{
    "id": "2512.01336v1",
    "title": "Discovering Self-Protective Falling Policy for Humanoid Robot via Deep Reinforcement Learning",
    "authors": [
        "Diyuan Shi",
        "Shangke Lyu",
        "Donglin Wang"
    ],
    "abstract": "近年来，人形机器人受到了广泛的研究关注并取得了显著进展。尽管已取得诸多成果，但由于其形态结构、动力学特性以及控制策略的限制，与四足或轮式机器人等其他形态相比，人形机器人更容易发生跌倒。而其较大的重量、较高的重心位置以及高自由度结构，在失控跌倒时可能对自身及周围物体造成严重的硬件损坏。目前该领域的研究大多依赖基于控制的方法，这类方法难以应对多样化的跌倒场景，且可能引入不恰当的人类先验知识。另一方面，大规模深度强化学习结合课程学习可被用于激励人形智能体自主探索适合其自身特性的防跌保护策略。在本研究中，通过精心设计的奖励函数和领域多样化课程，我们成功训练了人形智能体探索出有效的防跌保护行为，并发现通过形成一种“三角形”结构，即使采用刚性材料机身，也能显著降低跌倒造成的损伤。通过全面的评估指标和实验，我们量化了该方法相较于其他方法的性能优势，可视化了其跌倒过程中的行为表现，并成功将其策略迁移到真实机器人平台上。",
    "url": "https://arxiv.org/abs/2512.01336v1",
    "html_url": "https://arxiv.org/html/2512.01336v1",
    "html_content": "",
    "preview_text": "Humanoid robots have received significant research interests and advancements in recent years. Despite many successes, due to their morphology, dynamics and limitation of control policy, humanoid robots are prone to fall as compared to other embodiments like quadruped or wheeled robots. And its large weight, tall Center of Mass, high Degree-of-Freedom would cause serious hardware damages when falling uncontrolled, to both itself and surrounding objects. Existing researches in this field mostly focus on using control based methods that struggle to cater diverse falling scenarios and may introduce unsuitable human prior. On the other hand, large-scale Deep Reinforcement Learning and Curriculum Learning could be employed to incentivize humanoid agent discovering falling protection policy that fits its own nature and property. In this work, with carefully designed reward functions and domain diversification curriculum, we successfully train humanoid agent to explore falling protection behaviors and discover that by forming a `triangle' structure, the falling damages could be significantly reduced with its rigid-material body. With comprehensive metrics and experiments, we quantify its performance with comparison to other methods, visualize its falling behaviors and successfully transfer it to real world platform.",
    "is_relevant": null,
    "relevance_score": 0.0,
    "extracted_keywords": [],
    "one_line_summary": "",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "published_date": "2025-12-01T06:53:54Z",
    "created_at": "2026-01-08T10:08:07.726352",
    "updated_at": "2026-01-08T10:08:07.726359",
    "flag": true
}