{
  "id": "2512.01952v1",
  "title": "GrndCtrl: Grounding World Models via Self-Supervised Reward Alignment",
  "authors": [
    "Haoyang He",
    "Jay Patrikar",
    "Dong-Ki Kim",
    "Max Smith",
    "Daniel McGann",
    "Ali-akbar Agha-mohammadi",
    "Shayegan Omidshafiei",
    "Sebastian Scherer"
  ],
  "abstract": "Recent advances in video world modeling have enabled large-scale generative models to simulate embodied environments with high visual fidelity, providing strong priors for prediction, planning, and control. Yet, despite their realism, these models often lack geometric grounding, limiting their use in navigation tasks that require spatial coherence and long-horizon stability. We introduce Reinforcement Learning with World Grounding (RLWG), a self-supervised post-training framework that aligns pretrained world models with a physically verifiable structure through geometric and perceptual rewards. Analogous to reinforcement learning from verifiable feedback (RLVR) in language models, RLWG can use multiple rewards that measure pose cycle-consistency, depth reprojection, and temporal coherence. We instantiate this framework with GrndCtrl, a reward-aligned adaptation method based on Group Relative Policy Optimization (GRPO), yielding world models that maintain stable trajectories, consistent geometry, and reliable rollouts for embodied navigation. Like post-training alignment in large language models, GrndCtrl leverages verifiable rewards to bridge generative pretraining and grounded behavior, achieving superior spatial coherence and navigation stability over supervised fine-tuning in outdoor environments.",
  "url": "https://arxiv.org/abs/2512.01952v1",
  "html_url": "https://arxiv.org/html/2512.01952v1",
  "html_content": "GrndCtrl: Grounding World Models via Self-Supervised Reward Alignment\nhttps://rlwg-grndctrl.github.io/\nHaoyang He\n1,2\nJay Patrikar\n2\nDong-Ki Kim\n2\nMax Smith\n2\nDaniel McGann\n2\nAli-akbar Agha-mohammadi\n2\nShayegan Omidshafiei\n2\nSebastian Scherer\n1,2\nAbstract\nRecent advances in video world modeling have enabled large-scale generative models to simulate embodied environments with high visual fidelity, providing strong priors for prediction, planning, and control. Yet, despite their realism, these models often lack geometric grounding, limiting their use in navigation tasks that require spatial coherence and long-horizon stability. We introduce\nReinforcement Learning with World Grounding (RLWG)\n, a self-supervised post-training framework that aligns pretrained world models with a physically verifiable structure through geometric and perceptual rewards. Analogous to reinforcement learning from verifiable feedback (RLVR) in language models, RLWG can use multiple rewards that measure pose cycle-consistency, depth reprojection, and temporal coherence. We instantiate this framework with\nGrndCtrl\n, a reward-aligned adaptation method based on Group Relative Policy Optimization (GRPO), yielding world models that maintain stable trajectories, consistent geometry, and reliable rollouts for embodied navigation. Like post-training alignment in large language models,\nGrndCtrl\nleverages verifiable rewards to bridge generative pretraining and grounded behavior, achieving superior spatial coherence and navigation stability over supervised fine-tuning in outdoor environments.\n1\nCarnegie Mellon University\n2\nFieldAI\nFigure 1\n:\nReinforcement Learning with World Grounding (RLWG)\naddresses geometric inconsistencies in pretrained video world models through self-supervised post-training with verifiable rewards. Instead of reconstruction losses, RLWG grounds models using geometric and perceptual rewards from frozen evaluators.\nGrndCtrl\ninstantiates RLWG using Group Relative Policy Optimization (GRPO), enabling physically consistent rollouts essential for reliable world generation.\n1\nIntroduction\nLarge-scale video world models have emerged as powerful priors for modeling perception and control for embodied agents\n[\nnvidia2025cosmosworldfoundationmodel\n,\nbar2025navigationworldmodels\n,\nassran2025vjepa2\n,\njin2025posepilotsteeringcamerapose\n,\nren2025gen3c\n]\n. By learning to predict future observations from past frames and actions, these models approximate the transition dynamics of the physical world, enabling simulation, planning, and policy evaluation. Operating in the pixel domain aligns them with real-world sensors and exploits the vast implicit supervision available in video, allowing unified modeling across domains such as manipulation, driving, and navigation. Yet despite their impressive generative fidelity, these models are often incentivized to capture the appearance of motion more than its structure. Their rollouts remain visually plausible but geometrically and temporally inconsistent: poses drift, depths wobble, and trajectories lose alignment over time. Even subtle deviations in inferred geometry accumulate into compounding spatial errors corrupting metric structure. These instabilities limit the use of current models for closed-loop tasks such as localization, mapping, and planning, where physically consistent representation is essential.\nWe define\nworld model grounding\nas aligning learned dynamics with physically verifiable spatial and temporal invariants, so that rollouts honor geometry and time in addition to reproducing surface appearance. Grounding shifts the objective of world modeling from visual plausibility to structural consistency, ensuring that the model’s internal dynamics respect the constraints of real motion and scene structure. To this end, we introduce\nReinforcement Learning with World Grounding (RLWG)\n, a self-supervised post-training framework that refines pretrained world models using verifiable geometric and perceptual rewards derived from model rollouts. RLWG extends the principle of Reinforcement Learning with Verifiable Rewards (RLVR) from language models\n[\nlambert2025tulu3pushingfrontiers\n]\nto the embodied domain, replacing text-based logical verification with geometric and temporal verification. In RLWG, a pretrained world model is treated as a policy that generates multiple candidate rollouts from the same context; each rollout is automatically scored using verifiable grounding rewards that quantify spatial and temporal coherence, such as pose cycle-consistency, depth reprojection agreement and action adherence. Unlike reconstruction losses that only penalize pixel error, these rewards measure physical correctness of the rollouts.\nTo optimize these verifiable rewards efficiently, we adopt Group Relative Policy Optimization (GRPO)\n[\nshao2024deepseekmathpushinglimitsmathematical\n]\nas our training mechanism, yielding our algorithm,\nGrndCtrl\n. For each context (and actions when available), the model generates a group of rollouts that are ranked by their grounding rewards; relative advantages are computed within the group, and the latent transition operator is updated using a clipped policy gradient objective regularized toward the pretrained model. This formulation preserves visual quality while progressively aligning the model’s dynamics with measurable structure in the real world. The process requires no human annotations or external simulators, operating entirely through self-supervised reinforcement grounded in the model’s own predictions. Conceptually,\nGrndCtrl\nextends the success of GRPO-based alignment in generative modeling to the geometric domain, grounding visual world models in verifiable 3D and temporal coherence.\nThis paradigm reframes the role of post-training in world modeling. Rather than optimizing for perceptual fidelity or next-frame likelihood, RLWG drives the model toward internal representations that are self-consistent and physically grounded. It establishes a structural analogue to the self-alignment processes that have improved reasoning in large language models: where RLVR grounds language in logic, RLWG grounds world models in geometry. The resulting models are self-grounded, spatially coherent, and dynamically stable—capable not only of rendering the world vividly, but of representing it in actionable, physically consistent form. Through this lens, we move beyond visually coherent generation toward structurally consistent simulation, bridging the gap between generative video modeling and physical world understanding, and opening a path toward world models that can both imagine and inhabit the real world.\nThe main contributions of this work are:\n1.\nWe introduce\nReinforcement Learning with World Grounding (RLWG)\n, a self-supervised grounding framework using verifiable geometric and temporal rewards from frozen evaluators without labels or simulators.\n2.\nWe construct\nGrndCtrl\n, a method that extends GRPO to the RLWG regime by multi-reward alignment over stochastic rollouts optimizing Translation, Rotation, Depth Temporal Reprojection Inlier ratio, and perceptual quality with pretrained frozen evaluators.\n3.\nWe provide a comprehensive evaluation of\nGrndCtrl\nacross multiple datasets showing reduced pose error means and variances, with strong gains under counterfactual rollouts and generalization to unseen inputs.\n2\nRelated Work\n2.1\nControlling World Models\nRecent progress in large-scale video foundation models has transformed video prediction into controllable world simulation. Models such as Cosmos-Predict\n[\nnvidia2025cosmosworldfoundationmodel\n]\n, and V-JEPA\n[\nassran2025vjepa2\n]\nunify multi-modal conditioning for long-horizon prediction and control. These models achieve impressive simulation fidelity but still exhibit spatial drift, geometric misalignment, and temporal incoherence over extended rollouts, revealing limitations in geometric grounding. Architectural innovations like flow matching, conditional diffusion transformers, and masked latent prediction have improved realism but not physical consistency.\nControlling these models can be categorized into\naction-conditioned\nand\ncamera-conditioned\nparadigms. The first paradigm trains models to predict futures from discrete actions, and can be further defined by the nature of the action and observation frame. Some methods\n[\nzhou2025dinowmworldmodelspretrained\n,\nzhu2025unifiedworldmodelscoupling\n]\nassume a static camera observing an embodiment performing actions, while others\n[\nhafner2024masteringdiversedomainsworld\n,\nvalevski2025diffusionmodelsrealtimegame\n,\nbar2025navigationworldmodels\n,\nbai2025wholebodyconditionedegocentricvideo\n]\nassume a fixed camera on the embodiment and train models to predict ego-centric views. Jointly, they aim to enable model-predictive control, but face challenges with physical realism. The second paradigm explicitly decouples viewpoint from embodiment, allowing the model to generate future observations from arbitrary camera poses. Early works\n[\nwang2024motionctrlunifiedflexiblemotion\n,\nhe2025cameractrlenablingcameracontrol\n]\ninjected pose embeddings into diffusion models to achieve this control, but lacked explicit geometric alignment. Subsequent methods\n[\njin2025posepilotsteeringcamerapose\n,\nren2025gen3c\n]\nimproved consistency via self-supervised warping, 3D-informed point cloud conditioning, achieving more precise viewpoint control. Recent work\n[\nguo2025ctrlworldcontrollablegenerativeworld\n]\nbridges the two paradigms by jointly training on multiple viewpoints, and improved spatial-temporal consistency with pose-conditioned memory retrieval. Despite these advances, most approaches rely on supervised learning or one-step consistency objectives and remain open-loop, with no mechanism to evaluate or optimize physical correctness.\n2.2\nReward Learning for Post-Training\nReinforcement-based post-training has become central to aligning large generative models. In language systems, Reinforcement Learning from Human Feedback (RLHF)\n[\nouyang2022traininglanguagemodelsfollow\n]\nand Reinforcement Learning with Verifiable Rewards (RLVR)\n[\nlambert2025tulu3pushingfrontiers\n]\nreplace imitation with objective-driven alignment, while Group Relative Policy Optimization (GRPO)\n[\nshao2024deepseekmathpushinglimitsmathematical\n]\nstabilizes learning via stochastic rollouts comparative updates. Extensions to vision, such as DanceGRPO\n[\nxue2025dancegrpounleashinggrpovisual\n]\n, demonstrate that rewards on visual quality can fine-tune video diffusion models effectively.\nBuilding on this foundation, RLWG adapts RLVR to world modeling, optimizing pretrained world models using physically verifiable rewards including cycle-consistency, depth reprojection, and trajectory stability.\nGrndCtrl\ninstantiates RLWG as a multi-objective GRPO over grounded rewards. This process enforces geometric coherence without human supervision, significantly reducing long-horizon drift. Parallel advances in 3D perception emphasize similar constraints: VGGT\n[\nwang2025vggt\n]\nand MapAnything\n[\nkeetha2025mapanythinguniversalfeedforwardmetric\n]\npredict depth and camera pose for consistent scene reconstruction, while SpaTracker\n[\nxiao2025spatialtrackerv23dpointtracking\n]\nintegrates rigidity priors for robust 3D tracking. Together, these efforts point toward reward-informed geometry as a unifying principle, where physical correctness acts as an alignment signal bridging generative modeling, simulation, and control.\nFigure 2\n:\nGrndCtrl\nframework architecture. Given conditioning context\nc\n=\n(\nx\n0\n,\na\n0\n:\nT\n−\n1\n)\nc=(x_{0},a_{0:T-1})\n, the world model generates multiple stochastic rollouts\n{\nx\n^\n1\n:\nT\n(\ni\n)\n}\ni\n=\n1\nG\n\\{\\hat{x}^{(i)}_{1:T}\\}_{i=1}^{G}\n. Frozen evaluators compute verifiable rewards for each rollout. Relative advantages are calculated within each group, and GRPO updates model parameters using a clipped policy gradient objective regularized toward the pretrained model, favoring physically consistent rollouts.\n3\nGrndCtrl\n3.1\nProblem Definition\nWe consider a pretrained\nvideo world model\nW\nθ\nW_{\\theta}\n, a policy parameterized by\nθ\n\\theta\n, that predicts future observations conditioned on a visual history and optionally actions.\nLet\nx\n0\nx_{0}\ndenote the observed frame and\na\n0\n:\nT\n−\n1\n=\n(\na\n0\n,\n…\n,\na\nT\n−\n1\n)\na_{0:T-1}=(a_{0},\\ldots,a_{T-1})\nthe associated control inputs.\nThe model samples a rollout\nx\n^\n1\n:\nT\n∼\nW\nθ\n(\n⋅\n∣\nx\n0\n,\na\n0\n:\nT\n−\n1\n)\n\\hat{x}_{1:T}\\sim W_{\\theta}(\\cdot\\mid x_{0},a_{0:T-1})\n,\nwhere\na\nt\n=\n(\nR\nt\n,\n𝐭\nt\n)\na_{t}=(R_{t},\\mathbf{t}_{t})\ncontrols translation\n𝐭\nt\n∈\nℝ\n3\n\\mathbf{t}_{t}\\in\\mathbb{R}^{3}\nand rotation\nR\nt\n∈\nSO\n​\n(\n3\n)\nR_{t}\\in\\mathrm{SO}(3)\n. Our goal is to\npost-train\nW\nθ\nW_{\\theta}\nusing self-supervised reinforcement learning to improve the\nspatial coherence\nand\nembodied reliability\nof its rollouts.\nTo obtain\nverifiable\nfeedback without supervision, we use a frozen\nfeed-forward 3D evaluator\nℰ\n\\mathcal{E}\nthat provides relative pose estimates\n(\nΔ\n​\nR\n1\n:\nT\n,\nΔ\n​\n𝐭\n1\n:\nT\n)\n(\\Delta R_{1:T},\\Delta\\mathbf{t}_{1:T})\nand per-frame depth maps\nD\nt\nD_{t}\n,\nwhere\nΔ\n​\nR\nt\n∈\nSO\n​\n(\n3\n)\n\\Delta R_{t}\\in\\mathrm{SO}(3)\nand\nΔ\n​\n𝐭\nt\n∈\nℝ\n3\n\\Delta\\mathbf{t}_{t}\\in\\mathbb{R}^{3}\n. Additionally, we obtain feedback on the visual and motion quality of the overall video using a frozen\nfeed-forward video evaluator\n𝒱\n\\mathcal{V}\nthat provides overall visual quality scoring.\nOur objective is to optimize\nθ\n\\theta\nsuch that sampled rollouts maximize a set of verifiable rewards\nU\n​\n(\nx\n^\n1\n:\nT\n)\nU(\\hat{x}_{1:T})\ncomprising translation (\nr\ntrans\nr_{\\text{trans}}\n), rotation (\nr\nrot\nr_{\\text{rot}}\n), depth temporal reprojection (\nr\ndtr\nr_{\\text{dtr}}\n), and video quality (\nr\nv\nr_{\\text{v}}\n).\nThese rewards are constructed from the 3D evaluator\nℰ\n\\mathcal{E}\nand video evaluator\n𝒱\n\\mathcal{V}\n, and are defined in detail in Section\n3.2\n.\n3.2\nVerifiable Self-Supervised Rewards\nLet\n𝒯\n\\mathcal{T}\ndenote the set of evaluated timesteps.\nEach reward term measures a distinct aspect of spatial and temporal consistency.\n(1) Translation Reward.\nWe compute the Euclidean deviation in translation:\n𝐞\nt\ntrans\n=\nΔ\n​\n𝐭\nt\n−\n𝐭\nt\n.\n\\mathbf{e}^{\\text{trans}}_{t}=\\Delta\\mathbf{t}_{t}-\\mathbf{t}_{t}.\n(1)\nand define the sum of mean squared trajectory error and squared final error as translation reward:\nr\ntrans\n=\n−\n(\n1\n|\n𝒯\n|\n​\n∑\nt\n∈\n𝒯\n‖\n𝐞\nt\ntrans\n‖\n2\n2\n+\n‖\n𝐞\n|\n𝒯\n|\ntrans\n‖\n2\n2\n)\n.\nr_{\\text{trans}}=-\\left(\\frac{1}{|\\mathcal{T}|}\\sum_{t\\in\\mathcal{T}}\\|\\mathbf{e}^{\\text{trans}}_{t}\\|^{2}_{2}+\\|\\mathbf{e}^{\\text{trans}}_{|\\mathcal{T}|}\\|^{2}_{2}\\right).\n(2)\nWhen metric scale is ambiguous, a normalization factor is applied from the evaluator’s scale estimate.\n(2) Rotation Reward.\nWe compute the minimum angular deviation between predicted and evaluator rotations:\n𝐞\nt\nrot\n=\narccos\n⁡\n(\ntr\n⁡\n(\nΔ\n​\nR\nt\n⋅\nR\nt\nT\n)\n−\n1\n2\n)\n,\n\\mathbf{e}^{\\text{rot}}_{t}=\\arccos\\left(\\frac{\\operatorname{tr}\\left(\\Delta R_{t}\\cdot{R_{t}}^{T}\\right)-1}{2}\\right),\n(3)\nand define the axis-angle cumulative error as rotation reward:\nr\nrot\n=\n−\n∑\nt\n∈\n𝒯\n𝐞\nt\nrot\n.\nr_{\\text{rot}}=-\\sum_{t\\in\\mathcal{T}}\\mathbf{e}^{\\text{rot}}_{t}.\n(4)\n(3) Depth Temporal Reprojection Reward.\nWe adopt the\ndepth inlier ratio\nfrom MapAnything\n[\nkeetha2025mapanythinguniversalfeedforwardmetric\n]\nevaluations as a verifiable geometric reward for depth temporal reprojection.\nFor each pixel\np\n∈\nΩ\np\\!\\in\\!\\Omega\n, define the reprojected correspondence and expected depth via the evaluator geometry\n(\np\n^\n,\nd\nt\n→\nt\n+\n1\nexp\n​\n(\np\n)\n)\n=\nΦ\n​\n(\np\n;\nD\nt\n,\nΔ\n​\nR\nt\n,\nΔ\n​\n𝐭\nt\n,\nK\nt\n,\nK\nt\n+\n1\n)\n,\n(\\hat{p},\\,d_{t\\to t+1}^{\\exp}(p))\\;=\\;\\Phi\\!\\big(p;\\,D_{t},\\,\\Delta R_{t},\\,\\Delta\\mathbf{t}_{t},\\,K_{t},K_{t+1}\\big),\n(5)\nwhere\nΦ\n\\Phi\nback-projects\np\np\nusing\nD\nt\nD_{t}\n, applies\n(\nΔ\n​\nR\nt\n,\nΔ\n​\n𝐭\nt\n)\n(\\Delta R_{t},\\Delta\\mathbf{t}_{t})\n, and projects into frame\nt\n+\n1\nt{+}1\n.\nThe per-pair depth inlier ratio (threshold\nγ\n=\n0.0103\n\\gamma{=}0.0103\n) is\nDTRI\nt\n(\nγ\n)\n=\n1\n|\nΩ\n|\n​\n∑\np\n∈\nΩ\n𝟏\n​\n[\n|\nD\nt\n+\n1\n​\n(\np\n^\n)\n−\nd\nt\n→\nt\n+\n1\nexp\n​\n(\np\n)\n|\nd\nt\n→\nt\n+\n1\nexp\n​\n(\np\n)\n<\nγ\n]\n.\n\\mathrm{DTRI}_{t}^{(\\gamma)}\\;=\\;\\frac{1}{|\\Omega|}\\sum_{p\\in\\Omega}\\mathbf{1}\\!\\left[\\frac{\\big|\\,D_{t+1}(\\hat{p})-d_{t\\to t+1}^{\\exp}(p)\\,\\big|}{d_{t\\to t+1}^{\\exp}(p)}\\;<\\;\\gamma\\right].\n(6)\nWe use the average inlier ratio as the reward:\nr\ndtr\n=\n1\n|\n𝒯\n|\n​\n∑\nt\n∈\n𝒯\nDTRI\nt\n(\nγ\n)\n.\nr_{\\text{dtr}}\\;=\\;\\frac{1}{|\\mathcal{T}|}\\sum_{t\\in\\mathcal{T}}\\mathrm{DTRI}_{t}^{(\\gamma)}.\n(7)\n(4) Video Quality Reward.\nWe use the frozen VideoAlign\n[\nliu2025improving\n]\nas evaluator\n𝒱\n\\mathcal{V}\n, which returns three sequence-level scores in\n[\n0\n,\n1\n]\n[0,1]\n—visual quality\ns\nvis\ns_{\\text{vis}}\n, motion quality\ns\nmot\ns_{\\text{mot}}\n, and text alignment\ns\ntxt\ns_{\\text{txt}}\n—for a rollout\nx\n^\n1\n:\nT\n\\hat{x}_{1:T}\n(optionally conditioned on a prompt\ny\ny\n):\n(\ns\nvis\n,\ns\nmot\n,\ns\ntxt\n)\n=\n𝒱\n​\n(\nx\n^\n1\n:\nT\n;\ny\n)\n.\n(s_{\\text{vis}},\\,s_{\\text{mot}},\\,s_{\\text{txt}})\\;=\\;\\mathcal{V}(\\hat{x}_{1:T};\\,y).\n(8)\nOur visual reward uses only visual and motion quality as a convex combination,\nr\nv\n=\nα\n​\ns\nvis\n+\nβ\n​\ns\nmot\n,\nα\n,\nβ\n≥\n0\n,\nα\n+\nβ\n=\n1\n,\nr_{\\text{v}}\\;=\\;\\alpha\\,s_{\\text{vis}}+\\beta\\,s_{\\text{mot}},\\qquad\\alpha,\\beta\\geq 0,\\;\\alpha+\\beta=1,\n(9)\nwith\nα\n=\nβ\n=\n1\n2\n\\alpha=\\beta=\\tfrac{1}{2}\nby default.\n3.3\nGRPO for RLWG Post-Training\nFor each\nconditioning context\nc\n=\n(\nx\n0\n,\na\n0\n:\nT\n−\n1\n)\nc=(x_{0},a_{0:T-1})\n, a group of\nG\nG\ncandidate rollouts\n{\nx\n^\n1\n:\nT\n(\ni\n)\n}\ni\n=\n1\nG\n\\{\\hat{x}^{(i)}_{1:T}\\}_{i=1}^{G}\nis sampled from\nW\nθ\nW_{\\theta}\n.\nEach rollout is evaluated by every reward from the verifiable reward set\nU\n​\n(\nx\n^\n1\n:\nT\n)\nU(\\hat{x}_{1:T})\n, obtaining\n{\nr\ntrans\n(\ni\n)\n,\nr\nrot\n(\ni\n)\n,\nr\ndtr\n(\ni\n)\n,\nr\nv\n(\ni\n)\n}\n=\nU\n​\n(\nx\n^\n1\n:\nT\n(\ni\n)\n)\n\\{r^{(i)}_{\\text{trans}},r^{(i)}_{\\text{rot}},r^{(i)}_{\\text{dtr}},r^{(i)}_{\\text{v}}\\}=U(\\hat{x}^{(i)}_{1:T})\n. We compute the normalized reward for every verifiable reward\nr\n~\n(\ni\n)\n\\tilde{r}^{(i)}\n, and obtain a multi-objective normalized group advantage\nA\ni\nA_{i}\n:\nr\n~\n(\ni\n)\n=\nr\n(\ni\n)\n−\nmean\n​\n(\nr\n(\n1\n)\n,\n…\n,\nr\n(\nG\n)\n)\nstd\n​\n(\nr\n(\n1\n)\n,\n…\n,\nr\n(\nG\n)\n)\n,\nA\ni\n=\nr\n~\n(\ni\n)\n−\nmean\n​\n(\nr\n~\n(\n1\n)\n,\n…\n,\nr\n~\n(\nG\n)\n)\nstd\n​\n(\nr\n~\n(\n1\n)\n,\n…\n,\nr\n~\n(\nG\n)\n)\n,\n\\tilde{r}^{(i)}=\\tfrac{r^{(i)}-\\text{mean}(r^{(1)},\\ldots,r^{(G)})}{\\text{std}(r^{(1)},\\ldots,r^{(G)})},\\quad A_{i}=\\tfrac{\\tilde{r}^{(i)}-\\text{mean}(\\tilde{r}^{(1)},\\ldots,\\tilde{r}^{(G)})}{\\text{std}(\\tilde{r}^{(1)},\\ldots,\\tilde{r}^{(G)})},\n(10)\nThe GRPO objective optimizes\nθ\n\\theta\nusing the clipped surrogate:\nJ\n​\n(\nθ\n)\n=\n𝔼\n​\n[\n1\nG\n​\n∑\ni\n=\n1\nG\n1\nT\n​\n∑\nt\n=\n1\nT\nmin\n⁡\n(\nρ\nt\n,\ni\n​\nA\ni\n,\nclip\n​\n(\nρ\nt\n,\ni\n,\n1\n−\nϵ\n,\n1\n+\nϵ\n)\n​\nA\ni\n)\n]\n,\nJ(\\theta)=\\mathbb{E}\\Big[\\frac{1}{G}\\sum_{i=1}^{G}\\frac{1}{T}\\sum_{t=1}^{T}\\min\\big(\\rho_{t,i}A_{i},\\;\\text{clip}(\\rho_{t,i},1-\\epsilon,1+\\epsilon)A_{i}\\big)\\Big],\n(11)\nwhere\nϵ\n\\epsilon\nis the clip ratio,\nρ\nt\n,\ni\n\\rho_{t,i}\nis the per-step likelihood ratio under the current and reference policies.\nThis formulation stabilizes policy optimization for continuous video generation tasks. An illustration of the detailed\nGrndCtrl\nframework is shown in Figure\n2\n. To form each group for GRPO in practice, we generate multiple stochastic rollouts.\nGroups are instantiated by sampling multiple candidate rollouts from the diffusion generator under controlled stochasticity. Diffusion sampling can be formulated as a reverse-time\nstochastic differential equation\n(SDE) or, equivalently in time-marginals, as a\nprobability–flow ordinary differential equation\n(ODE)\n[\nsong2021scorebasedgenerativemodelingstochastic\n,\nalbergo2025stochasticinterpolantsunifyingframework\n]\n. Let\nx\nt\n∈\nℝ\nd\nx_{t}\\in\\mathbb{R}^{d}\ndenote the latent state at time\nt\n∈\n[\n0\n,\n1\n]\nt\\in[0,1]\n(noisiest at\nt\n=\n1\nt{=}1\n, data manifold at\nt\n→\n0\nt{\\to}0\n). A standard variance–preserving forward SDE is\nd\n​\nx\nt\n=\n−\n1\n2\n​\nβ\n​\n(\nt\n)\n​\nx\nt\n​\nd\n​\nt\n+\nβ\n​\n(\nt\n)\n​\nd\n​\nw\nt\n,\n\\mathrm{d}x_{t}=-\\tfrac{1}{2}\\beta(t)x_{t}\\mathrm{d}t+\\sqrt{\\beta(t)}\\mathrm{d}w_{t},\n(12)\nwith\nw\nt\nw_{t}\nas a standard Brownian motion and\nβ\n​\n(\nt\n)\n>\n0\n\\beta(t){>}0\nas the noise rate. The corresponding\nreverse\nSDE is\nd\n​\nx\nt\n=\n(\n−\n1\n2\n​\nβ\n​\n(\nt\n)\n​\nx\nt\n−\nβ\n​\n(\nt\n)\n​\n∇\nx\nlog\n⁡\np\nt\n​\n(\nx\nt\n)\n)\n​\nd\n​\nt\n+\nβ\n​\n(\nt\n)\n​\nd\n​\nw\n¯\nt\n,\n\\mathrm{d}x_{t}=\\big(-\\tfrac{1}{2}\\beta(t)x_{t}-\\beta(t)\\nabla_{x}\\log p_{t}(x_{t})\\big)\\mathrm{d}t+\\sqrt{\\beta(t)}\\mathrm{d}\\bar{w}_{t},\n(13)\nwhich is stochastic due to the\nd\n​\nw\n¯\nt\n\\mathrm{d}\\bar{w}_{t}\nterm and uses the learned score\n∇\nx\nlog\n⁡\np\nt\n\\nabla_{x}\\log p_{t}\n, where\np\nt\np_{t}\nis the forward SDE solution distribution of\nx\nt\nx_{t}\n. The\nprobability–flow ODE\n, which shares the same\np\nt\n{p_{t}}\nas (\n13\n) but is deterministic, is\nd\n​\nx\nt\nd\n​\nt\n=\n−\n1\n2\n​\nβ\n​\n(\nt\n)\n​\nx\nt\n−\n1\n2\n​\nβ\n​\n(\nt\n)\n​\n∇\nx\nlog\n⁡\np\nt\n​\n(\nx\nt\n)\n.\n\\frac{\\mathrm{d}x_{t}}{\\mathrm{d}t}=-\\tfrac{1}{2}\\beta(t)x_{t}-\\tfrac{1}{2}\\beta(t)\\nabla_{x}\\log p_{t}(x_{t}).\n(14)\nIn practice, sampler stochasticity is controlled by\nη\n∈\n[\n0\n,\n1\n]\n\\eta\\in[0,1]\n(ODE limit at\nη\n=\n0\n\\eta{=}0\n; SDE-style sampling with per-step Gaussian perturbations at\nη\n=\n1\n\\eta{=}1\n). For each context\nc\nc\n, we draw\nG\nG\nrollouts\n{\nx\n^\n1\n:\nT\n(\ni\n)\n}\ni\n=\n1\nG\n\\{\\hat{x}_{1:T}^{(i)}\\}_{i=1}^{G}\nwith identical conditioning and independent noise governed by\nη\n\\eta\n, providing the within-group diversity required by GRPO.\n4\nExperimental Setup\n(a)\n(b)\nFigure 3\n:\nQualitative results: (a)\nGrndCtrl\nmitigates scene drift on counterfactual rollouts, maintaining spatial coherence where baseline diverges. (b)\nGrndCtrl\nsuccessfully follows directionally inverted actions, generating geometrically consistent rollouts where baseline fails.\n4.1\nDatasets\nWe train and evaluate our methods on three datasets spanning diverse embodiments and scenarios.\nCODa\n[\nzhang2023towards\n]\nis a campus navigation dataset collected on wheeled robots with pseudo-ground truth poses.\nSCAND\n[\nkarnan2022sociallycompliantnavigationdataset\n]\nis a social navigation dataset also collected on campus, featuring embodiments of both a wheeled robot and a quadruped.\nCityWalk\n[\nliu2025citywalker\n]\nis an egocentric urban navigation dataset of a person walking in crowded city streets, collected from in-the-wild YouTube city walking videos and reprocessed with MapAnything\n[\nkeetha2025mapanythinguniversalfeedforwardmetric\n]\nto obtain pose estimates. We subsample each dataset to 2k non-overlapping 13-frame sequences of pose-action pairs for training, ensuring temporal diversity and avoiding data leakage.\n4.2\nBaseline Model\nWe obtain the baseline pretrained world model\nW\nθ\nW_{\\theta}\nvia supervised fine-tuning (SFT) on Cosmos-Predict2-2B-Video2World\n[\nnvidia2025cosmosworldfoundationmodel\n]\n, a diffusion model with a latent VAE backbone and temporal attention. We use a modified version of its action-conditioned video predictor post-training pipeline, adapting the action space from 7 to 6 degrees of freedom to match our navigation setting:\n(\nx\n,\ny\n,\nz\n,\nroll\n,\npitch\n,\nyaw\n)\n(x,y,z,\\mathrm{roll},\\mathrm{pitch},\\mathrm{yaw})\nas 6×12 action embeddings. We initialize the action embeddings randomly while fine-tuning the entire DiT backbone for 20k steps with an effective batch size of 64. Training follows the EDM framework\n[\nkarras2022elucidatingdesignspacediffusionbased\n,\nkarras2024analyzingimprovingtrainingdynamics\n]\n, using the weighted expectation of denoising score matching loss over noise levels. We perform full SFT over all DiT backbone parameters keeping the visual encoder and decoder frozen, as our experiments showed that only full SFT or full-size LoRA yielded meaningful changes in motion dynamics. Additional implementation details are provided in Appendix.\n4.3\nGRPO Post-Training\nPost-training applies GRPO with self-supervised verifiable rewards as described in Sec.\n3.3\n. We use MapAnything\n[\nkeetha2025mapanythinguniversalfeedforwardmetric\n]\nas\nℰ\n\\mathcal{E}\nto obtain rewards\nr\ntrans\nr_{\\text{trans}}\n,\nr\nrot\nr_{\\text{rot}}\n, and\nr\ndtr\nr_{\\text{dtr}}\n. We use VideoAlign\n[\nliu2025improving\n]\nas\n𝒱\n\\mathcal{V}\nto obtain the reward\nr\nv\nr_{\\text{v}}\n. We perform an ablation study of combinatorial rewards as defined in Sec.\n3.2\nto evaluate multi-objective GRPO. For each reward configuration, we train for 100 steps with an effective batch size of 8, generating\nG\n=\n8\nG=8\nstochastic rollouts\n{\nx\n^\n1\n:\nT\n(\ni\n)\n}\ni\n=\n1\nG\n\\{\\hat{x}^{(i)}_{1:T}\\}_{i=1}^{G}\nper conditioning context\nc\n=\n(\nx\n0\n,\na\n0\n:\nT\n−\n1\n)\nc=(x_{0},a_{0:T-1})\n. To obtain diverse rollouts, we use the same initial noise for reverse-SDE diffusion with the same starting frame\nx\n0\nx_{0}\nand action trajectory\na\n0\n:\nT\n−\n1\na_{0:T-1}\n, but inject stochastic Brownian noise at each diffusion step as described in Sec.\n3.3\n. We compute per-step likelihood ratios only over the first 60% of diffusion timesteps to focus training on the most relevant denoising steps to improve training stability. Additional training details are provided in Appendix.\n4.4\nEvaluation Regimes\nWe evaluate on three regimes that progressively test generalization capabilities:\n•\nSeen\n: Start frames and scene domains seen during SFT with matching action distributions. This regime tests in-distribution performance.\n•\nCounterfactual\n: Scenes seen during SFT but with counterfactual actions (e.g., mirrored or directionally inverted action sequences). This regime tests the model’s ability to extrapolate geometric structure to novel motion patterns.\n•\nUnseen\n: Both scenes and actions novel at test time, with scenes from different domains and action sequences with different motion characteristics. This regime tests full generalization to unseen scenarios.\n4.5\nMetrics\nWe report four metrics averaged across an evaluation set of 200 non-overlapping sequences for each regime: Translation error (\nT\n=\n−\nr\ntrans\n\\text{T}=-r_{\\text{trans}}\n) in meters, Rotation error (\nR\n=\n−\nr\nrot\n\\text{R}=-r_{\\text{rot}}\n) in radians, Video Quality (\nV\n=\nr\nv\n\\text{V}=r_{\\text{v}}\n) combining visual and motion quality scores, and Depth Temporal Reprojection Inlier Ratio (\nDTRI\n=\nr\ndtr\n\\text{DTRI}=r_{\\text{dtr}}\n) as a percentage. Lower values indicate better performance for T and R, while higher values are better for V and DTRI.\n5\nAnalysis and Discussion\nSeen\nCounterfactual\nUnseen\nMethod\nT\n↓\nT\\downarrow\nR\n↓\nR\\downarrow\nV\n↑\nV\\uparrow\nDTRI\n↑\n\\uparrow\nT\n↓\nT\\downarrow\nR\n↓\nR\\downarrow\nV\n↑\nV\\uparrow\nDTRI\n↑\n\\uparrow\nT\n↓\nT\\downarrow\nR\n↓\nR\\downarrow\nV\n↑\nV\\uparrow\nDTRI\n↑\n\\uparrow\nCODa\n[\nzhang2023towards\n]\nBaseline\n[\nnvidia2025cosmosworldfoundationmodel\n]\n57.8\n57.8\n1.77\n1.77\n7.40\n7.40\n38.9\n38.9\n71.5\n71.5\n1.55\n1.55\n7.41\n7.41\n39.1\n39.1\n56.9\n56.9\n1.71\n1.71\n7.40\n7.40\n38.3\n38.3\n+T+R\n46.4\n46.4\n1.44\n1.44\n7.32\n7.32\n38.4\n38.4\n50.5\n50.5\n1.53\n1.53\n7.34\n7.34\n38.7\n38.7\n54.3\n54.3\n1.75\n1.75\n7.36\n7.36\n39.3\n39.3\n+T+R+DTRI\n65.7\n65.7\n1.74\n1.74\n7.43\n7.43\n37.0\n37.0\n57.7\n57.7\n1.86\n1.86\n7.42\n7.42\n36.8\n36.8\n42.6\n42.6\n1.74\n1.74\n7.40\n7.40\n37.1\n37.1\n+T+R+DTRI+V\n39.9\n39.9\n1.27\n1.27\n7.35\n7.35\n37.5\n37.5\n40.7\n40.7\n1.42\n1.42\n7.34\n7.34\n37.4\n37.4\n31.0\n31.0\n1.53\n1.53\n7.37\n7.37\n38.0\n38.0\nSCAND\n[\nkarnan2022sociallycompliantnavigationdataset\n]\nBaseline\n[\nnvidia2025cosmosworldfoundationmodel\n]\n186.3\n186.3\n3.76\n3.76\n7.16\n7.16\n23.6\n23.6\n315.9\n315.9\n4.24\n4.24\n7.13\n7.13\n21.4\n21.4\n117.0\n117.0\n4.02\n4.02\n6.99\n6.99\n18.4\n18.4\n+T+R\n158.2\n158.2\n3.61\n3.61\n7.19\n7.19\n23.7\n23.7\n251.2\n251.2\n4.34\n4.34\n7.18\n7.18\n21.7\n21.7\n131.1\n131.1\n3.95\n3.95\n7.04\n7.04\n19.1\n19.1\n+T+R+DTRI\n157.9\n157.9\n3.65\n3.65\n7.10\n7.10\n22.1\n22.1\n288.6\n288.6\n4.45\n4.45\n7.17\n7.17\n20.1\n20.1\n118.6\n118.6\n4.07\n4.07\n7.03\n7.03\n17.9\n17.9\n+T+R+DTRI+V\n133.4\n133.4\n3.30\n3.30\n7.11\n7.11\n24.5\n24.5\n220.1\n220.1\n4.23\n4.23\n7.08\n7.08\n22.8\n22.8\n123.4\n123.4\n3.62\n3.62\n6.98\n6.98\n19.4\n19.4\nCityWalk\n[\nliu2025citywalker\n]\nBaseline\n[\nnvidia2025cosmosworldfoundationmodel\n]\n11.7\n11.7\n3.13\n3.13\n7.96\n7.96\n46.9\n46.9\n13.1\n13.1\n3.27\n3.27\n7.94\n7.94\n47.4\n47.4\n20.8\n20.8\n4.47\n4.47\n7.90\n7.90\n44.5\n44.5\n+T+R\n8.9\n8.9\n3.31\n3.31\n7.90\n7.90\n44.9\n44.9\n4.8\n4.8\n4.42\n4.42\n7.91\n7.91\n45.6\n45.6\n10.2\n10.2\n3.47\n3.47\n7.87\n7.87\n42.8\n42.8\n+T+R+DTRI\n8.4\n8.4\n3.36\n3.36\n7.84\n7.84\n43.5\n43.5\n4.7\n4.7\n4.40\n4.40\n7.83\n7.83\n44.1\n44.1\n10.9\n10.9\n3.68\n3.68\n7.79\n7.79\n41.4\n41.4\n+T+R+DTRI+V\n8.8\n8.8\n3.37\n3.37\n7.84\n7.84\n42.6\n42.6\n4.7\n4.7\n4.37\n4.37\n7.85\n7.85\n43.3\n43.3\n9.9\n9.9\n3.74\n3.74\n7.80\n7.80\n40.8\n40.8\nTable 1\n:\nQuantitative evaluation across three datasets (\nCODa\n,\nSCAND\n,\nCityWalk\n) and three regimes:\nSeen\n,\nCounterfactual\n, and\nUnseen\n. We compare baseline against progressive reward combinations (T+R, T+R+DTRI, T+R+DTRI+V).\nGrndCtrl\nachieves substantial improvements. Metrics: T (Translation Error, m), R (Rotation Error, rad), V (Video Quality), DTRI (Depth Temporal Reprojection Inliers).\n5.1\nImpact of\nGrndCtrl\non World Model Failures\nO1: Baselines show poor counterfactual performance but good generalization within familiar motion manifolds.\nTable\n1\nreports quantitative results on CODa, SCAND, and CityWalk datasets across three evaluation regimes. Across all datasets, the baseline performs well in Seen but degrades significantly in Counterfactual, indicating limited transfer to out-of-distribution action sequences. On CODa, baseline translation error increases by\n24\n%\n24\\%\nfrom Seen to Counterfactual, while on SCAND the degradation is more severe, increasing by\n70\n%\n70\\%\n. On CityWalk, the increase is more modest at\n12\n%\n12\\%\n. Unseen performance, however, remains comparable to Seen across datasets, suggesting that the pretrained model does generalize within familiar motion manifolds. This contrast in performance between Counterfactual and Unseen indicates a fundamental limitation in pretrained video world model’s ability to extrapolate geometric structure to counterfactual rollouts, a key property expected of grounded world simulators.\nO2: Translation and rotation rewards improve spatial alignment with largest gains under counterfactual motion.\nIntroducing translation and rotation rewards\nr\ntrans\nr_{\\text{trans}}\nand\nr\nrot\nr_{\\text{rot}}\n(\nT+R\n) improves spatial alignment across all datasets. On CODa, T+R decreases translation error by\n20\n%\n20\\%\nin Seen and by\n29\n%\n29\\%\nin Counterfactual relative to baseline, while rotation error improves by\n19\n%\n19\\%\nin Seen. On SCAND, the improvements are substantial: translation error decreases by\n15\n%\n15\\%\nin Seen and by\n20\n%\n20\\%\nin Counterfactual, with rotation error improving by\n4\n%\n4\\%\nin Seen. CityWalk shows the strongest counterfactual gains, with Counterfactual translation error dropping by\n63\n%\n63\\%\nrelative to baseline, while Seen improves by\n24\n%\n24\\%\n. These results demonstrate that explicit pose-based feedback enhances motion consistency and stabilizes rollouts\nx\n^\n1\n:\nT\n\\hat{x}_{1:T}\nacross diverse embodiments. Notably, the improvement in Counterfactual highlights that verifiable motion alignment encourages generalization to directionally inverted action sequences\na\n0\n:\nT\n−\n1\na_{0:T-1}\n, an essential feature for embodied reasoning.\nTable\n2\nfurther demonstrates that GRPO training systematically improves model reliability: the baseline model shows high variance across both translation and rotation errors, indicating unstable rollouts sensitive to diffusion noise. With\nGrndCtrl\ntraining, both mean errors and variance decrease substantially: at 200 iterations, translation error means reduce by\n77\n%\n77\\%\nrelative to baseline across experiments, with standard deviations reduced by\n75\n%\n75\\%\n. Rotation error also improves, with means reducing by 39% and standard deviations reduced by\n32\n%\n32\\%\n, achieving reliable and consistent rollouts across all evaluation regimes.\nSeen\nCounterfactual\nUnseen\nMethod\nT\n↓\nT\\downarrow\nR\n↓\nR\\downarrow\nT\n↓\nT\\downarrow\nR\n↓\nR\\downarrow\nT\n↓\nT\\downarrow\nR\n↓\nR\\downarrow\nBaseline\n[\nnvidia2025cosmosworldfoundationmodel\n]\n73.2\n±\n243.7\n73.2\\pm 243.7\n2.38\n±\n3.88\n2.38\\pm 3.88\n75.8\n±\n253.9\n75.8\\pm 253.9\n2.38\n±\n3.90\n2.38\\pm 3.90\n71.2\n±\n251.2\n71.2\\pm 251.2\n2.88\n±\n4.28\n2.88\\pm 4.28\nGrndCtrl\nT+R 100\n72.0\n±\n283.6\n72.0\\pm 283.6\n1.95\n±\n3.38\n1.95\\pm 3.38\n75.9\n±\n311.7\n75.9\\pm 311.7\n1.85\n±\n3.22\n1.85\\pm 3.22\n58.4\n±\n231.1\n58.4\\pm 231.1\n2.57\n±\n4.08\n2.57\\pm 4.08\nGrndCtrl\nT+R 150\n26.7\n±\n101.5\n26.7\\pm 101.5\n1.54\n±\n2.84\n1.54\\pm 2.84\n24.8\n±\n99.1\n24.8\\pm 99.1\n1.53\n±\n2.80\n1.53\\pm 2.80\n26.5\n±\n104.3\n26.5\\pm 104.3\n2.08\n±\n3.33\n2.08\\pm 3.33\nGrndCtrl\nT+R 200\n18.4\n±\n68.1\n18.4\\pm 68.1\n1.40\n±\n2.49\n1.40\\pm 2.49\n16.8\n±\n63.0\n16.8\\pm 63.0\n1.36\n±\n2.57\n1.36\\pm 2.57\n16.3\n±\n56.5\n16.3\\pm 56.5\n1.97\n±\n3.11\n1.97\\pm 3.11\nTable 2\n:\nReliability analysis showing error statistics (mean\n±\n\\pm\nstandard deviation) across multiple stochastic rollouts for different GRPO iterations. Baseline exhibits high variance, while GRPO training progressively reduces both mean errors and variance, achieving consistent rollouts. Metrics: T (Translation Error, m), R (Rotation Error, rad).\nO3: Depth reward enforces local coherence but trades off global alignment.\nAdding the depth reprojection reward\nr\ndtr\nr_{\\text{dtr}}\n(\nT+R+DTRI\n) enforces local geometric coherence but introduces a trade-off in global rollout alignment. On CODa, compared to T+R, translation error increases by\n42\n%\n42\\%\nin Seen and by\n14\n%\n14\\%\nin Counterfactual, while Unseen benefits substantially with a\n22\n%\n22\\%\nimprovement. On SCAND, Seen shows minimal change, Counterfactual degrades by\n15\n%\n15\\%\n, while Unseen improves by\n10\n%\n10\\%\n. CityWalk shows a different pattern where DTRI maintains or slightly improves performance across most regimes. This suggests the depth reward enforces short-horizon consistency and local geometric smoothness, with benefits most apparent in unseen scenarios.\nO4: Full reward set produces most balanced and robust performance.\nIncorporating perceptual feedback through the full reward set (\nT+R+DTRI+V\n) produces the most balanced and robust performance across all datasets. On CODa, the full objective achieves translation error reductions of\n31\n%\n31\\%\n(Seen),\n43\n%\n43\\%\n(Counterfactual), and\n45\n%\n45\\%\n(Unseen) relative to baseline, with rotation error improving by\n28\n%\n28\\%\n(Seen),\n8\n%\n8\\%\n(Counterfactual), and\n11\n%\n11\\%\n(Unseen). On SCAND, translation error reduces by\n28\n%\n28\\%\n(Seen),\n30\n%\n30\\%\n(Counterfactual), and\n5\n%\n5\\%\n(Unseen), while CityWalk shows consistent improvements with Counterfactual achieving a\n64\n%\n64\\%\nreduction. The full objective recovers and extends the rollout accuracy of T+R while preserving local stability from DTRI. Perceptual alignment via video-based evaluators acts as a long-horizon stabilizer, promoting rollouts that are both physically consistent and visually coherent.\nFigure\n3\nshowcases qualitative comparisons of\nGrndCtrl\nrollouts\nx\n^\n1\n:\nT\n\\hat{x}_{1:T}\nagainst the baseline.\nGrndCtrl\nsignificantly mitigates the scene drift failures frequently observed when queried with mirrored input action sequences\na\n0\n:\nT\n−\n1\na_{0:T-1}\n, and improves rollout consistency.\n5.2\nTraining Insights and Stability\nI1: Pretraining bias requires full fine-tuning for meaningful motion adaptation.\nCosmos-Predict2’s pretraining on videos with mostly short clips and slight forward movements biases the model toward scene stability over dynamics. This pretraining bias explains why we observed negligible changes in motion behavior when using parameter-efficient methods like LoRA (except full-size variants), suggesting that pretrained world models may require substantial capacity updates to adapt to navigation-specific action distributions.\nI2: Early diffusion timesteps are most critical for GRPO training stability.\nGrndCtrl\ntraining is significantly more memory intensive than SFT, as it requires maintaining computation graphs over all diffusion steps to track per-timestep log-probabilities for likelihood ratio computation. Early timesteps are primarily responsible for content denoising while later timesteps refine details with exponentially smaller likelihood values, making the 60% timestep limitation both memory-efficient and beneficial for training stability by focusing on the most relevant denoising steps.\nI3:\nGrndCtrl\nrequires sufficient reward variance and careful checkpoint selection.\nMost critically,\nGrndCtrl\ntraining stability depends on having sufficient reward variance across stochastic rollouts.\nGrndCtrl\nfocuses optimization on the reward component with highest variance within each group, which is beneficial for addressing scene drift when some rollouts fail visual odometry while others succeed. However, when checkpoints are overfitted or undertrained, producing uniformly poor or uniformly good rollouts, the normalization step in advantage calculation can amplify subtle differences, leading to degraded training where the model learns arbitrary patterns that add noise to predictions. We mitigate this through KL regularization toward the pretrained model and careful checkpoint selection, ensuring the baseline checkpoint generates distinguishably good and bad rollouts before applying GRPO.\n6\nLimitations\nRLWG introduces a new paradigm for grounding world models using verifiable rewards, and our study focuses on establishing core principles rather than exhaustively scaling the approach. Our experiments use moderate budgets and limited datasets, but already demonstrate that meaningful grounding can be achieved efficiently. A practical constraint of\nGrndCtrl\nis its reliance on sufficient rollout variance for stable relative-policy optimization; understanding the variance dynamics of reward-aligned world model training remains an open direction. Additionally, while RLWG optimizes a multi-objective reward, we do not explore alternative weighting strategies or adaptive weighting schemes, which could further shape the trade-off between global alignment, local consistency, and visual fidelity. Investigating principled multi-reward weighting and larger-scale training holds promise for pushing RLWG toward increasingly stable, generalizable, and physically grounded world models.\n7\nConclusions\nOur work demonstrates that\nRLWG\nenables pretrained video world models to be effectively grounded in physical structure through self-supervised post-training, without requiring human labels or external simulators. Instantiated as\nGrndCtrl\n, the key insight is that verifiable geometric and perceptual rewards, when optimized via relative policy methods, systematically improve spatial coherence while preserving the visual quality that makes these models powerful priors. The most significant improvements emerge under counterfactual scenarios.\nGrndCtrl\nachieves substantial improvements under counterfactual rollouts, with up to\n64\n%\n64\\%\nreduction in translation error, demonstrating that reward-based alignment addresses a fundamental limitation of current world models: their tendency to prioritize visual plausibility over structural consistency. By explicitly optimizing for both,\nRLWG\nenables models that are not only visually coherent but also geometrically consistent, opening new possibilities for reliable long-horizon planning and control in real-world environments.\nAcknowledgements\nWe thank NVIDIA and the authors of Cosmos-Predict2\n[\nnvidia2025cosmosworldfoundationmodel\n]\nfor publicly releasing their code and checkpoints, upon which we build our post-training pipeline. We thank Nikhil Keetha and collaborators for MapAnything\n[\nkeetha2025mapanythinguniversalfeedforwardmetric\n]\n, and the authors of VideoAlign\n[\nliu2025improving\n]\n, for making their code and checkpoints publicly available, enabling our verifiable self-supervised rewards and evaluation metrics. We also thank Amir Bar and collaborators for releasing Navigation World Models\n[\nbar2025navigationworldmodels\n]\ncode and checkpoints and for kindly responding to our inquiry email. Finally, we thank Cherie Ho for early-stage discussions and Jay Karhade for discussions on geometric consistency.\n\\thetitle\nAppendix\nAppendix A\nQualitative Results\nWe include additional counterfactual generation results of\nGrndCtrl\nagainst baseline and ground truths in SCAND\n[\nkarnan2022sociallycompliantnavigationdataset\n]\n(Figure\n4\n) and CityWalk\n[\nliu2025citywalker\n]\n(Figure\n5\n), in addition to CODa\n[\nzhang2023towards\n]\n(Figure\n3\n). The counterfactual rollouts of\nGrndCtrl\nand baseline are expected to mirror the trajectory shown in ground truths in each scene. We observe\nGrndCtrl\nimproves trajectory-following and mitigates scene drift in counterfactual rollouts in all three datasets.\nFigure 4\n:\nCounterfactual generation example in SCAND. Baseline and\nGrndCtrl\nare conditioned on left-right mirrored actions, and the rollouts are expected to invert the movements of the ground truth. Baseline generation still follows similar left-forward movement as GT (trajectory-following failure), while\nGrndCtrl\ngeneration successfully follow inverted right-forward movement.\nFigure 5\n:\nCounterfactual generation example in CityWalk. Baseline and\nGrndCtrl\nare conditioned on left-right mirrored actions, and the rollouts are expected to invert the movements of the ground truth. Baseline generation still follows similar left-turn movement as GT (trajectory-following failure), while\nGrndCtrl\ngeneration successfully follow inverted right-turn movement.\nAppendix B\nComparisons with NWM\n[\nbar2025navigationworldmodels\n]\nWhile RLWG is a post-training framework agnostic to the baseline world model, and in\nGrndCtrl\nwe obtain the baseline with supervised fine-tuning, we acknowledge other potential candidates that perform similar tasks as an experimental baseline. This is exemplified by NWM\n[\nbar2025navigationworldmodels\n]\n, which operates a similar world models scenario in navigation tasks. However, significant differences in experimental settings between\nGrndCtrl\nand NWM results in infeasible quantitative comparisons:\n•\nNWM is jointly-trained on multiple datasets, including RECON\n[\nshah2021rapid\n]\nand HuRoN\n[\nhirose2023sacson\n]\n, which are collected using fish-eye cameras. This results in frequent twisted artifacts in rollouts conditioned on rectilinear images such as SCAND\n[\nkarnan2022sociallycompliantnavigationdataset\n]\n. This biases NWM to perform poorly with visual odometry metrics based on a\nfeed-forward 3D evaluator\nsuch as MapAnything\n[\nkeetha2025mapanythinguniversalfeedforwardmetric\n]\n.\n•\nGrndCtrl\nis conditioned on actions defined in 6-DOF space\n(\nx\n,\ny\n,\nz\n,\nroll\n,\npitch\n,\nyaw\n)\n(x,y,z,\\mathrm{roll},\\mathrm{pitch},\\mathrm{yaw})\n, whereas NWM’s actions are simplified to 3-DOF space\n(\nx\n,\ny\n,\nyaw\n)\n(x,y,\\mathrm{yaw})\n.\nSince\nGrndCtrl\nadopts MapAnything as an evaluator to obtain rewards, we are unable to directly use NWM as our baseline pretrained world model\nW\nθ\nW_{\\theta}\n. Nevertheless, we include qualitative samples of NWM counterfactual rollouts in Figure\n6\n. We used the same image-action sequences from Figures\n4\nin SCAND, the dataset shared by both our experiments and NWM. We used 3-DOF actions as conditions, then performed the same inversion for the rest of the trajectory in 3-DOF to generate counterfactual rollouts. We observe similar failures in scene drift and trajectory-following.\nFigure 6\n:\nCounterfactual generation example in SCAND. NWM and\nGrndCtrl\nare conditioned on left-right mirrored actions, and the rollouts are expected to invert the movements of the ground truth. NWM generation shows clear sign of scene drift in frames 1-3, ending in a more consistent but different scene than the conditional image.\nAppendix C\nFailure Modes\nWhile\nGrndCtrl\ndemonstrates meaningful grounding in world models, we identify three main failure modes.\nFirst, the lack of pixel-level supervision in our post-training results in gradual increase in pixel-level noises in our rollouts. While we mitigate this with KL-regularization towards the pretrained model, we still observe a gradual increase in visual noises as our post-training increases overall rewards with by improving trajectory-following or mitigating scene drift in rollouts. When unconstrained in post-training iterations, the added visual noise may eventually exceed the noise tolerance of the\nfeed-forward 3D evaluator\n, resulting in invalid rewards used for training, and the model rollouts gradually collapse to pure noises.\nSecond, when a set of rollouts produce similarly good or similarly bad results, our multi-objective normalized group advantage treats the slightly worse good results as negative samples, or the slightly better bad results as positive samples. This results in counterproductive learning in post-training, which causes training instability and gradual collapse to noises. We leave the investigation of rollout variance in world models as future work.\nThird, we occasionally observe reward-hacking behaviors, where rewards increase despite generating noises. Due to the black-box nature of the evaluators and our pipeline stochasticity, we mitigate this by retraining.\nAppendix D\nImplementation Details\nWe first describe supervised fine-tuning of the baseline world model, followed by GRPO post-training and the evaluator setup. Table\n3\nsummarizes the key hyperparameters used in both stages.\nD.1\nSupervised Fine-Tuning\nWe fine-tune the Cosmos-Predict2-2B Video2World backbone starting from the released 2B-720p-16fps checkpoint. The visual encoder and decoder of the latent VAE are kept frozen, and we update all parameters in the DiT backbone.\nBefore settling on this configuration, we experimented with several alternatives: (i) full supervised fine-tuning (all DiT parameters), (ii) LoRA with ranks\n16\n16\nand\n64\n64\n, (iii) a full-size LoRA configuration with\n2048\n×\n2048\n2048\\times 2048\nhidden states, and (iv) training only the action embeddings. Due to Cosmos-Predict2’s large-scale pretraining on short clips with mostly mild forward motion, the model is strongly biased toward scene stability rather than rich trajectory dynamics. In practice, only full SFT and the full-size LoRA variant produced meaningful changes in motion behavior; lower-rank LoRA and action-only updates had negligible effect. For simplicity and robustness, we therefore adopt full SFT for all reported experiments.\nSupervision is applied in the latent space using an MSE loss with EDM regularization. During SFT, we perform single-step diffusion and backpropagate only through the DiT backbone, which keeps training computationally efficient. We train for\n20\n20\nk steps with Fully Sharded Data Parallel (FSDP) across eight A100 GPUs. All remaining optimization and diffusion hyperparameters follow the default action-conditioned Cosmos-Predict2 post-training configuration and are listed in Table\n3\n.\nD.2\nGRPO Post-Training\nGRPO post-training is substantially more GPU-memory intensive than SFT because it requires multiple full video rollouts\nx\n^\n1\n:\nT\n\\hat{x}_{1:T}\nper conditioning context while maintaining computation graphs over all diffusion steps to track per-timestep log-probabilities. To fit within memory constraints, we train with a batch size of\n1\n1\nper GPU on eight A100 GPUs and compensate by sampling\nG\n=\n8\nG=8\nstochastic rollouts for each context\nc\n=\n(\nx\n0\n,\na\n0\n:\nT\n−\n1\n)\nc=(x_{0},a_{0:T-1})\n, which provides sufficient diversity for group-relative advantage estimation.\nA single GRPO update accumulates gradients through the diffusion trajectory to compute per-step likelihood ratios. However, diffusion timesteps do not contribute equally: early steps primarily denoise the main scene content, whereas later steps refine fine-grained details and contribute exponentially smaller likelihood values. Computing likelihood ratios over all steps causes the cumulative log-likelihood to vanish and destabilizes training. In practice, we compute the per-step likelihood ratio only over the first\n60\n%\n60\\%\nof diffusion timesteps while still running the full sampler, which improves both numerical stability and memory efficiency.\nComponent\nHyperparameter\nValue\nOptimization\nSFT/GRPO\nOptimizer\nfused AdamW\nSFT/GRPO\nLearning rate\n1.0\n×\n10\n−\n4\n1.0\\times 10^{-4}\nSFT/GRPO\nWeight decay\n0.1\n0.1\nSFT/GRPO\nBetas\n(\n0.9\n,\n0.99\n)\n(0.9,0.99)\nSFT/GRPO\nEpsilon\n1.0\n×\n10\n−\n8\n1.0\\times 10^{-8}\nSFT/GRPO\nLR schedule\nconstant\nDiffusion and sampling\nSFT/GRPO\nPrecision\nbfloat16\nSFT\nClassifier-free guidance\n7.0\n7.0\nSFT/GRPO\nDiffusion timesteps\n35\n35\nSFT\nEDM loss scale\n10.0\n10.0\nSFT\nEDM\nσ\ncond\n\\sigma_{\\text{cond}}\n1.0\n×\n10\n−\n4\n1.0\\times 10^{-4}\nSFT\nEDM\nσ\ndata\n\\sigma_{\\text{data}}\n1.0\n1.0\nSFT\nEDM high-\nσ\n\\sigma\nratio\n0.0\n0.0\nGRPO\nClassifier-free guidance\n0.0\n0.0\nGRPO\nTimesteps backpropagated\n21\n21\nBatching and hardware\nSFT/GRPO\nGPUs\n8\n×\n8\\times\nA100\nSFT\nBatch size / GPU\n8\n8\nSFT\nEffective batch size\n64\n64\nGRPO\nBatch size / GPU\n1\n1\nGRPO\nEffective batch size\n8\n8\nGRPO\nRollouts per context\nG\nG\n8\n8\nTable 3:\nKey hyperparameters for supervised fine-tuning (SFT) and GRPO post-training.\nD.3\nCounterfactual Actions\nWe define the action conditioning of our model as\n(\nx\n,\ny\n,\nz\n,\nroll\n,\npitch\n,\nyaw\n)\n(x,y,z,\\mathrm{roll},\\mathrm{pitch},\\mathrm{yaw})\n. In practice, we use the absolute poses with respect to the conditional image’s camera frame for each frame we generate. We follow the standard camera coordinate convention with\nx\nx\nright,\ny\ny\ndown, and\nz\nz\nforward.\nWe perform left-right mirroring of the ground truth actions to obtain the counterfactual actions. Mirroring a trajectory with respect to the image center corresponds to reflecting motion across the plane\nx\n=\n0\nx=0\nand flipping the viewing direction around the optical axis. For the translational part, this reflection is\n(\nx\n,\ny\n,\nz\n)\n⊤\n↦\n(\n−\nx\n,\ny\n,\nz\n)\n⊤\n(x,y,z)^{\\top}\\;\\mapsto\\;(-x,y,z)^{\\top}\n, which inverts only the lateral component. For small angular magnitudes, the viewing direction can be linearized as\n𝐝\n​\n(\npitch\n,\nyaw\n)\n≈\n(\nyaw\n,\npitch\n,\n1\n)\n⊤\n\\mathbf{d}(\\mathrm{pitch},\\mathrm{yaw})\\approx(\\mathrm{yaw},\\mathrm{pitch},1)^{\\top}\n, so mirroring around the optical axis sends\n𝐝\n↦\n(\n−\nyaw\n,\n−\npitch\n,\n1\n)\n⊤\n\\mathbf{d}\\mapsto(-\\mathrm{yaw},-\\mathrm{pitch},1)^{\\top}\n, corresponding to\n(\npitch\n,\nyaw\n)\n↦\n(\n−\npitch\n,\n−\nyaw\n)\n(\\mathrm{pitch},\\mathrm{yaw})\\mapsto(-\\mathrm{pitch},-\\mathrm{yaw})\n. Combining these, a 6-DOF action\n(\nx\n,\ny\n,\nz\n,\nroll\n,\npitch\n,\nyaw\n)\n(x,y,z,\\mathrm{roll},\\mathrm{pitch},\\mathrm{yaw})\nhas the counterfactual action\n(\n−\nx\n,\ny\n,\nz\n,\nroll\n,\n−\npitch\n,\n−\nyaw\n)\n(-x,y,z,\\mathrm{roll},-\\mathrm{pitch},-\\mathrm{yaw})\n,\nwhich is the mirror of the original motion with respect to the conditioning image’s center axis.\nThis method of obtaining counterfactual actions ensure realistic movement of the embodiment as those in the datasets. When conditioning using arbitrary actions, the model rollouts from the pretrained model are more likely to have poorer quality.\nD.4\nEvaluators and Rewards\nMapAnything\n[\nkeetha2025mapanythinguniversalfeedforwardmetric\n]\nserves as our frozen 3D evaluator\nE\nE\n, providing relative pose estimates\n(\nΔ\n​\nR\nt\n,\nΔ\n​\n𝐭\nt\n)\n(\\Delta R_{t},\\Delta\\mathbf{t}_{t})\nand per-frame depth maps\nD\nt\nD_{t}\nfor each rollout\nx\n^\n1\n:\nT\n\\hat{x}_{1:T}\n. VideoAlign\n[\nliu2025improving\n]\nserves as our frozen video evaluator\nV\nV\n, providing sequence-level visual quality, motion quality, and text alignment scores. We use only visual and motion quality scores (with equal weighting\nα\n=\nβ\n=\n0.5\n\\alpha=\\beta=0.5\n) for the video quality reward\nr\nv\nr_{\\text{v}}\n, ignoring text alignment since our rollouts are not text-conditioned. When GPU memory is constrained, model parameters of the evaluators are temporarily offloaded to CPU, and re-loaded only when used.",
  "preview_text": "Recent advances in video world modeling have enabled large-scale generative models to simulate embodied environments with high visual fidelity, providing strong priors for prediction, planning, and control. Yet, despite their realism, these models often lack geometric grounding, limiting their use in navigation tasks that require spatial coherence and long-horizon stability. We introduce Reinforcement Learning with World Grounding (RLWG), a self-supervised post-training framework that aligns pretrained world models with a physically verifiable structure through geometric and perceptual rewards. Analogous to reinforcement learning from verifiable feedback (RLVR) in language models, RLWG can use multiple rewards that measure pose cycle-consistency, depth reprojection, and temporal coherence. We instantiate this framework with GrndCtrl, a reward-aligned adaptation method based on Group Relative Policy Optimization (GRPO), yielding world models that maintain stable trajectories, consistent geometry, and reliable rollouts for embodied navigation. Like post-training alignment in large language models, GrndCtrl leverages verifiable rewards to bridge generative pretraining and grounded behavior, achieving superior spatial coherence and navigation stability over supervised fine-tuning in outdoor environments.\n\nGrndCtrl: Grounding World Models via Self-Supervised Reward Alignment\nhttps://rlwg-grndctrl.github.io/\nHaoyang He\n1,2\nJay Patrikar\n2\nDong-Ki Kim\n2\nMax Smith\n2\nDaniel McGann\n2\nAli-akbar Agha-mohammadi\n2\nShayegan Omidshafiei\n2\nSebastian Scherer\n1,2\nAbstract\nRecent advances in video world modeling have enabled large-scale generative models to simulate embodied environments with high visual fidelity, providing strong priors for prediction, planning, and control. Yet, despite their realism, these models often lack geometric grounding, limiting their use in navigation tasks that require spatial coherence and long-horizon stability. We introduce\nReinforcement Learning with Wo",
  "is_relevant": true,
  "relevance_score": 7.0,
  "extracted_keywords": [
    "video diffusion",
    "multimodal generation",
    "efficient diffusion model"
  ],
  "one_line_summary": "通过自监督奖励对齐实现几何接地的视频世界模型，提升具身导航中的空间一致性和长程稳定性。",
  "detailed_summary": "## 论文详细摘要\n\n- **研究背景和动机**  \n  当前的大规模视频世界模型虽能生成高视觉保真的未来帧预测，但在长期rollout中常出现几何漂移、姿态不一致等问题，导致其在需要空间一致性的具身导航任务中表现不佳。本文指出，现有模型过度关注“视觉合理性”而忽视“结构一致性”，缺乏对物理世界的几何与时间约束的建模。\n\n- **核心方法和技术创新**  \n  提出 **Reinforcement Learning with World Grounding (RLWG)** 框架，并实例化为 **GrndCtrl** 方法。该方法通过自监督奖励对预训练世界模型进行后训练：利用冻结的3D感知模型（如MapAnything）提取**位姿循环一致性、深度重投影、动作遵循性**等可验证的几何奖励，结合Group Relative Policy Optimization (GRPO) 进行多目标强化学习优化。创新性地将语言模型中的RLVR思想迁移到视觉世界模型，实现无需人工标注或仿真器的“自我对齐”。\n\n- **主要实验结果**  \n  在CODa、SCAND和CityWalk三个真实导航数据集上验证，GrndCtrl显著降低平移与旋转误差（最多减少64%），尤其在反事实动作（如镜像控制）下表现出更强的泛化能力。同时，rollout的轨迹稳定性与深度一致性大幅提升，且优于监督微调方法。\n\n- **研究意义和价值**  \n  本工作首次系统性实现了世界模型的“几何接地”（grounding），推动视频世界模型从“看起来合理”走向“结构上可信”。为构建可用于真实环境长期规划与控制的可靠世界模型提供了新范式，具有重要的理论价值与应用前景。",
  "qa_pairs": [
    {
      "question": "这篇论文的核心创新点是什么，他想解决什么问题，怎么解决的？",
      "answer": "## 论文核心创新与问题解决分析\n\n这篇论文《**GrndCtrl: Grounding World Models via Self-Supervised Reward Alignment**》提出了一种全新的后训练对齐框架，旨在解决当前视频世界模型在**几何一致性**和**长期稳定性**上的根本缺陷。\n\n---\n\n### 一、要解决的核心问题\n\n- **问题本质：视觉逼真 ≠ 几何正确**\n  - 当前大规模视频世界模型（如Cosmos-Predict）虽然能生成高视觉保真的未来帧预测，但其动态建模往往“**重外观轻结构**”。\n  - 在长程 rollout 中会出现：\n    - **姿态漂移（pose drift）**\n    - **深度抖动（depth wobble）**\n    - **轨迹失准（trajectory misalignment）**\n  - 这些问题导致模型无法用于需要**物理一致性的任务**，如导航、定位、规划等闭环保留场景。\n\n- **关键挑战**：\n  - 如何在不依赖人工标注或外部仿真器的前提下，让世界模型从“看起来像”进化到“动起来也对”。\n\n---\n\n### 二、核心创新点\n\n#### 1. 提出 **RLWG（Reinforcement Learning with World Grounding）** 框架\n> 类比于语言模型中的 RLVR（Reinforcement Learning with Verifiable Rewards），将可验证奖励引入**具身世界建模**。\n\n- **创新思想**：\n  - 将预训练的世界模型视为一个“策略”，通过自监督的**可验证奖励**进行强化学习式微调。\n  - 奖励不是来自人类反馈，而是来自**冻结的感知模块**（frozen evaluators）提供的物理一致性指标。\n\n- **技术亮点**：\n  ```markdown\n  - 自监督：无需标注数据\n  - 可验证：奖励基于几何/时间不变性（如循环一致性）\n  - 多目标：联合优化平移、旋转、深度重投影、视觉质量\n  ```\n\n#### 2. 构造 **GrndCtrl** 方法 —— RLWG 的具体实现\n> 基于 **Group Relative Policy Optimization (GRPO)** 实现多奖励对齐。\n\n- **方法流程**：\n  1. 对同一初始状态 $c = (x_0, a_{0:T-1})$，采样 $G$ 条随机 rollout $\\{\\hat{x}_{1:T}^{(i)}\\}$\n  2. 使用冻结的评估器计算每条 rollout 的四项奖励：\n     - **r_trans**: 平移误差（vs. 视觉里程计估计）\n     - **r_rot**: 旋转误差\n     - **r_dtr**: 深度时序重投影内点率（Depth Temporal Reprojection Inlier）\n     - **r_v**: 视频质量（来自 VideoAlign 的视觉+运动评分）\n  3. 在组内归一化并计算相对优势（advantage）\n  4. 使用带裁剪的策略梯度更新模型参数，同时用 KL 正则保持与原始模型接近\n\n- **公式摘要**：\n  ```math\n  J(\\theta) = \\mathbb{E}\\left[\\frac{1}{G}\\sum_{i=1}^G \\frac{1}{T}\\sum_{t=1}^T \\min\\left(\\rho_{t,i} A_i, \\text{clip}(\\rho_{t,i}, 1-\\epsilon, 1+\\epsilon) A_i\\right)\\right]\n  ```\n  其中 $A_i$ 是多目标归一化后的 group advantage。\n\n---\n\n### 三、如何解决问题？—— 技术路径总结\n\n| 步骤 | 解法 | 目标 |\n|------|------|------|\n| **1. 定义“接地”标准** | 引入物理可验证的奖励函数（cycle-consistency, reprojection, etc.） | 替代传统像素级重建损失 |\n| **2. 构建反馈闭环** | 利用冻结的 **MapAnything** 和 **VideoAlign** 作为“裁判” | 实现无监督的自我评估 |\n| **3. 稳定优化过程** | 采用 GRPO 进行组内相对优化 | 避免绝对奖励尺度问题，提升训练稳定性 |\n| **4. 控制生成多样性** | 在扩散过程中控制噪声注入（$\\eta$ 参数）以生成多样 rollout | 满足 GRPO 所需的对比基础 |\n\n---\n\n### 四、实际价值与意义\n\n- ✅ **首次实现世界模型的“自我对齐”**：\n  - 不依赖标签或模拟器，仅靠自身预测 + 冻结评估器即可完成物理接地。\n\n- ✅ **显著提升长程稳定性**：\n  - 实验显示在 counterfactual 动作下，**平移误差最多降低 64%**，且方差大幅减小（见 Table 2）。\n\n- ✅ **支持反事实推理（counterfactual reasoning）**：\n  - 能正确响应镜像动作指令，生成符合物理逻辑的反向轨迹（见 Figure 3, 4, 5），这是真正“理解”运动的表现。\n\n- ✅ **为真实机器人应用铺路**：\n  - 接地后的世界模型可用于安全可靠的长期规划、SLAM 初始化、虚拟试驾等任务。\n\n---\n\n### 总结：一句话概括\n\n> **GrndCtrl 通过自监督的可验证奖励（几何+感知），利用 GRPO 框架对预训练世界模型进行后训练对齐，使其从“画得像”变为“动得对”，实现了无需标注的物理一致性世界模拟。**\n\n这一工作标志着世界模型从**生成式艺术**迈向**功能性仿真**的关键一步。",
      "timestamp": "2026-01-09T10:00:29.738471",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "基于他的前作，梳理这个方向的整个发展脉络，每一步相比于之前的工作都改进了什么，着重于几个不同的发展方向。",
      "answer": "## GrndCtrl 发展脉络与技术演进分析\n\n本文 **GrndCtrl: Grounding World Models via Self-Supervised Reward Alignment** 提出了一种全新的世界模型“接地”（grounding）范式，其核心思想是借鉴大语言模型中的 **RLVR（Reinforcement Learning with Verifiable Rewards）** 框架，将其迁移到视觉世界模型中，通过可验证的几何与感知奖励实现自监督后训练。这一工作并非孤立出现，而是建立在多个前沿方向的基础之上。\n\n以下从四个关键技术脉络梳理该方向的发展，并指出每一步的改进点：\n\n---\n\n### 1. **视频世界模型：从生成到控制**\n> *目标：让模型不仅能预测未来帧，还能响应动作指令进行可控模拟*\n\n- **早期工作（如 Cosmos-Predict, V-JEPA）**  \n  - 基于大规模视频预训练，学习像素级未来帧预测。\n  - 使用扩散模型或自回归架构，在视觉上高度逼真。\n  - ❌ 缺陷：仅关注外观一致性，忽略物理结构；缺乏对动作的显式建模。\n\n- **改进：引入动作条件化（Action-Conditioned World Models）**\n  - 如 **PosePilot**, **Gen3C**, **Navigation World Models (NWM)** 等：\n    - 将动作（平移、旋转）作为输入条件，控制未来视角生成。\n    - 实现 ego-centric 视角下的导航模拟。\n    - ✅ 改进：支持闭环控制和路径规划。\n    - ❌ 局限：依赖监督学习，使用单步一致性损失（如光流对齐），无法保证长时程几何稳定性。\n\n- **GrndCtrl 的突破**：\n  - 不再依赖监督微调（SFT），而是提出 **RLWG（Reinforcement Learning with World Grounding）** 框架。\n  - 将世界模型视为策略（policy），通过强化学习优化多步 rollout 的整体物理一致性。\n  - ✅ **本质跃迁**：从“模仿预测”转向“结构对齐”，强调长期动态稳定性而非短期像素匹配。\n\n```text\n发展路径：\nCosmos-Predict → NWM/PosePilot → GrndCtrl\n       ↓               ↓              ↓\n   视频预测      动作条件化生成     自监督结构对齐\n```\n\n---\n\n### 2. **几何一致性增强：从被动评估到主动优化**\n> *目标：解决世界模型中普遍存在的“场景漂移”（scene drift）、深度抖动等问题*\n\n- **传统方法（如 Flow Matching, Warping Losses）**\n  - 利用光流、视差等低级特征约束相邻帧之间的变换。\n  - 如 PosePilot 使用 self-supervised warping 损失提升局部一致性。\n  - ❌ 局限：只考虑一阶时间关系，累积误差仍严重；无全局轨迹约束。\n\n- **进阶方法（如 MapAnything, SpaTracker）**\n  - 引入 **feed-forward 3D evaluator**：\n    - 可以估计每帧的相机位姿（ΔR, Δt）和深度图 D_t。\n    - 提供独立于生成模型的外部几何参考。\n  - 这些模型本身不参与训练，仅用于评估生成结果的几何合理性。\n\n- **GrndCtrl 的创新整合**：\n  - 首次将这些冻结的 3D evaluator 用作 **奖励函数提供者**，而非测试指标。\n  - 设计三种可验证奖励：\n    - **r_trans / r_rot**：衡量预测动作与视觉里程计推断动作的一致性。\n    - **r_dtr**（Depth Temporal Reprojection Inlier Ratio）：衡量重投影点是否落在合理深度范围内。\n  - ✅ 改进：将几何一致性从“训练信号缺失”变为“可量化优化目标”。\n\n---\n\n### 3. **后训练对齐：从人类反馈到自验证奖励**\n> *目标：无需人工标注即可提升模型行为的可靠性*\n\n- **语言模型启发：RLHF → RLVR**\n  - **RLHF**（Reinforcement Learning from Human Feedback）：\n    - 依赖人类打标签排序输出，成本高。\n  - **RLVR**（Reinforcement Learning with Verifiable Rewards）：\n    - 如 Tulu3 所示，利用逻辑/数学规则自动判断回答正确性。\n    - 实现“自我验证”的推理对齐。\n\n- **视觉领域迁移：DanceGRPO → GrndCtrl**\n  - **DanceGRPO**：\n    - 应用 GRPO 到舞蹈视频生成，使用视觉质量评分器作为奖励。\n    - 但仍是美学导向，非物理结构导向。\n\n- **GrndCtrl 的关键飞跃**：\n  - 提出 **RLWG = RLVR + 几何验证**\n    - 类比 RLVR 中的语言逻辑验证，RLWG 使用 **几何与时间一致性** 作为验证标准。\n  - 引入 **Group Relative Policy Optimization (GRPO)**：\n    - 对同一上下文生成多个 rollout。\n    - 使用冻结 evaluator 打分并归一化，计算组内相对优势。\n    - 更新策略以偏好更“物理可信”的轨迹。\n  - ✅ 核心贡献：首次实现 **完全自监督的世界模型接地训练**，无需任何人工标注或仿真器介入。\n\n---\n\n### 4. **多目标奖励设计：平衡全局与局部一致性**\n> *目标：协调不同性质的奖励，避免优化冲突*\n\n| 奖励类型 | 作用 | 潜在风险 |\n|--------|------|---------|\n| `r_trans`, `r_rot` | 全局轨迹对齐，防止漂移 | 忽视局部细节 |\n| `r_dtr`（深度重投影） | 局部几何平滑，确保帧间对应 | 可能牺牲全局路径准确性 |\n| `r_v`（视觉质量） | 维持生成保真度 | 可能鼓励“看起来好但不真实”的幻觉 |\n\n- **GrndCtrl 的系统性探索**：\n  - 在 Table 1 中进行了完整的 ablation study：\n    - **+T+R**：显著改善 Counterfactual 性能（最高↓63%），说明姿态一致性对泛化至关重要。\n    - **+T+R+DTRI**：局部稳定提升，但在某些数据集导致全局误差上升 → 揭示了**局部 vs 全局**的 trade-off。\n    - **+T+R+DTRI+V**：加入视觉质量后恢复平衡，实现最鲁棒表现。\n  - ✅ 贡献：不仅提出多奖励机制，还实证揭示了各类奖励的作用边界与协同方式。\n\n---\n\n## 总结：GrndCtrl 的技术创新与实际价值\n\n| 方向 | 之前的工作 | GrndCtrl 的改进 |\n|------|------------|----------------|\n| **训练范式** | 监督微调（SFT）<br>单步重建损失 | ✅ 提出 **RLWG** 框架<br>→ 多步 rollout 强化学习对齐 |\n| **监督来源** | 人类标注 / 地面真值 | ✅ 完全自监督<br>→ 冻结 evaluator 提供可验证奖励 |\n| **优化目标** | 视觉保真度<br>短期一致性 | ✅ 结构一致性<br>长期物理可信性 |\n| **核心技术** | Diffusion + SFT | ✅ GRPO + 多目标奖励归一化 |\n| **应用场景** | 开环生成 | ✅ 支持闭环保留<br>→ 导航、规划、定位 |\n\n### 实际价值亮点：\n- **适用于真实户外环境**：在 CODa、SCAND、CityWalk 等复杂城市/校园场景中验证有效。\n- **强泛化能力**：尤其在 **Counterfactual Rollouts** 上表现突出（如镜像动作反转），表明具备真正的空间推理潜力。\n- **即插即用式升级**：可作为现有世界模型的“后处理模块”，无需重新预训练。\n\n---\n\n## 未来方向展望\n\n1. **动态奖励加权机制**：当前固定组合权重，未来可探索根据任务自适应调整。\n2. **闭环集成应用**：将 GrndCtrl 接地后的世界模型直接用于 MPC（Model Predictive Control）。\n3. **扩展至其他模态**：如触觉、声音等多感官一致性奖励。\n4. **减少对 evaluator 的依赖**：研究如何联合学习轻量级 reward model 替代大型冻结 evaluator。\n\n> **一句话总结**：  \n> **GrndCtrl 实现了世界模型从“画得像”到“走得稳”的关键跨越——它不再只是世界的画家，而开始成为可信赖的导航员。**",
      "timestamp": "2026-01-09T10:01:31.282638",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "他的前作有哪些？使用表格仔细讲讲他的每篇前作，他和前作的区别是什么，主要改善是什么？着重于具体相比于之前文章的改动",
      "answer": "## GrndCtrl: Grounding World Models via Self-Supervised Reward Alignment — 前作分析与技术演进\n\n本文 **GrndCtrl** 提出了一种全新的“世界模型接地”（World Model Grounding）范式，其核心思想是通过**自监督的可验证奖励**（verifiable rewards）对预训练视频世界模型进行后训练（post-training），从而提升其在空间几何和时间动态上的物理一致性。为了深入理解其创新性，我们系统梳理作者团队或相关背景下的**关键前作**，并重点分析 **GrndCtrl 相比这些工作的具体改进与技术突破**。\n\n> 注：由于论文作者列表中包含来自 FieldAI 和 CMU 的多位研究人员，且部分工作未明确标注为同一团队，以下分析基于论文引用、研究方向一致性以及公开信息推断出最相关的前作，并聚焦于与 **GrndCtrl 核心目标——提升世界模型的几何一致性**直接相关的研究。\n\n---\n\n### 📚 关键前作汇总表\n\n| 论文/项目 | 作者/团队 | 年份 | 主要贡献 | 方法类型 | 是否需标注/仿真器 |\n|----------|---------|------|--------|--------|----------------|\n| **Cosmos-Predict2** | NVIDIA | 2025 | 大规模视频基础模型，支持动作条件化生成 | 预训练 + SFT | 是（动作-视频对） |\n| **MapAnything** | Nikhil Keetha et al. | 2025 | 开箱即用的单目深度与姿态估计器 | 自监督视觉感知 | 否 |\n| **VideoAlign** | Liu et al. | 2025 | 视频质量评估模型（视觉+运动质量） | 视频打分模型 | 否 |\n| **Navigation World Models (NWM)** | Amir Bar et al. | 2025 | 导航专用世界模型，强调轨迹一致性 | 端到端监督训练 | 是 |\n| **GrndCtrl (本文)** | He et al. | 2024 | **通过多目标 GRPO 对世界模型进行自监督奖励对齐** | **RL-based post-training** | **否** |\n\n---\n\n### 🔍 逐篇对比分析：GrndCtrl 的技术创新点\n\n#### 1. **vs. Cosmos-Predict2 [nvidia2025cosmosworldfoundationmodel]**\n\n- **前作简介**：\n  - 一个大规模预训练的视频世界模型，使用扩散架构（DiT + VAE），能够根据初始帧和动作序列生成未来视频。\n  - 采用**监督微调**（SFT）方式，在动作-视频数据上训练，目标是最小化像素级重建误差或扩散损失。\n\n- **主要问题**：\n  - 虽然视觉保真度高，但缺乏**几何接地**（geometric grounding）：生成的轨迹存在漂移（drift）、旋转不一致、深度抖动等问题。\n  - 模型倾向于“看起来合理”，而非“物理上正确”。\n\n- **GrndCtrl 的改进与改动**：\n\n| 维度 | Cosmos-Predict2 | GrndCtrl |\n|------|------------------|----------|\n| **训练目标** | 最大似然 / 像素重建损失 | **多目标可验证奖励最大化**（r_trans, r_rot, r_dtr, r_v） |\n| **学习信号来源** | 人类标注的动作-视频对 | **冻结的自监督评估器**（MapAnything + VideoAlign） |\n| **训练机制** | 监督学习（SFT） | **强化学习式后训练**（GRPO） |\n| **是否需要标签** | ✅ 是 | ❌ 否（完全自监督） |\n| **是否依赖仿真器** | ❌ 否 | ❌ 否 |\n| **几何一致性** | 弱（仅隐式学习） | **强（显式优化 cycle-consistency, reprojection）** |\n| **反事实泛化能力** | 差（见 Table 1 Counterfactual 性能下降） | **显著提升（最高64%误差降低）** |\n\n> ✅ **核心创新**：将原本用于语言模型对齐的 **GRPO + RLVR 范式迁移到视觉世界模型**，实现了从“模仿外观”到“遵守物理”的转变。\n\n---\n\n#### 2. **vs. MapAnything [keetha2025mapanythinguniversalfeedforwardmetric]**\n\n- **前作简介**：\n  - 一种无需微调即可为任意视频提供**每帧深度图**和**相对相机位姿**的前馈网络。\n  - 可作为“冻结评估器”用于下游任务中的几何一致性测量。\n\n- **GrndCtrl 的利用方式**：\n  - 将 MapAnything 作为 **冻结的 3D evaluator ℰ**，用于计算三个关键奖励：\n    - `r_trans`：预测平移 vs. 评估器估计的平移误差\n    - `r_rot`：预测旋转 vs. 评估器估计的旋转误差\n    - `r_dtr`：深度重投影内点率（Depth Temporal Reprojection Inlier ratio）\n\n- **相比前作的改进**：\n  - MapAnything 本身是一个**感知工具**，而 GrndCtrl 将其转化为**训练信号生成器**。\n  - 实现了“**用感知指导生成**”的闭环：生成 → 评估几何一致性 → 更新生成器。\n  - 这是一种典型的 **reward-informed geometry** 设计哲学。\n\n> ✅ **创新点**：首次将通用 3D 感知模型作为**可微分奖励函数的一部分**，用于稳定世界模型训练，而不仅仅是测试指标。\n\n---\n\n#### 3. **vs. VideoAlign [liu2025improving]**\n\n- **前作简介**：\n  - 一个用于评估生成视频质量的模型，输出包括视觉质量、运动连贯性和文本对齐得分。\n\n- **GrndCtrl 的利用方式**：\n  - 使用其提供的 `s_vis` 和 `s_mot` 构建 **视频质量奖励 `r_v`**：\n    ```python\n    r_v = α * s_vis + β * s_mot  # 默认 α=β=0.5\n    ```\n  - 该奖励保留生成结果的视觉合理性，防止过度优化几何导致画面崩坏。\n\n- **相比前作的改进**：\n  - VideoAlign 原本用于**评估或排序**生成结果。\n  - GrndCtrl 将其嵌入训练循环，成为**梯度更新的驱动力之一**。\n  - 形成多目标平衡：既不能太“假”，也不能太“飘”。\n\n> ✅ **创新点**：构建了**多模态奖励融合机制**，兼顾几何真实性与视觉美观性，避免单一目标带来的副作用。\n\n---\n\n#### 4. **vs. Navigation World Models (NWM) [bar2025navigationworldmodels]**\n\n- **前作简介**：\n  - 专为导航设计的世界模型，强调长期轨迹稳定性。\n  - 使用监督学习联合训练动作-观测映射。\n\n- **GrndCtrl 的区别与优势**：\n\n| 维度 | NWM | GrndCtrl |\n|------|-----|---------|\n| **训练方式** | 端到端监督训练 | **基于已有模型的后训练对齐** |\n| **动作空间** | 3-DOF（x, y, yaw） | **6-DOF（x, y, z, roll, pitch, yaw）** |\n| **泛化能力** | 限于训练分布 | **支持 counterfactual 动作（如镜像）** |\n| **是否需重新训练** | ✅ 是 | ❌ 否（适用于任何预训练模型） |\n| **几何约束** | 隐式学习 | **显式 reward-driven alignment** |\n\n- **实验补充说明（Appendix B）**：\n  - 作者尝试比较 NWM，但由于其使用鱼眼相机训练，在标准图像上表现差，且动作维度不同，无法公平对比。\n  - 定性结果显示 NWM 在反事实场景下也出现严重场景漂移。\n\n> ✅ **核心优势**：**GrndCtrl 是一种通用的 post-training 框架**，不依赖特定架构或训练流程，可即插即用地提升现有模型性能。\n\n---\n\n### 🛠️ GrndCtrl 的核心技术改动总结\n\n| 技术组件 | 改动详情 | 目的 |\n|--------|--------|------|\n| **训练范式** | 从 SFT → **GRPO-based RL** | 利用相对优势优化非可导奖励 |\n| **奖励设计** | 引入 **4 种可验证奖励**：<br>• `r_trans`（平移误差）<br>• `r_rot`（旋转误差）<br>• `r_dtr`（深度重投影内点率）<br>• `r_v`（视觉+运动质量） | 多角度衡量物理一致性 |\n| **评估器使用** | 冻结 MapAnything 和 VideoAlign 作为 **black-box reward 函数**",
      "timestamp": "2026-01-09T10:02:20.535359",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文提出了哪些关键技术方法，请列表格具体详细说明技术细节，需要包含具体的数学原理推导，以及具体参数。",
      "answer": "## 论文关键技术方法详解\n\n本文提出了一种名为 **GrndCtrl** 的自监督后训练框架，用于对预训练的视频世界模型进行几何和感知对齐。其核心思想是通过可验证的奖励信号（verifiable rewards）来“接地”（grounding）生成式世界模型，使其在长时序模拟中保持空间一致性和物理合理性。\n\n以下是论文提出的关键技术方法及其详细技术细节、数学原理推导与参数设置。\n\n---\n\n### 1. 总体框架：Reinforcement Learning with World Grounding (RLWG)\n\n| **项目** | **说明** |\n|--------|--------|\n| **目标** | 将预训练的世界模型 $W_\\theta$ 从视觉保真度驱动转向结构一致性驱动，实现几何与时间上的物理可验证性。 |\n| **范式** | 自监督强化学习（无需人工标注或外部仿真器）。 |\n| **机制** | 使用冻结的评估器（frozen evaluators）计算多个可验证奖励，基于 GRPO 算法优化模型策略。 |\n| **输入** | 初始帧 $x_0$ 和动作序列 $a_{0:T-1}$ |\n| **输出** | 多个候选 rollout $\\{\\hat{x}_{1:T}^{(i)}\\}_{i=1}^G$ |\n\n---\n\n### 2. 核心算法：GrndCtrl = RLWG + GRPO\n\n| **组件** | **说明** |\n|--------|--------|\n| **基础模型** | 预训练扩散模型（Cosmos-Predict2-2B），Latent DiT 架构 |\n| **后训练方式** | Group Relative Policy Optimization (GRPO) |\n| **关键创新** | 将语言模型中的 RLVR 范式迁移到视觉世界建模领域，用几何/感知奖励替代逻辑/语言奖励 |\n\n#### 数学形式化：\n\n给定条件上下文 $c = (x_0, a_{0:T-1})$，模型采样 $G$ 个 rollouts：\n$$\n\\hat{x}_{1:T}^{(i)} \\sim W_\\theta(\\cdot \\mid x_0, a_{0:T-1}), \\quad i=1,\\dots,G\n$$\n\n每个 rollout 被一组冻结评估器打分，得到多目标奖励向量：\n$$\nU(\\hat{x}_{1:T}^{(i)}) = \\left[r_{\\text{trans}}^{(i)}, r_{\\text{rot}}^{(i)}, r_{\\text{dtr}}^{(i)}, r_v^{(i)}\\right]\n$$\n\n然后归一化并计算组内相对优势（Group Advantage）：\n\n```math\n\\tilde{r}^{(i)} = \\frac{r^{(i)} - \\mu_r}{\\sigma_r}, \\quad A_i = \\frac{\\tilde{r}^{(i)} - \\mu_{\\tilde{r}}}{\\sigma_{\\tilde{r}}}\n```\n\n其中 $\\mu, \\sigma$ 分别为均值和标准差。\n\n最终优化目标为带裁剪的 PPO 式策略梯度：\n\n```math\nJ(\\theta) = \\mathbb{E}\\left[\\frac{1}{G}\\sum_{i=1}^G \\frac{1}{T}\\sum_{t=1}^T \\min\\left(\\rho_{t,i} A_i, \\text{clip}(\\rho_{t,i}, 1-\\epsilon, 1+\\epsilon) A_i\\right)\\right]\n```\n\n其中：\n- $\\rho_{t,i} = \\exp(\\log p_\\theta(x_t^{(i)} \\mid x_{<t}^{(i)}) - \\log p_{\\text{ref}}(x_t^{(i)} \\mid x_{<t}^{(i)}))$\n- $p_{\\text{ref}}$ 是参考策略（即原始预训练模型）\n- $\\epsilon = 0.2$ （默认 clip ratio）\n\n> ✅ **作用**：稳定训练过程，防止策略更新过大导致崩溃；利用组内比较增强鲁棒性。\n\n---\n\n### 3. 可验证奖励系统（Verifiable Self-Supervised Rewards）\n\n所有奖励均由**冻结的前馈网络**（frozen feed-forward models）提供，不参与梯度更新。\n\n| 奖励类型 | 数学公式 | 物理意义 | 参数设置 |\n|--------|--------|--------|--------|\n\n#### (1) 平移奖励（Translation Reward）\n\n衡量预测动作与评估器估计之间的平移误差。\n\n```math\n\\mathbf{e}_t^{\\text{trans}} = \\Delta\\mathbf{t}_t - \\mathbf{t}_t\n```\n```math\nr_{\\text{trans}} = -\\left( \\frac{1}{|\\mathcal{T}|} \\sum_{t \\in \\mathcal{T}} \\|\\mathbf{e}_t^{\\text{trans}}\\|_2^2 + \\|\\mathbf{e}_{|\\mathcal{T}|}^{\\text{trans}}\\|_2^2 \\right)\n```\n\n- $\\Delta\\mathbf{t}_t$: MapAnything 提供的相对位移\n- $\\mathbf{t}_t$: 模型预测的动作输入\n- $\\mathcal{T}$: 评估的时间步集合（通常为全部时间步）\n- 加入最终位置惩罚项以增强轨迹整体一致性\n\n> ⚙️ **用途**：约束全局轨迹对齐，减少漂移。\n\n---\n\n#### (2) 旋转奖励（Rotation Reward）\n\n使用轴角距离衡量旋转偏差。\n\n```math\n\\mathbf{e}_t^{\\text{rot}} = \\arccos\\left( \\frac{\\operatorname{tr}(\\Delta R_t R_t^\\top) - 1}{2} \\right)\n```\n```math\nr_{\\text{rot}} = -\\sum_{t \\in \\mathcal{T}} \\mathbf{e}_t^{\\text{rot}}\n```\n\n- $\\Delta R_t \\in SO(3)$: 评估器提供的相对旋转\n- $R_t$: 模型动作输入中的旋转部分\n- 输出单位为弧度（rad）\n\n> ⚙️ **用途**：确保姿态变化符合真实运动规律。\n\n---\n\n#### (3) 深度时序重投影奖励（Depth Temporal Reprojection Inlier Ratio, DTRI）\n\n借鉴 [MapAnything] 中的方法，衡量深度图在运动下的几何一致性。\n\n对于像素 $p \\in \\Omega$（图像域）：\n\n```math\n(\\hat{p}, d_{t\\to t+1}^{\\exp}(p)) = \\Phi(p; D_t, \\Delta R_t, \\Delta\\mathbf{t}_t, K_t, K_{t+1})\n```\n\n其中 $\\Phi$ 表示反投影 + 刚体变换 + 投影操作：\n\n1. 用 $D_t(p)$ 将 $p$ 反投影为空间点\n2. 应用 $(\\Delta R_t, \\Delta\\mathbf{t}_t)$ 变换到下一帧坐标系\n3. 使用 $K_{t+1}$ 投影到 $t+1$ 帧得 $\\hat{p}$\n4. 查 $D_{t+1}(\\hat{p})$ 得实际深度\n\n定义单帧深度内点率（threshold $\\gamma = 0.0103$）：\n\n```math\n\\mathrm{DTRI}_t^{(\\gamma)} = \\frac{1}{|\\Omega|} \\sum_{p \\in \\Omega} \\mathbf{1}\\left[ \\frac{|D_{t+1}(\\hat{p}) - d_{t\\to t+1}^{\\exp}(p)|}{d_{t\\to t+1}^{\\exp}(p)} < \\gamma \\right]\n```\n\n最终奖励为平均内点率：\n\n```math\nr_{\\text{dtr}} = \\frac{1}{|\\mathcal{T}|} \\sum_{t \\in \\mathcal{T}} \\mathrm{DTRI}_t^{(\\gamma)}\n```\n\n> ✅ **优点**：无需真实深度标签，仅依赖相机几何即可构建强监督信号  \n> 🔁 **本质**：闭环一致性检查（cycle consistency in depth space）\n\n---\n\n#### (4) 视频质量奖励（Video Quality Reward）\n\n使用 VideoAlign 模型输出三个维度的质量评分：\n\n```math\n(s_{\\text{vis}}, s_{\\text{mot}}, s_{\\text{txt}}) = \\mathcal{V}(\\hat{x}_{1:T}; y)\n```\n\n由于无文本提示 $y$，忽略 $s_{\\text{txt}}$，定义综合视觉奖励：\n\n```math\nr_v = \\alpha s_{\\text{vis}} + \\beta s_{\\text{mot}}, \\quad \\alpha = \\beta = 0.5\n```\n\n- $s_{\\text{vis}} \\in [0,1]$: 图像清晰度、伪影程度\n- $s_{\\text{mot}} \\in [0,",
      "timestamp": "2026-01-09T10:03:04.056971",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "他使用了哪些评价指标与数据集，列表格具体讲讲他的评价指标的细节与数据集的细节",
      "answer": "## GrndCtrl: 评价指标与数据集详解\n\n该论文通过系统性的实验验证了 **GrndCtrl** 在提升世界模型几何一致性与导航稳定性方面的有效性。其评估体系设计严谨，覆盖多种泛化场景，并结合多维度、可验证的指标进行量化分析。\n\n---\n\n### 一、核心评价指标（Metrics）\n\n论文在三个主要维度上对模型性能进行评估：**位姿精度（Translation & Rotation）**、**深度一致性（Depth Temporal Reprojection Inlier Ratio, DTRI）** 和 **视觉质量（Video Quality）**。\n\n| 指标 | 符号 | 定义 | 单位 | 越...越好 |\n|------|------|------|------|-----------|\n| **平移误差** | T ↓ | 累计轨迹均方误差 + 最终位置误差，即 $-r_{\\text{trans}}$ | 米 (m) | 小 |\n| **旋转误差** | R ↓ | 累积轴角偏差总和，即 $-r_{\\text{rot}}$ | 弧度 (rad) | 小 |\n| **深度时序重投影内点率** | DTRI ↑ | 像素级深度一致性比例，衡量几何局部稳定性的关键指标 | 百分比 (%) | 大 |\n| **视频质量得分** | V ↑ | 视觉质量 $s_{\\text{vis}}$ 与运动质量 $s_{\\text{mot}}$ 的加权平均：<br>$r_v = \\alpha s_{\\text{vis}} + \\beta s_{\\text{mot}},\\ \\alpha=\\beta=0.5$ | [0,1] 区间分数 | 大 |\n\n> 📌 **说明**：\n> - 所有指标均基于 **200 个非重叠序列** 的测试集计算平均值。\n> - 平移与旋转误差使用 **MapAnything** 提供的伪真值姿态估计作为参考。\n> - DTRI 使用固定阈值 $\\gamma = 0.0103$ 判断深度是否一致。\n> - 视频质量由 **VideoAlign** 冻结模型打分，仅保留视觉与运动质量项。\n\n---\n\n### 二、实验数据集（Datasets）\n\n为验证方法的通用性，作者在三个风格迥异的数据集上进行了训练与评估，涵盖不同平台（轮式机器人、四足机器人、行人）、环境（校园、城市街道）和采集方式。\n\n| 数据集 | 类型 | 平台 | 场景 | 关键特性 | 训练/测试划分 |\n|--------|------|------|------|----------|----------------|\n| **CODa**<br>[Zhang et al., 2023] | 导航数据集 | 轮式机器人 | 校园户外路径 | - 包含激光雷达SLAM生成的伪真值位姿<br>- 中等尺度运动，结构清晰 | 子采样 2k 条 13 帧序列用于训练<br>200 条用于各测试集 |\n| **SCAND**<br>[Karnan et al., 2022] | 社会导航数据集 | 轮式 & 四足机器人 | 校园人行道 | - 多动态障碍物交互<br>- 更复杂的避障行为<br>- 动作多样性高 | 同上 |\n| **CityWalk**<br>[Liu et al., 2025] | 行人第一视角数据集 | 行人（YouTube视频） | 城市密集街道 | - 极高动态背景（人群、车辆）<br>- 相机抖动显著<br>- 使用 MapAnything 重处理获得姿态 | 同上 |\n\n> ✅ **预处理统一性**：\n> - 所有数据被子采样为 **13帧连续片段**（1条件帧 + 12预测帧）\n> - 动作空间统一为 **6自由度**：$(x, y, z, \\text{roll}, \\text{pitch}, \\text{yaw})$\n> - 使用 **MapAnything** 统一提取每帧深度图 $D_t$ 与相对位姿 $(\\Delta R_t, \\Delta \\mathbf{t}_t)$ 作为奖励信号来源\n\n---\n\n### 三、三大评估范式（Evaluation Regimes）\n\n为了全面检验模型的泛化能力，论文设计了三个递进式的测试场景：\n\n| 范式 | 描述 | 目的 |\n|------|------|------|\n| **Seen（已见）** | 起始帧与场景来自训练分布，动作也匹配原始分布 | 测试模型在训练域内的基本性能（in-distribution 性能） |\n| **Counterfactual（反事实）** | 场景见过，但输入动作为“镜像翻转”或方向反转（如左转变右转） | 检验模型能否根据新动作合理外推物理结构，是**几何接地的关键挑战** |\n| **Unseen（未见）** | 场景与动作模式均在训练中未出现 | 测试模型对完全新环境的迁移能力（full generalization） |\n\n> 🔍 **反事实构造细节（见 Appendix D.3）**：\n> 对于一个6-DOF动作 $(x, y, z, \\text{roll}, \\text{pitch}, \\text{yaw})$，其镜像反事实动作为：\n> $$\n> (-x, y, z, \\text{roll}, -\\text{pitch}, -\\text{yaw})\n> $$\n> 这模拟了左右对称路径下的导航行为。\n\n---\n\n### 四、综合表现总结（Table 1 关键发现）\n\n从 **Table 1** 可以提炼出以下核心结论：\n\n- **Baseline 模型严重依赖训练动作流形**：在 Seen 上表现尚可，但在 Counterfactual 下性能急剧下降（如 SCAND 平移误差↑70%），表明缺乏真正的几何理解。\n- **T+R 奖励显著改善位姿一致性**：尤其在 Counterfactual 场景下，CityWalk 的平移误差降低 **63%**，证明旋转和平移奖励有效增强了运动逻辑的物理合理性。\n- **DTRI 提升局部几何稳定性**：虽可能轻微牺牲全局轨迹（trade-off），但在 Unseen 场景中带来增益，说明其促进短时一致性。\n- **完整奖励组合（T+R+DTRI+V）最稳健**：兼顾全局对齐、局部光滑与视觉连贯，在所有数据集和场景中取得最优平衡，例如 CODa 在 Unseen 下平移误差↓45%。\n\n```markdown\n📌 示例亮点（CityWalk - Counterfactual）：\n| 方法           | T (m) ↓ | R (rad) ↓ |\n|----------------|---------|-----------|\n| Baseline       | 13.1    | 3.27      |\n| GrndCtrl (Full)| **4.7** | **4.37**  |\n→ 平移误差减少 **64%**\n```\n\n---\n\n### 五、附加可靠性分析（Reliability via Table 2）\n\n除了均值比较，**Table 2** 展示了多次随机 rollout 的误差分布（均值 ± 标准差），揭示了 **GrndCtrl 显著提升了生成稳定性**：\n\n- Baseline 模型具有极高方差（如 T: 73±243 m），表明 rollout 极不稳定。\n- 经过 GRPO 训练后，**均值和标准差同步大幅下降**（200步后 T 均值↓77%，std↓75%），实现可靠且一致的生成。\n\n---\n\n### 总结\n\n| 维度 | 内容 |\n|------|------|\n| **技术价值** | 首次将 RLVR 思想引入视频世界模型，用**可验证的几何奖励**替代人工标注，实现自监督接地 |\n| **创新点** | - 提出 RLWG 框架<br>- 构建 GrndCtrl（基于 GRPO 的多目标对齐）<br>- 设计 pose-cycle, depth reprojection 等物理可验证奖励 |\n| **实际意义** | 使世界模型从“看起来真实”走向“结构上可信”，为长期规划、闭环控制、具身推理提供可靠模拟基础 |\n\n> 💡 **一句话总结**：  \n> **GrndCtrl 通过自监督的物理一致性奖励，在不损害视觉质量的前提下，让世界模型学会“按规矩走路”，而不是“凭感觉瞎走”。**",
      "timestamp": "2026-01-09T10:04:01.555643",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文在哪些数据集上进行了实验？主要的评估指标和性能提升是多少？",
      "answer": "## 论文实验数据集、评估指标与性能提升分析\n\n该论文在三个多样化的真实世界导航数据集上进行了系统性实验，并设计了多维度评估机制，验证了 **GrndCtrl** 在提升世界模型几何一致性与长期稳定性方面的显著优势。\n\n---\n\n### 数据集（Datasets）\n\n论文在以下三个涵盖不同实体形态和场景的数据集上进行训练与评估：\n\n- **CODa**：校园轮式机器人导航数据集，提供伪真值位姿。\n- **SCAND**：社交导航数据集，包含轮式机器人和四足机器人的校园场景。\n- **CityWalk**：第一人称城市步行数据集，由YouTube街景视频重构，模拟拥挤城市环境中的行人导航。\n\n所有数据集均被采样为2000个非重叠的13帧序列用于训练，确保时间多样性。\n\n---\n\n### 评估指标（Metrics）\n\n论文采用四个核心指标进行量化评估（基于200个非重叠测试序列）：\n\n| 指标 | 公式 | 含义 | 越小越好 / 越大越好 |\n|------|------|------|------------------|\n| **T (Translation Error)** | $ T = -r_{\\text{trans}} $ | 平移误差（米），衡量轨迹漂移 | ↓ 越小越好 |\n| **R (Rotation Error)** | $ R = -r_{\\text{rot}} $ | 旋转误差（弧度） | ↓ 越小越好 |\n| **V (Video Quality)** | $ V = r_v = \\alpha s_{\\text{vis}} + \\beta s_{\\text{mot}} $ | 视觉与运动质量得分（来自VideoAlign） | ↑ 越大越好 |\n| **DTRI** | $ \\text{DTRI} = r_{\\text{dtr}} $ | 深度时序重投影内点率（%），衡量局部几何一致性 | ↑ 越大越好 |\n\n---\n\n### 评估场景（Evaluation Regimes）\n\n论文设计了三种递进式评估场景以测试泛化能力：\n\n1. **Seen**：训练分布内场景，测试基础性能。\n2. **Counterfactual**：已见场景但使用反事实动作（如镜像/方向反转），测试对新运动模式的外推能力。\n3. **Unseen**：全新场景与动作，测试完全泛化能力。\n\n---\n\n### 性能提升总结（Key Results from Table 1 & 5.1）\n\n#### 主要发现：\n\n- **Baseline模型在反事实场景下严重退化**：\n  - 在SCAND上平移误差增加70%，表明其无法处理方向反转等合理但未见过的动作。\n  - 显示当前视频世界模型“重外观轻结构”，缺乏物理一致性。\n\n- **GrndCtrl显著改善空间一致性，尤其在反事实场景**：\n  - 使用完整奖励集（+T+R+DTRI+V）后，在**Counterfactual**场景下取得最大提升。\n\n#### 典型性能增益（相对Baseline）：\n\n| 数据集 | 场景 | 平移误差降低 | 旋转误差降低 | 备注 |\n|--------|------|--------------|--------------|------|\n| **CODa** | Counterfactual | **43%** | 8% | 显著缓解轨迹漂移 |\n| **SCAND** | Counterfactual | **30%** | — | 基线误差极高，改进明显 |\n| **CityWalk** | Counterfactual | **64%** | — | 最大提升，说明对复杂动态有效 |\n\n> ✅ **最高达64%的平移误差下降**，证明GrndCtrl能有效纠正因动作反转导致的场景漂移问题（见图3、附录图4-5）。\n\n#### 可靠性提升（Table 2）：\n\n- 经过200步GRPO训练后：\n  - 平移误差**均值降低77%**，标准差降低75%\n  - 旋转误差均值降低39%，标准差降低32%\n- 表明模型输出更加**稳定可重复**，减少对扩散噪声的敏感性。\n\n---\n\n### 技术创新与实际价值\n\n```markdown\n- **无需标注或仿真器**：通过冻结的现成3D/视频评估器（MapAnything, VideoAlign）提供自监督信号，实现低成本部署。\n- **多目标奖励协同优化**：\n  - `T+R` 改善全局轨迹对齐\n  - `DTRI` 增强局部深度一致性\n  - `V` 防止视觉质量退化，起长程稳定作用\n- **适用于任意预训练模型**：RLWG是通用后训练框架，不限定具体架构。\n```\n\n---\n\n### 结论\n\n论文通过在 **CODa、SCAND、CityWalk** 三大真实导航数据集上的实验证明：\n\n> **GrndCtrl** 利用自监督的几何与感知奖励，成功将视觉逼真的世界模型转化为**物理一致、空间连贯、长期稳定**的仿真引擎，尤其在反事实推理任务中实现高达 **64% 的平移误差下降**，为自动驾驶、具身智能等需要可靠预测的应用开辟了新路径。",
      "timestamp": "2026-01-09T10:04:30.380788",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文的主要局限性有哪些？未来可能的改进方向是什么？",
      "answer": "## 论文的主要局限性与未来改进方向\n\n根据论文第6节“Limitations”及附录中的分析，**GrndCtrl** 方法虽然在世界模型的几何接地（grounding）方面取得了显著进展，但仍存在若干关键局限性。以下是系统性的总结与未来可能的改进方向。\n\n---\n\n### 主要局限性\n\n- **对 rollout 方差的依赖性强**  \n  GrndCtrl 的训练稳定性高度依赖于生成的多个 rollout 之间存在足够的奖励差异（reward variance）。当所有 rollout 都表现极好或极差时，归一化后的优势计算会放大微小差异，导致模型学习到无意义的噪声模式，甚至引发训练崩溃（collapse to noise）。\n\n- **缺乏多目标奖励的自适应加权机制**  \n  当前方法采用固定的多奖励组合（如 T+R+DTRI+V），但未探索不同任务或场景下的**动态权重调整策略**。例如，在长距离导航中应更重视全局轨迹对齐（translation/rotation），而在局部避障中则需强调深度一致性（DTRI）。\n\n- **预训练偏差影响迁移能力**  \n  基础模型（如 Cosmos-Predict2）在短片段、前向运动视频上预训练，导致其固有偏好“场景稳定性”而非“动态变化”。这使得低参数量微调方法（如 LoRA）难以有效调整运动行为，必须进行全量微调（full SFT），增加了计算成本。\n\n- **视觉质量随训练退化**  \n  后训练过程中，由于缺乏像素级监督，仅通过几何奖励优化可能导致生成图像逐渐出现**视觉噪声累积**。尽管使用 KL 正则化缓解，但在长时间训练后仍可能出现生成质量下降的问题。\n\n- **潜在的奖励欺骗行为（Reward Hacking）**  \n  模型可能学会生成 evaluator 误判为高分但实际上物理不一致的内容（如结构混乱但 depth reprojection 分数高的假象），反映出当前冻结 evaluator 的黑箱特性带来的风险。\n\n---\n\n### 未来可能的改进方向\n\n```markdown\n1. **引入自适应多奖励加权机制**\n   - 设计基于不确定性或任务需求的动态奖励融合策略。\n   - 例如：使用强化学习控制器自动调节各 reward 权重，平衡全局轨迹与局部几何一致性。\n\n2. **增强 rollout 多样性以提升训练稳定性**\n   - 在扩散采样中引入可控噪声调度（controlled stochasticity），确保每个 group 内部有足够的高质量与低质量 rollout 对比。\n   - 探索 rollout variance 的理论建模，指导最优采样策略设计。\n\n3. **结合显式物理约束进行联合优化**\n   - 将刚体运动先验、重力约束等物理规律编码为可微模块，嵌入训练流程，减少对 evaluator 黑箱判断的依赖。\n\n4. **迭代式 evaluator 更新机制**\n   - 当前 evaluator 完全冻结；未来可考虑轻量级在线更新 evaluator，形成“模型 ↔ evaluator”协同进化闭环，避免静态 evaluator 被欺骗。\n\n5. **扩展至更大规模数据与复杂场景**\n   - 当前实验基于有限数据集和较短序列（13帧）。未来可在大规模城市驾驶、室内导航等真实复杂环境中验证泛化能力。\n\n6. **探索更高效的训练架构**\n   - 开发内存优化方案（如梯度检查点、混合精度反向传播），降低 GRPO 对 GPU 显存的需求，支持更长 rollouts 和更大 batch size。\n```\n\n---\n\n### 总结\n\n| 维度 | 局限性 | 改进方向 |\n|------|--------|----------|\n| **训练稳定性** | 依赖 rollout 差异，易崩溃 | 控制采样方差，建模 variance 动力学 |\n| **奖励设计** | 固定权重，无自适应性 | 引入动态/学习式加权机制 |\n| **视觉保真度** | 噪声累积，质量退化 | 加强 KL 正则，引入感知损失 |\n| **物理一致性** | 存在 reward hacking | 融合显式物理模型，构建可解释 evaluator |\n\n> **核心洞见**：GrndCtrl 成功将 LLM 中的 RLVR 思想迁移到视觉世界模型，实现了“从生成到仿真”的跃迁。未来的关键在于如何让这种 self-supervised grounding 更鲁棒、可扩展，并真正支撑起长期自主智能体的决策与控制。",
      "timestamp": "2026-01-09T10:04:57.106519",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    }
  ],
  "is_hidden": false,
  "is_starred": false,
  "published_date": "2025-12-01T18:03:29Z",
  "created_at": "2026-01-09T09:59:24.747697",
  "updated_at": "2026-01-09T09:59:24.747706"
}