{
    "id": "2512.01218v1",
    "title": "How do trout regulate patterns of muscle contraction to optimize propulsive efficiency during steady swimming",
    "authors": [
        "Tao Li",
        "Chunze Zhang",
        "Weiwei Yao",
        "Junzhao He",
        "Ji Hou",
        "Qin Zhou",
        "Lu Zhang"
    ],
    "abstract": "理解高效的鱼类运动机制可为生物力学、流体力学和工程学提供重要启示。传统研究常常忽略了神经肌肉控制与全身运动之间的关联。为了探究鲹科鱼类（carangiform）游动中的能量传递机制，我们构建了一条受生物启发的数字鳟鱼模型。该模型结合了多体动力学、Hill型肌肉建模以及高保真流固耦合算法，精确复现了真实鳟鱼的形态与物理特性。通过深度强化学习， Trout的神经系统实现了对肌肉激活的时空分层控制。我们系统地分析了不同激活策略对游动速度和能耗的影响。结果表明，轴向肌节间的耦合（激活范围超过0.5倍体长）对于稳定的身体波传播至关重要。适度的肌肉收缩持续时间（尾鳍摆动周期的[0.1, 0.3]区间）可使身体与周围流体共同充当被动阻尼系统，从而降低能量消耗。此外，肌节激活的相位滞后显著影响身体波形；若相位滞后过大，则会导致拮抗性收缩，阻碍推进力产生。这些发现深化了对生物启发式运动机制的理解，并为设计节能型水下系统提供了指导。",
    "url": "https://arxiv.org/abs/2512.01218v1",
    "html_url": "https://arxiv.org/html/2512.01218v1",
    "html_content": "",
    "preview_text": "Understanding efficient fish locomotion offers insights for biomechanics, fluid dynamics, and engineering. Traditional studies often miss the link between neuromuscular control and whole-body movement. To explore energy transfer in carangiform swimming, we created a bio-inspired digital trout. This model combined multibody dynamics, Hill-type muscle modeling, and a high-fidelity fluid-structure interaction algorithm, accurately replicating a real trout's form and properties. Using deep reinforcement learning, the trout's neural system achieved hierarchical spatiotemporal control of muscle activation. We systematically examined how activation strategies affect speed and energy use. Results show that axial myomere coupling-with activation spanning over 0.5 body lengths-is crucial for stable body wave propagation. Moderate muscle contraction duration ([0.1,0.3] of a tail-beat cycle) lets the body and fluid act as a passive damping system, cutting energy use. Additionally, the activation phase lag of myomeres shapes the body wave; if too large, it causes antagonistic contractions that hinder thrust. These findings advance bio-inspired locomotion understanding and aid energy-efficient underwater system design.",
    "is_relevant": null,
    "relevance_score": 0.0,
    "extracted_keywords": [],
    "one_line_summary": "",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "published_date": "2025-12-01T02:57:02Z",
    "created_at": "2026-01-05T20:53:28.744003",
    "updated_at": "2026-01-05T20:53:28.744036",
    "flag": true
}