{
  "id": "2512.02270v1",
  "title": "Property-Guided Cyber-Physical Reduction and Surrogation for Safety Analysis in Robotic Vehicles",
  "authors": [
    "Nazmus Shakib Sayom",
    "Luis Garcia"
  ],
  "abstract": "We propose a methodology for falsifying safety properties in robotic vehicle systems through property-guided reduction and surrogate execution. By isolating only the control logic and physical dynamics relevant to a given specification, we construct lightweight surrogate models that preserve property-relevant behaviors while eliminating unrelated system complexity. This enables scalable falsification via trace analysis and temporal logic oracles.\n  We demonstrate the approach on a drone control system containing a known safety flaw. The surrogate replicates failure conditions at a fraction of the simulation cost, and a property-guided fuzzer efficiently discovers semantic violations. Our results suggest that controller reduction, when coupled with logic-aware test generation, provides a practical and scalable path toward semantic verification of cyber-physical systems.",
  "url": "https://arxiv.org/abs/2512.02270v1",
  "html_url": "https://arxiv.org/html/2512.02270v1",
  "html_content": "1\n1\ninstitutetext:\nUniversity of Utah, Salt Lake City, UT, USA\n1\n1\nemail:\n{sayom.shakib,la.garcia}@utah.edu\nProperty-Guided Cyber-Physical Reduction and Surrogation for Safety Analysis in Robotic Vehicles\nNazmus Shakib Sayom\nLuis A. Garcia\nAbstract\nWe propose a methodology for falsifying safety properties in robotic vehicle systems through property-guided reduction and surrogate execution. By isolating only the control logic and physical dynamics relevant to a given specification, we construct lightweight surrogate models that preserve property-relevant behaviors while eliminating unrelated system complexity. This enables scalable falsification via trace analysis and temporal logic oracles.\nWe demonstrate the approach on a drone control system containing a known safety flaw. The surrogate replicates failure conditions at a fraction of the simulation cost, and a property-guided fuzzer efficiently discovers semantic violations. Our results suggest that controller reduction, when coupled with logic-aware test generation, provides a practical and scalable path toward semantic verification of cyber-physical systems.\n1\nIntroduction\nModern robotic vehicle systems face an inherent verification challenge: they combine discrete control logic with continuous physical dynamics\n[\nFrazzoli2000\n]\n, forming hybrid systems that demand domain-specific formal methods and analysis techniques to manage their complexity\n[\nSeshia2017\n]\n. Traditional verification approaches either rely on exhaustive simulations, which quickly become infeasible as system complexity increases due to the state explosion problem and the computational cost of high-fidelity modeling\n[\nDerler2012\n,\nCorso2022\n]\n, or on static code analysis techniques that struggle to capture the nuanced interactions between cyber and physical components\n[\nzaddach2014avatar\n,\npgfuzz\n]\n. This fundamental challenge has led to a verification gap for safety-critical autonomous systems like drones, where subtle interactions between control decisions and physical dynamics can lead to hazardous conditions that evade detection during development.\nThe problem is compounded by how current verification methodologies treat cyber-physical systems as monolithic entities, despite their inherently modular structure. While these approaches often construct targeted mission-level scenarios to validate safety properties, they do so without exploiting the modular decomposition of the software to isolate analysis to only those components relevant to the property under verification. This leads to verification procedures that analyze components unrelated to the safety property under analysis, introducing unnecessary computational overhead. Furthermore, while recent advances like PGFUZZ\n[\npgfuzz\n]\nand ROCAS\n[\nrocas\n]\nhave made progress in detection of misconfigurations and parameter-related vulnerabilities, they are not designed to uncover deeper semantic flaws in the control logic — the kinds of issues that can cause catastrophic failures in safety-critical applications.\nRecent efforts have enriched the verification landscape with techniques that address specific vulnerabilities in robotic systems. For example, policy and control-guided fuzzing frameworks such as PGFUZZ\n[\npgfuzz\n]\nand RVFUZZER\n[\nrvfuzzer\n]\ngenerate inputs that stress control parameters or trigger policy violations, revealing misconfigurations and input validation flaws. CPFuzz\n[\nShang2020CPFuzzCF\n]\nintegrates signal temporal logic robustness into a coverage-guided framework, uncovering violations of formal specifications in small embedded control programs.Complementary approaches like DiscoFuzzer\n[\nRivera2020DiscoFuzzer\n]\ndetect behavioral anomalies through output discontinuity analysis, and RoboFuzz\n[\nKim2022RoboFuzz\n]\nleverages domain-specific oracles to flag semantic violations within simulation-based testbeds. Post hoc analysis techniques such as ROCAS\n[\nrocas\n]\nbring novel capabilities in root cause localization by co-mutating both cyber parameters and environmental conditions to identify accident-triggering factors. Collectively, these approaches have significantly improved the ability to detect misconfigurations, parameter errors, and certain forms of semantic inconsistency.\nHowever, what remains largely unaddressed is the challenge of identifying\ndeep semantic flaws\nin control logic that only surface under narrowly scoped, property-specific conditions. Existing techniques typically operate over the entire system—either through repeated full-execution simulations or by broad-brush fuzzing of high-level policies—without leveraging the internal structure of the system to localize analysis. As a result, verification remains both computationally intensive and semantically diffuse, especially when high-fidelity physical models are involved. Moreover, many current methods are tightly coupled to specific software frameworks such as ROS\n[\nrosorg\n]\nor Apollo\n[\napolloauto_apollo\n]\n, limiting their ability to generalize across diverse cyber-physical architectures or to reason about system semantics independent of middleware implementation. Crucially, there exists no principled framework for formally reducing a cyber-physical system to the\nminimal executable slice\nnecessary to analyze a given safety or correctness property. This lack of structural and property-specific reduction limits our ability to reason efficiently about the interactions between control decisions and physical dynamics—precisely where critical bugs often reside.\nTo address these challenges, we introduce a verification methodology that reduces both the cyber and physical dimensions of a robotic vehicle system with respect to a given safety property. On the cyber side, we isolate the subset of control logic components that are semantically relevant to the property under analysis. These components are then composed into a property-specific surrogate system that maintains the input-output and control-flow behaviors necessary to evaluate the property, while abstracting away unrelated logic. On the physical side, we replace the full-order plant model with a reduced-order approximation that captures only the dynamics pertinent to the verification task. This reduction is designed to preserve the control responses and physical interactions relevant to the safety property, ensuring that all behaviors necessary for detecting potential violations are reta‘ined. The resulting surrogate system enables targeted analysis over a minimal but semantically complete slice of the original system, improving efficiency and precision in detecting property violations.\nContributions.\nIn this work, we present a property-guided verification methodology that reduces both the cyber and physical dimensions of robotic systems with respect to specific safety properties. Our primary contributions are as follows:\n•\nA formalism for property-guided cyber-space reduction\n, which identifies and isolates only those control logic components that are causally relevant to a given safety property through structural and dataflow analysis.\n•\nA host-agnostic surrogate construction framework\nthat enables dynamic analysis of the isolated control logic outside its original software and hardware environment, while preserving semantic equivalence with respect to the property under test.\n•\nA property-scoped physical reduction technique\nthat replaces full-system simulation with reduced-order models capturing only those physical dynamics that interact meaningfully with the relevant control logic.\n•\nA co-reduction workflow\nthat integrates cyber and physical reductions to enable efficient, property-targeted fuzzing, significantly reducing the analysis scope while retaining coverage of behaviors critical to property violations.\nWe demonstrate the effectiveness of our methodology through a robotic vehicle case study, illustrating how the proposed reductions facilitate targeted verification of safety properties through fuzzing the surrogate system achieved by reduction.\n2\nBackground\n2.1\nCyber-Physical Systems and Verification Challenges\nCyber-physical systems (CPS) integrate computational processes with physical dynamics, creating hybrid systems where discrete control logic governs continuous physical behaviors\n[\nFrazzoli2000\n,\nSeshia2017\n]\n. In robotic vehicles, this manifests as control software making discrete decisions based on sensor inputs that directly affect continuous physical dynamics like motion, energy consumption, and environmental interaction. The verification of such systems presents unique challenges due to the complex interplay between cyber and physical components, where subtle bugs in control logic can lead to safety violations that only emerge under specific physical conditions\n[\nDerler2012\n]\n.\nTraditional verification approaches for CPS face a fundamental scalability challenge. Exhaustive simulation-based verification becomes computationally intractable as system complexity grows, due to both the state explosion problem and the computational cost of high-fidelity physical modeling\n[\nCorso2022\n]\n. Static analysis techniques, while computationally efficient, struggle to capture the nuanced interactions between discrete control decisions and continuous physical dynamics that characterize CPS behavior\n[\nzaddach2014avatar\n]\n.\n2.2\nModularity and System Structure\nDespite being deployed as monolithic systems, modern robotic platforms like PX4\n[\npx4\n]\nand ArduPilot\n[\nardupilot\n]\nare built from modular components that interact through well-defined interfaces. These systems typically comprise distinct modules for navigation, safety monitoring, estimation, and control, each responsible for specific aspects of system behavior\n[\nwang2022autocps\n]\n. Similarly, the physical behavior of robotic systems emerges from multiple interacting subsystems—propulsion, energy management, kinematics—each governed by distinct physical principles.\nThis inherent modularity presents an opportunity for targeted verification. Many safety properties depend on only a subset of the available system components. For example, a property concerning emergency parachute deployment may depend primarily on altitude estimation, battery monitoring, and emergency control logic, while being largely independent of lateral navigation or obstacle avoidance subsystems. Current verification approaches, however, treat CPS as atomic units, analyzing all components regardless of their relevance to the property under verification.\n2.3\nProperty-Guided Analysis\nThe concept of property-guided analysis has emerged as a promising approach to address the scalability challenges in CPS verification. Rather than analyzing the entire system uniformly, property-guided techniques focus computational resources on those aspects of the system that are most relevant to the property being verified. This approach has been successfully applied in software verification through techniques like program slicing\n[\nweiser1984program\n]\n, which extracts minimal program fragments that preserve specific behavioral properties.\nIn the context of CPS, property-guided analysis must account for both cyber and physical dimensions. The challenge lies in identifying which control logic components and which aspects of the physical dynamics are necessary to preserve the semantics of a given safety property. This requires formal techniques for reasoning about component dependencies and interaction patterns within hybrid cyber-physical systems.\n2.4\nReduced-Order Modeling in Engineering\nReduced-order modeling (ROM) provides a principled approach to simplifying complex dynamical systems while preserving their essential characteristics. These techniques, widely used in computational mechanics and control theory, project high-dimensional system behavior onto lower-dimensional spaces that capture the system’s dominant modes\n[\nbenner2015survey\n]\n. Methods such as proper orthogonal decomposition, balanced truncation, and static condensation enable efficient simulation of complex physical systems without sacrificing accuracy for the quantities of interest.\nIn verification contexts, reduced-order models offer a pathway to address the computational bottleneck of high-fidelity physical simulation. By focusing on only those physical dynamics that interact meaningfully with the property under analysis, ROM techniques can significantly reduce simulation time while preserving the fidelity necessary to detect property violations.\n2.5\nSimulation-Based Verification\nSimulation remains a cornerstone of CPS verification, particularly for systems where mathematical modeling or formal verification is intractable\n[\nlee2017introduction\n]\n. Software-in-the-loop (SITL) simulation environments execute unmodified control software while providing simulated sensor inputs and interpreting actuator commands, enabling system-level testing without physical hardware\n[\nderler2013cyber\n]\n. This approach is fundamental to the development and verification of robotic platforms.\nHowever, high-fidelity SITL simulations are computationally expensive. Each simulation trial requires full initialization of the software stack and detailed modeling of the physical environment and vehicle dynamics. Property verification through simulation often requires exploring large parameter spaces or validating stochastic scenarios, necessitating thousands of simulation runs. This computational burden becomes a significant bottleneck when attempting to systematically explore edge cases or validate safety properties across diverse operational conditions.\n3\nMethodology\nOur approach enables efficient analysis of robotic systems by reducing their cyber-physical execution to only the control logic and physical behaviors relevant to a given safety or correctness property. To illustrate the methodology, we use a representative drone scenario—modeled as a hybrid dynamical system—that captures a bug pattern inspired by a real firmware flaw discovered by PGFuzz\n[\npgfuzz\n]\n.\nFigure 1\n:\nOverview of our cyber-physical reduction methodology for safety analysis of robotic vehicles. The approach combines control logic reduction with physical model reduction through static condensation to create an efficient, property-specific surrogate system.\n3.1\nCyber-Physical Reduction and Structured Surrogation\nWe develop a structured methodology for reducing cyber-physical systems by isolating the minimal set of components necessary for analyzing a given safety or correctness property. Our approach combines two complementary formalisms: static condensation for efficient reduction of physical component models and hybrid dynamical systems for principled pruning of control modes and transitions while preserving property-relevant behaviors.\n3.1.1\nStatic Condensation for Physical Model Reduction\nOur physical model reduction is grounded in the SCRBE framework of Kapteyn et al.\n[\nkapteyn2021scrbe\n]\n, which extends static condensation to modular systems with coupled physical processes. This approach enables us to create compact physical surrogate models that preserve the input-output relationships essential for property analysis.\nLet the physical system be governed by a parametric variational problem:\na\n​\n(\nu\n,\nv\n;\nμ\n)\n=\nf\n​\n(\nv\n;\nμ\n)\n,\n∀\nv\n∈\nX\n​\n(\nμ\n)\n,\na(u,v;\\mu)=f(v;\\mu),\\quad\\forall v\\in X(\\mu),\n(1)\nwhere\nu\n​\n(\nμ\n)\nu(\\mu)\ndenotes the state of the full physical system, and\nμ\n\\mu\nis a high-dimensional parameter vector spanning environmental and configuration uncertainties. After discretization, we obtain:\nK\n​\n(\nμ\n)\n​\nU\n​\n(\nμ\n)\n=\nF\n​\n(\nμ\n)\n,\nK(\\mu)U(\\mu)=F(\\mu),\n(2)\nwith\nK\n​\n(\nμ\n)\n∈\nℝ\nN\n×\nN\nK(\\mu)\\in\\mathbb{R}^{N\\times N}\nand\nU\n​\n(\nμ\n)\n∈\nℝ\nN\nU(\\mu)\\in\\mathbb{R}^{N}\n.\nTo restrict physical analysis to a subsystem\nπ\n⊆\n𝒮\n\\pi\\subseteq\\mathcal{S}\n—e.g., those physical components interacting with a safety-critical control path—we partition\nU\n=\n[\nU\np\n,\nU\ni\n]\nT\nU=[U_{p},U_{i}]^{T}\ninto interface and internal variables and apply static condensation:\nU\ni\n=\nK\ni\n,\ni\n−\n1\n​\n(\nF\ni\n−\nK\ni\n,\np\n​\nU\np\n)\n,\nU_{i}=K_{i,i}^{-1}\\left(F_{i}-K_{i,p}U_{p}\\right),\n(3)\nyielding a reduced physical system over the interface variables:\nK\n~\n​\n(\nμ\n)\n​\nU\np\n=\nF\n~\n​\n(\nμ\n)\n,\n\\tilde{K}(\\mu)U_{p}=\\tilde{F}(\\mu),\n(4)\nwhere\nK\n~\n=\nK\np\n,\np\n−\nK\np\n,\ni\n​\nK\ni\n,\ni\n−\n1\n​\nK\ni\n,\np\n,\nF\n~\n=\nF\np\n−\nK\np\n,\ni\n​\nK\ni\n,\ni\n−\n1\n​\nF\ni\n.\n\\tilde{K}=K_{p,p}-K_{p,i}K_{i,i}^{-1}K_{i,p},\\quad\\tilde{F}=F_{p}-K_{p,i}K_{i,i}^{-1}F_{i}.\n(5)\nThis approach allows us to create a physically reduced model that focuses computational resources on the physical aspects relevant to our property of interest.\n3.1.2\nHybrid Dynamical Systems for Control Logic Reduction\nThe computational (cyber) aspects of our system are modeled using hybrid dynamical systems (HDS), providing a formal framework for identifying which control modes and transitions must be preserved in our reduced model. Following Branicky’s formalism\n[\nBranicky2005\n]\n, we represent the full cyber-physical system as a tuple:\nH\n=\n(\nQ\n,\nΣ\n,\nA\n,\nG\n)\nH=(Q,\\Sigma,A,G)\nwhere:\n•\nQ\nQ\nis a finite set of discrete states or modes, each corresponding to a distinct control logic configuration\n•\nΣ\n=\n{\nΣ\nq\n}\nq\n∈\nQ\n\\Sigma=\\{\\Sigma_{q}\\}_{q\\in Q}\nis a collection of continuous dynamics, where each\nΣ\nq\n\\Sigma_{q}\nis governed by\nx\n˙\n=\nf\nq\n​\n(\nx\n,\nμ\n)\n\\dot{x}=f_{q}(x,\\mu)\non state space\nX\nq\n⊂\nℝ\nn\nX_{q}\\subset\\mathbb{R}^{n}\n, with\nμ\n∈\nΘ\n\\mu\\in\\Theta\nrepresenting system parameters\n•\nA\n=\n{\nA\nq\n}\nq\n∈\nQ\nA=\\{A_{q}\\}_{q\\in Q}\nare the autonomous jump sets, where\nA\nq\n⊂\nX\nq\nA_{q}\\subset X_{q}\ndefines conditions triggering transitions from mode\nq\nq\n•\nG\n=\n{\nG\nq\n}\nq\n∈\nQ\nG=\\{G_{q}\\}_{q\\in Q}\nare the transition maps, where\nG\nq\n:\nA\nq\n→\nS\nG_{q}:A_{q}\\to S\ndetermines the target state after transitions (\nS\n=\n∪\nq\n∈\nQ\nX\nq\n×\n{\nq\n}\nS=\\cup_{q\\in Q}X_{q}\\times\\{q\\}\nbeing the hybrid state space)\nThis HDS formulation makes explicit the interrelationships between control modes and physical dynamics, enabling us to reason about which elements of the control logic are necessary to preserve the behaviors relevant to our analysis.\n3.1.3\nIntegrated Cyber-Physical Reduction\nFor a given property\nφ\n\\varphi\n, our methodology creates a property-specific reduced system through a two-phase process:\nFirst, we apply the HDS formalism to identify the minimal control structure necessary for analyzing\nφ\n\\varphi\n. This yields a reduced hybrid system\nH\nφ\n=\n(\nQ\nφ\n,\nΣ\nφ\n,\nA\nφ\n,\nG\nφ\n)\nH_{\\varphi}=(Q_{\\varphi},\\Sigma_{\\varphi},A_{\\varphi},G_{\\varphi})\nconstructed by:\n1.\nIdentifying the subset of control modes\nQ\nφ\n⊆\nQ\nQ_{\\varphi}\\subseteq Q\nthat are causally relevant to\nφ\n\\varphi\n2.\nPreserving only those transitions in\nA\nφ\nA_{\\varphi}\nand\nG\nφ\nG_{\\varphi}\nthat can occur along execution paths relevant to\nφ\n\\varphi\n3.\nRetaining the minimal control logic necessary for property evaluation\nSecond, for each mode\nq\n∈\nQ\nφ\nq\\in Q_{\\varphi}\n, we apply SCRBE to reduce the physical model associated with that mode, creating efficient surrogate representations of the continuous dynamics\nf\nq\n​\n(\nx\n,\nμ\n)\nf_{q}(x,\\mu)\n.\nThe integration of these two reduction approaches yields a comprehensive cyber-physical reduced model that maintains:\n∀\nμ\n∈\nΘ\nφ\n,\nTr\nφ\n​\n(\nH\nφ\n,\nμ\n)\n≅\nTr\nφ\n​\n(\nH\n,\nμ\n)\n\\forall\\mu\\in\\Theta_{\\varphi},\\quad\\text{Tr}_{\\varphi}(H_{\\varphi},\\mu)\\cong\\text{Tr}_{\\varphi}(H,\\mu)\nwhere\nTr\nφ\n\\text{Tr}_{\\varphi}\nextracts the execution trace elements relevant to property\nφ\n\\varphi\n, and\n≅\n\\cong\ndenotes behavioral equivalence with respect to those elements.\nFor practical analysis, we implement\nH\nφ\nH_{\\varphi}\nas a concrete surrogate system\nM\nφ\nM_{\\varphi}\nthat provides an efficient, executable representation while preserving semantic equivalence with respect to the property:\n∀\nμ\n∈\nΘ\nφ\n,\nTr\nφ\n​\n(\nM\nφ\n,\nμ\n)\n≅\nTr\nφ\n​\n(\nH\n,\nμ\n)\n\\forall\\mu\\in\\Theta_{\\varphi},\\quad\\text{Tr}_{\\varphi}(M_{\\varphi},\\mu)\\cong\\text{Tr}_{\\varphi}(H,\\mu)\nScope of equivalence.\nIn this paper,\nTr\nφ\n\\text{Tr}_{\\varphi}\ndenotes the projection to the signals referenced by\nφ\n\\varphi\n(e.g., battery, altitude, deployment). We interpret\n≅\n\\cong\nas agreement in the truth valuation of\nφ\n\\varphi\nover the projected trace. We validate this\nproperty-scoped\nequivalence empirically by checking that the surrogate and the full system yield the same satisfaction or, violation outcome for the same configurations.\nThis reduction framework naturally distinguishes between two complementary forms of simplification:\ncyber reduction\n, which isolates the minimal subset of control modes and transitions necessary for evaluating property\nφ\n\\varphi\n; and\nphysical reduction\n, which applies SCRBE to create efficient surrogate models of the physical dynamics in each retained mode.\nThe former corresponds to a structural restriction of the control logic and firmware execution pipeline, while the latter yields computationally efficient physical models and a reduced parameter space for analysis.\nTogether, these reductions enable targeted reasoning about subsystem behavior while preserving fidelity with respect to the full system along the slice relevant to\nφ\n\\varphi\n.\nExample: Fault-Aware Reduction of a Parachute Deployment Pipeline.\nWe consider a drone system exhibiting a safety-critical bug in its emergency parachute deployment logic. When the battery falls below a configured threshold, the emergency controller is expected to deploy the parachute unconditionally. However, due to an implementation flaw, deployment is prevented if the drone is outside a safe altitude range—specifically, if it is below a minimum safe altitude or above a maximum safe altitude—an inappropriate constraint under critical battery conditions.\nWe model this system using a hybrid dynamical system\nH\n=\n(\nQ\n,\nΣ\n,\nA\n,\nG\n)\nH=(Q,\\Sigma,A,G)\n, where:\n•\nThe mode set\nQ\nQ\nconsists of operational states such as\nIDLE\n,\nTAKE_OFF\n,\nGOTO\n,\nLAND\n, and\nPARACHUTE\n, each corresponding to a distinct phase of the drone’s mission.\n•\nThe collection\nΣ\n=\n{\nΣ\nq\n}\nq\n∈\nQ\n\\Sigma=\\{\\Sigma_{q}\\}_{q\\in Q}\ndefines the continuous-time dynamics within each mode. These dynamics govern the evolution of physical state variables such as position, velocity, and battery level.\n•\nThe guard sets\nA\n=\n{\nA\nq\n}\nq\n∈\nQ\nA=\\{A_{q}\\}_{q\\in Q}\ndefine the conditions under which transitions occur between modes, based on state-dependent thresholds such as altitude, position, or remaining energy.\n•\nThe transition maps\nG\n=\n{\nG\nq\n}\nq\n∈\nQ\nG=\\{G_{q}\\}_{q\\in Q}\ndetermine the post-transition hybrid state, including updates to the active mode and any necessary resets or reinitializations of the continuous state. For example, transitioning to\nPARACHUTE\nmode may reinitialize the system’s velocity state to reflect a controlled descent profile.\nThe full hybrid system encodes not only normal mission behavior but also soft-landing maneuvers, emergency overrides, PID-stabilized position tracking, and mode-specific force modulation. It contains significant behavioral diversity beyond the logic necessary to evaluate the property\nφ\n\\varphi\n, making full-scale falsification or symbolic analysis computationally expensive.\nWe define the safety property:\nφ\n=\nG\n​\n(\nbattery_low\n∧\nairborne\n→\nF\n[\n0\n,\nΔ\n]\n​\ndeployed\n)\n\\varphi=G(\\texttt{battery\\_low}\\wedge\\texttt{airborne}\\rightarrow F_{[0,\\Delta]}\\texttt{deployed})\nTo analyze this property efficiently, we construct a reduced hybrid system\nH\nφ\n=\n(\nQ\nφ\n,\nΣ\nφ\n,\nA\nφ\n,\nG\nφ\n)\nH_{\\varphi}=(Q_{\\varphi},\\Sigma_{\\varphi},A_{\\varphi},G_{\\varphi})\nthat preserves all behavior relevant to\nφ\n\\varphi\n. This reduction includes:\n•\nA restricted mode set\nQ\nφ\n=\n{\nGOTO\n,\nPARACHUTE\n}\nQ_{\\varphi}=\\{\\texttt{GOTO},\\texttt{PARACHUTE}\\}\n, excluding modes not involved in the fault scenario.\n•\nA state projection\nx\nφ\n=\n(\nbattery\n,\naltitude\n)\nx_{\\varphi}=(\\texttt{battery},\\texttt{altitude})\n, eliminating dimensions unrelated to the triggering and outcome of the bug.\n•\nA reduced guard set\nA\nφ\n⊆\nA\nA_{\\varphi}\\subseteq A\n, retaining only the transition predicate responsible for triggering parachute deployment under low battery.\n•\nA corresponding transition map\nG\nφ\n⊆\nG\nG_{\\varphi}\\subseteq G\nthat encodes the system’s behavior after deployment, including any reinitialization or dynamics required for continued simulation in\nPARACHUTE\nmode.\nThis reduction enables efficient detection of the guard logic flaw without executing unrelated control paths. Furthermore, we apply physical model reduction via SCRBE to retain only the simplified descent dynamics necessary for analyzing the timing and validity of deployment behavior.\nThe surrogate system\nM\nφ\nM_{\\varphi}\nthus supports efficient falsification of\nφ\n\\varphi\n, preserving trace-level equivalence with the original system over the property-relevant slice:\n∀\nμ\n∈\nΘ\nφ\n,\nTr\nφ\n​\n(\nM\nφ\n,\nμ\n)\n≅\nTr\nφ\n​\n(\nH\n,\nμ\n)\n\\forall\\mu\\in\\Theta_{\\varphi},\\quad\\text{Tr}_{\\varphi}(M_{\\varphi},\\mu)\\cong\\text{Tr}_{\\varphi}(H,\\mu)\n3.2\nProperty-Guided Falsification over the Reduced System\nOnce the reduced surrogate system\nM\nφ\nM_{\\varphi}\nhas been constructed, the next step is to explore its behavior under varied configurations and runtime conditions to identify inputs that violate the safety property\nφ\n\\varphi\n. To this end, we employ a structured falsification process that systematically searches over the reduced parameter space\nΘ\nφ\n\\Theta_{\\varphi}\nfor configurations that falsify the specification.\nWe define the falsification objective as discovering a configuration\nμ\n∈\nΘ\nφ\n\\mu\\in\\Theta_{\\varphi}\nsuch that the resulting system trace fails to satisfy the property:\nTr\nφ\n​\n(\nM\nφ\n,\nμ\n)\n⊧̸\nφ\n\\text{Tr}_{\\varphi}(M_{\\varphi},\\mu)\\not\\models\\varphi\nwhere\nTr\nφ\n\\text{Tr}_{\\varphi}\ndenotes the trace projected to the state and control signals relevant to\nφ\n\\varphi\n.\nEach configuration\nμ\n\\mu\ncomprises both physical state variables (e.g., initial altitude, battery level) and control parameters (e.g., deployment thresholds). Rather than relying on unconstrained sampling, the search process applies domain-aware generation and mutation strategies that preserve structural constraints—such as the ordering between minimum and maximum altitude—and prioritize exploration near semantically significant regions.\nEvaluation of each candidate proceeds in three stages:\n1.\nExecute the reduced system\nM\nφ\n​\n(\nμ\n)\nM_{\\varphi}(\\mu)\nto produce a time-indexed execution trace.\n2.\nAnalyze the trace using a logical oracle corresponding to the safety property\nφ\n\\varphi\n.\n3.\nIf the property is violated, log the trace and configuration; otherwise, continue exploration.\nTo reduce redundancy, the falsification loop retains only non-equivalent counterexamples and discards duplicate violations. The final result is a curated collection of minimal failing inputs along with their associated traces, enabling post-hoc analysis of failure regions within\nΘ\nφ\n\\Theta_{\\varphi}\n.\n3.2.1\nTemporal Logic Oracle\nEach trace is evaluated against the specification by a temporal logic oracle that maps input configurations to a Boolean verdict:\n𝒪\nφ\n​\n(\nμ\n)\n=\n{\nSatisfied\n,\nif\nTr\nφ\n​\n(\nM\nφ\n,\nμ\n)\n⊧\nφ\nViolated\n,\nif\nTr\nφ\n​\n(\nM\nφ\n,\nμ\n)\n⊧̸\nφ\n\\mathcal{O}_{\\varphi}(\\mu)=\\begin{cases}\\texttt{Satisfied},&\\text{if }\\text{Tr}_{\\varphi}(M_{\\varphi},\\mu)\\models\\varphi\\\\\n\\texttt{Violated},&\\text{if }\\text{Tr}_{\\varphi}(M_{\\varphi},\\mu)\\not\\models\\varphi\\end{cases}\nThe property\nφ\n\\varphi\n, previously defined using Signal Temporal Logic (STL), expresses that any low-battery condition during flight must lead to a successful parachute deployment within a bounded delay.\nThe oracle implements the formal semantics of STL to determine whether the trace satisfies\nφ\n\\varphi\n, treating each simulation as a deterministic signal over the relevant observable variables.\nThis falsification loop serves as an effective mechanism for evaluating the sufficiency of the reduced model and for uncovering subtle cyber-physical logic flaws that may only manifest under specific combinations of physical state and control configuration.\n4\nImplementation\nTo demonstrate the viability of our methodology, we develop a proof-of-concept system that instantiates each phase of the proposed framework. While simplified in scope, this implementation embodies the full reduction-surrogation-falsification pipeline and serves as a concrete vehicle for validating the technical approach.\nFigure 2\n:\nFull-System Flight Trajectory.\nPyBullet-based simulation trace showing 3D descent profile after battery low warning. But the drone does not deploy the parachute due to a bug in the emergency controller. Simulation took 24.7 seconds and required complete system execution.\n4.1\nSystem Overview\nThe example system models a drone flight controller responsible for emergency parachute deployment. Rather than simulating the entire PyBullet-based software stack and physical dynamics, the implementation applies structural and semantic reductions that isolate only the components relevant to evaluating a critical safety property. The resulting surrogate behaves identically with respect to the property, but is significantly more lightweight and analyzable.\nCyber-Reduction Realization\nThe cyber portion of the system is distilled from a realistic multi-mode flight control stack to a minimal state machine with two control modes: waypoint navigation (\nGOTO\n) and emergency override (\nPARACHUTE\n). Intermediate states (e.g.,\nIDLE\n,\nTAKE_OFF\n,\nLAND\n) and unrelated control flows are omitted. The retained logic preserves mission-relevant transitions and emergency triggers, ensuring property-relevant behavior is intact.\nThis selection follows the formal restriction\nQ\nφ\nQ_{\\varphi}\ndescribed in Section\n3\n, guided directly by the STL property and its triggering guard conditions.\nPhysical Reduction Realization\nPhysical dynamics are reduced to a minimal two-variable model capturing battery level and altitude—abstracting away full-body flight physics, actuator dynamics, and energy consumption models. These two variables are sufficient for evaluating deployment behavior in the presence of low-battery conditions, enabling efficient simulation and trace extraction without loss of semantic coverage.\nThis corresponds to the projection used by\nTr\nφ\n\\text{Tr}_{\\varphi}\nand the static-condensation-based reduction in Section\n3\n.\nExecutable Surrogate System\nThe reduced cyber and physical components are integrated into a self-contained Python system that executes full traces over the reduced hybrid state space. The configuration includes parametric threshold settings (e.g., minimum/maximum deployment altitude, battery critical threshold) that control mode transitions and influence safety-critical decisions. This surrogate system offers a clean, bounded execution model suitable for rigorous automated falsification.\n4.2\nFalsification Framework\nTo test the resilience of the reduced system, we construct a targeted fuzzing pipeline that explores the parameter space for configurations that violate the intended safety property. The fuzzer employs constraint-preserving generators and feedback-driven mutations to systematically probe boundary conditions and uncover logic flaws.\nEach run produces a complete execution trace along with a verdict from a temporal logic oracle, which analyzes the trace against a formally specified STL property. Violating configurations are logged for inspection, and visual analytics summarize the falsification landscape. The fuzzer supports continuous execution until interruption, automatically generating visualization outputs at termination.\n4.3\nOverview\nThis implementation demonstrates the core contribution of our framework: the ability to reduce a complex cyber-physical system to a semantically faithful, executable surrogate and to evaluate it through property-guided falsification. Despite its compactness, the system supports trace-level diagnostics, captures subtle safety violations, and enables reproducible experiments grounded in formal logic.\n5\nEvaluation\nFigure 3\n:\nBattery safety margin vs. altitude-directed safety margin for 200 autonomous runs.\nEach point is one run: green circles indicate that the safety property was satisfied, and orange crosses indicate a violation (80/200 runs, 40%). The battery safety margin on the\nx\nx\n-axis is the observed battery level relative to the mission low-battery threshold (\nM\nbat\n=\nbattery level\n−\nthreshold\nM_{\\mathrm{bat}}=\\text{battery level}-\\text{threshold}\n); larger values indicate more remaining battery. The altitude-directed margin on the\ny\ny\n-axis is the signed distance to the nearest allowed deployment altitude limit; positive values indicate that the vehicle is above the maximum allowed deployment altitude, negative values indicate that it is below the minimum allowed deployment altitude, and\n0\ncorresponds to contact with a limit. Dashed lines mark the controller’s battery threshold (vertical) and safe-altitude boundary (horizontal). Shaded quadrants (\nQ\n​\n1\nQ1\n–\nQ\n​\n4\nQ4\n) separate high/low battery and high-/low-side altitude regimes. Violations cluster where the battery margin is low and the vehicle is\noutside\nthe allowed altitude band (either too low or too high), showing that the parachute deployment logic is incorrectly inhibited whenever altitude is out of range, even under critical battery conditions where deployment should be unconditional.\nWe evaluate our methodology on a drone deployment scenario inspired by a safety-critical control flaw originally reported in PX4-based systems\n[\npgfuzz\n]\n. Our goal is to assess whether property-guided reduction and surrogate construction enable efficient, semantically faithful falsification while retaining practical utility.\n5.1\nBaseline: Full-System Simulation Cost\nWe begin by attempting falsification via full PyBullet-based simulation. This process involves mission setup, realistic flight dynamics, and complete control stack execution. A single trace that reaches the faulty deployment condition takes over 24 seconds of wall-clock time (see Figure\n2\n).\nBeyond runtime, this approach requires significant engineering effort including platform-specific instrumentation, logging infrastructure, and telemetry capture. These overheads make full-system falsification expensive and difficult to scale for proactive validation or regression testing.\n5.2\nFalsification through Surrogate Execution\nUsing our reduction methodology (Section\n3\n), we construct a property-specific surrogate that preserves only the relevant cyber-physical behavior. Each surrogate run completes in under 500 milliseconds and produces a complete trace with STL-based property evaluation.\nExample run (reduced system):\n⬇\n$\npython\nrun_scrbe_simulation\n.\npy\n--\nbattery\n10.0\n--\naltitude\n20\nConfiguration\n:\n-\nMin\ndeploy\naltitude\n:\n60.0\nm\n-\nMax\ndeploy\naltitude\n:\n80.0\nm\n-\nLow\nbattery\nthreshold\n:\n10.0%\nResult\n:\nBattery\n:\n10.0%\n(\nCRITICAL\n)\nAltitude\n:\n20.0\nm\nParachute\n:\nNOT\nDEPLOYED\nStatus\n:\nBLOCKED\n-\nCritical\nbattery\nbut\naltitude\nout\nof\ndeployment\nrange\nThis trace mirrors the behavioral failure seen in PyBullet-based full physics simulation with full control stack, showing that the surrogate reproduces the relevant failure semantics at a fraction of the cost.\nAs a property-scoped conformance check for\nφ\n\\varphi\n, we treat this agreement as evidence that the surrogate and full simulation yield the same truth valuation of\nφ\n\\varphi\nunder the same configuration. In particular, existence of a configuration\nμ\n∗\n\\mu^{*}\nsuch that both traces violate\nφ\n\\varphi\nwitnesses that\nM\nφ\nM_{\\varphi}\nreproduces the failure semantics relevant to\nφ\n\\varphi\nin this scenario.\n5.3\nFuzzing Results on Reduced Model\nWe implemented a feedback-guided fuzzer that perturbs both physical conditions (e.g., altitude, battery) and controller thresholds. Table\n1\nsummarizes the results from 20 runs on patched and non-patched controllers.\nTable 1\n:\nFuzzing Results: Patched vs. Non-Patched Controller\nNon-Patched\nPatched\nTotal Runs\n200\n200\nUnique Violations\n80\n0\nViolation Rate\n40%\n0%\nThe unpatched system consistently violates the safety property, while the patched version satisfies it across all tested inputs—demonstrating the surrogate’s utility for diagnostic validation.\n5.4\nVisualizing Safety Envelope and Violation Modes\nWe analyze how the controller behaves near its safety limits by projecting each evaluated run into a two-dimensional “margin space” defined by battery margin and altitude-directed margin (Fig.\n3\n). Each point in this space corresponds to one run and is labeled according to whether the safety property was satisfied or violated. Both axes are expressed as distances to the controller’s own decision boundaries: the battery axis measures remaining battery relative to the configured low-battery trigger level (positive when sufficient charge remains, negative when below threshold), and the altitude axis measures signed distance to the nearest permitted deployment altitude limit (negative when the vehicle is below the minimum deployment altitude, positive when above the maximum).\nThis view makes the failure mode of the emergency parachute logic explicit. The intended behavior is that, once the battery drops below its emergency threshold, deployment should proceed unconditionally. Instead, violations concentrate in regions where the battery margin is low\nand\nthe vehicle lies outside the nominal deployment altitude band. In these cases, deployment is blocked because the altitude is either too low or too high, even though that altitude check is not supposed to prevent an emergency action under critical battery conditions.\nCrucially, Fig.\n3\nis generated from the reduced surrogate model rather than the full flight stack. The surrogate reproduces the same interaction between low battery and altitude gating that we observe in the full system, and it produces the same class of safety violations (parachute withheld despite critical battery). This provides empirical evidence that the surrogate preserves the safety-relevant decision logic of the original controller, and therefore can be fuzzed in place of the full system while still revealing the true violation modes.\n5.5\nEffectiveness and Scalability\nOur approach demonstrates several benefits:\n•\nSemantic fidelity (w.r.t.\nφ\n\\varphi\n):\nThe surrogate reproduces failure behavior under the same conditions as the whole system simulated in a full physics simulation.\n•\nRuntime efficiency:\nSurrogate runs are over 10\n×\n\\times\nfaster, enabling large-scale test campaigns.\n•\nFuzzing tractability:\nTemporal falsification becomes practical over high-dimensional configuration spaces.\nThis evaluation confirms that our surrogate-based methodology enables efficient falsification and insight-driven debugging. It faithfully mirrors full-system bugs while reducing infrastructure burden and runtime costs.\n6\nDiscussion\nThis work establishes a principled framework for cyber-physical verification through property-guided reduction and surrogate execution. Our methodology demonstrates how formal reduction techniques can be systematically applied to isolate and analyze the minimal components necessary for property verification in robotic systems.\nTheoretical Foundation and Generalizability.\nThe core contribution of this work lies in establishing the formal foundation for property-guided cyber-physical reduction. By grounding cyber reduction in hybrid dynamical systems theory and physical reduction in static condensation, we provide a domain-agnostic methodology that applies broadly across CPS platforms. The framework’s theoretical basis ensures that reductions preserve semantic equivalence with respect to the target property, enabling reliable verification on simplified surrogate systems.\nMethodological Innovation.\nOur approach represents a significant departure from traditional monolithic verification strategies. Rather than treating cyber-physical systems as atomic units, we demonstrate how to systematically decompose them into property-relevant components while maintaining behavioral fidelity. This decomposition enables targeted analysis that focuses computational resources precisely where they are needed, addressing the fundamental scalability challenges that plague existing verification approaches.\nPractical Efficiency and Automation Potential.\nThe surrogate-based workflow we establish provides substantial computational advantages over full-system simulation. Our evaluation demonstrates significant runtime improvements while maintaining complete accuracy in bug detection. Importantly, the formal structure of our reduction methodology creates natural opportunities for automation—the systematic component identification and interface analysis procedures we define can serve as the foundation for automated tooling in future implementations.\nValidation and Semantic Consistency.\nA critical achievement of our framework is the preservation of semantic equivalence between original systems and their reduced surrogates. Grounded in formal models, our methodology is evaluated empirically: we validate property‑level semantic preservation by reproducing the same violation conditions in the surrogate and full‑system settings. This semantic consistency is essential for practical adoption of the methodology.\nArchitectural Compatibility.\nOur approach leverages the modular architecture inherent in modern robotic platforms, working with well-established open-source systems like PX4 and ArduPilot. This compatibility with existing development ecosystems positions the methodology for practical adoption without requiring fundamental changes to current robotic software engineering practices.\nEvaluation Rigor.\nThe focused evaluation we present serves multiple purposes: it validates the theoretical soundness of our reduction techniques, demonstrates practical efficiency gains, and establishes a reproducible baseline for future comparative studies. The case study provides clear evidence that property-guided reduction can achieve substantial computational savings while maintaining verification accuracy.\nOur framework establishes the theoretical and methodological foundation for a new class of property-specific verification tools. The systematic reduction techniques we present enable efficient analysis of semantic flaws in cyber-physical systems, offering a principled alternative to computationally expensive full-system approaches. The formal grounding of our methodology provides a solid foundation for future extensions and automation efforts in property-guided CPS verification.\nLimitations and scope.\nOur evaluation focuses on a single robotic platform, one representative safety property, and one bug manifestation. This scope is intentional: our primary contribution is methodological, centered on property-guided cyber-physical reduction with surrogation. The study is designed to isolate feasibility and demonstrate the end-to-end workflow. Broadening across platforms and properties requires substantial re-instrumentation and scenario curation, which is orthogonal to the core technique. Within this scoped setting, we demonstrate that the reductions preserve safety-relevant behavior while delivering substantial efficiency gains that enable practical analysis. Future work will expand the evaluation to additional platforms, properties, and bug types to further validate generalizability.\n7\nConclusion\nWe have presented a property-guided methodology for cyber-physical system verification that enables semantically faithful falsification through structural reduction and surrogate construction. By isolating the minimal control and physical components relevant to a given safety property, our approach transforms complex robotic systems into lightweight, analyzable surrogates—supporting scalable, specification-driven testing without reliance on full-system simulation.\nThrough a proof-of-concept implementation targeting a real-world drone deployment bug, we demonstrated how this reduction enables targeted fuzzing, rapid falsification, and interpretable diagnostics with minimal engineering overhead. Our evaluation confirms that safety violations can be exposed in orders-of-magnitude less time while preserving behavioral equivalence with the full system.\nThis work opens the door to broader verification frameworks that are property-aware by construction. Future research will focus on automating reduction workflows, scaling to multi-property analyses, and applying these techniques to closed-source and industry-scale platforms.\nAcknowledgements.\nThe research reported in this paper was sponsored in part by the\nNational Science Foundation (NSF) under awards FMitF-2425711 and NCS-2435642 and the National Institute of Health (NIH) under award R61MH135109. The views and conclusions contained in this document are those of the authors and should not be interpreted as representing the official policies, either expressed or implied, of the funding agencies.",
  "preview_text": "We propose a methodology for falsifying safety properties in robotic vehicle systems through property-guided reduction and surrogate execution. By isolating only the control logic and physical dynamics relevant to a given specification, we construct lightweight surrogate models that preserve property-relevant behaviors while eliminating unrelated system complexity. This enables scalable falsification via trace analysis and temporal logic oracles.\n  We demonstrate the approach on a drone control system containing a known safety flaw. The surrogate replicates failure conditions at a fraction of the simulation cost, and a property-guided fuzzer efficiently discovers semantic violations. Our results suggest that controller reduction, when coupled with logic-aware test generation, provides a practical and scalable path toward semantic verification of cyber-physical systems.\n\n1\n1\ninstitutetext:\nUniversity of Utah, Salt Lake City, UT, USA\n1\n1\nemail:\n{sayom.shakib,la.garcia}@utah.edu\nProperty-Guided Cyber-Physical Reduction and Surrogation for Safety Analysis in Robotic Vehicles\nNazmus Shakib Sayom\nLuis A. Garcia\nAbstract\nWe propose a methodology for falsifying safety properties in robotic vehicle systems through property-guided reduction and surrogate execution. By isolating only the control logic and physical dynamics relevant to a given specification, we construct lightweight surrogate models that preserve property-relevant behaviors while eliminating unrelated system complexity. This enables scalable falsification via trace analysis and temporal logic oracles.\nWe demonstrate the approach on a drone control system containing a known safety flaw. The surrogate replicates failure conditions at a fraction of the simulation cost, and a property-guided fuzzer efficiently discovers semantic violations. Our results suggest that controller reduction, when coupled with logic-aware test generation, provides a practical and scalable path toward semantic verification of cyber-physic",
  "is_relevant": false,
  "relevance_score": 1.0,
  "extracted_keywords": [
    "safety analysis",
    "cyber-physical systems",
    "model reduction",
    "surrogate models",
    "falsification",
    "temporal logic",
    "drone control system"
  ],
  "one_line_summary": "本文提出一种面向安全属性的模型降阶与代理执行方法，用于机器人车辆系统的安全性验证，与视频扩散或生成式大模型无关。",
  "detailed_summary": "",
  "qa_pairs": [],
  "is_hidden": false,
  "is_starred": false,
  "published_date": "2025-12-01T23:27:22Z",
  "created_at": "2026-01-09T09:59:26.797514",
  "updated_at": "2026-01-09T09:59:26.797524"
}