{
    "id": "2512.01598v1",
    "title": "A Cross-Embodiment Gripper Benchmark for Rigid-Object Manipulation in Aerial and Industrial Robotics",
    "authors": [
        "Marek Vagas",
        "Martin Varga",
        "Jaroslav Romancik",
        "Ondrej Majercak",
        "Alejandro Suarez",
        "Anibal Ollero",
        "Bram Vanderborght",
        "Ivan Virgala"
    ],
    "abstract": "机器人夹爪正越来越多地应用于工业、协作及空中平台，不同平台对夹爪在机械结构、能量消耗和操作性能方面提出了各不相同的约束条件。现有的YCB和NIST基准能够量化单一平台上抓取的成功率、力度或时间，但无法评估跨形态的可迁移性或能耗感知性能——而这两种能力对于现代移动式和空中操作任务至关重要。本文提出了一种跨形态夹爪基准（Cross-Embodiment Gripper Benchmark, CEGB），这是一个紧凑且可复现的评测套件，在YCB和部分NIST指标的基础上新增了三个组件：一是“形态转换时间”基准，用于衡量更换夹爪平台的实际操作耗时；二是“能耗”基准，评估抓取与持握过程中的能效表现；三是“任务导向的理想负载”评估，反映依赖设计特性的操作能力。这些指标共同刻画了夹爪的抓取性能，以及其在异构机器人系统间重复使用的适用性。本文以一款轻量级自锁型夹爪原型作为参考案例进行了实现。实验结果表明，该原型具备快速的平台切换能力（不同用户组平均约17.6秒）、低持握能耗（约每10秒1.5焦耳），并在3.2至3.9秒的周期内实现超过90%的抓取成功率。因此，CEGB为空中及操作类机器人领域的跨平台、节能型夹爪评估提供了可复现的基准框架。",
    "url": "https://arxiv.org/abs/2512.01598v1",
    "html_url": "https://arxiv.org/html/2512.01598v1",
    "html_content": "A Cross-Embodiment Gripper Benchmark for Rigid-Object Manipulation in Aerial and Industrial Robotics\nMarek Vagas\n1\n, Martin Varga\n1\n, Jaroslav Romancik\n1\n, Ondrej Majercak\n1\n, Alejandro Suarez\n2\n, Anibal Ollero\n2\n,Bram Vanderborght\n3\n, and Ivan Virgala\n1\n*This work is supported by the European ROBotics and AI Network (euROBIN, Grant agreement ID: 101070596) project funded by the European Commission\n1\nMarek Vagas, Martin Varga, Jaroslav Romancik, Ondrej Majercak and Ivan Virgala are with the Faculty of Mechanical Engineering, Technical University of Kosice, 04200 Kosice, Slovakia\n(emails:marek.vagas, martin.varga.2, jaroslav.romancik, ondrej.majercak, ivan.virgala, @tuke.sk)\n2\nAlejandro Suarez and Anibal Ollero are with the GRVC Robotics Lab of Seville,\n41004 Sevilla, Spain\n(emails:asuarezfm@us.es, aollero@us.es)\n3\nBram Vanderborght is with with Brubotics,\nVrije Universiteit Brussel and IMEC,\n1050 Elsene, Belgium\n(email:bram.vanderborhght@imec.be)\nAbstract\nRobotic grippers are increasingly deployed across industrial, collaborative, and aerial platforms, where each embodiment imposes distinct mechanical, energetic, and operational constraints. Established YCB and NIST benchmarks quantify grasp success, force, or timing on a single platform, but do not evaluate cross-embodiment transferability or energy-aware performance, capabilities essential for modern mobile and aerial manipulation.\nThis letter introduces the Cross-Embodiment Gripper Benchmark (CEGB), a compact and reproducible benchmarking suite extending YCB and selected NIST metrics with three additional components: a transfer-time benchmark measuring the practical effort required to exchange embodiments, an energy-consumption benchmark evaluating grasping and holding efficiency, and an intent-specific ideal payload assessment reflecting design-dependent operational capability. Together, these metrics characterize both grasp performance and the suitability of reusing a single gripper across heterogeneous robotic systems.\nA lightweight self-locking gripper prototype is implemented as a reference case. Experiments demonstrate rapid embodiment transfer (median\n≈\n\\approx\n17.6 s across user groups), low holding energy for gripper prototype (\n≈\n\\approx\n1.5 J per 10 s), and consistent grasp performance with cycle times of 3.2–3.9 s and success rates exceeding 90%. CEGB thus provides a reproducible foundation for cross-platform, energy-aware evaluation of grippers in aerial and manipulators domains.\nI\nIntroduction\nRobotic grasping has been extensively investigated across industrial, collaborative, and aerial domains. Over the past decades, numerous gripper designs have emerged. From simple parallel-jaw and underactuated mechanisms to modern soft, hybrid, and multifunctional systems\n[\ncitation_17\n]\n,\n[\ncitation_19\n]\n,\n[\ncitation_20\n]\n. Despite this progress, grippers deployed across heterogeneous platforms continue to face embodiment-dependent constraints such as mounting geometry, actuation compatibility, and power availability, which complicate direct comparison of their performance. Substantial technological progress, review papers consistently highlight the lack of a unified, quantitative\nFigure 1\n:\nOverview of the Cross-Embodiment Gripper Benchmark (CEGB). A common reference gripper is mounted on different robotic platforms—a collaborative manipulator, mobile robot with manipulator and UAV—to evaluate cross-embodiment transfer, mounting compatibility, and performance under different actuation and environmental conditions.\nframework for cross-platform comparison\n[\ncitation_14\n]\n,\n[\ncitation_21\n]\n. Current benchmarks primarily quantify grasp success or adaptability but seldom address transferability, energy efficiency, or reproducibility across different robotic embodiments. To improve reproducibility, standardized object sets and test protocols have been introduced. The YCB Object and Model Set\n[\n7251504\n]\nbecame a widely adopted reference for grasp success evaluation, while NIST protocols\n[\n8950105\n]\ncomplemented it with timing, payload, and force-based metrics. Initiatives such as GRASPA\n[\ncitation_5\n]\n, OpenGRASP\n[\ncitation_2\n]\n, and the Robotic Grasping and Manipulation Competitions (RGMC)\n[\ncitation_10\n]\nhave further advanced transparent benchmarking practices. However, these methods remain largely platform-specific and do not evaluate the ability of a single gripper to be reused across heterogeneous systems.\nThe emergence of soft and hybrid grippers has emphasized the limitations of existing frameworks. Traditional benchmarks such as YCB and NIST were primarily designed for rigid or underactuated mechanisms, thus capturing only a subset of behaviors observed in compliant or multi-modal systems. Recent developments include multifunctional soft grippers with integrated sensing\n[\ncitation_27\n]\n, learning-based hybrid architectures\n[\ncitation_30\n]\n, and topology-optimized designs\n[\ncitation_26\n]\n. The SoGraB framework\n[\ncitation_11\n]\nintroduced visual deformation analysis for soft grasping, representing a significant step forward. Nevertheless, these approaches focus mainly on shape adaptability and do not systematically consider energy efficiency or cross-platform transferability—factors critical for modern mobile and aerial robots.\nAerial manipulation benchmarks\n[\ncitation_6\n]\nhave addressed unique flight constraints such as payload, stability, and energy limitations, whereas industrial robotics including collaborative robots emphasize safety, modularity, and reconfigurability\n[\ncitation_16\n]\n,\n[\ncitation_15\n]\n. Modular and detachable grippers have therefore gained increasing attention, offering fast tool exchange and compatibility across multiple embodiments. Examples include the Co-Gripper\n[\nSalvietti8593877\n]\n, a wireless modular end-effector capable of standalone operation, and detachable collaborative grippers using electromagnetic changers\n[\nIqbal\n]\nor modular fingertips\n[\nRingwald\n]\n. These concepts illustrate the emerging trend toward cross-platform reuse, yet their quantitative assessment remains largely unexplored. Although qualitative demonstrations repeatedly highlight the promise of such designs, the community lacks a standardized methodology for measuring how effectively a gripper can be transferred, redeployed, and operated across platforms with different kinematics, control strategies, and physical interfaces.\nIn the literature, transferability generally refers to the capability of a gripper to operate effectively across different embodiments, tasks, or environments\n[\ncitation_6\n]\n,\n[\nSalvietti8593877\n]\n,\n[\nWang10582538\n]\n. Embodiment transfer describes mechanical or control adaptation between robotic platforms, task transfer concerns the reuse of grasp strategies across manipulation tasks, and environment transfer involves deploying the same gripper hardware across aerial and manipulators systems. While these notions are increasingly discussed conceptually, a rigorous benchmarking methodology to quantify them is still missing. Existing frameworks remain limited in addressing the three pillars of modern gripper benchmarking — transferability across robotic embodiments, energy-aware operation for resource-constrained platforms, and reproducible comparison enabling transparent cross-platform evaluation. In addition, current benchmarks do not provide standardized reporting conventions for transfer-related metrics, making it difficult to compare methods across laboratories or robotic platforms.\nThese limitations motivate the development of a comprehensive and reproducible framework that integrates mechanical, energetic, and functional evaluation of gripper performance across platforms. The goal is not to replace established YCB and NIST procedures but to extend them with complementary metrics that address embodiment transfer and energy efficiency in a unified way.\nThe main contributions of this letter are as follows: (1) We introduce the Cross-Embodiment Gripper Benchmark (CEGB), a compact benchmarking suite extending YCB and selected NIST metrics with additional evaluations focusing on cross-platform transfer and energy-aware performance; (2) We present and validate a self-locking reference gripper prototype (RGP) characterized by low energy consumption during holding; (3) We provide open-source data, CAD model, and scripts to support reproducible cross-platform comparison of grippers.\nBeyond addressing these gaps, CEGB aims to provide a common language for discussing gripper performance across heterogeneous embodiments. By doing so, it supports more transparent comparison of emerging designs and promotes reproducible evaluation practices across the community.\nII\nCross-Embodiment Gripper Benchmark\nA comprehensive evaluation of a gripper requires benchmarks that are comparable across platforms and reproducible within the community. We build upon the widely adopted YCB Object and Model Set and selected NIST protocols, extending them with complementary metrics that explicitly quantify transferability, energy efficiency, and intent-specific payload. Transferability is understood as the ability of a gripper to maintain its function and performance across distinct robotic embodiments with minimal adaptation, an aspect not addressed in existing standards. The resulting CEGB thus combines established object- and force-based evaluations with additional cross-platform and energy-aware metrics tailored for aerial and manipulators scenarios.\nAll continuous variables are reported as median, interquartile range (IQR), and 95% bootstrap confidence intervals, while binomial proportions use Wilson score intervals for consistent statistical reporting. This convention reduces the influence of outliers and non-Gaussian effects, which are common in contact-rich experiments, and facilitates transparent comparison of results across laboratories that adopt the same benchmark. This unified reporting structure ensures that future grippers evaluated under CEGB can be compared directly, regardless of platform, embodiment, or actuation technology.\nII-A\nYCB Grasp Success and Metrics\nThe YCB Object and Model Set\n[\n7251504\n]\nprovides a reproducible baseline for evaluating grasp–hold–release performance and remains the\nmost widely adopted object set for manipulation benchmarking. We follow established YCB evaluation practices\n[\nChenBohgLiu2024\n]\n,\n[\nzhou2023instagraspentirely3dprinted\n]\nusing a subset of objects\nS\nS\nand testing each object\no\no\nin\nk\nk\ncanonical poses, with\na\na\nrepeated attempts per pose. The choice of\nS\nS\n,\nk\nk\n, and\na\na\nis driven by a trade-off between experimental time and statistical reliability, and can be adapted by other users of CEGB as long as the configuration is reported together with the results.\nFor each object\no\no\nand pose\nj\nj\n, the grasp success proportion is\ns\no\n,\nj\n=\ng\no\n,\nj\na\n,\nj\n=\n1\n,\n…\n,\nk\ns_{o,j}=\\frac{g_{o,j}}{a},\\qquad j=1,\\dots,k\n(1)\nwhere\ng\no\n,\nj\ng_{o,j}\nis the number of successful attempts. The per-object success rate is\ns\no\n=\n1\nk\n​\n∑\nj\n=\n1\nk\ns\no\n,\nj\ns_{o}=\\frac{1}{k}\\sum_{j=1}^{k}s_{o,j}\n(2)\nDataset-level summaries are reported as micro- and macro-averages:\ns\n¯\nmicro\n=\n∑\no\n∈\nS\n∑\nj\ng\no\n,\nj\n∑\no\n∈\nS\n∑\nj\na\n,\ns\n¯\nmacro\n=\n1\n|\nS\n|\n​\n∑\no\n∈\nS\ns\no\n\\bar{s}_{\\text{micro}}=\\frac{\\sum_{o\\in S}\\sum_{j}g_{o,j}}{\\sum_{o\\in S}\\sum_{j}a},\\qquad\\bar{s}_{\\text{macro}}=\\frac{1}{|S|}\\sum_{o\\in S}s_{o}\n(3)\nHere,\ns\n¯\nmicro\n\\bar{s}_{\\text{micro}}\nemphasizes the overall success rate weighted by the number of trials, while\ns\n¯\nmacro\n\\bar{s}_{\\text{macro}}\nassigns equal weight to each object, which is useful when comparing grippers with different object preferences or failure modes.\nTo quantify uncertainty in these binomial success proportions, we report Wilson score confidence intervals, which offer well-behaved coverage even for small sample sizes and proportions near 0 or 1, and represent the recommended practice in manipulation benchmarking.\n[\n8950105\n]\n.\nA grasp is considered successful if the object is lifted at least 5 cm within\n3 s and held for 3 s without slip (10 s timeout), consistent with prior YCB-based\nevaluations. In addition to binary outcomes, we\nrecord\ntime-to-lift\nand\ntime-to-release\nas complementary continuous\nmetrics, reported using median, IQR, and 95% bootstrap confidence intervals. These temporal quantities provide additional insight into the dynamic behavior of the gripper, for example distinguishing fast but unreliable grasps from slower yet more robust strategies.\nII-B\nNIST Benchmark\nTo complement the YCB grasp–success evaluation, we adopt a compact subset\nof NIST end-effector metrics\n[\n8950105\n]\n, covering timing, force output,\nslip resistance, and payload capacity. These quantities provide platform-agnostic, time- and force-based descriptors that capture aspects not addressed by the YCB pass/fail criterion. Within CEGB, the NIST-derived metrics serve as a common reference layer that allows different grippers and embodiments to be compared in terms of fundamental mechanical capability, independently of the specific object set or task.\nGrasp Cycle Time\nThe grasp cycle time is defined as\nT\ncycle\n=\nT\nstop\n−\nT\nstart\nT_{\\text{cycle}}=T_{\\text{stop}}-T_{\\text{start}}\n(4)\ncorresponding to the duration of a complete grasp–hold–release sequence. To ensure comparability, either standardized gauge objects or identical commanded stroke lengths are used across trials\n[\n241386\n]\n. Results follow\nthe unified statistical convention of median, IQR, and 95% bootstrap confidence intervals, see Sec.\nII\n.\nGrasp Strength\nGrasp strength is the total normal force exerted by all fingers pressing a rigid\nreference object. Let\nF\nN\ni\nF_{N_{i}}\ndenote the normal force at finger\ni\ni\n; then\nF\ntotal\n=\n∑\ni\n=\n1\nn\nF\nN\ni\nF_{\\text{total}}=\\sum_{i=1}^{n}F_{N_{i}}\n(5)\nPeak and plateau values are recorded for each trial and low-pass filtered to\nsuppress measurement spikes. This metric refines earlier NIST terminology and\nensures unambiguous definition of normal-force summation\n[\n8950105\n]\n.\nSlip Resistance\nSlip resistance quantifies the tangential load that induces object motion. The effective friction coefficient is\nμ\neff\n=\nF\nslip\n∑\ni\nN\ni\n\\mu_{\\text{eff}}=\\frac{F_{\\text{slip}}}{\\sum_{i}N_{i}}\n(6)\nwhere\nF\nslip\nF_{\\text{slip}}\nis the tangential force at slip onset. For designs where an\nexternal torque\nT\na\nT_{a}\nis applied along a finger of length\nL\nL\n, we additionally report the dimensionless holding-quality factor\nQ\nhold\n=\nF\nslip\n​\nL\nT\na\nQ_{\\text{hold}}=\\frac{F_{\\text{slip}}L}{T_{a}}\n(7)\nsupporting different loading modes and test fixtures\n[\n10.5555/1209344\n]\n.\nEach condition is repeated multiple times, including worst-case pull directions. In CEGB,\nμ\neff\n\\mu_{\\text{eff}}\nand\nQ\nhold\nQ_{\\text{hold}}\ntogether capture how the contact design, surface materials, and finger geometry influence robustness to external disturbances.\nII-C\nTransfer Time Benchmark\nTransferability refers to the ability of a gripper to operate across different robotic embodiments without mechanical redesign or control recalibration, as emphasized in prior modular and cross-platform end-effector work\n[\nSalvietti8593877\n]\n,\n[\nIqbal\n]\n,\n[\nWang10582538\n]\n. While transferability is often discussed qualitatively in the literature, no quantitative metric currently exists to measure the operational effort required\nto reuse the same gripper across heterogeneous platforms.\nTo address this gap, the\nTransfer Time Benchmark\nmeasures the duration required to detach the gripper from one platform and reattach it to another. The metric captures practical factors such as connector accessibility,\nalignment tolerance, mechanical keying, safety interlocks, and human operator interaction, elements that strongly affect deployability in real-world applications, especially in mobile or aerial manipulation where downtime is critical. Within CEGB, this benchmark explicitly links hardware design choices (e.g., quick-release interfaces, connector placement) to measurable differences in transfer performance.\nThe average transfer duration is defined as\nT\ntransfer\n=\n1\nN\n​\n∑\ni\n=\n1\nN\nT\ni\nT_{\\text{transfer}}=\\frac{1}{N}\\sum_{i=1}^{N}T_{i}\n(8)\nwhere\nT\ni\nT_{i}\nis the duration of the\ni\ni\n-th attach/detach cycle. Robustness is quantified by the success rate\nS\ntransfer\n=\nN\nsuccess\nN\nS_{\\text{transfer}}=\\frac{N_{\\text{success}}}{N}\n(9)\nin which\nN\nsuccess\nN_{\\text{success}}\ncounts transfers completed without mechanical misalignment, electrical-connector faults, or software/communication errors.\nExperimental Protocol\nTransfer trials are performed between two representative robotic platforms. To isolate the end-effector exchange process from platform motion, both platforms are placed in a neutral pose, powered off, and mechanically locked. Each trial starts when the operator touches the quick-release interface and ends when the gripper is fully reattached and electrically available to the\nhost platform. Multiple repetitions are conducted across participant groups (novices, intermediate users, trained operators) to capture human-related\nvariability, which is known to influence repeatability in modular tool-changing systems.\nRelevance\nThe Transfer Time Benchmark quantifies the practical overhead of reusing the same gripper across heterogeneous embodiments. This is particularly important in aerial manipulation, where minimizing downtime directly affects\nmission endurance, and in industrial robotics, where rapid transitions between task-specific tools are often required. Unlike existing benchmarks, which evaluate gripper performance on a single platform, this metric captures the operational effort and reliability associated with embodiment transfer. It thereby complements YCB and NIST metrics by providing a direct link between gripper modularity and system-level deployability.\nII-D\nEnergy Consumption Benchmark\nEnergy consumption is a critical dimension of gripper performance, particularly for aerial and mobile manipulation platforms where onboard\npower is limited. Existing benchmarks rarely quantify energy usage in a standardized manner, despite its direct impact on flight endurance, mission duration, and overall system efficiency. We therefore introduce an\nEnergy Consumption Benchmark\nthat evaluates the energy required across the main phases of a grasp cycle. The definition is formulated in an actuation-agnostic manner so that the same benchmark can be applied to electrically, pneumatically, or hydraulically actuated grippers without modification of the core metric. By reporting phase-specific energy, CEGB distinguishes between designs that are efficient during motion, during holding, or in both regimes.\nThe total cycle energy is defined as\nE\ncycle\n=\nE\ngrasp\n+\nE\nhold\n+\nE\nrelease\nE_{\\text{cycle}}=E_{\\text{grasp}}+E_{\\text{hold}}+E_{\\text{release}}\n(10)\nwhere each component corresponds to a distinct phase of the grasping process. To avoid mechanical irregularities at stroke limits, a power grasp is executed from a fully open configuration to at least 95% closure.\nEnergy Components\nE\ngrasp\nE_{\\text{grasp}}\ndenotes the energy consumed from the commanded closing motion until the object is securely lifted.\nE\nhold\nE_{\\text{hold}}\nrepresents the energy used during a prescribed holding interval\nt\nhold\nt_{\\text{hold}}\n, and\nE\nrelease\nE_{\\text{release}}\ncovers the energy required\nfrom the opening command until the gripper fully opens.\nEach energy quantity is computed by integrating the instantaneous input power,\nE\n=\n∫\nP\n​\n(\nt\n)\n​\nd\nt\n{E=\\int P(t)\\,\\mathrm{d}t}\n(11)\nwhere\nP\n​\n(\nt\n)\nP(t)\ndenotes the instantaneous power supplied to the gripper actuation system. For electrically actuated grippers, this reduces to\nP\n​\n(\nt\n)\n=\nU\n​\n(\nt\n)\n​\nI\n​\n(\nt\n)\nP(t)=U(t)\\,I(t)\nusing measured voltage\nU\n​\n(\nt\n)\nU(t)\nand current\nI\n​\n(\nt\n)\nI(t)\n, whereas pneumatic or hydraulic systems may compute\nP\n​\n(\nt\n)\nP(t)\nfrom their corresponding pressure and flow variables. Thus, the benchmark remains general while allowing platform-specific implementations.\nBecause holding energy scales with holding duration, we report a standardized 10-second equivalent:\nE\nhold10\n=\n10\n​\nP\n¯\nhold\nE_{\\text{hold10}}=10\\,\\overline{P}_{\\text{hold}}\n(12)\nwhere\nP\n¯\nhold\n\\overline{P}_{\\text{hold}}\nis the average input power during the stable hold phase. This normalization facilitates comparison across grippers and use cases with different holding durations and duty cycles.\nExperimental Protocol\nMeasurements are performed under controlled conditions using representative object weights. For each object, the grasp cycles are repeated in staticitally reasonable count, and the three components\nE\ngrasp\nE_{\\text{grasp}}\n,\nE\nhold10\nE_{\\text{hold10}}\n, and\nE\nrelease\nE_{\\text{release}}\nare recorded. Identical approach distances and grasp types are prescribed across repetitions to ensure comparability. Results are reported using the unified statistical convention of median, IQR, and 95% bootstrap confidence intervals. In addition, sampling the relevant actuation variables at a fixed rate allows the reconstruction of instantaneous power profiles\nP\n​\n(\nt\n)\nP(t)\nand their integrals. Such profiles reveal transient behaviors, frictional effects, or compliance-driven responses that are not evident from aggregate energy values alone, and they provide valuable diagnostic insight when comparing different embodiments or actuation systems.\nII-E\nIntent-specific Ideal Payload Benchmark\nGeneral-purpose benchmarks often fail to capture the conditions under which a gripper is designed to operate most effectively. Many grippers exhibit\ndistinct performance characteristics depending on their preferred grasp type, object geometry, and structural compliance. To reflect these design-dependent aspects, we introduce the\nIntent-Specific Ideal Payload Benchmark\n(IIPB), which evaluates the maximum sustainable load under the gripper’s intended operational configuration. In CEGB, IIPB serves as the link between abstract mechanical capability and the concrete use cases for which a gripper has been designed.\nThree standardized artifacts are used to represent typical grasping scenarios: (i) a NIST test cylinder, (ii) a rectangular box with PVC-coated contact surfaces, and (iii) a rigid PVC-coated sphere. Each artifact is assigned a\ncompact symbolic label (C, B, S), enabling concise notation and facilitating comparison across heterogeneous gripper designs, as summarized in Table\nI\n.\nTo account for structural compliance, grippers are classified as rigid (R- rigid) or compliant in one (1S- semicompliant in one axis), two (2S- semicompliant in two axis), or all three (F- fully compliant) principal axes. While compliant fingers enhance adaptability to irregular or fragile objects, they typically reduce the achievable payload; thus, compliance is reported jointly with the ideal payload capacity. This joint reporting encourages designers to explicitly state the trade-offs between adaptability and load capacity, rather than optimizing one at the expense of the other without documentation.\nThe measurement procedure follows the slip-resistance protocol described in Sec.\nII-B\n. The artifact is grasped in the gripper’s preferred configuration, and an external pulling force is gradually increased until slippage occurs or\na predefined safety limit is reached. The ideal payload is defined as\nF\nideal\n=\nmax\n⁡\n(\nF\npull\n)\nF_{\\text{ideal}}=\\max(F_{\\text{pull}})\n(13)\nwhere\nF\npull\nF_{\\text{pull}}\nis the externally applied tangential force. Each test is repeated statistically reasonable times for each artifact size, and results are reported using the unified statistical convention (median, IQR, and 95% bootstrap confidence intervals). When combined with the compliance and grip-type codes in Table\nI\n, these values enable concise cataloguing of grippers in terms of both their preferred operating regime and their achievable intent-specific payload.\nTABLE I\n:\nGripper classification codes used for IIPB comparison.\nParameter\nOption\nCode\nCompliance Type\nRigid / 1-axis / 2-axis / 3-axis\nR / 1S / 2S / F\nPreferred Grip Type\nWrap / Pinch\nW / P\nIdeal Object Shape\nCylinder / Box / Sphere\nC / B / S\nIII\nExperimental Results\nIII-A\nYCB Evaluation\nTo quantify the baseline grasping ability, we applied the YCB Grasp Success approach using a constant approach trajectory and fixed grasping speed. For each object–pose combination,\na\n=\n5\na=\\text{5}\nattempts were performed, and per-object success rates were computed according to Eq.\n1\n–\n3\n. The RGP achieved a micro-average success rate of\n39.5\n%\n​\n(\n95\n%\n​\nC\n​\nI\n​\n[\n37.35\n,\n41.55\n]\n)\n\\text{39.5}\\%(95\\%CI[37.35,41.55])\nand a macro-average success rate of\n38.7\n%\n​\n(\n95\n%\n​\nC\n​\nI\n​\n[\n22.43\n,\n57.47\n]\n)\n\\text{38.7}\\%(95\\%CI[22.43,57.47])\n. Spherical and cylindrical objects exceeded\n63\n%\n\\text{63}\\%\nmicro-average success rate, while thin and flat objects remained below\n1.7\n%\n\\text{1.7}\\%\nmicro-average success rate and articulated object reached above\n80\n%\n\\text{80}\\%\nmicro-average success rate.\nThese outcomes are consistent with the gripper’s mechanical structure: high-friction pads and passive finger compliance support adaptation to\ncurved and irregular geometries, whereas planar artifacts remain challenging due to the fixed fingernail geometry and the absence of a universal picking motion. Fig.\n2\nillustrates representative examples, including successful grasps of articulated objects by our RGP.\nLarge or unevenly distributed masses also reduced performance. The main contributors were (i) local pad deformation leading to slippage and (ii)\ntorsional stresses in the compliant joints causing suboptimal finger alignment. These observations suggest that future iterations may benefit from semi-flexible fingernails to improve ground-level picking.\nFigure 2\n:\nReference gripper prototype performance metric results based on the YCB benchmark.\nAcross repeated trials, the gripper exhibited reproducible temporal behavior.\nIn summary, the YCB evaluation confirms that the RGP achieves robust and reproducible grasping performance across a wide range of object classes, while highlighting expected limitations with thin and heavy items. The\nreported success rates with confidence intervals demonstrate performance comparable to established adaptive designs and significantly stronger than\nminimal two-finger mechanisms.\nIII-B\nNIST Evaluation\nThe NIST-based evaluation complements the YCB results by providing quantitative measurements of grasp timing, force output, and slip resistance, following the standardized metrics defined in Sec.\nII-B\n. Three metrics were evaluated: grasp cycle time, grasp strength, and slip resistance. Each experiment was repeated at least\nN\n=\n10\nN=\\text{10}\ntimes under identical conditions, and results are reported as median values with 95% bootstrap confidence intervals.\nGrasp Cycle Time\nThe grasp cycle time was evaluated using standard cylindrical artifacts of 50 mm and 80 mm diameter, following the NIST procedure described in Sec.\nII-B\n. Each cycle began at the commanded approach (\nT\nstart\nT_{\\text{start}}\n) and ended once the gripper returned to its fully open\nstate (\nT\nstop\nT_{\\text{stop}}\n). The resulting cycle time is therefore\nT\ncycle\n=\nT\nstop\n−\nT\nstart\nT_{\\text{cycle}}=T_{\\text{stop}}-T_{\\text{start}}\n.\nEach measurement was repeated\n32\n32\ntimes under identical conditions to ensure reproducibility.\nThe grasping sequence is shown in Fig.\n3\n.\nThe use of standardized reference artifacts facilitates comparison with other grippers tested under the NIST framework.\nFigure 3\n:\nDetermination of the reference gripper prototype grasp cycle time following the NIST procedure.\nThe mean cycle times and 95% confidence intervals are summarized in Table\nII\n. The RGP achieved cycle durations of\n3.91 s for the 50 mm artifact and 3.23 s for the 80 mm artifact, with low variability across repetitions. The slight reduction in cycle time for larger artifacts is consistent with the reduced finger travel required for a power grasp at wider diameters.\nTABLE II\n:\nEvaluation of the reference gripper prototype grasp cycle time.\nArtifact [mm]\nType\nOrientation [\n∘\n]\nCycle time [s]\n50\npinch\n0\n3.91 [3.88, 3.94]\n80\npinch\n0\n3.23 [3.20, 3.60]\nGrasp Strength\nGrasp strength was evaluated with 50 mm and 80 mm cylindrical artifacts using the NIST force-measurement protocol, defined in Sec.\nII-B\n. For each trial, the normal forces exerted by all contacting fingers (\nN\ni\nN_{i}\n) were summed to obtain the total grasp force\nF\ntotal\n=\n∑\ni\nN\ni\nF_{\\text{total}}=\\sum_{i}N_{i}\n.\nAs shown in Table\nIII\n, the RGP generated 9.79 N on the 50 mm artifact and 8.18 N on the 80 mm artifact.\nThe decrease in force for larger diameters is expected, as finger curvature reduces local contact pressure and the gripping force is not constant through its stroke.\nTABLE III\n:\nEvaluation of the reference gripper prototype grasping strength.\nArtifact\nGrasp Type\nMean [N]\n95% CI [N]\n50 mm\npinch\n9.79\n[9.76, 9.82]\n80 mm\npinch\n8.18\n[8.15, 8.20]\nSlip resistance\nThe slip resistance test quantifies the gripper’s ability to withstand externally applied tangential loads without object loss, following the NIST methodology defined in Sec.\nII-B\n.\nFour cylindrical artifacts with diameters of 32 mm, 50 mm, 75 mm, and 100 mm were used.\nEach artifact was grasped in a wrap configuration at an orientation of 90°, while the robotic arm applied a constant translational motion along the\ny\ny\n-axis at a speed of 150 mm/min.\nA calibrated force sensor recorded the tangential resistance force\nF\nslip\nF_{\\text{slip}}\nuntil the onset of motion.\nAccording to Eq.\n6\n, the effective friction coefficient was evaluated as\nμ\neff\n=\nF\nslip\n/\n∑\ni\nF\nN\ni\n\\mu_{\\text{eff}}=F_{\\text{slip}}/\\sum_{i}F_{N_{i}}\n,\nwhere\nF\nN\ni\nF_{N_{i}}\ndenotes the normal forces measured during grasping.\n10\n10\nrepetitions were performed for each artifact to ensure statistical reliability, and the mean values with 95% confidence intervals are reported in Table\nIV\n.\nFigure 4\n:\nExperimental setup for the slip-resistance test based on the NIST methodology.\nTABLE IV\n:\nEvaluation of reference gripper prototype slip resistance.\nArtifact [mm]\nGrasp Type\nMean [N]\n95% CI [N]\n32\npinch\n6.28\n[6.17, 6.40]\n50\npinch\n5.78\n[5.69, 5.87]\n75\npinch\n6.24\n[6.06, 6.41]\n100\npinch\n3.75\n[3.67, 3.83]\nThe results show consistent behavior across artifacts of comparable sizes, with a noticeable decrease in slip resistance for the largest diameter (100 mm).\nThis trend is attributed to the non constant gripper force throughout the stroke and local deformation of the compliant pads at wider openings.\nOverall, the gripper maintained stable contact forces across the tested range, confirming its ability to resist tangential loads in alignment with the NIST slip-resistance criteria.\nIII-C\nTransfer Time Evaluation\nThe Transfer Time Benchmark introduced in Sec.\nII-C\nwas applied to quantify the practical effort required to reuse the same gripper across distinct robotic platforms. For each trial, the transfer time\nT\ntransfer\nT_{\\text{transfer}}\nwas computed as the mean duration of\n5\n5\nattach/detach cycles (Eq.\n8\n), while robustness was captured by the success rate\nS\ntransfer\nS_{\\text{transfer}}\n(Eq.\n9\n).\nFigure 5\n:\nExperimental sequence for participants to attach and detach the reference gripper prototype.\nFig.\n5\nillustrates the detach/attach sequence performed by participants. Both platforms were placed in a neutral pose and powered off to isolate the end-effector exchange from any platform. Fig.\n6\nshows that after transferring the gripper between the two embodiments, it was immediately deployed in representative pick-and-place tasks on both the industrial manipulator and the UAV, demonstrating functional continuity beyond the attach/detach procedure.\nFigure 6\n:\nTransferability to the platforms with parcel delivery task.\nThe experiment was repeated across four participant groups (45 in total): bachelor students, master students, colleagues without prior explanation, and experienced researchers involved in this work.\nThe results are summarized in Fig.\n7\nand reported as median values with IQR\nand 95% bootstrap confidence intervals. All groups achieved perfect robustness\n(\nS\ntransfer\n=\n1.0\nS_{\\text{transfer}}=1.0\n). The longest transfer durations were observed for\nuntrained colleagues (22.8 s), who encountered the mechanism for the first time. Bachelor and master students achieved similar results (16.1 s and 14.2 s), reflecting comparable familiarity with robotic hardware. Interestingly, experienced colleagues did not obtain the shortest times (17.6 s on average); anonymous feedback indicated that some participants handled the mechanism with excessive caution, slowing down the locking step.\nFigure 7\n:\nTransfer times collected from the target participant groups.\nOverall, the detachable design enables fast, reliable, and intuitive transfer across robotic embodiments. The fact that inexperienced users performed comparably to trained operators highlights the usability of the mechanism and its relevance in scenarios where minimising downtime is critical, such as aerial or industrial manipulation.\nIII-D\nEnergy Efficiency Evaluation\nThe energy efficiency of the gripper was evaluated according to the Energy Consumption Benchmark defined in Sec.\nII-D\n. Measurements were performed across the three phases of the grasp cycle—approach and grasping (\nE\ngrasp\nE_{\\text{grasp}}\n), holding (\nE\nhold10\nE_{\\text{hold10}}\n), and release\n(\nE\nrelease\nE_{\\text{release}}\n)—with\n10\n10\nrepetitions per condition. Instantaneous\nvoltage\nU\n​\n(\nt\n)\nU(t)\nand current\nI\n​\n(\nt\n)\nI(t)\nwere sampled at 0.1 kHz, and electrical\nenergy for each phase was obtained by integrating power over time\n(Eq.\n11\n). Each grasping/releasing phase lasted approximately\n2\n​\ns\n2\\,s\n, corresponding to a stable and repeatable motion profile.\nFig.\n8\nshows the instantaneous power traces for the three phases of the grasp cycle. Distinct power peaks appear at the onset of closing and at the moment of object contact,\nindicating that the actuator draws the most energy during transient motion, while the steady-state holding phase remains energetically minimal due to the self-locking mechanism. During the holding phase, the self-locking mechanism of RGP prevents back-driving and maintains the grasp with minimal current consumption. This results in a normalized holding energy of\nE\nhold10\n≈\n1.5\nE_{\\text{hold10}}\\approx 1.5\nJ (see Tab.\nV\n).\nFigure 8\n:\nInstantaneous electrical power\nP\n​\n(\nt\n)\n=\nU\n​\n(\nt\n)\n​\nI\n​\n(\nt\n)\nP(t)=U(t)I(t)\nmeasured during the grasp cycle. The plot shows the real-time power profile across the closing, holding, and release phases.\nTABLE V\n:\nEvaluation of the reference gripper prototype energy consumption.\nCycle phase\nMean [J]\n95% CI [J]\nGrasping\n2.59\n[2.71, 2.64]\nHolding 10s\n1.5\n[1.5, 1.51]\nReleasing\n1.91\n[1.89, 1.93]\nThe total energy per grasp cycle reached approximately\nE\ncycle\n≈\n6\nE_{\\text{cycle}}\\approx 6\nJ for a 600 g object, yielding an energy-to-weight ratio of\n0.01J/g for the full cycle and\n4.31\n×\n10\n−\n3\n4.31\\times 10^{-3}\nJ/g for the grasping phase alone.\nOverall, the results confirm that the RGP consumes energy primarily\nduring active finger motion, with negligible energy required to maintain\na grasp. This validates the assumptions of Sec.\nII-D\nand demonstrates the suitability of the self-locking design for energy-limited platforms such as UAVs and other mobile manipulators. Such energy characteristics are particularly advantageous for UAV-based manipulation, where even small reductions in holding power can translate into measurable gains in flight endurance.\nIII-E\nIntent-specific Ideal Payload Benchmark\nThe Intent-Specific Ideal Payload Benchmark (IIPB) introduced in Sec.\nII-E\nwas applied to evaluate the gripper under its intended operational conditions. As the proposed design is optimized for lightweight, energy-efficient aerial manipulation, this benchmark quantifies its maximum sustainable load in the preferred grasp configuration.\nThe gripper exhibits compliance primarily in the\nx\nx\n- and\ny\ny\n-axes of the\ngripping plane, with limited compliance in the\nz\nz\n-axis. It predominantly operates in a power–pinch configuration with a reliable grasping range of 40–100 mm, while wrap grasps are used only in rare situations. The key parameters and compliance classification are summarized in Table\nVI\n.\nTABLE VI\n:\nReference gripper prototype parameters and options.\nGripper Parameter\nOption\nCode\nCompliance Type\nCompliant in 2 main axes\n2S\nPreferred Grip Type\nPinch\nP\nIdeal Object Shape\nBox-type artifacts\nB\nGripping Range\n40–100 mm\n–\nFigure 9\n:\nExperimental setup for the Ideal Payload Benchmark.\nThe measurement procedure follows the slip-resistance protocol in Sec.\nII-B\n,\nadapted for payload evaluation. Three box-type artifacts with gripping surface distances of 50 mm, 75 mm, and 100 mm were tested. One side of the artifact was grasped by the RGP, while the opposite side was attached to a calibrated 100 N force sensor. During each trial, the robotic arm moved vertically upward at 150 mm/min until slip or detachment occurred. The maximum recorded pulling force corresponds to the ideal payload as\ndefined in Eq.\n13\n, where\nF\npull\nF_{\\text{pull}}\ndenotes the externally applied tangential force.\nEach measurement was repeated\n10\n10\ntimes for each artifact size, and the\nresulting ideal payload distributions are shown in Fig.\n9\nand summarised in Table\nVII\nusing the unified statistical convention (median, interquartile range, and 95% bootstrap confidence intervals). The highest payload was achieved for the mid-range artifact (75 mm), while the reduced\nload capacity for the 100 mm artifact is consistent with lower normal pressure,\nincreased pad deformation at wide openings and non-constant force output throughout the stroke.\nTABLE VII\n:\nEvaluation of ideal maximum load.\nArtifact [mm]\nIdeal Max Load [N]\n95% CI [N]\n50\n11.37\n[11.06, 11.69]\n75\n11.99\n[11.59, 12.38]\n100\n7.67\n[7.22, 8.11]\nThe IIPB results demonstrate reliable grasping across the RGP’s operational range, confirming its suitability for aerial and mobile tasks that prioritise robustness, energy efficiency, and moderate payload capacity. The IIPB benchmark therefore provides a concise descriptor of a gripper’s intended capability, complementing platform-agnostic metrics such as YCB and NIST with task-specific operational insight.\nIV\nConclusion and Future Work\nThis letter presented the Cross-Embodiment Gripper Benchmark, a reproducible framework that extends YCB and NIST protocols with embodiment-transfer, energy-aware, and intent-specific payload metrics. Using a lightweight self-locking reference gripper prototype, we experimentally validated the framework and demonstrated rapid transferability (\n≈\n17.6\n​\ns\n\\approx 17.6\\,\\text{s}\n, 100% success), high holding efficiency (\n≈\n1.5\n​\nJ\n/\n10\n​\ns\n\\approx 1.5\\,\\text{J}/10\\,\\text{s}\n), and consistent grasp performance (object dependent NIST cycle time\n≈\n3.2\n​\n–\n​\n3.9\n​\ns\n\\approx 3.2\\,\\text{–}\\,3.9\\,\\text{s}\n).\nCEGB enables standardized cross-platform comparison of grippers and supports transparent evaluation of mechanical, energetic, and usability-related characteristics across heterogeneous robotic embodiments. Future work will focus on automating the benchmark procedures, extending the evaluations to dynamic aerial and mobile scenarios, and supporting broader community adoption to further advance reproducible, energy-aware, and platform-agnostic benchmarking.\nACKNOWLEDGMENT\nThis work is supported by EUROBIN, the European Robotics and AI Network (Grant agreement 101070596), funded by the European Commission.",
    "preview_text": "Robotic grippers are increasingly deployed across industrial, collaborative, and aerial platforms, where each embodiment imposes distinct mechanical, energetic, and operational constraints. Established YCB and NIST benchmarks quantify grasp success, force, or timing on a single platform, but do not evaluate cross-embodiment transferability or energy-aware performance, capabilities essential for modern mobile and aerial manipulation. This letter introduces the Cross-Embodiment Gripper Benchmark (CEGB), a compact and reproducible benchmarking suite extending YCB and selected NIST metrics with three additional components: a transfer-time benchmark measuring the practical effort required to exchange embodiments, an energy-consumption benchmark evaluating grasping and holding efficiency, and an intent-specific ideal payload assessment reflecting design-dependent operational capability. Together, these metrics characterize both grasp performance and the suitability of reusing a single gripper across heterogeneous robotic systems. A lightweight self-locking gripper prototype is implemented as a reference case. Experiments demonstrate rapid embodiment transfer (median ~= 17.6 s across user groups), low holding energy for gripper prototype (~= 1.5 J per 10 s), and consistent grasp performance with cycle times of 3.2 - 3.9 s and success rates exceeding 90%. CEGB thus provides a reproducible foundation for cross-platform, energy-aware evaluation of grippers in aerial and manipulators domains.\n\nA Cross-Embodiment Gripper Benchmark for Rigid-Object Manipulation in Aerial and Industrial Robotics\nMarek Vagas\n1\n, Martin Varga\n1\n, Jaroslav Romancik\n1\n, Ondrej Majercak\n1\n, Alejandro Suarez\n2\n, Anibal Ollero\n2\n,Bram Vanderborght\n3\n, and Ivan Virgala\n1\n*This work is supported by the European ROBotics and AI Network (euROBIN, Grant agreement ID: 101070596) project funded by the European Commission\n1\nMarek Vagas, Martin Varga, Jaroslav Romancik, Ondrej Majercak and Ivan Virgala are with ",
    "is_relevant": null,
    "relevance_score": 0.0,
    "extracted_keywords": [],
    "one_line_summary": "",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "published_date": "2025-12-01T12:17:56Z",
    "created_at": "2026-01-08T10:08:08.612660",
    "updated_at": "2026-01-08T10:08:08.612669",
    "flag": true
}