{
    "id": "2512.01218v1",
    "title": "How do trout regulate patterns of muscle contraction to optimize propulsive efficiency during steady swimming",
    "authors": [
        "Tao Li",
        "Chunze Zhang",
        "Weiwei Yao",
        "Junzhao He",
        "Ji Hou",
        "Qin Zhou",
        "Lu Zhang"
    ],
    "abstract": "理解鱼类高效游动机制可为生物力学、流体动力学及工程学领域提供重要启示。传统研究常忽略神经肌肉控制与全身运动之间的关联。为探究鲹科模式游动中的能量传递机制，我们构建了仿生数字鳟鱼模型。该模型融合多体动力学、希尔型肌肉建模及高精度流固耦合算法，精确复现了真实鳟鱼的形态与物理特性。通过深度强化学习，鳟鱼神经系统实现了肌肉激活的层级化时空控制。我们系统研究了激活策略对游速与能耗的影响，结果显示：轴向肌节耦合（激活范围跨越0.5个身长）对稳定体波传播至关重要；适中的肌肉收缩时长（占摆尾周期的[0.1,0.3]）可使身体与流体形成被动阻尼系统，显著降低能耗；此外，肌节激活相位差决定了体波形态，若相位差过大将引发拮抗性收缩从而阻碍推进力。这些发现深化了对仿生运动机制的理解，并为设计高能效水下系统提供了理论依据。",
    "url": "https://arxiv.org/abs/2512.01218v1",
    "html_url": "https://arxiv.org/html/2512.01218v1",
    "html_content": "",
    "preview_text": "Understanding efficient fish locomotion offers insights for biomechanics, fluid dynamics, and engineering. Traditional studies often miss the link between neuromuscular control and whole-body movement. To explore energy transfer in carangiform swimming, we created a bio-inspired digital trout. This model combined multibody dynamics, Hill-type muscle modeling, and a high-fidelity fluid-structure interaction algorithm, accurately replicating a real trout's form and properties. Using deep reinforcement learning, the trout's neural system achieved hierarchical spatiotemporal control of muscle activation. We systematically examined how activation strategies affect speed and energy use. Results show that axial myomere coupling-with activation spanning over 0.5 body lengths-is crucial for stable body wave propagation. Moderate muscle contraction duration ([0.1,0.3] of a tail-beat cycle) lets the body and fluid act as a passive damping system, cutting energy use. Additionally, the activation phase lag of myomeres shapes the body wave; if too large, it causes antagonistic contractions that hinder thrust. These findings advance bio-inspired locomotion understanding and aid energy-efficient underwater system design.",
    "is_relevant": false,
    "relevance_score": 1.0,
    "extracted_keywords": [
        "bio-inspired locomotion",
        "deep reinforcement learning",
        "fluid-structure interaction",
        "energy efficiency",
        "neuromuscular control"
    ],
    "one_line_summary": "该论文通过数字鳟鱼模型和深度强化学习，研究了鳟鱼肌肉收缩策略如何优化游泳推进效率，与视频扩散或多模态生成等关键词无关。",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "published_date": "2025-12-01T02:57:02Z",
    "created_at": "2026-01-10T10:38:36.058153",
    "updated_at": "2026-01-10T10:38:36.058181",
    "flag": true
}