{
  "id": "2512.01897v1",
  "title": "NeuroHJR: Hamilton-Jacobi Reachability-based Obstacle Avoidance in Complex Environments with Physics-Informed Neural Networks",
  "authors": [
    "Granthik Halder",
    "Rudrashis Majumder",
    "Rakshith M R",
    "Rahi Shah",
    "Suresh Sundaram"
  ],
  "abstract": "Autonomous ground vehicles (AGVs) must navigate safely in cluttered environments while accounting for complex dynamics and environmental uncertainty. Hamilton-Jacobi Reachability (HJR) offers formal safety guarantees through the computation of forward and backward reachable sets, but its application is hindered by poor scalability in environments with numerous obstacles. In this paper, we present a novel framework called NeuroHJR that leverages Physics-Informed Neural Networks (PINNs) to approximate the HJR solution for real-time obstacle avoidance. By embedding system dynamics and safety constraints directly into the neural network loss function, our method bypasses the need for grid-based discretization and enables efficient estimation of reachable sets in continuous state spaces. We demonstrate the effectiveness of our approach through simulation results in densely cluttered scenarios, showing that it achieves safety performance comparable to that of classical HJR solvers while significantly reducing the computational cost. This work provides a new step toward real-time, scalable deployment of reachability-based obstacle avoidance in robotics.",
  "url": "https://arxiv.org/abs/2512.01897v1",
  "html_url": "https://arxiv.org/html/2512.01897v1",
  "html_content": "NeuroHJR: Hamilton-Jacobi Reachability-based Obstacle Avoidance in Complex Environments with Physics-Informed Neural Networks\nGranthik Halder\n1#\n, Rudrashis Majumder\n2∗#\n, Rakshith M R\n3\n,\nRahi Shah\n4\nand Suresh Sundaram\n3\n∗\nCorresponding Author\n#\nEqual Contribution\n1\nGranthik Halder from the Department of Physical Science, Indian Institute of Science Education and Research, Kolkata, India, has worked as a Research Intern with the Department of Aerospace Engineering, Indian Institute of Science, Bangalore, India.\ngh23ms065@iiserkol.ac.in\n2\nRudrashis Majumder is with the Department of Computer Science and Engineering, Shiv Nadar University, Chennai, India\nrudrashism@snuchennai.edu.in\n3\nM R Rakshith and Suresh Sundaram are with the Department of Aerospace Engineering, Indian Institute of Science, Bangalore 560012,\nKarnataka, India\nmrrakshith.iisc@gmail.com, vssuresh@iisc.ac.in\n4\nRahi Shah from the Department of Computer Science Engineering, Ahmedabad University, India, has worked as a Research Intern with the Department of Aerospace Engineering, Indian Institute of Science, Bangalore, India.\nrahi.s@ahduni.edu.in\n.\nAbstract\nAutonomous ground vehicles (AGVs) must navigate safely in cluttered environments while accounting for complex dynamics and environmental uncertainty. Hamilton-Jacobi Reachability (HJR) offers formal safety guarantees through the computation of forward and backward reachable sets, but its application is hindered by poor scalability in environments with numerous obstacles. In this paper, we present a novel framework called NeuroHJR that leverages Physics-Informed Neural Networks (PINNs) to approximate the HJR solution for real-time obstacle avoidance. By embedding system dynamics and safety constraints directly into the neural network loss function, our method bypasses the need for grid-based discretization and enables efficient estimation of reachable sets in continuous state spaces. We demonstrate the effectiveness of our approach through simulation results in densely cluttered scenarios, showing that it achieves safety performance comparable to that of classical HJR solvers while significantly reducing the computational cost. This work provides a new step toward real-time, scalable deployment of reachability-based obstacle avoidance in robotics.\n1\nIntroduction\nAutonomous ground vehicles (AGVs) are increasingly being deployed in various domains\n[\nhebert2012intelligent\n]\nsuch as logistics, agriculture, and surveillance, where safe and efficient navigation is critical. Crucial to their autonomy is the ability to plan the vehicle’s motion strategically while responding to the surrounding environment. In particular, real-time obstacle avoidance has emerged as a key factor facilitating reliable and safe autonomous navigation\n[\nmoon2010study\n]\n. However, this task requires perception of the environment and timely generation of control actions that respect vehicle dynamics and safety constraints.\nUnmanned ground vehicles (UGVs), in both civilian and military applications, face significant challenges in navigating complex terrains with static and dynamic obstacles. Various obstacle avoidance algorithms have been developed, including Artificial Potential Fields (APF)\n[\nsun2017collision\n]\n, collision cone methods\n[\nxu2020dynamic\n]\n, and Model Predictive Control (MPC)\n[\npark2009obstacle\n]\n. More recently, Control Barrier Functions (CBFs) have gained popularity for their ease of implementation, theoretical safety guarantees, and compatibility with feedback-based control\n[\names2016control\n,\names2019control\n]\n. However, each of these methods has inherent limitations: APF suffers from local minima and instability near dynamic obstacles, collision cone approaches are computationally intensive in densely cluttered environments, and MPC, despite offering optimality, is often too slow for real-time deployment. Although CBFs allow for real-time operation with safety guarantees, they typically offer only myopic safety guarantees and are sensitive to parameter tuning.\nIn contrast, Hamilton-Jacobi Reachability (HJR)\n[\ntomlin2003computational\n,\nherbert2020safe\n]\noffers a rigorous framework for safety-critical planning by computing forward and backward reachable sets that capture all future states leading to unsafe conditions under worst-case scenarios. This makes HJR particularly attractive for obstacle avoidance in densely cluttered environments. Unlike the above-mentioned existing methods, HJR provides global safety guarantees by integrating system dynamics, control constraints, and obstacle geometry into a unified formulation. However, the practical use of HJR is hindered by its poor scalability: its computational cost increases exponentially with the number of obstacles, as each obstacle must be incorporated into the target set representation. This renders traditional HJR solvers infeasible for real-time applications in complex environments.\nIn this work, we propose a Physics-Informed Neural Network (PINN)-based approach\n[\nraissi2019physics\n,\nmajumder2024oa\n,\nmajumder2024safe\n]\n, called NeuroHJR, to approximate the Hamilton-Jacobi Reachability solution for obstacle avoidance in cluttered settings. In a cluttered environment with dense obstacles, Hamilton-Jacobi Reachability (HJR) becomes computationally intensive because each obstacle must be encoded into the level set representation, significantly increasing the complexity of the value function and its evolution. This leads to higher memory usage and longer computation times, especially when using grid-based solvers. Physics-Informed Neural Networks (PINNs) address this challenge by representing the value function continuously without explicit gridding, allowing the model to generalize over complex obstacle configurations. As a result, PINNs enable scalable and efficient approximation of HJR solutions, making real-time obstacle avoidance feasible even in densely cluttered environments. The proposed approach bridges the gap between the formal rigor of reachability analysis and the scalability of learning-based methods. This work demonstrates the effectiveness of the proposed framework in simulated scenarios, showing its potential to maintain real-time safety while significantly reducing computational cost. The main contributions of this work are as follows:\n•\nA novel PINN-based framework is proposed to approximate the Hamilton-Jacobi Reachability (HJR) solution for real-time obstacle avoidance in cluttered environments.\n•\nThe method embeds system dynamics and safety constraints in the training loss, enabling scalable reachability computation without grid-based discretization.\n•\nThe proposed approach handles multiple obstacles efficiently, overcoming the scalability limitations of classical HJR solvers.\n•\nWe demonstrate through simulations that our method achieves safety performance comparable to traditional HJR, while providing much better real-time evaluation.\n•\nAn ablation study is also presented to evaluate the impact of varying sensor radius on the NeuroHJR performance.\nThe remainder of this paper is organized as follows. Section\n2\nintroduces the necessary mathematical preliminaries and outlines the problem formulation. The proposed methodology, NeuroHJR, is detailed in Section\n3\n. Section\n4\npresents simulation results and an ablation study to evaluate the performance of NeuroHJR. Finally, Section\n5\nsummarizes the key findings and discusses directions for future work.\n2\nPreliminaries and Problem Statement\nThis section introduces the preliminary concepts on Hamilton-Jacobi Reachability (HJR) Physics-Informed Neural Networks (PINN). Then, the problem setting addressed in this work is presented, including the system model, obstacle assumptions, and the safety specification to be approximated using a PINN.\n2.1\nHamilton-Jacobi Reachability\nHamilton-Jacobi Reachability (HJR)\n[\ntomlin2003computational\n,\nherbert2020safe\n]\nis a powerful framework for analyzing safety and reachability in dynamical systems. It provides mathematical tools to compute safe sets and optimal control strategies and is particularly effective for obstacle avoidance and safety-critical control problems.\nThe HJR framework is governed by the Hamilton-Jacobi-Bellman (HJB) equation, which describes the evolution of the value function\nV\n​\n(\nx\n,\nt\n)\nV(x,t)\n:\n∂\nV\n∂\nt\n+\nH\n​\n(\nx\n,\n∂\nV\n∂\nx\n)\n\\displaystyle\\frac{\\partial V}{\\partial t}+H\\left(x,\\frac{\\partial V}{\\partial x}\\right)\n=\n0\n\\displaystyle=0\n(1)\nwhere\nV\n​\n(\nx\n,\nT\n)\n=\ng\n​\n(\nx\n)\nV(x,T)=g(x)\n, for some final time\nT\nT\nand the Hamiltonian is defined as\nH\n​\n(\nx\n,\n∂\nV\n∂\nx\n)\n=\nmin\nu\n∈\n𝒰\n⁡\n{\n∂\nV\n∂\nx\n⋅\nf\n​\n(\nx\n,\nu\n)\n}\n\\displaystyle H\\left(x,\\frac{\\partial V}{\\partial x}\\right)=\\min_{u\\in\\mathcal{U}}\\left\\{\\frac{\\partial V}{\\partial x}\\cdot f(x,u)\\right\\}\n(2)\nThe key components include\nV\n​\n(\nx\n,\nt\n)\nV(x,t)\nas the value function representing safety/cost,\ng\n​\n(\nx\n)\ng(x)\nas the terminal condition, and\nH\n​\n(\n⋅\n)\nH(\\cdot)\nas the Hamiltonian function.\n2.1.1\nForward Reachability Set\nThe forward reachable set from the initial set\n𝒮\n0\n\\mathcal{S}_{0}\nat time\nt\nt\nis defined as:\nℛ\nF\n​\n(\nt\n)\n=\n{\nx\n​\n(\nt\n)\n:\nx\n​\n(\n0\n)\n∈\n𝒮\n0\n,\n∃\nu\n​\n(\n⋅\n)\n}\n\\displaystyle\\mathcal{R}_{F}(t)=\\{x(t):x(0)\\in\\mathcal{S}_{0},\\exists u(\\cdot)\\}\n(3)\nThis represents the set of all states reachable from\n𝒮\n0\n\\mathcal{S}_{0}\nwithin time\nt\nt\n, where control tries to maximize reachability and disturbance tries to minimize reachability.\nThe HJB formulation for forward reachability is as follows:\n∂\nV\nF\n∂\nt\n+\nmin\nu\n∈\n𝒰\n⁡\n{\n∂\nV\nF\n∂\nx\n⋅\nf\n​\n(\nx\n,\nu\n)\n}\n\\displaystyle\\frac{\\partial V_{F}}{\\partial t}+\\min_{u\\in\\mathcal{U}}\\left\\{\\frac{\\partial V_{F}}{\\partial x}\\cdot f(x,u)\\right\\}\n=\n0\n\\displaystyle=0\n(4)\nwhere\n,\nV\nF\n​\n(\nx\n,\n0\n)\n\\displaystyle\\textnormal{where},\\quad V_{F}(x,0)\n=\nmin\n⁡\n{\n‖\nx\n−\ny\n‖\n:\ny\n∈\n𝒮\n0\n}\n\\displaystyle=\\min\\{\\|x-y\\|:y\\in\\mathcal{S}_{0}\\}\n(5)\n2.1.2\nBackward Reachability Set\nThe backward reachable set for the target set\n𝒯\n\\mathcal{T}\nat time\nt\nt\nis defined as:\nℛ\nB\n​\n(\nt\n)\n=\n{\nx\n​\n(\n0\n)\n:\nx\n​\n(\nT\n)\n∈\n𝒯\n,\n∃\nu\n​\n(\n⋅\n)\n}\n\\displaystyle\\mathcal{R}_{B}(t)=\\{x(0):x(T)\\in\\mathcal{T},\\exists u(\\cdot)\\}\n(6)\nThis represents the set of all initial states that can reach\n𝒯\n\\mathcal{T}\nwithin time\nT\n−\nt\nT-t\n, where the control tries to ensure that the target is reached, and the disturbance tries to prevent the target from reaching.\nThe HJB formulation for backward reachability is:\n∂\nV\nB\n∂\nt\n+\nmin\nu\n∈\n𝒰\n⁡\n{\n∂\nV\nB\n∂\nx\n⋅\nf\n​\n(\nx\n,\nu\n)\n}\n\\displaystyle\\frac{\\partial V_{B}}{\\partial t}+\\min_{u\\in\\mathcal{U}}\\left\\{\\frac{\\partial V_{B}}{\\partial x}\\cdot f(x,u)\\right\\}\n=\n0\n\\displaystyle=0\n(7)\nwhere\n,\nV\nB\n​\n(\nx\n,\nT\n)\n\\displaystyle\\textnormal{where},\\quad V_{B}(x,T)\n=\nmin\n⁡\n{\n‖\nx\n−\ny\n‖\n:\ny\n∈\n𝒯\n}\n\\displaystyle=\\min\\{\\|x-y\\|:y\\in\\mathcal{T}\\}\n(8)\nFor obstacle avoidance, both approaches are combined using a composite value function:\nV\n​\n(\nx\n,\nt\n)\n=\nmax\n⁡\n{\nV\nF\n​\n(\nx\n,\nt\n)\n,\n−\nV\nB\n​\n(\nx\n,\nt\n)\n}\n\\displaystyle V(x,t)=\\max\\{V_{F}(x,t),-V_{B}(x,t)\\}\n(9)\nA trajectory is safe if\nV\n​\n(\nx\n​\n(\nt\n)\n,\nt\n)\n≥\n0\nV(x(t),t)\\geq 0\nfor all\nt\n∈\n[\n0\n,\nT\n]\nt\\in[0,T]\n.\n2.2\nPhysics-Informed Neural Networks\nPhysics-Informed Neural Networks (PINNs)\n[\nraissi2019physics\n]\nintegrate neural networks with physical laws, typically in the form of partial differential equations (PDEs), to constrain learning and produce solutions that satisfy the governing equations of the system\n[\nraissi2019physics\n]\n. Unlike purely data-driven models, PINNs incorporate prior knowledge of system dynamics, enabling accurate and physically consistent predictions even in regions with sparse or noisy data. Let a physical system be described by a PDE of the form\n𝒩\n​\n[\nu\n​\n(\n𝐱\n,\nt\n)\n]\n=\n0\n,\n𝐱\n∈\nΩ\n,\nt\n∈\n[\n0\n,\nT\n]\n,\n\\mathcal{N}[u(\\mathbf{x},t)]=0,\\quad\\mathbf{x}\\in\\Omega,\\;t\\in[0,T],\n(10)\nwhere\n𝒩\n​\n[\n⋅\n]\n\\mathcal{N}[\\cdot]\nis a nonlinear differential operator, and\nu\n​\n(\n𝐱\n,\nt\n)\nu(\\mathbf{x},t)\nis the unknown solution. A PINN approximates\nu\n​\n(\n𝐱\n,\nt\n)\nu(\\mathbf{x},t)\nusing a neural network\nu\nθ\n​\n(\n𝐱\n,\nt\n)\nu_{\\theta}(\\mathbf{x},t)\nwith trainable parameters\nθ\n\\theta\n, and incorporates the PDE residual directly into the loss function\n[\nmajumder2024oa\n,\nmajumder2024safe\n]\n. The total loss typically takes the form of\nℒ\n​\n(\nθ\n)\n=\nλ\nd\n​\na\n​\nt\n​\na\n​\nℒ\ndata\n+\nλ\np\n​\nh\n​\ny\n​\ns\n​\ni\n​\nc\n​\ns\n​\nℒ\nPDE\n,\n\\mathcal{L}(\\theta)=\\lambda_{data}\\mathcal{L}_{\\text{data}}+\\lambda_{physics}\\mathcal{L}_{\\text{PDE}},\n(11)\nwhere\nℒ\ndata\n\\mathcal{L}_{\\text{data}}\nenforces agreement with available measurements, and\nℒ\nPDE\n=\n‖\n𝒩\n​\n[\nu\nθ\n​\n(\n𝐱\n,\nt\n)\n]\n‖\n2\n\\mathcal{L}_{\\text{PDE}}=\\left\\|\\mathcal{N}[u_{\\theta}(\\mathbf{x},t)]\\right\\|^{2}\npenalizes deviations from the governing physics. This physics-informed training paradigm enables the network to infer solutions that are consistent with both observed data and the underlying physical principles, making PINNs particularly effective for solving forward and inverse problems in scenarios with limited or noisy data.\nIn our work, we utilize the PINN to solve the time-invariant (steady-state) form of the HJB equation for obstacle avoidance in cluttered environments, where the network simultaneously learns the optimal control policy and the value function for safe navigation.\n2.3\nProblem Definition\nA single UGV is considered to study the efficacy of the proposed NeuroHJR approach for an obstacle avoidance problem. The area for the UGV movement is considered with specific start and goal locations, and several cylindrical obstacles. The vehicle is expected to successfully reach the goal location without colliding with any of the obstacles. The UGV is assumed to reach the goal once its distance from the goal is less than a specific threshold value.\nTo explain the idea mathematically, let\nd\n=\n‖\np\nu\n​\ng\n​\nv\n​\n(\nt\n)\n−\np\no\n​\nb\n​\ns\n​\n(\nt\n)\n‖\n=\n(\nx\n−\nx\no\n)\n2\n+\n(\ny\n−\ny\no\n)\n2\nd=||p_{ugv}(t)-p_{obs}(t)||=\\sqrt{(x-x_{o})^{2}+(y-y_{o})^{2}}\n(12)\nbe the distance between the UGV and any obstacle located at coordinate\n(\nx\no\n,\ny\no\n)\n(x_{o},y_{o})\n. For safe path planning of UGVs,\nd\n>\nd\nt\n​\nh\n​\nr\n​\ne\n​\ns\n​\nh\n​\no\n​\nl\n​\nd\nd>d_{threshold}\nis required, be it a static or a dynamic obstacle in the environment. However, avoiding obstacles is not the only concern of a successful mission. After starting the journey, the UGV should reach the goal in a finite amount of time. Therefore, it is expected that\n‖\np\nu\n​\ng\n​\nv\n​\n(\nt\n)\n−\np\ng\n​\no\n​\na\n​\nl\n​\n(\nt\n)\n‖\n→\n0\n||p_{ugv}(t)-p_{goal}(t)||\\rightarrow 0\n(13)\noccurs at some finite time\nt\n=\nT\nt=T\n.\n2.3.1\nSystem Model\nWe consider velocity-controlled UGV for obstacle avoidance represented by a holonomic first-order model as\nx\n˙\n​\n(\nt\n)\n=\nu\n​\n(\nt\n)\n\\dot{\\textbf{x}}(t)=\\textbf{u}(t)\n(14)\nwhere\nx\n=\n[\nP\nx\n,\nP\ny\n]\n\\textbf{x}=[P_{x},P_{y}]\nrepresents the position of the UGV on the ground and\nu\n=\n[\nu\nx\n,\nu\ny\n]\n\\textbf{u}=[u_{x},u_{y}]\nis the respective velocity that acts as a control input. Being a ground vehicle, its motion is considered in a two-dimensional environment.\n3\nNeuroHJR Methodology\nIn this section, we present the formulation of NeuroHJR, our proposed PINN-based framework for approximating Hamilton-Jacobi Reachability (HJR) solutions in the context of obstacle avoidance. The approach embeds the system dynamics and safety constraints into the loss function of a neural network, enabling continuous and scalable approximation of the value function without relying on discretized grids. We begin by formulating the PDE for the HJR problem, followed by the design of the PINN architecture and training strategy.\n3.1\nPDE for Hamilton Jacobi Reachability\nThe value function\nV\n​\n(\nx\n,\nt\n)\nV(x,t)\nis the cornerstone of Hamilton-Jacobi reachability and serves as the mathematical foundation for our approach. The value function represents:\nV\n​\n(\nx\n,\nt\n)\n=\nmin\nu\n​\n(\n⋅\n)\n⁡\nJ\n​\n(\nx\n,\nt\n,\nu\n)\nV(x,t)=\\min_{u(\\cdot)}J(x,t,u)\n(15)\nwhere\nJ\nJ\nrepresents the cost-to-go from state\nx\nx\nat time\nt\nt\n. We employ a composite value function constructed from both the forward and backward reachable sets, as defined in Equation (\n9\n).\nIn the context of our obstacle avoidance problem, the state variables\n(\nx\n,\ny\n)\n(x,y)\nin the HJB equation correspond to the UGV’s position coordinates\n(\nP\nx\n,\nP\ny\n)\n(P_{x},P_{y})\n. For optimal control problems, the value function satisfies the Hamilton-Jacobi-Bellman (HJB) equation:\n∂\nV\n∂\nt\n+\nmin\nu\n∈\n𝒰\n⁡\n{\n∂\nV\n∂\nP\nx\n​\nf\nx\n​\n(\nP\nx\n,\nP\ny\n,\nu\n)\n+\n∂\nV\n∂\nP\ny\n​\nf\ny\n​\n(\nP\nx\n,\nP\ny\n,\nu\n)\n}\n=\n0\n\\frac{\\partial V}{\\partial t}+\\min_{u\\in\\mathcal{U}}\\left\\{\\frac{\\partial V}{\\partial P_{x}}f_{x}(P_{x},P_{y},u)+\\frac{\\partial V}{\\partial P_{y}}f_{y}(P_{x},P_{y},u)\\right\\}=0\n(16)\nwhich represents an expanded form of the general HJB equation presented in Equation (\n1\n).\nFor our system with robot dynamics\nf\nx\n=\nu\nx\nf_{x}=u_{x}\nand\nf\ny\n=\nu\ny\nf_{y}=u_{y}\nas defined in Equation (\n14\n), the HJB equation becomes:\n∂\nV\n∂\nt\n+\nmin\nu\nx\n,\nu\ny\n⁡\n{\n∂\nV\n∂\nP\nx\n​\nu\nx\n+\n∂\nV\n∂\nP\ny\n​\nu\ny\n}\n=\n0\n\\frac{\\partial V}{\\partial t}+\\min_{u_{x},u_{y}}\\left\\{\\frac{\\partial V}{\\partial P_{x}}u_{x}+\\frac{\\partial V}{\\partial P_{y}}u_{y}\\right\\}=0\n(17)\nIn our case, since the starting position, goal position, and obstacle configuration remain static, the problem is time-invariant. Therefore, we consider the steady-state case where\n∂\nV\n∂\nt\n=\n0\n\\frac{\\partial V}{\\partial t}=0\n:\nmin\nu\nx\n,\nu\ny\n⁡\n{\n∂\nV\n∂\nP\nx\n​\nu\nx\n+\n∂\nV\n∂\nP\ny\n​\nu\ny\n}\n=\n0\n\\min_{u_{x},u_{y}}\\left\\{\\frac{\\partial V}{\\partial P_{x}}u_{x}+\\frac{\\partial V}{\\partial P_{y}}u_{y}\\right\\}=0\n(18)\nWe now proceed to solve this PDE using NeuroHJR.\nFigure 1\n:\nNeuroHJR Architecture\n3.2\nNeuroHJR Architecture\nIn NeuroHJR, the Physics-Informed Neural Network (PINN) consists of a carefully designed network structure optimized to solve the Hamilton-Jacobi-Bellman equation, as shown in Fig.\n1\n. The network takes a 2D input\n(\nP\nx\n,\nP\ny\n)\n∈\nℝ\n2\n(P_{x},P_{y})\\in\\mathbb{R}^{2}\n, representing position coordinates at each time step\nΔ\n​\nt\n=\n0.1\n\\Delta t=0.1\nsecond and processes it through 3 hidden layers with 128 neurons each, using\ntanh\n\\tanh\nactivation functions. The architecture then branches into two output heads: a control head with\ntanh\n\\tanh\nactivation producing bounded outputs\n(\nu\nx\n,\nu\ny\n)\n(u_{x},u_{y})\n, representing the control inputs (velocities) bounded by\n|\nu\nx\n|\n,\n|\nu\ny\n|\n≤\n1\n|u_{x}|,|u_{y}|\\leq 1\n, and a value head with linear activation producing an unbounded scalar output\nV\n∈\nℝ\nV\\in\\mathbb{R}\n.\nThe mathematical representation of the network is:\nNeuroHJR\n:\n(\nP\nx\n,\nP\ny\n)\n↦\n(\nu\nx\n,\nu\ny\n,\nV\n)\n\\text{NeuroHJR}:(P_{x},P_{y})\\mapsto(u_{x},u_{y},V)\nwhere the network learns both the optimal control policy and value function simultaneously. NeuroHJR uses automatic differentiation to compute the value function gradients:\n∂\nV\n∂\nP\nx\n=\n∂\nV\nNN\n​\n(\nP\nx\n,\nP\ny\n;\nθ\n)\n∂\nP\nx\n,\n∂\nV\n∂\nP\ny\n=\n∂\nV\nNN\n​\n(\nP\nx\n,\nP\ny\n;\nθ\n)\n∂\nP\ny\n\\frac{\\partial V}{\\partial P_{x}}=\\frac{\\partial V_{\\text{NN}}(P_{x},P_{y};\\theta)}{\\partial P_{x}},\\quad\\frac{\\partial V}{\\partial P_{y}}=\\frac{\\partial V_{\\text{NN}}(P_{x},P_{y};\\theta)}{\\partial P_{y}}\n(19)\nwhere\nθ\n\\theta\nrepresents the neural network parameters.\n3.3\nTraining and Loss Function\nThe training process of NeuroHJR involves minimizing a loss function that incorporates governing physical laws and observational data. This is achieved by using collocation points, which are strategically chosen locations within the domain where the PDE residual is enforced to be approximately zero, ensuring that the solution satisfies the equation at those points. The training data collocation points are generated by sampling\nN\nc\n=\n8000\nN_{c}=8000\nrandom points from the safe region\n𝒮\n\\mathcal{S}\n, along with\nN\nb\n=\n5000\nN_{b}=5000\npoints concentrated near obstacle boundaries to improve boundary resolution. This approach offers two key advantages: (1) it naturally handles complex obstacle shapes due to its flexible geometric formulation, and (2) it achieves computational efficiency through parallel evaluation at all spatial points. The model is trained using the Adam optimizer with a learning rate of\nα\n=\n0.001\n\\alpha=0.001\n, for a total of\nE\n=\n10000\nE=10000\nepochs.\nThe total loss function is composed of four components:\nℒ\ntotal\n=\nℒ\nPDE\n+\nℒ\nvalue\n+\nℒ\nobstacle\n+\nℒ\ngoal\n\\mathcal{L}_{\\text{total}}=\\mathcal{L}_{\\text{PDE}}+\\mathcal{L}_{\\text{value}}+\\mathcal{L}_{\\text{obstacle}}+\\mathcal{L}_{\\text{goal}}\n(20)\nEach of the components is defined as follows.\n3.3.1\nPDE Residual Loss\nThis is the most critical component that enforces the HJB equation:\nℒ\nPDE\n=\n1\nN\n​\n∑\ni\n=\n1\nN\n(\n∂\nV\n∂\nP\nx\n​\nu\nx\n(\ni\n)\n+\n∂\nV\n∂\nP\ny\n​\nu\ny\n(\ni\n)\n)\n2\n\\mathcal{L}_{\\text{PDE}}=\\frac{1}{N}\\sum_{i=1}^{N}\\left(\\frac{\\partial V}{\\partial P_{x}}u_{x}^{(i)}+\\frac{\\partial V}{\\partial P_{y}}u_{y}^{(i)}\\right)^{2}\n(21)\nwhere\n(\nP\nx\n(\ni\n)\n,\nP\ny\n(\ni\n)\n)\n(P_{x}^{(i)},P_{y}^{(i)})\nare the\ni\ni\n-th collocation points,\nu\nx\n(\ni\n)\n,\nu\ny\n(\ni\n)\nu_{x}^{(i)},u_{y}^{(i)}\nare PINN-predicted controls, and\n∂\nV\n∂\nP\nx\n,\n∂\nV\n∂\nP\ny\n\\frac{\\partial V}{\\partial P_{x}},\\frac{\\partial V}{\\partial P_{y}}\nare given by Equation (\n19\n). This loss ensures that the learned control policy minimizes the Hamiltonian, effectively solving the HJB PDE at each collocation point.\n3.3.2\nValue Function Loss\nℒ\nvalue\n=\n1\nN\n​\n∑\ni\n=\n1\nN\n(\nV\npred\n(\ni\n)\n−\nV\ntrue\n(\ni\n)\n)\n2\n\\mathcal{L}_{\\text{value}}=\\frac{1}{N}\\sum_{i=1}^{N}\\left(V_{\\text{pred}}^{(i)}-V_{\\text{true}}^{(i)}\\right)^{2}\n(22)\nwhere the\nV\npred\nV_{\\text{pred}}\nis the value function predicted by the neural network and\nV\ntrue\nV_{\\text{true}}\nis the value function computed using forward and backward reachability sets, given by Equation (\n9\n). This loss ensures the neural network accurately predicts the value function by minimizing the mean squared error between predicted and ground truth values.\n3.3.3\nObstacle Avoidance Loss\nℒ\nobstacle\n=\n1\nN\n​\n∑\ni\n=\n1\nN\n(\nmax\n⁡\n(\n0\n,\nR\nd\n−\nd\ni\n)\n)\n2\n\\mathcal{L}_{\\text{obstacle}}=\\frac{1}{N}\\sum_{i=1}^{N}\\left(\\max(0,R_{d}-d_{i})\\right)^{2}\n(23)\nwhere\nd\ni\n=\n(\nP\nx\n(\ni\n)\n−\nx\no\n)\n2\n+\n(\nP\ny\n(\ni\n)\n−\ny\no\n)\n2\nd_{i}=\\sqrt{(P_{x}^{(i)}-x_{o})^{2}+(P_{y}^{(i)}-y_{o})^{2}}\nis the distance from point\ni\ni\nto the obstacle center and\nR\nd\nR_{d}\nrepresents the radius of the entire unsafe region, which is the original obstacle radius\nR\nR\nplus a safety margin\nδ\n\\delta\n. This loss penalizes the network when it predicts trajectories that come too close to obstacles by applying a penalty proportional to the square of the distance violation within the radius of the unsafe zone.\n3.3.4\nGoal Convergence Loss\nℒ\ngoal\n=\n−\n1\nN\n​\n∑\ni\n=\n1\nN\n⟨\nu\n→\n(\ni\n)\n,\nr\n→\ngoal\n(\ni\n)\n⟩\n\\mathcal{L}_{\\text{goal}}=-\\frac{1}{N}\\sum_{i=1}^{N}\\left\\langle\\vec{u}^{(i)},\\vec{r}_{\\text{goal}}^{(i)}\\right\\rangle\n(24)\nThis loss encourages alignment between the control vector\nu\n→\n(\ni\n)\n=\n(\nu\nx\n(\ni\n)\n,\nu\ny\n(\ni\n)\n)\n\\vec{u}^{(i)}=(u_{x}^{(i)},u_{y}^{(i)})\nand the unit direction vector toward the goal\nr\n→\ngoal\n(\ni\n)\n=\n⟨\nx\ng\n−\nP\nx\n(\ni\n)\n,\ny\ng\n−\nP\ny\n(\ni\n)\n⟩\n‖\n(\nx\ng\n−\nP\nx\n(\ni\n)\n,\ny\ng\n−\nP\ny\n(\ni\n)\n)\n‖\n\\vec{r}^{(i)}_{\\text{goal}}=\\frac{\\langle x_{g}-P_{x}^{(i)},y_{g}-P_{y}^{(i)}\\rangle}{\\|(x_{g}-P_{x}^{(i)},y_{g}-P_{y}^{(i)})\\|}\n, where\n(\nx\ng\n,\ny\ng\n)\n(x_{g},y_{g})\nis the goal position and\n∥\nx\ng\n−\nP\nx\n(\ni\n)\n,\ny\ng\n−\nP\ny\n(\ni\n)\n∥\n=\n(\nx\ng\n−\nP\nx\n(\ni\n)\n)\n2\n+\n(\ny\ng\n−\nP\ny\n(\ni\n)\n)\n2\n\\|x_{g}-P_{x}^{(i)},y_{g}-P_{y}^{(i)}\\|=\\sqrt{(x_{g}-P_{x}^{(i)})^{2}+(y_{g}-P_{y}^{(i)})^{2}}\n, by maximizing their dot product\n⟨\nu\n→\n,\nr\n→\ngoal\n⟩\n>\n0\n\\langle\\vec{u},\\vec{r}_{\\text{goal}}\\rangle>0\n. The negative sign ensures that maximizing alignment corresponds to minimizing the loss.\nThe vehicle initially follows a straight-line path to the goal using linear motion. Upon sensing an obstacle, it switches to NeuroHJR-generated control to avoid collision, then resumes the shortest path toward the goal. This behavior is illustrated in the next section.\n(a)\nCluttered Environment 1\n(b)\nCluttered Environment 2\nFigure 2\n:\nObstacle avoidance using NeuroHJR\n(a)\nScenario 1\n(b)\nScenario 2\n(c)\nScenario 3\nFigure 3\n:\nTrajectory Comparison: NeuroHJR vs Conventional HJR\n4\nPerformance Evaluation\nIn this section, we provide the results for the evaluation of NeuroHJR using Python simulations.\n4.1\nNumerical Simulations\nThe proposed NeuroHJR framework was evaluated through comprehensive numerical simulations in cluttered environments. The simulation parameters are configured as follows: the system operates within a 45\nm\n× 45\nm\n, the robot starts at position\n(\nx\ns\n,\ny\ns\n)\n=\n(\n1\n,\n1\n)\n(x_{s},y_{s})=(1,1)\n, with the goal located at\n(\nx\ng\n,\ny\ng\n)\n=\n(\n40\n,\n40\n)\n(x_{g},y_{g})=(40,40)\n; ten cylindrical obstacles (circular in 2D from the top view) are randomly placed in the environment, each with a radius of\nR\n=\n2.0\nR=2.0\nmeters; a safety tolerance of\nδ\n=\n1\n\\delta=1\nmeters is applied, defining an unsafe region around each obstacle with an expanded radius\nR\nd\n=\nR\n+\nδ\n=\n3.0\nR_{d}=R+\\delta=3.0\nmeters.\nThe UGV utilizes a sensor range of 5 meters to detect obstacles within its vicinity and triggers the NeuroHJR-based avoidance control when it is on the verge of entering any unsafe region around the obstacle. Fig.\n2(a)\nand\n2(b)\nshow the trajectories of the UGV in two different environments from the starting to the goal locations while avoiding obstacles. These simulation results validate that the NeuroHJR framework can effectively solve complex navigation problems in cluttered environments.\n4.2\nBaseline Comparison\nA comprehensive performance comparison was conducted between the proposed novel NeuroHJR method and the conventional HJR solver-based approach. The evaluation considers both computational efficiency and path optimization characteristics as the performance metrics. The comparison of the respective trajectories in three different scenarios are shown in Fig.\n3(a)\n-\n3(c)\n.\nScenario\nNeuroHJR (s)\nConventional HJR (s)\nTravel Time Reduction (%)\nScenario 1\n44.9\n59.3\n24.3\nScenario 2\n77.3\n105.4\n26.7\nScenario 3\n54.7\n70.8\n22.8\nAverage\n-\n-\n24.6\nTable 1\n:\nComputational Speed Comparison\nThe results in Table\n1\nfor 50 Monte Carlo runs demonstrate that NeuroHJR consistently outperforms the conventional HJR approach, achieving a reduction of 24.6% in travel time of the UGV across all the tested scenarios, as shown in Fig.\n3(a)\n-\n3(c)\n. The UGV following the conventional HJR approach requires significantly more time to reach the goal compared to NeuroHJR due to the higher computational burden of the conventional approach.\nScenario\nNeuroHJR (m)\nConventional HJR (m)\nPath Efficiency (%)\nScenario 1\n57.24\n59.10\n3.15\nScenario 2\n100.48\n104.24\n3.61\nScenario 3\n68.89\n70.28\n1.98\nAverage\n-\n-\n2.91\nTable 2\n:\nPath Length Efficiency Comparison\nAs evident from Table\n2\n, the UGV with our proposed NeuroHJR method consistently travels shorter paths compared to conventional approach to reach the goal, as shown in Fig.\n3(a)\n-\n3(c)\n. The average path length reduction is 2.91% with NeuroHJR. While this improvement may appear modest, it represents significant gains in terms of energy efficiency and mission completion time for robotic applications, as observed in Table\n1\n.\n4.3\nAblation Studies\nTo evaluate the impact of sensor radius (\nρ\n\\rho\n) of the UGV on the NeuroHJR performance, ablation studies are conducted with varying sensor detection ranges. The sensor radius directly influences the UGV’s ability to detect obstacles and initiate evasive maneuvers, which affects both trajectory efficiency and safety margins. Each scenario maintains the same environment configuration with ten randomly placed cylindrical obstacles. Three different cases are evaluated to assess the performance of obstacle detection using sensor radii\nρ\n\\rho\n= 3, 5, and 7 meters, respectively. The respective trajectories are shown in Fig.\n4\n.\nFigure 4\n:\nComparison of Trajectories for Different Sensor Radii\nSensor Radius\nTime taken (s)\nPath Length (m)\n3-meter\n80.6\n103.23\n5-meter\n77.3\n100.48\n7-meter\n72.2\n95.36\nTable 3\n:\nAnalysis of Trajectories with Varying Sensor Ranges\nThe Table\n3\nshows how sensor radius affects time and path length in trajectory analysis. As the sensor range increases, there is a noticeable trend where both the time required and the path length traversed tend to decrease. This suggests a trade-off between sensor range, travelling time, and path efficiency. Based on the analysis given in this section, we conclude our study in Section\n5\n.\n5\nConclusions\nIn this work, we introduced NeuroHJR, a novel Physics-Informed Neural Network (PINN) framework designed to approximate Hamilton-Jacobi Reachability (HJR) solutions for obstacle avoidance in cluttered environments. By embedding system dynamics and safety constraints into the loss function, NeuroHJR avoids grid-based discretization and overcomes the scalability limits of conventional HJR solvers. Our simulation results demonstrate that the proposed method achieves safety performance on par with the classical HJR approach while offering a substantial reduction of around 25% in the travel time of the UGV, enabling real-time deployment. NeuroHJR enables the UGV to travel a shorter distance to reach the goal while avoiding obstacles. The ablation study shows how changing the sensor radius affects the overall performance of NeuroHJR. NeuroHJR represents a key step toward combining formal safety guarantees with the scalability of learning-based control. Future work will extend it to higher-dimensional systems and validate it on physical robots in complex environments.",
  "preview_text": "Autonomous ground vehicles (AGVs) must navigate safely in cluttered environments while accounting for complex dynamics and environmental uncertainty. Hamilton-Jacobi Reachability (HJR) offers formal safety guarantees through the computation of forward and backward reachable sets, but its application is hindered by poor scalability in environments with numerous obstacles. In this paper, we present a novel framework called NeuroHJR that leverages Physics-Informed Neural Networks (PINNs) to approximate the HJR solution for real-time obstacle avoidance. By embedding system dynamics and safety constraints directly into the neural network loss function, our method bypasses the need for grid-based discretization and enables efficient estimation of reachable sets in continuous state spaces. We demonstrate the effectiveness of our approach through simulation results in densely cluttered scenarios, showing that it achieves safety performance comparable to that of classical HJR solvers while significantly reducing the computational cost. This work provides a new step toward real-time, scalable deployment of reachability-based obstacle avoidance in robotics.\n\nNeuroHJR: Hamilton-Jacobi Reachability-based Obstacle Avoidance in Complex Environments with Physics-Informed Neural Networks\nGranthik Halder\n1#\n, Rudrashis Majumder\n2∗#\n, Rakshith M R\n3\n,\nRahi Shah\n4\nand Suresh Sundaram\n3\n∗\nCorresponding Author\n#\nEqual Contribution\n1\nGranthik Halder from the Department of Physical Science, Indian Institute of Science Education and Research, Kolkata, India, has worked as a Research Intern with the Department of Aerospace Engineering, Indian Institute of Science, Bangalore, India.\ngh23ms065@iiserkol.ac.in\n2\nRudrashis Majumder is with the Department of Computer Science and Engineering, Shiv Nadar University, Chennai, India\nrudrashism@snuchennai.edu.in\n3\nM R Rakshith and Suresh Sundaram are with the Department of Aerospace Engineering, Indian Institute of Science, Bangalore 560012,\nKarnataka,",
  "is_relevant": false,
  "relevance_score": 1.0,
  "extracted_keywords": [
    "Physics-Informed Neural Networks",
    "real-time obstacle avoidance",
    "Hamilton-Jacobi Reachability",
    "safe navigation",
    "autonomous ground vehicles"
  ],
  "one_line_summary": "该论文提出一种基于物理信息神经网络的哈密顿-雅可比可达性方法，用于复杂环境中的实时避障。",
  "detailed_summary": "",
  "qa_pairs": [],
  "is_hidden": false,
  "is_starred": false,
  "published_date": "2025-12-01T17:18:24Z",
  "created_at": "2026-01-09T09:59:24.221696",
  "updated_at": "2026-01-09T09:59:24.221709"
}