{
    "id": "2601.08485v1",
    "title": "AME-2: Agile and Generalized Legged Locomotion via Attention-Based Neural Map Encoding",
    "authors": [
        "Chong Zhang",
        "Victor Klemm",
        "Fan Yang",
        "Marco Hutter"
    ],
    "abstract": "要在各种地形上实现敏捷且通用的腿式运动，需要感知与控制的紧密集成，尤其是在存在遮挡和立足点稀疏的情况下。现有方法已在跑酷课程中展现出敏捷性，但通常依赖于端到端的感知运动模型，其泛化能力和可解释性有限。相比之下，针对通用运动的方法通常表现出有限的敏捷性，且在视觉遮挡方面存在困难。我们提出了AME-2，这是一个用于敏捷通用运动的统一强化学习框架，它在控制策略中引入了一种新颖的基于注意力的地图编码器。该编码器提取局部和全局地图特征，并利用注意力机制聚焦于显著区域，为基于强化学习的控制生成可解释且泛化性强的嵌入表示。我们进一步提出了一种基于学习的地图构建流程，该流程能够提供快速、不确定性感知的地形表示，对噪声和遮挡具有鲁棒性，并作为策略输入。它使用神经网络将深度观测转换为带有不确定性的局部高程，并与里程计信息融合。该流程还与并行模拟集成，使我们能够通过在线地图构建训练控制器，有助于模拟到现实的迁移。我们在四足和双足机器人上使用所提出的地图构建流程验证了AME-2，所得控制器在模拟和真实世界实验中均展现出强大的敏捷性以及对未见地形的泛化能力。",
    "url": "https://arxiv.org/abs/2601.08485v1",
    "html_url": "https://arxiv.org/html/2601.08485v1",
    "html_content": "AME-2: Agile and Generalized Legged Locomotion via Attention-Based Neural Map Encoding\nChong Zhang\n123∗\n, Victor Klemm\n1\n, Fan Yang\n1\n, Marco Hutter\n1\nWebsite:\nsites.google.com/leggedrobotics.com/ame-2\n1\nRobotic Systems Lab, ETH Zurich, Switzerland\n2\nSecure, Reliable, and Intelligent Systems Lab, ETH Zurich, Switzerland\n3\nETH AI Center, Switzerland\n∗\nCorresponding: chong.zhang@ai.ethz.ch\nAbstract\nAchieving agile and generalized legged locomotion across terrains requires tight integration of perception and control, especially under occlusions and sparse footholds.\nExisting methods have demonstrated agility on parkour courses but often rely on end-to-end sensorimotor models with limited generalization and interpretability. By contrast, methods targeting generalized locomotion typically exhibit limited agility and struggle with visual occlusions.\nWe introduce AME-2, a unified reinforcement learning (RL) framework for agile and generalized locomotion that incorporates a novel attention-based map encoder in the control policy.\nThis encoder extracts local and global mapping features and uses attention mechanisms to focus on salient regions, producing an interpretable and generalized embedding for RL-based control.\nWe further propose a learning-based mapping pipeline that provides fast, uncertainty-aware terrain representations robust to noise and occlusions, serving as policy inputs. It uses neural networks to convert depth observations into local elevations with uncertainties, and fuses them with odometry. The pipeline also integrates with parallel simulation so that we can train controllers with online mapping, aiding sim-to-real transfer.\nWe validate AME-2 with the proposed mapping pipeline on a quadruped and a biped robot, and the resulting controllers demonstrate strong agility and generalization to unseen terrains in simulation and in real-world experiments.\nI\nIntroduction\nAgile and generalized locomotion is essential for legged robots to operate reliably in diverse real-world environments. It requires tightly coupled real-time perception and control, robustness to sensor noise and occlusions, agility through whole-body control, and precise behavior on terrains with sparse footholds. Designing such perceptive locomotion systems that are simultaneously agile and able to generalize across diverse terrains remains a critical challenge.\nClassical pipelines address perceptive locomotion by combining model-based control with explicit mapping and state estimation\n[\n1\n,\n2\n,\n3\n,\n4\n,\n5\n,\n6\n,\n7\n,\n8\n]\n. Typically, they maintain a state estimator\n[\n9\n]\n, build elevation maps from sensor data\n[\n10\n,\n11\n]\n, and use model-based planning and control methods to command the robot based on this mapping information. These approaches have proven effective for deliberate walking and carefully planned maneuvers on moderately structured terrain, where accurate state estimation and dense, slowly changing maps can be maintained. However, their reliance on precise models and often deterministic optimal control makes them sensitive to errors in estimation and mapping, especially under visual occlusions and violations of modeling assumptions\n[\n4\n]\n. Elevation maps are often updated at lower rates than the control loop and heuristically filtered\n[\n11\n,\n2\n,\n4\n]\n, which often requires per-terrain tuning to ensure safety and makes it difficult to obtain a general solution for diverse terrains that demand agile motions. Moreover, the optimization and planning components in these pipelines tend to be computationally heavy, which can limit agility on real robots. These limitations motivate learning-based approaches such as RL that can better exploit raw sensor data, operate under uncertainty, and produce more dynamic behaviors.\nLearning-based methods, in particular RL, have recently shown strong potential for legged locomotion\n[\n12\n]\n. One line of work combines RL with classical state estimation and mapping pipelines, using elevation maps or related representations as policy inputs\n[\n13\n,\n14\n,\n15\n,\n16\n,\n17\n,\n18\n,\n19\n,\n20\n,\n21\n,\n22\n,\n23\n,\n24\n,\n25\n,\n26\n]\n. These methods can improve robustness and generalization compared to purely model-based controllers, but they also inherit the computational cost and failure modes of the underlying estimation and mapping systems\n[\n27\n,\n28\n]\n. In simulation, noise is typically injected into both the state estimates and the mapping observations. A common strategy is to assume a fully observed egocentric map during training and then tune the real-world mapping stack to approximate this assumption\n[\n13\n,\n21\n,\n15\n]\n, which simplifies training but can make performance sensitive when occlusions occur or when agile whole-body contacts violate estimator assumptions. Another strategy is to heavily randomize state-estimation and mapping noise so that the controller becomes robust and conservative under mapping uncertainties in dense terrains\n[\n14\n]\n, yet such policies tend to struggle on terrains that require very high agility or precise foothold placement.\nMore recently, neural network–based mapping has been explored, where networks are trained in simulation to reconstruct maps that can be used as policy inputs\n[\n29\n,\n30\n,\n31\n,\n32\n,\n33\n,\n34\n]\n. While this yields efficient mapping suitable for real-time control, the learned mappings are usually fitted to particular terrain distributions and sensor configurations, offer limited generalization to unseen terrains, and do not explicitly model uncertainties such as occlusions.\nAnother line of work directly maps raw exteroceptive perception and proprioception to actions\n[\n35\n,\n36\n,\n37\n,\n38\n,\n39\n,\n40\n,\n41\n,\n42\n,\n43\n,\n44\n,\n45\n,\n46\n,\n47\n]\n. These sensorimotor policies have demonstrated highly agile behaviors on challenging courses\n[\n36\n,\n38\n,\n42\n]\n, but typically exhibit limited generalization beyond the training environments and offer little interpretability, since terrain reasoning is implicitly encoded in the policy. More recent sensorimotor generalist models\n[\n48\n]\ndistill a single policy from multiple expert controllers to achieve strong performance, yet such methods still show limited generalization to unseen terrains and often require finetuning on new terrains, as evaluated in our benchmarks (Sec.\nVII\n). Overall, existing RL-based approaches tend to trade off agility, generalization, mapping efficiency, and interpretability rather than addressing these requirements within a unified framework.\nFigure 1:\nOur method enables agile and generalized legged locomotion across diverse terrains with onboard sensing and computation.\nIn this work, we present AME-2, a unified RL framework for perceptive legged locomotion with an\nA\nttention-based\nM\nap\nE\nncoding architecture trained jointly with the controller. The AME-2 encoder, built upon the design in\n[\n15\n]\n, first extracts local features (pixel-wise representation of terrain details) and global features (capturing global terrain context) from the elevation map, then uses the global features together with proprioception to assign attention weights to the local features. The resulting weighted local features are concatenated with the global features and proprioception to form a terrain-aware representation for policy learning. This design allows the policy to downweigh local regions that are less relevant for the current task, improving generalization to new terrains. Because the attention is conditioned on global terrain context, the policy can also learn distinct attention and motion patterns across different terrains. To enable learning agile controllers with this representation, we adopt a goal-reaching locomotion formulation from prior works\n[\n20\n,\n26\n,\n49\n,\n40\n,\n32\n,\n50\n]\nand adapt it so that the same reward functions and training settings can be used for different robots. Together, the AME-2 encoder and unified training formulation enable training a single generalist policy with terrain-aware skills, which in our experiments exhibits strong generalization to unseen terrains while maintaining high agility.\nTo enable real-world deployment of agile and generalized locomotion controllers, we develop a learning-based elevation mapping pipeline to remove the dependency on classical mapping stacks while maintaining generalization. The pipeline projects depth images into local grids and uses a lightweight neural network trained via Bayesian learning\n[\n51\n]\nto predict local elevations with per-cell uncertainty estimates. These local maps are fused into a consistent global frame with odometry, providing a fast and uncertainty-aware representation that accounts for occlusions and sensor noise. We then query egocentric elevations and associated uncertainties as the map inputs for the controller. This design is inspired by\n[\n52\n]\n, which fuses per-frame map predictions instead of training temporal networks for off-road navigation, thereby reducing data requirements and mitigating overfitting. Furthermore, we synthesize random terrain data, including many terrains that are not feasible for the robots, to broaden the training distribution for the local map predictor and improve generalization.\nThe same mapping pipeline runs both in parallel simulation and on the real robots, enabling online mapping during training rather than relying on idealized or hand-tuned maps. For training efficiency, we adopt a teacher–student scheme\n[\n48\n,\n53\n]\n: a teacher policy is first trained with ground-truth elevation maps, and a student policy with the same AME-2 architecture is then trained using the proposed mapping under teacher supervision alongside RL. The resulting student policy is directly deployable, operates with the lightweight, uncertainty-aware mapping in the loop, and retains the generalization and agility of the teacher.\nWe evaluate AME-2 on an ANYmal-D quadruped\n[\n54\n]\nand a LimX TRON1 biped\n[\n55\n]\nboth in simulation and on real hardware. As shown in Fig.\n1\n, the resulting controllers exhibit strong agility and robust generalization to a wide range of terrains. The proposed mapping pipeline produces high-quality elevation maps in real time, supporting these agile motions with onboard perception and computation.\nThe main contributions of this work are summarized as follows:\n1.\nWe propose\nAME-2\n, a unified RL framework with an attention-based map encoder to achieve agile and generalized legged locomotion.\n2.\nWe develop a\nlightweight, uncertainty-aware elevation mapping\npipeline that generalizes to diverse terrains, explicitly models occlusions and noise, and helps bridge the sim-to-real gap.\n3.\nWe use a\nteacher-student scheme\nthat yields deployable controllers using the learned mapping while retaining agility, generalization, and interpretability.\n4.\nWe demonstrate a\nstate-of-the-art combination of agility and generalization\nwith a quadruped and a biped robot across diverse challenging terrains under the same training setup.\nII\nRelated Works\nII-A\nPerceptive Locomotion with Explicit Mapping\nEarly explorations of perceptive locomotion use model-based methods with either prebuilt maps or classical online mapping. Most of them first perform foothold or trajectory planning and then apply a model-based tracking controller\n[\n1\n,\n2\n,\n3\n,\n5\n,\n6\n,\n7\n,\n8\n]\n, while some directly optimize a reactive controller over feasible footholds\n[\n4\n]\n. Although these methods offer strong guarantees and can generalize well under their modeling assumptions, their real-world performance is limited by model mismatch, state-estimation uncertainties, mapping errors, and computational burden.\nTo address these limitations, RL emerges as an alternative for perceptive locomotion\n[\n12\n]\n. One line of work keeps a strong model-based component and uses RL mainly as an add-on\n[\n21\n,\n22\n,\n56\n]\n. DTC\n[\n21\n]\naugments a model-based planner with an RL tracking controller to improve robustness while maintaining generalization, but the planner remains sensitive to mapping uncertainties and constrains agility through its modeling assumptions and computational cost. RLOC\n[\n22\n]\ninstead uses a model-based controller to track an RL planner, yet the overall performance is capped by the limitations of the controller.\nOther approaches remove the model-based modules entirely while still relying on explicit maps. When given prebuilt maps, RL controllers can exhibit highly agile motions\n[\n26\n]\n. With classical online mapping, they outperform model-based counterparts in terms of agility and robustness\n[\n13\n,\n14\n,\n15\n,\n16\n,\n17\n,\n18\n,\n19\n,\n23\n,\n24\n]\n, but their agility remains limited by the update rate and quality of the mapping. In addition, many such controllers suffer from generalization issues, as they tend to overfit to the training terrains\n[\n21\n]\n. A recent work\n[\n15\n]\nshows that RL can achieve generalized locomotion across diverse terrains, but its agility is still constrained by the online classical mapping stack and the learning framework.\nMore recently, RL-based methods have begun to use learned maps, where neural networks reconstruct egocentric terrains for the controller in real time\n[\n29\n,\n30\n,\n31\n,\n32\n,\n33\n,\n34\n]\n. These approaches demonstrate strong agility and successful real-world deployment, but the learned maps often fit the training distribution and show limited generalization in unseen, unstructured environments. In contrast, our work combines a fully RL-based controller with a learned mapping module designed for generalization. As a result, our policies achieve agility comparable to previous state of the art while enabling generalized locomotion across diverse terrains.\nII-B\nPerceptive Locomotion with Raw Sensor Data\nPerceptive locomotion with raw sensor data seeks to bypass the limitations of explicit mapping. Instead of constructing and maintaining a map, some works directly train policies from camera images\n[\n35\n,\n36\n,\n37\n,\n38\n,\n39\n,\n41\n,\n44\n,\n46\n,\n42\n,\n43\n,\n45\n,\n47\n]\nor lidar point clouds\n[\n40\n]\n. Early approaches in this direction still separate perception and control: a visual module outputs footholds or trajectories, which are then tracked by model-based controllers\n[\n57\n]\n. Between explicit mapping and fully end-to-end policies, other works learn intermediate representations from raw sensors (such as ray distances\n[\n49\n]\nand neural volumetric memory\n[\n58\n]\n) that remain cheap to compute while enabling fast control.\nMany recent methods adopt a monolithic design, where a single neural network maps raw sensor streams and proprioception directly to joint commands. Within this family, some distill deployable student policies from privileged teacher policies — often using maps as privileged inputs — to achieve efficient and stable learning\n[\n35\n,\n36\n,\n38\n,\n46\n,\n42\n,\n43\n,\n48\n]\n, while others learn from scratch with the help of representation learning techniques such as world models\n[\n44\n]\nor privileged-information reconstruction\n[\n41\n,\n45\n]\n.\nThe current state of the art in agile generalist locomotion\n[\n48\n]\ntrains multiple mapping-based teacher controllers and distills them into a single generalist student policy that operates directly on raw depth images. This student policy combines the skills of the teachers and can be finetuned efficiently on new terrains. However, its zero-shot generalization to previously unseen environments is limited.\nIn contrast, our work also trains neural networks from raw sensor data, but uses them exclusively within the mapping process rather than in a monolithic perception-to-action policy. Because our learned mapping is lightweight and well suited to massive parallelization in simulation, we can run the full mapping loop during training and then deploy exactly the same mapping at test time, preserving both speed and consistency. Without training a monolithic policy that directly maps raw sensor data to joint actions, we still obtain an agile controller while also achieving strong generalization across diverse terrains.\nII-C\nLearning-Based Mapping\nLearning-based mapping aims to retain the structure and interpretability of explicit maps while overcoming the computational and modeling limitations of classical mapping. Classical mapping pipelines combine geometric projection, hand-tuned filtering, and probabilistic fusion to produce high-quality maps, and can handle a wide range of complex terrains\n[\n10\n,\n11\n,\n23\n,\n24\n]\n. However, these methods are often too slow for agile locomotion and require heuristic, terrain-specific filtering to cope with occlusions and sensor noise.\nTo enable faster control, several works directly train terrain reconstruction modules in or after the policy training loop\n[\n29\n,\n30\n,\n31\n,\n32\n,\n33\n,\n34\n]\n. These learned mappings can infer local geometry quickly enough to support agile controllers, but are usually trained on a narrow distribution of environments, showing limited generalization beyond the training terrains.\nRecent off-road navigation approaches take a different route to obtain uncertainty-aware neural mapping with improved accuracy and data efficiency. In particular,\n[\n52\n]\nleverages neural processes\n[\n59\n]\nto model terrain elevation: a network predicts per-frame local elevation maps together with associated uncertainties, which are then fused over time using odometry. By predicting local maps with uncertainty instead of learning a fully end-to-end sensor-to-map model, this approach reduces the data requirements for accurate estimation and improves generalization in complex off-road environments. However, the computational costs of the models in\n[\n52\n]\nare too high (each environment takes\n>\n13\n>13\nGB GPU memory) and cannot be deployed with thousands of parallel simulation environments.\nInspired by these ideas, we design a learning-based elevation mapping module tailored for agile legged locomotion. We project depth-camera point clouds into local elevation grids and train lightweight, robust networks to predict local elevation and its uncertainty from these inputs, which are then fused over time using odometry. This design suppresses sensor noise and naturally models occlusions as regions of high uncertainty. We further improve generalization through extensive randomization in a custom data pipeline. The resulting module is lightweight enough to run in massively parallel simulation and fast enough to support highly agile motions in deployment, while providing an uncertainty-aware terrain representation for our controllers.\nIII\nSystem Overview\nFigure 2:\nAn overview of our system. We use RL to train a teacher policy with ground-truth mapping in simulation, and a student policy under the teacher’s supervision with our proposed neural mapping. The policies output joint-level actions that actuate the robots to reach position and heading goals, as illustrated by the yellow wireframes.\nIII-A\nFormulation\nAs illustrated in Fig.\n2\n, we use RL to train terrain-aware locomotion policies that reach position and heading goals. We formulate the problem as a partially observable Markov decision process (POMDP) and optimize the policies using PPO\n[\n60\n]\nin parallel simulation\n[\n61\n]\n. By maximizing goal-reaching rewards (detailed in Sec.\nIV\n), the policies learn agile locomotion skills that enable them to traverse diverse terrains. We first train a privileged teacher policy and then transfer the skills to a deployable student policy, which is also detailed in Sec.\nIV\n.\nIII-B\nController Inputs and Outputs\nOur controllers run at 50 Hz. The policy actions\na\na\nare joint PD targets\n[\n62\n]\ntracked at 400 Hz on real hardware.\nProprioception observations include base linear velocity\nv\nb\nv_{b}\n(only accessible to the teacher), base angular velocity\nω\nb\n\\omega_{b}\n, projected gravity\ng\nb\ng_{b}\n, joint positions\nq\nq\n, joint velocities\nq\n˙\n\\dot{q}\n, previous actions, and goal commands\nc\nc\n.\nGround-truth mapping represents each point in the egocentric elevation grid by its 3D coordinates\n(\nx\n,\ny\n,\nz\n)\n(x,y,z)\n. Our neural mapping augments this with an uncertainty channel and produces a 4D representation\n(\nx\n,\ny\n,\nz\n,\nu\n)\n(x,y,z,u)\nfor each point, where\nu\nu\nis the uncertainty metric.\nIV\nLocomotion Control\nIV-A\nPolicy Architecture and AME-2 Encoder\nFigure 3:\nAn illustration of our AME-2 policy architecture.\nLeft top:\nThe general abstract of our policies. Proprioceptive observations are encoded into a proprioception embedding, which is used together with the mapping as the inputs of the AME-2 encoder to produce the map embedding. The proprioception embedding and the map embedding are then concatenated and fed into an MLP to generate actions.\nLeft bottom:\nThe AME-2 encoder design. We extract both local features and global features from the map, and then use the global features and the proprioception embedding to produce the attention-weighted local features.\nL\nL\nand\nW\nW\nare the length and width of the map,\nd\nm\n​\na\n​\np\nd_{map}\nis the dimension of map representation (3 for the teacher, 4 for the student),\nd\nP\n​\nE\nd_{PE}\nis the dimension of proprioception embedding.\nRight:\nThe proprioception encoder designs. We have different designs for teacher and student policies to facilitate sim-to-real transfer, while both designs can fit into our overall architecture.\nThe general policy architecture is illustrated in Fig.\n3\n, with the AME-2 encoder serving as the core feature extractor for the mapping input. We have a proprioception encoder to embed proprioceptive observations, and the AME-2 encoder to embed the map observations based on the proprioception embedding. We feed both the proprioception embedding and the map embedding through a multilayer perceptron (MLP) to output the actions.\nThe AME-2 encoder first extracts local map features with a convolutional neural network (CNN) and computes a positional embedding for each point with an MLP. These are then fused by another MLP to obtain pointwise local features. Next, an additional MLP followed by max pooling over the pointwise features produces global features that capture the overall terrain context. We combine these global features with a proprioceptive embedding through an MLP to obtain a query vector, which is used in a multi-head attention (MHA) module\n[\n63\n]\nwith the pointwise local features serving as keys and values. This yields a weighted local feature embedding that focuses on important terrain regions based on the current proprioceptive state and global context. Finally, the global features and weighted local features are concatenated to form the map embedding fed into the policy’s action decoder.\nThis design builds on the attention-based map encoder in previous work\n[\n15\n]\n, which we refer to as AME-1 for clarity. Unlike the AME-1 encoder, our AME-2 encoder additionally computes global features and uses them to weigh the local features. This enables more generalized locomotion over complex terrains, where motion patterns should vary with the terrain. We demonstrate the resulting performance gap between AME-1 and AME-2 encoders in Sec.\nVI\nand Sec.\nVII\n.\nThe choice of proprioception encoder in our architecture is flexible, as long as it produces an effective proprioception embedding. Hence, we use different designs for the teacher and the student. For the teacher, since ground-truth proprioceptive observations are available, we use a plain MLP over them to obtain the proprioception embedding. For the student, because of various environmental uncertainties and following lessons from previous works\n[\n64\n,\n65\n,\n66\n]\n, we stack the proprioceptive observations (except base linear velocities and commands) from the past 20 steps and use Long-Short I/O (LSIO)\n[\n66\n]\nto obtain a temporal embedding of both robot states and environment dynamics. This temporal embedding and the commands are then jointly fed into an MLP to produce the student’s proprioception embedding.\nIV-B\nAsymmetric Actor Critic\nWe adopt asymmetric actor–critic training\n[\n67\n]\n. For the critic, we do not use the same attention-based design as in the actor, because the critic does not need to generalize beyond the training terrains and optimizing an MHA module with\n(\nL\n×\nW\n)\n(L\\times W)\nlocal feature inputs is costly. Instead, we use the mixture-of-experts (MoE) design from\n[\n68\n]\n, which is powerful for function fitting yet much more computationally efficient to optimize. Note that, although we can train a generalized teacher with our policy architecture and an MoE critic, an MoE actor does not yield a generalized teacher, as shown in Sec.\nVII\n.\nOn top of the noiseless proprioceptive observations used by the teacher actor and the ground-truth map, we additionally provide the contact state of each link to the critic. We do not provide such contact information to the teacher, since we can already train a robust, generalized teacher without it, and a larger information gap between teacher and student can hurt student training\n[\n69\n]\n.\nWe also apply left-right symmetry augmentation from\n[\n32\n]\nto the critic to improve sample efficiency and motion style, but not to the actor to avoid additional computational cost of actor optimization.\nThe critic design is shared for the teacher and the student.\nIV-C\nTeacher-Student RL\nWe use Teacher–Student RL\n[\n70\n,\n14\n,\n48\n,\n53\n]\nto facilitate sim-to-real transfer. Although directly training a student policy with our mapping pipeline is also possible, simulation can run at only about half the speed compared to using ground-truth mapping and requires significantly more GPU memory, making it computationally inefficient for us.\nOur student training objective linearly combines the RL losses from PPO, the action distillation losses from\n[\n53\n]\n, and a representation loss given by the mean squared error between the teacher and student map embeddings. In practice, we also disable the PPO surrogate loss during the first few iterations while using a large learning rate. These design choices enable stable, efficient, and well-aligned student training, which we will ablate in Sec.\nVII\n.\nIV-D\nEnvironments\nIV-D\n1\nRewards\nTABLE I:\nRewards for Controller Training.\nReward Term\nExpression\nWeight (\n×\nd\n​\nτ\n∗\n\\times d\\tau^{*}\n)\nNotes\nTask Rewards\nPosition Tracking\nEq. (\n1\n)\n100\n100\nHeading Tracking\nEq. (\n3\n)\n50\n50\nMoving to Goal\nEq. (\n4\n)\n5\n5\nStanding at Goal\nEq. (\n5\n)\n5\n5\nRegularization and Penalties\nEarly Termination\n1\n1\nif early termination triggered\n−\n10\n/\nd\n​\nτ\n-10/d\\tau\nUndesired Events\n1\n1\nfor each undesired event\n−\n1\n-1\nBase Roll Rate\n[\nω\nb\n]\nx\n2\n[\\omega_{b}]_{x}^{2}\n−\n0.1\n-0.1\nJoint Regularization\n∥\nq\n˙\n∥\n2\n+\n0.01\n​\n∥\nτ\n∥\n2\n+\n0.001\n​\n∥\nq\n¨\n∥\n2\n\\lVert\\dot{q}\\rVert^{2}+0.01\\lVert\\tau\\rVert^{2}+0.001\\lVert\\ddot{q}\\rVert^{2}\n−\n0.001\n-0.001\nτ\n\\tau\ndenotes the joint torques\nAction Smoothness\n∥\na\nt\n−\na\nt\n−\n1\n∥\n2\n\\lVert a_{t}-a_{t-1}\\rVert^{2}\n−\n0.01\n-0.01\nLink Contact Forces\n∥\nmax\n⁡\n(\nF\ncon\n−\nG\n,\n𝟎\n)\n∥\n2\n\\lVert\\max{(F_{\\rm con}-G,\\mathbf{0})\\rVert^{2}}\n−\n0.00001\n-0.00001\nF\ncon\nF_{\\rm con}\ndenotes the contact forces for each link and\nG\nG\nis the robot weight\nLink Acceleration\n∑\nl\n∥\nv\n˙\nl\n∥\n\\sum_{l}\\lVert\\dot{v}_{l}\\rVert\n−\n0.001\n-0.001\nv\nl\nv_{l}\nis the velocity of link\nl\nl\n; summing over all links\nSimulation Fidelity\nsumming over all joints\nJoint Position Limits\n∑\nj\nmax\n⁡\n(\n0\n,\nq\nj\n−\n0.95\n​\nq\nj\nmax\n,\n0.95\n​\nq\nj\nmin\n−\nq\nj\n)\n\\sum_{j}\\max(0,q_{j}-0.95q^{\\max}_{j},0.95q^{\\min}_{j}-q_{j})\n−\n1000\n-1000\nq\nj\nmax\nq_{j}^{\\max}\nand\nq\nj\nmin\nq_{j}^{\\min}\nare position limits for joint\nj\nj\nJoint Velocity Limits\n∑\nj\nmax\n⁡\n(\n0\n,\n|\nq\n˙\nj\n|\n−\n0.9\n​\nq\n˙\nj\nmax\n)\n\\sum_{j}\\max(0,|\\dot{q}_{j}|-0.9\\dot{q}^{\\max}_{j})\n−\n1\n-1\nq\n˙\nj\nmax\n\\dot{q}^{\\max}_{j}\nis the velocity limit for joint\nj\nj\nJoint Torque Limits\n∑\nj\nmax\n⁡\n(\n0\n,\n|\nτ\nj\n|\n−\n0.8\n​\nτ\nj\nmax\n)\n\\sum_{j}\\max(0,|\\tau_{j}|-0.8\\tau^{\\max}_{j})\n−\n1\n-1\nτ\nj\nmax\n\\tau^{\\max}_{j}\nis the torque limit for joint\nj\nj\nd\n∗\n​\nτ\n=\n0.02\n{}^{*}d\\tau=0.02\nsec is the policy interval.\nFigure 4:\nTraining and Test Terrains. We train our locomotion policies on primitive terrains of three categories: \\tiny1⃝ dense, \\tiny2⃝ climbing, and \\tiny3⃝ sparse. To test generalization, we evaluate the policies on four terrains that are either entirely unseen or combinations of training and/or unseen terrains.\nWe use three types of rewards shared across both quadruped and biped training environments, as listed in Table\nI\n: task rewards which incentivize goal-reaching behaviors, regularization rewards which improve stability and safety, and simulation-fidelity rewards, which penalize near-limit joint states that can cause unrealistic simulation.\nThere are four task reward terms, respectively for goal position tracking, goal heading tracking, moving towards goal, and standing at goal.\nFollowing\n[\n49\n]\n, we define the position tracking reward as\nr\nposition\n​\n_\n​\ntracking\n=\n1\n1\n+\n0.25\n​\nd\nx\n​\ny\n2\n⋅\nt\nmask\n​\n(\n4\n)\n,\nr_{\\rm position\\_tracking}=\\frac{1}{1+0.25d_{xy}^{2}}\\cdot t_{\\rm mask}(4),\n(1)\nwhere\nd\nx\n​\ny\nd_{xy}\nis the horizontal distance from the robot to the goal position, and\nt\nmask\n​\n(\n⋅\n)\nt_{\\rm mask}(\\cdot)\nis a time-based mask function defined as\nt\nmask\n​\n(\nT\n)\n=\n1\nT\n⋅\n𝟏\n​\n(\nt\nleft\n<\nT\n)\n,\nt_{\\rm mask}(T)=\\frac{1}{T}\\cdot\\mathbf{1}(t_{\\rm left}<T),\n(2)\nwith\nt\nleft\nt_{\\rm left}\ndenoting the remaining time of the current episode. Further, we define the heading tracking reward as\nr\nheading\n​\n_\n​\ntracking\n=\n1\n1\n+\nd\nyaw\n2\n⋅\nt\nmask\n​\n(\n2\n)\n⋅\n𝟏\n​\n(\nd\nx\n​\ny\n<\n0.5\n)\n,\nr_{\\rm heading\\_tracking}=\\frac{1}{1+d_{\\rm yaw}^{2}}\\cdot t_{\\rm mask}(2)\\cdot\\mathbf{1}(d_{xy}<0.5),\n(3)\nIntuitively, these two tracking rewards encourage the robot to be at the goal position with the desired heading at the end of the episode, without constraining how it reaches the goal, thereby allowing complex locomotion skills to emerge for traversing terrains.\nTo further facilitate exploration, we introduce a moving-to-goal reward:\nr\nmove\n=\n𝟏\n(\nd\nx\n​\ny\n<\n0.5\n∨\n(\ncos\nθ\nv\nb\n,\ngoal\n>\n0.5\n∧\nv\nmin\n≤\n∥\n[\nv\nb\n]\nx\n​\ny\n∥\n≤\nv\nmax\n)\n)\n,\n\\begin{split}r_{\\text{move}}=\\mathbf{1}\\Big(&d_{xy}<0.5\\;\\lor\\\\\n&\\big(\\cos\\theta_{v_{b},\\text{goal}}>0.5\\land v_{\\min}\\leq\\|[{v}_{b}]_{xy}\\|\\leq v_{\\max}\\big)\\Big),\\end{split}\n(4)\nwhere\nθ\nv\nb\n,\ngoal\n\\theta_{v_{b},\\text{goal}}\nis the angle between the base velocity and the vector from the base to the goal position,\nv\nmin\n=\n0.3\n​\nm/s\nv_{\\min}=0.3\\,\\text{m/s}\nis the lower bound of the horizontal base velocity\n[\nv\nb\n]\nx\n​\ny\n[{v}_{b}]_{xy}\nto be considered as moving, and\nv\nmax\n=\n2\n​\nm/s\nv_{\\max}=2\\,\\text{m/s}\nis an upper bound chosen according to hardware and SLAM constraints.\nIn other words,\nr\nmove\n=\n1\nr_{\\text{move}}=1\nif the robot is already close to the goal or if it is moving roughly towards the goal, and\nr\nmove\n=\n0\nr_{\\text{move}}=0\notherwise.\nTo enforce a stable standing posture after reaching the goal, we define the standing reward:\nr\nstand\n=\n𝟏\n​\n(\nd\nx\n​\ny\n<\n0.5\n∧\nd\nyaw\n<\n0.5\n)\n⋅\nexp\n⁡\n(\n−\nd\nfoot\n+\nd\ng\n+\nd\nq\n+\nd\nx\n​\ny\n4\n)\n,\n\\begin{split}r_{\\rm stand}=&\\mathbf{1}(d_{xy}<0.5\\land d_{\\rm yaw}<0.5)\\\\\n&\\cdot\\exp\\left(-\\frac{d_{\\rm foot}+d_{\\rm g}+d_{\\rm q}+d_{xy}}{4}\\right),\\end{split}\n(5)\nwhere\nd\nfoot\nd_{\\rm foot}\nis the number of feet not in contact divided by the total number of feet,\nd\ng\n=\n1\n−\n[\ng\nb\n]\nz\n2\nd_{\\rm g}=1-[g_{b}]_{z}^{2}\nmeasures the base tilt relative to gravity, and\nd\nq\nd_{\\rm q}\nis the mean deviation of joint positions from the standing reference. This reward ensures the robot maintains a static, upright configuration at the goal.\nThe regularization and simulation fidelity rewards are presented in Table\nI\n. We set all weights to integer powers of 10, and make each term’s contribution\n1\n∼\n2\n1\\sim 2\norders of magnitude smaller than the task rewards. This enables successful learning without extensive weight tuning.\nIn the regularization rewards, we penalize each occurrence of these undesired events:\n•\nSpinning too fast: Yaw rate\n|\n[\nω\nb\n]\nz\n|\n>\n2.0\n\\lvert[\\omega_{b}]_{z}\\rvert>2.0\nrad/s, which can trigger drifts in the odometry.\n•\nLeaping on flat terrain: All feet are off the ground when the elevation difference is\n<\n30\n<30\ncm.\n•\nNon-foot contacts: We penalize both general non-foot contacts and non-foot contact switches (from no contact to contact). We separate these to allow stable interactions when necessary (e.g., climbing) while discouraging unnecessary non-foot contacts.\n•\nStumbling: Any link having a horizontal contact force larger than the vertical force.\n•\nSlippage: Any link moving while in contact.\n•\nSelf-collision: Collisions between robot links.\nUnlike previous works\n[\n19\n,\n23\n,\n33\n]\n, we do not explicitly reward or penalize foot contact positions in sparse terrains; instead, we formulate rewards for all robot links to enable emergent whole-body contacts. Those foothold position rewards are also difficult to define in a terrain-agnostic way: for example, quadruped climbing benefits from active knee contacts and near-edge foot placements, as shown in Fig.\n10\n, whereas on sparse terrains near-edge foot placements are undesirable.\nIV-D\n2\nTermination\nTo facilitate training, we set the following early termination conditions:\n•\nBad orientation: The projected gravity vector satisfies\n|\n[\ng\nb\n]\nx\n|\n>\n0.985\n|[g_{b}]_{x}|>0.985\n,\n|\n[\ng\nb\n]\ny\n|\n>\n0.7\n|[g_{b}]_{y}|>0.7\n, or\n[\ng\nb\n]\nz\n>\n0.0\n[g_{b}]_{z}>0.0\n(robot flipped).\n•\nBase collision: The base link experiences a contact force larger than the robot’s total weight.\n•\nHigh thigh acceleration: The acceleration of any thigh link exceeds a specific threshold. We design this to reduce impact during jumping, as stiff landings can damage hardware or reduce lifespan. Interestingly, we use typical data from dog (\n60\n​\nm\n/\ns\n2\n60\\rm\\ m/s^{2}\n[\n71\n]\n) and human (\n100\n​\nm\n/\ns\n2\n100\\rm\\ m/s^{2}\n[\n72\n]\n) biokinetics literature, and they directly work to emerge impact absorption or avoidance behaviors, which is shown in Sec.\nVI\n.\n•\nStagnation: Movement in the past 5 s is less than 0.5 m while the robot is still\n>\n1\n>1\nm away from the goal position.\nTriggering any of these conditions terminates the episode immediately and incurs early termination penalties.\nIV-D\n3\nTerrains and Curriculum\nWe train our controllers on primitive terrains and evaluate generalization on complex test terrains. Both are shown in Fig.\n4\n, while quantitative results are presented in Sec.\nVII\n. We use a terrain curriculum that scales difficulty from easy to hard (detailed in Appendix\nA\n), similar to\n[\n26\n]\n. To stabilize learning across different challenging terrains, we estimate the robot’s success rate using an exponential moving average. If the robot reaches the goal and its estimated success rate exceeds 0.5, we promote the environment to the next difficulty level. Conversely, the level is demoted if the robot remains\n>\n4\n>4\nm away from the goal (which is the average starting distance). Once the robot passes the highest level, the environment resets to a random difficulty.\nAdditionally, we use a perception noise curriculum and an initial heading curriculum. In the first 20% iterations of teacher training, we linearly increase mapping noise from zero to the maximum level, and simultaneously expand the initial heading from facing the goal to a random yaw in\n[\n−\nπ\n,\nπ\n]\n[-\\pi,\\pi]\n.\nIV-D\n4\nDomain Randomization\nFigure 5:\nThe controller can reuse the built map for the same terrain, enabled by our mapping randomization. (a) When the robot moves in the direction of the dotted orange arrow, it observes a partial map of the staircase (visualized on the right). (b) After going down along the solid orange arrow, it perceives a complete map of the staircase (visualized on the right) when attempting to move back along the dotted orange arrow.\nWe employ domain randomization\n[\n73\n]\nduring training to enhance robustness and facilitate sim-to-real transfer. We apply the following randomization setup:\n•\nRobot Dynamics: We uniformly randomize the payload, friction coefficients, and actuation delays. For the TRON1 biped, we additionally randomize PD gains and motor armatures, following\n[\n15\n]\n.\n•\nObservation Noise: We apply uniform noises to the policy observations. We also degrade the student’s depth clouds by simulating missing points and sensor artifacts.\n•\nMapping: During student training, we randomly select a subset of environments to access complete maps, while others rely on partial online maps. This setup enables map reuse when the robot traverses the same terrain repeatedly, as illustrated in Fig.\n5\n. We also corrupt the student’s mapping by randomly removing points and assigning random height values with high uncertainties. Additionally, we simulate mapping drifts for both the teacher and the student.\nImplementation details are provided in Appendix\nB\n.\nIV-E\nTraining and Deployment\nIV-E\n1\nTraining Setup\nWe train our controllers in Isaac Gym\n[\n61\n]\nwith the PPO implementation in RSL-RL\n[\n74\n]\n. The both teacher policies are trained with 80000 iterations, and the both student policies are trained with 40000 iterations (surrogate loss disabled during first 5000 iterations). The hyperparameters are listed in Appendix\nC\n. The training cost for the ANYmal-D policies is\n∼\n60\n\\sim 60\nRTX-4090-days with\n8\n8\nGPUs in parallel. The training cost for the TRON1 policies is\n∼\n30\n\\sim 30\nRTX-4090-days with\n4\n4\nGPUs in parallel.\nThe difference between both robots’ training costs are due to the mapping sizes. For ANYmal-D, we use a map of size\n36\n×\n14\n36\\times 14\n, with\n8\n8\n-cm resolution, centered at\nx\n=\n0.6\n​\nm\n,\ny\n=\n0\n​\nm\nx=0.6\\rm{\\ m},y=0\\rm{\\ m}\nin the base frame. For TRON1, we use a map of size\n18\n×\n13\n18\\times 13\n, with\n8\n8\n-cm resolution, centered at\nx\n=\n0.32\n​\nm\n,\ny\n=\n0\n​\nm\nx=0.32\\rm{\\ m},y=0\\rm{\\ m}\nin the base frame. These numbers are designed based on the robot dimensions and terrain sizes.\nIV-E\n2\nDeployment Setup\nWe deploy the controllers using ONNX Runtime\n[\n75\n]\n. On the onboard Intel Core i7-8850H CPUs, the policy inference time is approximately\n2\n2\nms.\nIV-E\n3\nOther Sim-to-Real Designs\nWe model the actuator dynamics for sim-to-real transfer. In simulation, we use the actuator network\n[\n76\n]\nfor ANYmal-D, and an identified DC-motor model for TRON1. We clip the applied torques using the joint torque-velocity constraints in\n[\n77\n]\n.\nTo enable continuous deployment (infinite-horizon execution), we define the command observations differently from prior goal-reaching works\n[\n48\n,\n49\n,\n50\n]\n. Following prior practice, the critic receives the full command: the goal’s relative position, the sine and cosine of the relative yaw, and the remaining episode time. The actor, however, receives a modified command representation: we clip the observed goal distance to a maximum of\n2\n​\nm\n2\\,\\text{m}\nand remove the remaining time. Additionally, if the actual goal distance exceeds\n2\n​\nm\n2\\,\\text{m}\n, we randomize the observed yaw command during training. This design decouples policy deployment from finite-horizon training and simplifies steering control.\nV\nNeural Mapping\nV-A\nMapping Pipeline\nFigure 6:\nOur proposed mapping pipeline. For each frame of depth clouds, we project it into local grids, and use a lightweight neural network to predict elevation estimations with uncertainties. The predictions are then fused into the global map via the odometry, and local maps can be queried from the global map to serve as the controller inputs. In visualization, the green points indicate the depth points or elevation estimations, and the blue lines indicate the uncertainties.\nOur proposed neural mapping pipeline is illustrated in Fig.\n6\n. It can not only achieve real-time computation on the hardware, but also run with thousands of parallel environments in simulation, thereby bridging the sim-to-real gap with identical mapping pipelines.\nFor each sensing frame, we project the point cloud onto a local 2D height grid. If multiple points fall into the same cell, we keep the maximum\nz\nz\n-value, which is most relevant for locomotion, and we assign a fixed minimum value to cells with no points. The resulting local elevations, however, are often noisy and incomplete due to occlusions. To mitigate this, we use a lightweight CNN trained with Bayesian learning (detailed in Sec.\nV-B\n) to jointly predict base-relative elevations and their uncertainties (in the form of log-variance). The predicted uncertainties capture both measurement noise and occlusions, while the elevation predictions themselves can also suppress noise.\nFigure 7:\nTerrain meshes used for mapping model training. We use four meshes: the locomotion training terrains, randomly stacked boxes, random heightfields, and random floating boxes. The colored points visualized are the elevation scans from random poses.\nWe then use the odometry poses to fuse these local predictions into a global grid map\nℳ\n\\mathcal{M}\n. It has two layers: the elevation layer and the uncertainty layer (in the form of variance). The global map is initialized as flat ground at the robot’s standing height (ground height relative to the base) with large uncertainties. At each new frame, given the local elevation estimations with uncertainties and the current base pose, we project the local predictions to the global grid cells. For any global grid point\n(\nu\n,\nv\n)\n(u,v)\ncovered by the local grids, we denote the new estimation as\nh\nt\nh_{t}\nand its uncertainty as\nσ\nt\n2\n\\sigma_{t}^{2}\n, fusing them with existing values\nh\np\n​\nr\n​\ni\n​\no\n​\nr\nh_{prior}\nand\nσ\np\n​\nr\n​\ni\n​\no\n​\nr\n2\n\\sigma^{2}_{prior}\n.\nWe do not use standard Bayesian fusion because repeated observations of the same occluded or uncertain area should not have reduce uncertainties simply due to consistent predictions. Instead, we employ a\nProbabilistic Winner-Take-All\nstrategy. First, we calculate an effective measurement variance\nσ\n^\nt\n2\n\\hat{\\sigma}^{2}_{t}\nthat is lower-bounded by the prior to prevent over-confidence:\nσ\n^\nt\n2\n=\nmax\n⁡\n(\nσ\nt\n2\n,\n0.5\n⋅\nσ\np\n​\nr\n​\ni\n​\no\n​\nr\n2\n)\n.\n\\hat{\\sigma}^{2}_{t}=\\max(\\sigma^{2}_{t},0.5\\cdot\\sigma^{2}_{prior}).\n(6)\nAn update is considered valid only if the effective measurement variance is not significantly larger than the prior (\nσ\n^\nt\n2\n<\n1.5\n​\nσ\np\n​\nr\n​\ni\n​\no\n​\nr\n2\n\\hat{\\sigma}^{2}_{t}<1.5\\sigma^{2}_{prior}\n), or if the absolute uncertainty is low (\nσ\n^\nt\n2\n<\n0.2\n2\n\\hat{\\sigma}^{2}_{t}<0.2^{2}\n).\nFor valid updates, we determine the probability\np\nwin\np_{\\rm win}\nof overwriting the map based on the relative precision:\np\nwin\n=\n(\nσ\n^\nt\n2\n)\n−\n1\n(\nσ\n^\nt\n2\n)\n−\n1\n+\n(\nσ\np\n​\nr\n​\ni\n​\no\n​\nr\n2\n)\n−\n1\n.\np_{\\rm win}=\\frac{(\\hat{\\sigma}^{2}_{t})^{-1}}{(\\hat{\\sigma}^{2}_{t})^{-1}+(\\sigma^{2}_{prior})^{-1}}.\n(7)\nFinally, the map is updated stochastically. We sample\nξ\n∼\n𝒰\n​\n[\n0\n,\n1\n]\n\\xi\\sim\\mathcal{U}[0,1]\nand let the new prediction take over the cell if the sample falls within the probability threshold:\n(\nh\nn\n​\ne\n​\nw\n,\nσ\nn\n​\ne\n​\nw\n2\n)\n←\n{\n(\nh\nt\n,\nσ\n^\nt\n2\n)\nif\n​\nξ\n<\np\nwin\n,\n(\nh\np\n​\nr\n​\ni\n​\no\n​\nr\n,\nσ\np\n​\nr\n​\ni\n​\no\n​\nr\n2\n)\notherwise.\n(h_{new},\\sigma^{2}_{new})\\leftarrow\\begin{cases}(h_{t},\\hat{\\sigma}^{2}_{t})&\\text{if }\\xi<p_{\\rm win},\\\\\n(h_{prior},\\sigma^{2}_{prior})&\\text{otherwise.}\\end{cases}\n(8)\nFor the controller inputs, we then just query the grids around the robot pose in the latest global map.\nThis\nProbabilistic Winner-Take-All\nstrategy offers the following benefits:\n•\nThe uncertainty of the same occluded point will not decrease through consistent predictions.\n•\nOver-confident predictions, if not consistent, cannot take over the cell.\n•\nThe system can rapidly update the map in response to dynamic terrain changes when high-confidence measurements are available.\n•\nThe pipeline is easy to integrate with parallel simulation, and fast enough to run on the hardware.\nV-B\nTraining\nFigure 8:\nMapping model architecture. We use a lightweight U-Net\n[\n78\n]\nmodel with a gated residual design for the estimation.\nWe train a CNN to predict per-frame elevation estimates and uncertainties with synthetic data and random terrains. The technical implementations are detailed below.\nV-B\n1\nTerrains and Data Sampling\nWe use both the locomotion training terrain meshes and additional procedurally generated terrains to train the mapping model, as shown in Fig.\n7\n. Instead of relying on physical simulation, we directly sample local elevation grids from random poses above these meshes using raytracing with Warp\n[\n79\n]\n, enabling sampling at hundreds of thousands of frames per second on a single RTX 4090 GPU.\nV-B\n2\nTraining Data Synthesis\nWe apply the following augmentations to the sampled local elevation grids:\n•\nadditive uniform noise with random magnitude on each cell;\n•\nrandom cropping of the map from the four borders;\n•\nsimulated occlusions with random sensor positions and field of view;\n•\nrandom ranges to clip the elevations;\n•\nrandom missing points and outliers at random ratios.\nBy doing so, we synthesize diverse, noisy, and partially observable local grids as the model inputs, and the original ground-truth elevations as the labels.\nV-B\n3\nModel and Optimization\nWe train the model to reconstruct the ground-truth elevations with\nβ\n−\n\\beta-\nNLL loss (\nβ\n=\n0.5\n\\beta=0.5\n) from\n[\n80\n]\n:\nL\n0.5\n=\n𝔼\nX\n,\nY\n​\n[\nsg\n​\n[\nσ\n^\n​\n(\nX\n)\n]\n​\n(\nlog\n⁡\nσ\n^\n2\n​\n(\nX\n)\n2\n+\n(\nY\n−\nμ\n^\n​\n(\nX\n)\n)\n2\n2\n​\nσ\n^\n2\n​\n(\nX\n)\n)\n]\n,\nL_{0.5}=\\mathbb{E}_{X,Y}\\left[\\mathrm{sg}\\left[\\hat{\\sigma}(X)\\right]\\left(\\frac{\\log\\hat{\\sigma}^{2}(X)}{2}+\\frac{(Y-\\hat{\\mu}(X))^{2}}{2\\hat{\\sigma}^{2}(X)}\\right)\\right],\n(9)\nwhere\nX\nX\ndenotes the inputs,\nY\nY\ndenotes the ground-truth elevations, and\nμ\n^\n​\n(\nX\n)\n\\hat{\\mu}(X)\nand\nσ\n^\n2\n​\n(\nX\n)\n\\hat{\\sigma}^{2}(X)\ndenote the predicted estimation and variance, respectively. The operator\nsg\n​\n[\n⋅\n]\n\\mathrm{sg}[\\cdot]\ndenotes the stop-gradient operation. Compared to the standard negative log-likelihood (NLL) loss used in classical Bayesian learning\n[\n51\n]\n, this formulation reduces the tendency of the model to overestimate uncertainty on hard samples to trivially reduce the loss. It encourages the model to output high uncertainty when accurate predictions are not possible, and low uncertainty together with accurate predictions when they are, thereby capturing the noise and occlusions.\nFor batched optimization, terrain roughness can vary significantly across samples. As a result, flat terrains can dominate the batch loss and reduce the effective emphasis on challenging cases. To mitigate this, we re-weigh samples in each batch during training using their total variation (TV)\n[\n81\n]\n:\nTV\n​\n(\nY\nb\n)\n\\displaystyle\\mathrm{TV}(Y_{b})\n=\n1\nH\n​\nW\n​\n(\n‖\n∇\nx\nY\nb\n‖\n1\n+\n‖\n∇\ny\nY\nb\n‖\n1\n)\n,\n\\displaystyle=\\frac{1}{HW}\\Big(\\|\\nabla_{x}Y_{b}\\|_{1}+\\|\\nabla_{y}Y_{b}\\|_{1}\\Big),\n(10)\nw\nb\n\\displaystyle w_{b}\n=\nTV\n​\n(\nY\nb\n)\n∑\nb\n′\n=\n1\nB\nTV\n​\n(\nY\nb\n′\n)\n+\nε\n.\n\\displaystyle=\\frac{\\mathrm{TV}(Y_{b})}{\\sum_{b^{\\prime}=1}^{B}\\mathrm{TV}(Y_{b^{\\prime}})+\\varepsilon}.\nHere,\nY\nb\nY_{b}\nis the ground-truth elevations of the\nb\nb\n-th sample in a batch, and\nH\nH\nand\nW\nW\nare the height and width. The weight\nw\nb\nw_{b}\nis normalized across the batch, and\nε\n\\varepsilon\nis a small positive constant. By doing so, we assign higher weights to samples with larger elevation variations.\nWe use a shallow U-Net\n[\n78\n]\nmodel with a gated residual design, as illustrated in Fig.\n8\n. The CNNs output the uncertainty, a raw estimation, and a gating map. The final estimation is obtained by the gated combination of the raw estimation and the input, preserving accuracy in clearly observed areas while selectively overwriting noisy or occluded areas.\nWe train the models on 54 million frames for each robot, each model takes less than 1 hour to converge. For ANYmal-D, the local grids are of shape\n51\n×\n31\n51\\times 31\n, with\n4\n4\n-cm resolution, centered at\nx\n=\n1.0\n​\nm\n,\ny\n=\n0\n​\nm\nx=1.0\\rm{\\ m},y=0\\rm{\\ m}\nin the base frame. For TRON1, the local grids are of shape\n31\n×\n31\n31\\times 31\n, with\n4\n4\n-cm resolution, centered at\nx\n=\n0.6\n​\nm\n,\ny\n=\n0\n​\nm\nx=0.6\\rm{\\ m},y=0\\rm{\\ m}\nin the base frame.\nV-C\nSimulation Integration and Deployment\nWhen deployed in simulation with 1000 parallel ANYmal-D environments, the model’s inference time is below\n0.3\n0.3\nms, and the GPU memory consumption is about\n3\n3\nGB (for TRON1, these numbers are roughly 60% of those for ANYmal-D). Storing\n8\n,\nm\n×\n8\n,\nm\n8,\\mathrm{m}\\times 8,\\mathrm{m}\nglobal maps for 1000 environments requires about\n0.3\n0.3\nGB, and the global map size can be flexibly chosen since we recenter the map around the robot when it approaches the boundary. Obtaining depth clouds and handling other intermediate overheads takes an additional\n∼\n1.2\n\\sim 1.2\nGB of GPU memory per 1000 ANYmal-D environments.\nOn real hardware, the mapping pipeline takes approximately\n5\n5\nms per frame on the onboard CPU, with around\n2.5\n2.5\nms spent on model inference using ONNX Runtime. This enables fast, low-latency mapping that can keep up with the depth camera’s frame rate. For ANYmal-D, we merge the point clouds from two front facing cameras for processing. For TRON1, we use the only front facing camera.\nRegarding odometry, we use CompSLAM\n[\n82\n]\nwith Graph-MSF\n[\n83\n]\non ANYmal-D to obtain a high-frequency, accurate LiDAR–inertial odometry. On TRON1, we use DLIO\n[\n84\n]\ninstead, as it better handles the platform’s higher accelerations.\nNotably, although these odometry solutions can run reliably at high frequency, their velocity estimates are observed to be noisy and delayed. This is intuitive: for example, a 1 cm position drift over a 20 ms timestep can translate to a velocity error of 0.5 m/s, yet has little impact on map fusion. Therefore, we remove the linear velocity observations from the student policy.\nVI\nResults\nVI-A\nAgility Comparison with Prior Art\nFigure 9:\nOur ANYmal-D controller zero-shots the hardest parkour and rubble pile terrains reported in prior work\n[\n32\n,\n48\n]\n.\nWe achieve state-of-the-art agility on both ANYmal-D and TRON1, measured by the difficulty of the terrains they can climb up and down.\nOn ANYmal-D, despite being trained only on primitive terrains, our policy zero-shots the hardest parkour and rubble pile terrains reported in prior work\n[\n32\n,\n48\n]\n, as shown in Fig.\n9\n.\nOn TRON1, our policy climbs up platforms up to\n0.48\n0.48\nm and climbs down up to\n0.88\n0.88\nm, while prior work on bipeds reports\n0.5\n0.5\nm platforms\n[\n17\n]\nusing the Unitree H1 robot (with\n4\n×\n4\\times\npeak torque and\n1.5\n×\n1.5\\times\nbase height compared to TRON1).\nAcross all terrains, our controllers on both robots reach peak forward velocities above\n1.5\n1.5\nm/s, demonstrating a combination of agility and terrain-aware locomotion. On top of this agility, our controllers also exhibit stronger generalization than existing methods, as shown below and benchmarked in Sec.\nVII\n.\nVI-B\nReal World Results\nVI-B\n1\nQuadruped Parkour\nFigure 10:\nOur system enables ANYmal-D to move back and forth on a parkour course, a terrain that is unseen during training of both the controller and the mapping model.\nWe demonstrate the agility and generalization of our trained ANYmal-D controller on a parkour course, as shown in Fig.\n10\n. This course is not included in the training terrains of either the locomotion controller or the mapping model, yet our system can stably traverse it at speeds of up to\n2\n2\nm/s, composing climbing and jumping maneuvers.\nVI-B\n2\nSparse Terrain Locomotion\nFigure 11:\nOur systems enable ANYmal-D and TRON1 to traverse diverse sparse terrains. (a) ANYmal-D traverses a\n19\n19\n-cm wide balance beam, which is in the training terrains. (b) TRON1 traverses two unfixed floating\n19\n19\n-cm wide blocks, which make an unseen curved beam terrain. (c) ANYmal-D traverses two unfixed beams with gaps, which is unseen during training. (d) TRON1 traverses a beam followed by a gap, which is an unseen combination during training. (e) ANYmal-D traverses two rows of\n19\n19\n-cm wide stepping stones with\n10\n10\n-cm height differences, which is unseen during training. (f) TRON1 traverses diamond-layout stepping stones, which is unseen during training.\nAs shown in Fig.\n11\n, our controllers enable both ANYmal-D and TRON1 to traverse a variety of sparse terrains, many of which are unseen during training, exhibiting generalization capabilities.\nVI-B\n3\nBiped maneuvering\nFigure 12:\nTRON1 maneuvers over a 38-cm-high platform, a gap, a staircase, and rough terrain, showcasing its omnidirectional perceptive locomotion capabilities. Orange arrows indicate the robot’s approximate trajectories.\nTo demonstrate the omnidirectional perceptive locomotion capabilities of our controller, we command TRON1 to traverse a 38-cm-high platform, a gap, a staircase, and rough terrain, as shown in Fig.\n12\n. The robot executes smooth maneuvers in all directions.\nVI-B\n4\nRobustness\nFigure 13:\nOur controllers are robust to moving terrains. (a) TRON1 climbs over an unlocked tiltable platform cart. (b) TRON1 climbs onto and balances on an unlocked tiltable platform cart. (c) ANYmal-D recovers from unfixed tilted stepping stones using its knees.\nWe demonstrate the robustness of our controllers on moving terrains. As shown in Fig.\n13\n, TRON1 can traverse or balance on a platform cart with unlocked wheels and spring suspension that can easily tilt to one side with the robot weight. We also show that ANYmal-D can recover from unfixed tilted stepping stones using its knees, after an occasional trip causes a misstep that tilts the blocks.\nVI-B\n5\nMapping Results\nIn Fig.\n14\n, we show the mapping results after ANYmal-D traverses terrains that are unseen during training. These maps capture fine-grained terrain details, such as gaps and supports, that help the controller achieve agile and generalized locomotion. Among prior works, only\n[\n32\n]\nhas demonstrated maps of comparable quality during agile motions. However, that approach cannot reliably infer unseen parts of obstacles in unstructured terrains\n[\n48\n]\n, is not efficient enough to support concurrent locomotion training, and does not explicitly encode uncertainty under partial observations such as occlusions. For generalized locomotion, explicitly modeling uncertainty is important: occluded regions are not completed by learned priors but kept uncertain, and newly observed geometry can be integrated into the map based on the predicted uncertainty once it becomes visible.\nFigure 14:\nObtained maps after ANYmal-D’s traversal of terrains that are unseen during training. Our mapping supports agile and generalized locomotion. In the visualizations, meshes represent the estimated elevations, and thin lines indicate the uncertainties. The meshes are colored with a red–blue colormap to enhance height contrast, excluding regions that are never covered by the cameras.\nVI-C\nEmergent Behaviors\nVI-C\n1\nActive Perception\nFigure 15:\nEmergent active perception behavior. (a) In a climb-up attempt, ANYmal-D collides with the obstacle due to limited field of view and depth sensing quality. (b) Although unsuccessful, this trial reveals higher parts of the obstacle in the map, enabling the robot to succeed in the immediate retrial. (c) ANYmal-D then climbs onto the obstacle. The maps are visualized in the top-left corner of each subfigure, excluding regions that are never covered by the cameras.\nTrained with partial observations and uncertainty-aware mapping, our locomotion controllers exhibit emergent active perception behaviors. In Fig.\n15\n, we exemplify this with ANYmal-D attempting to climb onto a high obstacle. In one attempt, the robot makes contact with the obstacle and cannot immediately climb up, due to its limited field of view and imperfect depth sensing. This interaction, however, exposes higher parts of the obstacle to the map. In the subsequent attempt, the controller uses this updated map and successfully climbs onto the obstacle. The maps are visualized to show how information gained from previous interactions is reused to make subsequent movements more informed and successful.\nNotably, this addresses a stated limitation of prior state-of-the-art work\n[\n48\n]\n, where a recurrent controller fails to climb onto a high box when starting close to it due to a lack of longer-term memory. In contrast, our mapping module explicitly maintains long-term spatial information, providing the controller with an effective representation of the environment over time.\nMoreover, consistent with\n[\n48\n]\n, we also observe the robot looking upward while climbing onto platforms, gaining additional terrain information.\nVI-C\n2\nLoco-Navigation\nFigure 16:\nEmergent local navigation capabilities. (a) TRON1 turns around and aligns itself with the beam to traverse the terrain. (b) ANYmal-D avoids an obstacle when reaching the goal.\nSince our locomotion controllers are trained to reach goals, they also exhibit local navigation capabilities. As shown in Fig.\n16\n, the controllers can align the robot with the terrain before traversal and avoid collisions with obstacles.\nThese behaviors can simplify remote human operation by reducing the need for high-frequency, navigation-level commands (such as velocity commands\n[\n13\n]\n).\nVI-C\n3\nWhole-Body Contact\nAs previously shown in Fig.\n10\nand Fig.\n13\n, our ANYmal-D controller actively use knee contacts to help stabilize the robot and traverse challenging terrains. On one hand, such whole-body contact behaviors are beneficial for agility and robustness; on the other hand, because most existing legged robots are designed primarily for foot contacts, these behaviors may stress the hardware. That said, we believe that whole-body contact will become increasingly important for achieving whole-body dexterity in complex environments\n[\n64\n,\n85\n,\n86\n]\n.\nVI-C\n4\nImpact Reduction\nAs mentioned in Sec.\nIV-D\n2\n, we use human and dog motion data to set thigh-acceleration thresholds for early termination. This induces impact-reduction behaviors, as shown in Fig.\n17\n: when climbing down, ANYmal-D uses its knees to gently touch down, while TRON1 retracts the support leg to absorb the impact.\nFigure 17:\nEmergent impact reduction behaviors. (a) ANYmal-D uses its knee to support the body when climbing down, and gently touches the ground to reduce the impact. (b) TRON1 extends one leg while jumping down, and retracts it during landing before switching support to the other leg.\nVI-D\nInterpretable Feature Patterns\nWe visualize the feature patterns of our ANYmal-D student policy’s AME-2 encoder in Fig.\n18\n. For local features, we visualize their attention weights with a red–blue colormap. For global features, which are obtained via max pooling, we treat pooled points as selected (weight 1) or not (weight 0) and average this binary mask over the feature dimension.\nBy inspecting these feature maps, we observe that local attention weights often emphasize fine-grained terrain details, while global features tend to concentrate on a sparse set of distinctive points across terrain types (e.g., obstacle boundaries, high platform surfaces, and beam centers).\nWe also find that these patterns persist on test terrains, which helps explain our controller’s generalization to unseen terrains despite being trained only on primitive terrains.\nFigure 18:\nFeature patterns of our ANYmal-D controller. We visualize the neural elevation map together with the corresponding local-attention and global-context weights. Points indicate elevation estimates, lines indicate uncertainties, and higher-intensity red colors correspond to higher weights. Local attention weights provide fine-grained patterns for locomotion control, while global context features primarily focus on sparse points that characterize the terrain type.\nVII\nAblations and Benchmarking\nIn this section, we benchmark our design choices on test terrains (depicted in Fig.\n4\n) that are unseen during training. All benchmarking experiments are conducted on ANYmal-D in simulation, where richer prior works and baselines are available.\nVII-A\nTeacher Architecture\nTABLE II:\nSuccess Rates (%) of Different Teacher Architectures on Training and Test Terrains\nTeacher Architecture\nTraining Terrains\nTest Terrains\nDense\nClimbing\nSparse\nTest 1\nTest 2\nTest 3\nTest 4\navg. Test\nAME-2 (Teacher)\n97.9\n96.0\n95.2\n96.8\n93.8\n99.7\n90.6\n95.2\nAME-1\n[\n15\n]\n96.0\n95.7\n95.5\n99.2\n29.2\n32.2\n44.1\n51.2\nMoE\n[\n68\n]\n95.0\n96.7\n90.5\n52.9\n55.3\n41.0\n30.8\n45.0\nBest results (within 5% of the maximum) are shown in\nbold\n.\nWe compare our teacher policy architecture against two baselines: AME-1\n[\n15\n]\nand MoE\n[\n68\n]\n. AME-1 is the prior state of the art in generalized locomotion, outperforming policies based on MLPs, CNNs, multimodal transformers\n[\n37\n]\n, and Vision Transformers\n[\n87\n]\n. The MoE architecture from\n[\n68\n]\nhas demonstrated strong scalability by enabling a humanoid to track diverse human motions.\nThe results are summarized in Table\nII\n. All architecture designs scale well on the training terrains, highlighting the stability of our training framework. However, MoE shows very limited generalization to unseen test terrains. AME-1 generalizes well on sparse terrains (test 1) but struggles when different terrains are mixed (test 2-4), which we attribute to its encoder assigning attention to local features based only on proprioception, thus missing global context. In contrast, our AME-2 teacher generalizes reliably across all test terrains.\nVII-B\nStudent Designs\nTABLE III:\nSuccess Rates (%) of Different Student Designs on Training and Test Terrains\nStudent Design\nTraining Terrains\nTest Terrains\nDense\nClimbing\nSparse\nTest 1\nTest 2\nTest 3\nTest 4\navg. Test\nAME-2 (Student)\n96.4\n96.4\n91.8\n90.0\n77.7\n89.1\n72.9\n82.4\nVisual Recurrent Student\n[\n48\n]\n98.0\n97.9\n86.4\n34.5\n20.9\n99.8\n50.6\n51.5\nAME-2 (Student) w/o RL\n95.8\n87.9\n84.6\n46.9\n59.1\n90.6\n46.0\n60.7\nAME-2 (Student) w/o rep. loss\n95.8\n94.8\n86.5\n81.9\n82.6\n69.5\n60.4\n73.6\nAME-2 (Teacher)\n97.9\n96.0\n95.2\n96.8\n93.8\n99.7\n90.6\n95.2\nBest student results (within 5% of the maximum) are shown in\nbold\n.\nHaving a generalized teacher does not automatically yield a generalized deployable student. We therefore compare our AME-2 student against the following baselines:\n1.\nThe end-to-end student design from\n[\n48\n]\n, the previous state of the art in agile generalist locomotion, which uses recurrent networks with vision inputs.\n2.\nAn AME-2 student trained without RL losses, using only teacher action distillation and the representation loss.\n3.\nAn AME-2 student trained without the representation loss.\nThe results are summarized in Table\nIII\n. On the training terrains, all student policies perform well, with our proposed design achieving slightly higher success rates on sparse terrains. On unseen test terrains, our student achieves the best overall success rates.\nThe end-to-end visual recurrent student from\n[\n48\n]\nperforms slightly better than ours on\nTest 3\n, a parkour course with obstacles, but underperforms on all other test terrains that contain sparse regions. On\nTest 3\n, most of our student’s failures occur when it attempts to climb the obstacles, which can be misinterpreted as higher platforms due to occlusions and the observed surface elevations. In contrast, using the full depth image, as in the visual recurrent design, may provide richer cues and a longer reaction horizon for obstacle avoidance. Despite this modest drop in generalization around obstacles, our student controller achieves much higher success rates on sparse and mixed terrains.\nRegarding the learning setup, we find that direct teacher supervision (action distillation plus representation alignment) already yields good performance on the training terrains, but does not produce strong generalization to unseen terrains without RL. Incorporating RL is important for performance on the test terrains, and the representation loss gives a further improvement. Overall, our student policy architecture performs better on unseen terrains than the end-to-end visual recurrent policy, and our learning design, with mixed RL losses and teacher supervision losses (action distillation and representation alignment), further enhances the generalization.\nVII-C\nMapping Designs\nTABLE IV:\nL\n0.5\nL_{0.5}\nLoss of Different Neural Mapping Methods on Training and Test Terrains\nMapping Pipeline\nTraining Terrains\nTest Terrains\nDense\nClimbing\nSparse\nTest 1\nTest 2\nTest 3\nTest 4\navg. Test\nOurs\n-0.006\n-0.108\n0.020\n0.033\n0.227\n0.036\n-0.111\n0.046\nOurs (Loco-Only)\n0.020\n-0.090\n0.081\n0.104\n0.234\n0.087\n-0.075\n0.088\nTemporal Recurrent\n-0.162\n-0.114\n-0.101\n0.316\n0.135\n0.066\n-0.176\n0.085\nBest (lowest) results are shown in\nbold\n.\nTABLE V:\nSuccess Rates (%) of the Student Policy under Noise and Sensor Degradation\nSetup\nTraining Terrains\nTest Terrains\nDense\nClimbing\nSparse\nTest 1\nTest 2\nTest 3\nTest 4\navg. Test\nNominal\n96.4\n96.4\n91.8\n90.0\n77.7\n89.1\n72.9\n82.4\n20\n%\n20\\%\nMissing Points\n95.5\n94.9\n91.3\n91.1\n77.3\n90.3\n74.8\n83.4\n3\n%\n3\\%\nArtifacts\n96.4\n97.6\n93.2\n95.2\n72.8\n92.5\n80.3\n85.2\n1\n1\nCamera Disabled\n91.2\n82.0\n85.9\n95.1\n56.0\n1.1\n74.6\n56.7\nFigure 19:\nQualitative comparison between the temporal recurrent model and our mapping pipeline on training and test terrains. The visualized maps are egocentric, with the robot facing rightward. Our mapping pipeline produces accurate estimations when confident and assigns high uncertainty to occluded regions. In contrast, the temporal recurrent model generates less meaningful uncertainty maps, loses fine-grained details, and performs worse on unseen terrains.\nWe benchmark our mapping pipeline against two baselines:\n1.\nOur pipeline, with the mapping model trained only on locomotion training terrains.\n2.\nA temporal recurrent model that directly predicts egocentric elevation maps from local grid observations and delta transforms.\nThe first baseline tests whether additional diverse meshes (both traversable and untraversable) are necessary for better generalization. The second contrasts our per-frame fusion approach with an end-to-end recurrent neural memory model: the recurrent model tends to overfit terrain patterns seen during training and produces lower-quality maps on unseen terrains, as we will show in the qualitative comparison in Fig.\n19\n.\nAll pipelines are evaluated on data collected from the same rollout trajectories, with results reported in Table\nIV\n. We use the\nL\n0.5\nL_{0.5}\nloss defined in Eq.\n9\nas the metric, which balances estimation accuracy and uncertainty quantification. The temporal recurrent model (detailed in Appendix\nD\n) uses a CNN encoder for local grids, an MLP encoder for delta transforms, and Spatially-Enhanced Recurrent Units (SRU), an architecture that enables 100 m-scale mapless visual navigation\n[\n88\n]\n, as the memory module. To stabilize training and prevent the model from collapsing to large uncertainties and poor estimates, we have to train the recurrent model only on locomotion training terrains with the policy in the loop (as done in prior work\n[\n33\n,\n29\n]\n) and add an auxiliary L2 loss on the elevation estimates in addition to\nL\n0.5\nL_{0.5}\n. This setup requires roughly\n5\n×\n5\\times\nmore training time to converge than our mapping models.\nIt is worth noting that the recurrent model can optimize both the elevation estimates and the associated uncertainties in unseen regions based on the training distribution, which is advantageous under the\nL\n0.5\nL_{0.5}\nloss, whereas our pipeline uses heuristic defaults. However, as illustrated in Fig.\n19\n, our mapping pipeline produces higher-quality maps in practice, and can effectively model occlusions with high uncertainties.\nVII-D\nRobustness to Visual Noise\nWe validate the robustness of our system to noise and sensor degradation. We evaluate our student policy’s success rates under missing points (removed from depth clouds), artifacts (replaced by random points in depth clouds), and with the front upper camera disabled. The tested setups are all above the randomization ranges during training.\nThe results are presented in Table\nV\n. Under missing points and artifacts, we find the policy performance does not drop, and can sometimes be slightly better. This can be explained by that, fewer effective points in the depth clouds result in more uncertain regions and make the policy behave more conservatively.\nWhen the front upper camera is disabled, the system still performs well on most terrains without re-training, highlighting the flexibility of our method for different sensor configurations. However, on terrains that require active perception, such as the high obstacles to climb in\nTest 2\nand\nTest 3\n, the policy struggles, suggesting that these behaviors remain sensitive to the available sensor viewpoints.\nVIII\nDiscussion\nIn this paper, we propose AME-2, a unified RL framework for agile and generalizable legged locomotion with attention-based neural map encoding. We use goal-reaching rewards to incentivize agile behaviors, and design the AME-2 encoder to achieve generalization across diverse challenging terrains. To facilitate sim-to-real deployment, we combine teacher-student learning with RL and introduce a lightweight neural mapping pipeline that explicitly models partial observability while running identically in simulation and on real robots. Our framework applies to both a quadruped and a biped without changing the rewards or training settings.\nVIII-A\nModular v.s. End-to-End\nClassical locomotion systems\n[\n2\n,\n4\n]\nuse modular designs (perception, planning, and control) to make the problem tractable, and can generalize well when their underlying assumptions hold (e.g., low uncertainty, stable foot contacts, accurate mapping and dynamics modeling). Recent works instead reduce system complexity through end-to-end sensor-to-motor policy learning\n[\n48\n,\n38\n]\n, but have not yet demonstrated strong generalization to unseen terrains.\nOur work tries to bridge these two. We use a mapping module and a controller module, and train the neural controller end-to-end to generate joint actions from observations. In the controller, our AME-2 encoder also learns planning-level representations (global context and local contact-relevant features) for the subsequent decoder, playing a similar role to the planning module in classical solutions. This design preserves a modular structure at the system level while avoiding explicit online model-based planning. In the mapping module, we keep a simple heuristic structure, but also run a lightweight neural network in the loop to improve robustness and generalization under noise, partial observability, and unseen terrain patterns.\nVIII-B\nGoal Reaching v.s. Velocity Tracking\nWe use a goal-reaching formulation\n[\n20\n]\ninstead of velocity tracking\n[\n15\n]\n. This encourages more agile behaviors and reduces reliance on high-frequency navigation commands. A drawback is that it offers less direct control over the robot’s intermediate motion, which can be troublesome when semantic obstacles lie along the path but appear traversable from the geometry. We envision combining both command interfaces within a single controller in future work, e.g., via masked commands and distillation\n[\n89\n]\n.\nVIII-C\nWhole-Body Skills\nWe achieve whole-body locomotion skills in this work, but for a given terrain type the learned motions tend to follow similar contact patterns. For systems with higher DoFs, such as humanoids, the same terrain type at different scales may require different contact strategies. For example, a humanoid may step onto low obstacles with a single leg, use a two-leg jump for medium heights, and leverage both arms and legs for higher obstacles. It remains unclear whether our method, without additional references or priors such as\n[\n86\n]\n, can automatically discover such diverse contact patterns to handle a broader range of terrains in higher-DoF systems.\nVIII-D\nTowards Higher Success Rates on Unseen Terrains\nWe still observe more failures on unseen test terrains than on training terrains, as expected for learning-based systems. Notably, most failures occur during skill transitions. For example, on\nTest 2\nthe robot must first decelerate on a sparse region and then execute a climbing maneuver while maintaining precise hind-leg footholds. While these specific cases could likely be addressed by finetuning\n[\n48\n]\n, it remains unclear whether there is a scalable, principled approach for learning such challenging skill transitions with zero-shot generalization.\nVIII-E\nLimitations and Future Work\nThis work has several limitations. First, we use a 2.5-D elevation map and do not address fully 3-D locomotion. Future work could incorporate multi-layer elevation maps\n[\n24\n]\n, which are directly compatible with our policy architecture, or explore attention-based voxel representations. Second, our controllers are not designed for severely degraded perception, such as high grass or snow. A promising direction is to combine robust controllers\n[\n14\n]\nwith our agile and generalized controllers into a single scene-aware policy. Third, our mapping module can fail in highly dynamic environments with occlusions, and could be extended to explicitly reason about moving elements in the scene.\nAcknowledgments\nThis work is funded by ETH AI Center, NCCR automation, Apple Inc. Any views, opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and should not be interpreted as reflecting the views, policies or position, either expressed or implied, of Apple Inc.\nWe thank the help and insights from Yuni Fuchioka, Elena Krasnova, William Talbot, Junzhe He, Matthias Heyrman, Clemens Schwarke, Jonas Frey, Manthan Patel, Emilio Palma, Vladlen Koltun, Matthias Müller, Siyuan Hu. We thank the support from Martin Vechev. We thank the technical support from LimX Dynamics and ANYbotics.\nAppendix A\nTerrain Parameters\nWe use the following terrain proportions and parameters for training:\n•\nRough (Dense, 5%)\n: Heightfields generated from uniform noise, with terrain resolution smaller than the map resolution. Over the curriculum, the noise range increases from\n±\n0\n\\pm 0\nm to\n±\n0.2\n\\pm 0.2\nm for ANYmal-D, and from\n±\n0\n\\pm 0\nm to\n±\n0.15\n\\pm 0.15\nm for TRON1. Goals are sampled anywhere on the terrain.\n•\nStair Down (Dense, 5%)\n: Floating stairs descending with random widths and random walls on both sides. The slope is increased from\n5\n∘\n5^{\\circ}\nto\n45\n∘\n45^{\\circ}\nover the curriculum for both robots. Goals are sampled anywhere on the terrain.\n•\nStair Up (Dense, 5%)\n: Floating stairs ascending with random widths and random walls on both sides. The slope is increased from\n5\n∘\n5^{\\circ}\nto\n45\n∘\n45^{\\circ}\nover the curriculum for both robots. Goals are sampled anywhere on the terrain.\n•\nBoxes (Dense, 5%)\n: Heightfields generated by adding and removing random boxes on flat ground. Over the curriculum, the maximum box height increases from\n0.05\n0.05\nm to\n0.4\n0.4\nm for ANYmal-D, and from\n0.05\n0.05\nm to\n0.3\n0.3\nm for TRON1. Goals are sampled anywhere on the terrain.\n•\nObstacles (Dense, 5%)\n: Random positive and negative obstacles placed on random slopes. Over the curriculum, the obstacle density increases from\n0\n​\nm\n−\n2\n0~\\mathrm{m}^{-2}\nto\n0.5\n​\nm\n−\n2\n0.5~\\mathrm{m}^{-2}\nfor both robots. Goals are sampled anywhere on the terrain.\n•\nClimbing Up (Climbing, 20%)\n: A pit to climb out of, with vertices near the edges randomly perturbed by up to 20% of the height. Over the curriculum, the pit height increases from\n0.1\n0.1\nm to\n1.0\n1.0\nm for ANYmal-D, and from\n0.1\n0.1\nm to\n0.48\n0.48\nm for TRON1. Goals are sampled at the other end of the terrain.\n•\nClimbing Down (Climbing, 5%)\n: A platform to climb down from, with vertices near the edges randomly perturbed by up to 20% of the height. Over the curriculum, the platform height increases from\n0.2\n0.2\nm to\n1.0\n1.0\nm for ANYmal-D, and from\n0.2\n0.2\nm to\n0.88\n0.88\nm for TRON1. Goals are sampled at the other end of the terrain.\n•\nClimbing Consecutive (Climbing, 5%)\n: Two stacked layers of rings to climb out of. The robot needs to consecutively climb up twice and then climb down twice. Over the curriculum, the first ring height increases from\n0.05\n0.05\nm to\n0.5\n0.5\nm for ANYmal-D and from\n0.05\n0.05\nm to\n0.3\n0.3\nm for TRON1. The second ring height increases from\n0.05\n0.05\nm to\n0.4\n0.4\nm for ANYmal-D and from\n0.05\n0.05\nm to\n0.3\n0.3\nm for TRON1. Goals are sampled at the other end of the terrain.\n•\nGap (Sparse, 5%)\n: A gap to jump over, with vertices near the edges randomly perturbed by up to\n10\n%\n10\\%\nof the distance, and a height difference between the two sides randomly sampled within\n±\n30\n%\n\\pm 30\\%\nof the distance. Over the curriculum, the distance increases from\n0.1\n0.1\nm to\n1.1\n1.1\nm for ANYmal-D and from\n0.1\n0.1\nm to\n0.6\n0.6\nm for TRON1. Goals are sampled at the other end of the terrain.\n•\nPallets (Sparse, 5%)\n: Parallel beams with random orientations. Over the curriculum, the beam width decreases from\n0.4\n0.4\nm to\n0.16\n0.16\nm for both robots. The gap width increases from\n0.08\n0.08\nm to\n0.35\n0.35\nm for ANYmal-D and from\n0.08\n0.08\nm to\n0.2\n0.2\nm for TRON1. The inter-beam height difference increases from\n0\nm to\n0.3\n0.3\nm for ANYmal-D and from\n0\nm to\n0.2\n0.2\nm for TRON1. Goals are sampled at the other end of the terrain.\n•\nStones (Sparse, 30%)\n: We follow the “Stones-Everywhere” design in\n[\n26\n]\nand\n[\n15\n]\n. Goals are sampled anywhere on the terrain.\n•\nBeam (Sparse, 5%)\n: A beam connecting two platforms, randomly inclined with roll, pitch, and yaw sampled within\n±\n0.1\n​\nrad\n\\pm 0.1~\\mathrm{rad}\n, and with a platform height difference sampled within\n±\n0.2\n\\pm 0.2\nm. Over the curriculum, the beam width decreases from\n0.9\n0.9\nm to\n0.18\n0.18\nm for both robots. Goals are sampled at the other end of the terrain.\nFor sparse terrains, we add physical floors to half of them and virtual floors (visible in the map without physical collision) to the other half. The floor height is randomized between\n−\n1.5\n-1.5\nm and\n−\n0.35\n-0.35\nm. This discourages the robot from walking on the floor when traversing shallow sparse terrains.\nAppendix B\nRandomization Parameters\nFor both robots, we randomize the payload within\n[\n−\n5\n,\n5\n]\n​\nkg\n[-5,5]~\\mathrm{kg}\n, actuation delays within\n[\n0\n,\n0.02\n]\n​\ns\n[0,0.02]~\\mathrm{s}\n, and friction coefficients within\n[\n0.3\n,\n1.0\n]\n[0.3,1.0]\n. For TRON1, we additionally apply random biases to PD gains and armatures within\n±\n15\n%\n\\pm 15\\%\nof the raw values.\nFor policy observations, we add zero-mean uniform noise with the following maximum magnitudes:\n0.1\n0.1\nm/s for base linear velocity,\n0.2\n0.2\nrad/s for base angular velocity,\n0.05\n0.05\nfor projected gravity,\n0.01\n0.01\nrad for joint positions,\n1.5\n1.5\nrad/s for joint velocities, and\n0.05\n0.05\nm for map observations. We also add a random drift within\n[\n−\n0.03\n,\n0.03\n]\n​\nm\n[-0.03,0.03]~\\mathrm{m}\nwhen querying map observations.\nDuring student policy training, we make\n15\n%\n15\\%\nof depth cloud points missing and\n2\n%\n2\\%\nartifacts. We give\n10\n%\n10\\%\nof the environments access to complete maps with variance\n0.0025\n​\nm\n2\n0.0025~\\mathrm{m}^{2}\n. We corrupt\n1\n%\n1\\%\npoints in the student map observations by assigning random values with a random variance larger than\n1\n​\nm\n2\n1~\\mathrm{m}^{2}\n.\nAppendix C\nPPO Parameters\nWe use the following PPO parameters in Table\nVI\n.\nTABLE VI:\nPPO Parameters\nParameter\nValue\nValue Loss Coefficient\n1.0\nValue Loss Clip\n0.2\nEntropy Coefficient\nDecay from 0.004 to 0.001\nLearning Epochs per Iteration\n4\nMini Batches per Iteration\n3\nSimulation Steps per Iteration\n24\nNumber of Environments\n4800\nLearning Rate\nAdaptive\nγ\n\\gamma\n0.99\nλ\n\\lambda\n0.95\nDesired KL Divergence\n0.01\nStudent only\nLearning Rate When Surrogate Loss Disabled\n0.001\nAction Distillation Loss Coefficient\n0.02\nRepresentation Loss Coefficient\n0.2\nAppendix D\nTemporal Recurrent Baseline Mapping Model\nThe architecture of the recurrent model used as the mapping baseline is shown in Fig.\n20\n.\nWe provide the model with ground-truth delta transforms, which are sufficient for map reconstruction and serve as a clean replacement for the proprioceptive observations used in prior work\n[\n29\n,\n33\n]\n, where transforms are not directly available.\nFigure 20:\nThe temporal recurrent model architecture to predict egocentric elevation mapping.\nReferences\n[1]\nP. Fankhauser, M. Bjelonic, C. D. Bellicoso, T. Miki, and M. Hutter, “Robust rough-terrain locomotion with a quadrupedal robot,” in\n2018 IEEE International Conference on Robotics and Automation (ICRA)\n. IEEE, 2018, pp. 5761–5768.\n[2]\nF. Jenelten, R. Grandia, F. Farshidian, and M. Hutter, “Tamols: Terrain-aware motion optimization for legged systems,”\nIEEE Transactions on Robotics\n, vol. 38, no. 6, pp. 3395–3413, 2022.\n[3]\nS. Fahmi, V. Barasuol, D. Esteban, O. Villarreal, and C. Semini, “Vital: Vision-based terrain-aware locomotion for legged robots,”\nIEEE Transactions on Robotics\n, vol. 39, no. 2, pp. 885–904, 2022.\n[4]\nR. Grandia, F. Jenelten, S. Yang, F. Farshidian, and M. Hutter, “Perceptive locomotion through nonlinear model-predictive control,”\nIEEE Transactions on Robotics\n, vol. 39, no. 5, pp. 3402–3421, 2023.\n[5]\nR. Akizhanov, V. Dhédin, M. Khadiv, and I. Laptev, “Learning feasible transitions for efficient contact planning,”\narXiv preprint arXiv:2407.11788\n, 2024.\n[6]\nR. J. Griffin, G. Wiedebach, S. McCrory, S. Bertrand, I. Lee, and J. Pratt, “Footstep planning for autonomous walking over rough terrain,” in\n2019 IEEE-RAS 19th International Conference on Humanoid Robots (Humanoids)\n, 2019, pp. 9–16.\n[7]\nC. Mastalli, W. Merkt, G. Xin, J. Shim, M. Mistry, I. Havoutis, and S. Vijayakumar, “Agile maneuvers in legged robots: a predictive control approach,”\narXiv preprint arXiv:2203.07554\n, 2022.\n[8]\nF. Jenelten, T. Miki, A. E. Vijayan, M. Bjelonic, and M. Hutter, “Perceptive locomotion in rough terrain – online foothold optimization,”\nIEEE Robotics and Automation Letters\n, vol. 5, no. 4, pp. 5370–5376, 2020.\n[9]\nF. Jenelten, J. Hwangbo, F. Tresoldi, C. D. Bellicoso, and M. Hutter, “Dynamic locomotion on slippery ground,”\nIEEE Robotics and Automation Letters\n, vol. 4, no. 4, pp. 4170–4176, 2019.\n[10]\nP. Fankhauser, M. Bloesch, and M. Hutter, “Probabilistic terrain mapping for mobile robots with uncertain localization,”\nIEEE Robotics and Automation Letters\n, vol. 3, no. 4, pp. 3019–3026, 2018.\n[11]\nT. Miki, L. Wellhausen, R. Grandia, F. Jenelten, T. Homberger, and M. Hutter, “Elevation mapping for locomotion and navigation using gpu,” in\n2022 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)\n, 2022, pp. 2273–2280.\n[12]\nS. Ha, J. Lee, M. van de Panne, Z. Xie, W. Yu, and M. Khadiv, “Learning-based legged locomotion: State of the art and future perspectives,”\nThe International Journal of Robotics Research\n, vol. 44, no. 8, pp. 1396–1427, 2025.\n[13]\nN. Rudin, D. Hoeller, P. Reist, and M. Hutter, “Learning to walk in minutes using massively parallel deep reinforcement learning,” in\nConference on robot learning\n. PMLR, 2022, pp. 91–100.\n[14]\nT. Miki, J. Lee, J. Hwangbo, L. Wellhausen, V. Koltun, and M. Hutter, “Learning robust perceptive locomotion for quadrupedal robots in the wild,”\nScience robotics\n, vol. 7, no. 62, p. eabk2822, 2022.\n[15]\nJ. He, C. Zhang, F. Jenelten, R. Grandia, M. Bächer, and M. Hutter, “Attention-based map encoding for learning generalized legged locomotion,”\nScience Robotics\n, vol. 10, no. 105, p. eadv3604, 2025.\n[16]\nA. Allshire, H. Choi, J. Zhang, D. McAllister, A. Zhang, C. M. Kim, T. Darrell, P. Abbeel, J. Malik, and A. Kanazawa, “Visual imitation enables contextual humanoid control,”\narXiv preprint arXiv:2505.03729\n, 2025.\n[17]\nJ. Long, J. Ren, M. Shi, Z. Wang, T. Huang, P. Luo, and J. Pang, “Learning humanoid locomotion with perceptive internal model,” in\n2025 IEEE International Conference on Robotics and Automation (ICRA)\n. IEEE, 2025, pp. 9997–10 003.\n[18]\nJ. Ren, T. Huang, H. Wang, Z. Wang, Q. Ben, J. Long, Y. Yang, J. Pang, and P. Luo, “Vb-com: Learning vision-blind composite humanoid locomotion against deficient perception,”\narXiv preprint arXiv:2502.14814\n, 2025.\n[19]\nH. Wang, Z. Wang, J. Ren, Q. Ben, T. Huang, W. Zhang, and J. Pang, “Beamdojo: Learning agile humanoid locomotion on sparse footholds,” in\nRobotics: Science and Systems (RSS)\n, 2025.\n[20]\nN. Rudin, D. Hoeller, M. Bjelonic, and M. Hutter, “Advanced skills by learning locomotion and local navigation end-to-end,” in\n2022 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)\n, 2022, pp. 2497–2503.\n[21]\nF. Jenelten, J. He, F. Farshidian, and M. Hutter, “Dtc: Deep tracking control,”\nScience Robotics\n, vol. 9, no. 86, p. eadh5401, 2024.\n[22]\nS. Gangapurwala, M. Geisert, R. Orsolino, M. Fallon, and I. Havoutis, “Rloc: Terrain-aware legged locomotion using reinforcement learning and optimal control,”\nIEEE Transactions on Robotics\n, vol. 38, no. 5, pp. 2908–2927, 2022.\n[23]\nY. Dong, J. Ma, L. Zhao, W. Li, and P. Lu, “Marg: Mastering risky gap terrains for legged robots with elevation mapping,”\nIEEE Transactions on Robotics\n, 2025.\n[24]\nY. Chen, J. Ma, Z. Luo, Y. Han, Y. Dong, B. Xu, and P. Lu, “Learning autonomous and safe quadruped traversal of complex terrains using multi-layer elevation maps,”\nIEEE Robotics and Automation Letters\n, 2025.\n[25]\nT. Miki, J. Lee, L. Wellhausen, and M. Hutter, “Learning to walk in confined spaces using 3d representation,” in\n2024 IEEE International Conference on Robotics and Automation (ICRA)\n, 2024, pp. 8649–8656.\n[26]\nC. Zhang, N. Rudin, D. Hoeller, and M. Hutter, “Learning agile locomotion on risky terrains,” in\n2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)\n. IEEE, 2024, pp. 11 864–11 871.\n[27]\nF. Shi, C. Zhang, T. Miki, J. Lee, M. Hutter, and S. Coros, “Rethinking robustness assessment: Adversarial attacks on learning-based quadrupedal locomotion controllers,” in\nRobotics: Science and Systems XX, Delft, The Netherlands, July 15-19, 2024\n, D. Kulic, G. Venture, K. E. Bekris, and E. Coronado, Eds., 2024.\n[28]\nJ. Lee, M. Bjelonic, A. Reske, L. Wellhausen, T. Miki, and M. Hutter, “Learning robust autonomous navigation and locomotion for wheeled-legged robots,”\nScience Robotics\n, vol. 9, no. 89, p. eadi9641, 2024.\n[29]\nJ. Sun, G. Han, P. Sun, W. Zhao, J. Cao, J. Wang, Y. Guo, and Q. Zhang, “Dpl: Depth-only perceptive humanoid locomotion via realistic depth synthesis and cross-attention terrain reconstruction,”\narXiv preprint arXiv:2510.07152\n, 2025.\n[30]\nY. Yang, G. Shi, C. Lin, X. Meng, R. Scalise, M. G. Castro, W. Yu, T. Zhang, D. Zhao, J. Tan\net al.\n, “Agile continuous jumping in discontinuous terrains,” in\n2025 IEEE International Conference on Robotics and Automation (ICRA)\n. IEEE, 2025, pp. 10 245–10 252.\n[31]\nD. Hoeller, N. Rudin, C. Choy, A. Anandkumar, and M. Hutter, “Neural scene representation for locomotion on structured terrain,”\nIEEE Robotics and Automation Letters\n, vol. 7, no. 4, pp. 8667–8674, 2022.\n[32]\nD. Hoeller, N. Rudin, D. Sako, and M. Hutter, “Anymal parkour: Learning agile navigation for quadrupedal robots,”\nScience Robotics\n, vol. 9, no. 88, p. eadi7566, 2024.\n[33]\nR. Yu, Q. Wang, Y. Wang, Z. Wang, J. Wu, and Q. Zhu, “Walking with terrain reconstruction: Learning to traverse risky sparse footholds,”\narXiv preprint arXiv:2409.15692\n, 2024.\n[34]\nH. Duan, B. Pandit, M. S. Gadde, B. Van Marum, J. Dao, C. Kim, and A. Fern, “Learning vision-based bipedal locomotion for challenging terrain,” in\n2024 IEEE International Conference on Robotics and Automation (ICRA)\n. IEEE, 2024, pp. 56–62.\n[35]\nA. Agarwal, A. Kumar, J. Malik, and D. Pathak, “Legged locomotion in challenging terrains using egocentric vision,” in\nProceedings of The 6th Conference on Robot Learning\n. PMLR, 2023.\n[36]\nX. Cheng, K. Shi, A. Agarwal, and D. Pathak, “Extreme parkour with legged robots,” in\n2024 IEEE International Conference on Robotics and Automation (ICRA)\n. IEEE, 2024, pp. 11 443–11 450.\n[37]\nR. Yang, M. Zhang, N. Hansen, H. Xu, and X. Wang, “Learning vision-guided quadrupedal locomotion end-to-end with cross-modal transformers,” in\nInternational Conference on Learning Representations\n, 2022.\n[38]\nZ. Zhuang, S. Yao, and H. Zhao, “Humanoid parkour learning,” in\nConference on Robot Learning\n. PMLR, 2025, pp. 1975–1991.\n[39]\nS. Li, S. Luo, J. Wu, and Q. Zhu, “Move: Multi-skill omnidirectional legged locomotion with limited view in 3d environments,” in\n2025 IEEE International Conference on Robotics and Automation (ICRA)\n, 2025, pp. 7647–7653.\n[40]\nQ. Ben, B. Xu, K. Li, F. Jia, W. Zhang, J. Wang, J. Wang, D. Lin, and J. Pang, “Gallant: Voxel grid-based humanoid locomotion and local-navigation across 3d constrained terrains,”\narXiv preprint arXiv:2511.14625\n, 2025.\n[41]\nS. Luo, S. Li, R. Yu, Z. Wang, J. Wu, and Q. Zhu, “Pie: Parkour with implicit-explicit learning framework for legged robots,”\nIEEE Robotics and Automation Letters\n, vol. 9, no. 11, pp. 9986–9993, 2024.\n[42]\nE. Chane-Sane, J. Amigo, T. Flayols, L. Righetti, and N. Mansard, “Soloparkour: Constrained reinforcement learning for visual locomotion from privileged experience,” in\nProceedings of The 8th Conference on Robot Learning\n, ser. Proceedings of Machine Learning Research, vol. 270. PMLR, 2025, pp. 4268–4285.\n[43]\nS. Kareer, N. Yokoyama, D. Batra, S. Ha, and J. Truong, “Vinl: Visual navigation and locomotion over obstacles,” in\n2023 IEEE International Conference on Robotics and Automation (ICRA)\n. IEEE, 2023, pp. 2018–2024.\n[44]\nH. Lai, J. Cao, J. Xu, H. Wu, Y. Lin, T. Kong, Y. Yu, and W. Zhang, “World model-based perception for visual legged locomotion,” in\n2025 IEEE International Conference on Robotics and Automation (ICRA)\n, 2025, pp. 11 531–11 537.\n[45]\nP. Li, H. Li, Y. Ma, L. Chang, X. Yang, R. Yu, Y. Zhang, Y. Cao, Q. Zhu, and G. Sartoretti, “Kivi: Kinesthetic-visuospatial integration for dynamic and safe egocentric legged locomotion,”\narXiv preprint arXiv:2509.23650\n, 2025.\n[46]\nH. Su, H. Luo, S. Yang, K. Jiang, W. Zhang, and H. Chen, “Lipm-guided reinforcement learning for stable and perceptive locomotion in bipedal robots,” in\n2025 IEEE-RAS 24th International Conference on Humanoid Robots (Humanoids)\n, 2025, pp. 1031–1038.\n[47]\nD. Wang, X. Wang, X. Liu, J. Shi, Y. Zhao, C. Bai, and X. Li, “More: Mixture of residual experts for humanoid lifelike gaits learning on complex terrains,”\narXiv preprint arXiv:2506.08840\n, 2025.\n[48]\nN. Rudin, J. He, J. Aurand, and M. Hutter, “Parkour in the wild: Learning a general and extensible agile locomotion policy using multi-expert distillation and rl fine-tuning,”\narXiv preprint arXiv:2505.11164\n, 2025.\n[49]\nT. He, C. Zhang, W. Xiao, G. He, C. Liu, and G. Shi, “Agile but safe: Learning collision-free high-speed legged locomotion,” in\nProceedings of Robotics: Science and Systems\n, Delft, Netherlands, July 2024.\n[50]\nC. Zhang, J. Jin, J. Frey, N. Rudin, M. Mattamala, C. Cadena, and M. Hutter, “Resilient legged local navigation: Learning to traverse with compromised perception end-to-end,” in\n2024 IEEE International Conference on Robotics and Automation (ICRA)\n, 2024, pp. 34–41.\n[51]\nA. Kendall and Y. Gal, “What uncertainties do we need in bayesian deep learning for computer vision?”\nAdvances in neural information processing systems\n, vol. 30, 2017.\n[52]\nS. Jung, D. Gwak, B. Boots, and J. Hays, “Uncertainty-aware accurate elevation modeling for off-road navigation via neural processes,” in\nConference on Robot Learning\n. PMLR, 2025, pp. 2802–2822.\n[53]\nH. Wang, Z. Shi, C. Zhu, Y. Qiao, C. Zhang, F. Yang, P. Ren, L. Lu, and D. Xuan, “Integrating learning-based manipulation and physics-based locomotion for whole-body badminton robot control,”\narXiv preprint arXiv:2504.17771\n, 2025.\n[54]\nM. Hutter, C. Gehring, D. Jud, A. Lauber, C. D. Bellicoso, V. Tsounis, J. Hwangbo, K. Bodie, P. Fankhauser, M. Bloesch\net al.\n, “Anymal-a highly mobile and dynamic quadrupedal robot,” in\n2016 IEEE/RSJ international conference on intelligent robots and systems (IROS)\n. IEEE, 2016, pp. 38–44.\n[55]\nLimX Dynamics, “TRON 1: The first multi-modal biped robot,”\nhttps://www.limxdynamics.com/en/tron1\n, 2025, accessed: 2025-11-23.\n[56]\nH. J. Lee, S. Hong, and S. Kim, “Integrating model-based footstep planning with model-free reinforcement learning for dynamic legged locomotion,” in\n2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)\n. IEEE, 2024, pp. 11 248–11 255.\n[57]\nW. Yu, D. Jain, A. Escontrela, A. Iscen, P. Xu, E. Coumans, S. Ha, J. Tan, and T. Zhang, “Visual-locomotion: Learning to walk on complex terrains with vision,” in\n5th Annual Conference on Robot Learning\n, 2021.\n[58]\nR. Yang, G. Yang, and X. Wang, “Neural volumetric memory for visual locomotion control,” in\nProceedings of the IEEE/CVF conference on computer vision and pattern recognition\n, 2023, pp. 1430–1440.\n[59]\nH. Kim, A. Mnih, J. Schwarz, M. Garnelo, A. Eslami, D. Rosenbaum, O. Vinyals, and Y. W. Teh, “Attentive neural processes,”\narXiv preprint arXiv:1901.05761\n, 2019.\n[60]\nJ. Schulman, F. Wolski, P. Dhariwal, A. Radford, and O. Klimov, “Proximal policy optimization algorithms,”\narXiv preprint arXiv:1707.06347\n, 2017.\n[61]\nV. Makoviychuk, L. Wawrzyniak, Y. Guo, M. Lu, K. Storey, M. Macklin, D. Hoeller, N. Rudin, A. Allshire, A. Handa\net al.\n, “Isaac gym: High performance gpu-based physics simulation for robot learning,”\narXiv preprint arXiv:2108.10470\n, 2021.\n[62]\nX. B. Peng and M. van de Panne, “Learning locomotion skills using deeprl: does the choice of action space matter?” in\nProceedings of the ACM SIGGRAPH / Eurographics Symposium on Computer Animation\n, ser. SCA ’17. New York, NY, USA: Association for Computing Machinery, 2017.\n[63]\nA. Vaswani, N. Shazeer, N. Parmar, J. Uszkoreit, L. Jones, A. N. Gomez, Ł. Kaiser, and I. Polosukhin, “Attention is all you need,”\nAdvances in neural information processing systems\n, vol. 30, 2017.\n[64]\nC. Zhang, W. Xiao, T. He, and G. Shi, “Wococo: Learning whole-body humanoid control with sequential contacts,” in\nProceedings of The 8th Conference on Robot Learning\n, ser. Proceedings of Machine Learning Research, vol. 270. PMLR, 2025, pp. 455–472.\n[65]\nT. He, Z. Luo, X. He, W. Xiao, C. Zhang, W. Zhang, K. M. Kitani, C. Liu, and G. Shi, “Omnih2o: Universal and dexterous human-to-humanoid whole-body teleoperation and learning,” in\nProceedings of The 8th Conference on Robot Learning\n, ser. Proceedings of Machine Learning Research, vol. 270. PMLR, November 2025, pp. 1516–1540. [Online]. Available:\nhttps://proceedings.mlr.press/v270/he25b.html\n[66]\nZ. Li, X. B. Peng, P. Abbeel, S. Levine, G. Berseth, and K. Sreenath, “Reinforcement learning for versatile, dynamic, and robust bipedal locomotion control,”\nThe International Journal of Robotics Research\n, 2024.\n[67]\nL. Pinto, M. Andrychowicz, P. Welinder, W. Zaremba, and P. Abbeel, “Asymmetric actor critic for image-based robot learning,” in\nRobotics: Science and Systems XIV, Carnegie Mellon University, Pittsburgh, Pennsylvania, USA, June 26-30, 2018\n, H. Kress-Gazit, S. S. Srinivasa, T. Howard, and N. Atanasov, Eds., 2018. [Online]. Available:\nhttp://www.roboticsproceedings.org/rss14/p08.html\n[68]\nZ. Chen, M. Ji, X. Cheng, X. Peng, X. B. Peng, and X. Wang, “Gmt: General motion tracking for humanoid whole-body control,”\narXiv preprint arXiv:2506.14770\n, 2025.\n[69]\nN. Messikommer, J. Xing, E. Aljalbout, and D. Scaramuzza, “Student-informed teacher training,” in\n7th Robot Learning Workshop: Towards Robots with Human-Level Abilities\n, 2025. [Online]. Available:\nhttps://openreview.net/forum?id=q06EAFOwDI\n[70]\nJ. Lee, J. Hwangbo, L. Wellhausen, V. Koltun, and M. Hutter, “Learning quadrupedal locomotion over challenging terrain,”\nScience robotics\n, vol. 5, no. 47, p. eabc5986, 2020.\n[71]\nT. Pfau, A. G. de Rivaz, S. Brighton, and R. Weller, “Kinetics of jump landing in agility dogs,”\nThe Veterinary Journal\n, vol. 190, no. 2, pp. 278–283, 2011.\n[72]\nS. McErlain-Naylor, M. King, and S. Allen, “Surface acceleration transmission during drop landings in humans,”\nJournal of Biomechanics\n, vol. 118, p. 110269, 2021.\n[73]\nJ. Tobin, R. Fong, A. Ray, J. Schneider, W. Zaremba, and P. Abbeel, “Domain randomization for transferring deep neural networks from simulation to the real world,” in\n2017 IEEE/RSJ international conference on intelligent robots and systems (IROS)\n. IEEE, 2017, pp. 23–30.\n[74]\nC. Schwarke, M. Mittal, N. Rudin, D. Hoeller, and M. Hutter, “Rsl-rl: A learning library for robotics research,”\narXiv preprint arXiv:2509.10771\n, 2025.\n[75]\nO. R. developers, “Onnx runtime,”\nhttps://onnxruntime.ai/\n, 2025.\n[76]\nJ. Hwangbo, J. Lee, A. Dosovitskiy, D. Bellicoso, V. Tsounis, V. Koltun, and M. Hutter, “Learning agile and dynamic motor skills for legged robots,”\nScience Robotics\n, vol. 4, no. 26, p. eaau5872, 2019.\n[77]\nY.-H. Shin, T.-G. Song, G. Ji, and H.-W. Park, “Actuator-constrained reinforcement learning for high-speed quadrupedal locomotion,”\narXiv preprint arXiv:2312.17507\n, 2023.\n[78]\nO. Ronneberger, P. Fischer, and T. Brox, “U-net: Convolutional networks for biomedical image segmentation,” in\nInternational Conference on Medical image computing and computer-assisted intervention\n. Springer, 2015, pp. 234–241.\n[79]\nM. Macklin, “Warp: A high-performance python framework for gpu simulation and graphics,”\nhttps://github.com/nvidia/warp\n, March 2022, nVIDIA GPU Technology Conference (GTC).\n[80]\nM. Seitzer, A. Tavakoli, D. Antic, and G. Martius, “On the pitfalls of heteroscedastic uncertainty estimation with probabilistic neural networks,” in\nInternational Conference on Learning Representations\n, 2022.\n[81]\nA. Chambolle, “An algorithm for total variation minimization and applications,”\nJournal of Mathematical imaging and vision\n, vol. 20, no. 1, pp. 89–97, 2004.\n[82]\nS. Khattak, T. Homberger, L. Bernreiter, J. Nubert, O. Andersson, R. Siegwart, K. Alexis, and M. Hutter, “Compslam: Complementary hierarchical multi-modal localization and mapping for robot autonomy in underground environments,”\narXiv preprint arXiv:2505.06483\n, 2025.\n[83]\nJ. Nubert, S. Khattak, and M. Hutter, “Graph-based multi-sensor fusion for consistent localization of autonomous construction robots,” in\n2022 International Conference on Robotics and Automation (ICRA)\n. IEEE, 2022, pp. 10 048–10 054.\n[84]\nK. Chen, R. Nemiroff, and B. T. Lopez, “Direct lidar-inertial odometry: Lightweight lio with continuous-time motion correction,” in\n2023 IEEE International Conference on Robotics and Automation (ICRA)\n. IEEE, 2023, pp. 3983–3989.\n[85]\nZ. Zhuang and H. Zhao, “Embrace contacts: humanoid shadowing with full body ground contacts,” in\n9th Annual Conference on Robot Learning\n, 2025.\n[86]\nL. Yang, X. Huang, Z. Wu, A. Kanazawa, P. Abbeel, C. Sferrazza, C. K. Liu, R. Duan, and G. Shi, “Omniretarget: Interaction-preserving data generation for humanoid whole-body loco-manipulation and scene interaction,”\narXiv preprint arXiv:2509.26633\n, 2025.\n[87]\nA. Dosovitskiy, L. Beyer, A. Kolesnikov, D. Weissenborn, X. Zhai, T. Unterthiner, M. Dehghani, M. Minderer, G. Heigold, S. Gelly, J. Uszkoreit, and N. Houlsby, “An image is worth 16x16 words: Transformers for image recognition at scale,”\nICLR\n, 2021.\n[88]\nF. Yang, P. Frivik, D. Hoeller, C. Wang, C. Cadena, and M. Hutter, “Spatially-enhanced recurrent memory for long-range mapless navigation via end-to-end reinforcement learning,”\nThe International Journal of Robotics Research\n, p. 02783649251401926, 2025.\n[89]\nT. He, W. Xiao, T. Lin, Z. Luo, Z. Xu, Z. Jiang, J. Kautz, C. Liu, G. Shi, X. Wang, L. J. Fan, and Y. Zhu, “HOVER: versatile neural whole-body controller for humanoid robots,” in\nIEEE International Conference on Robotics and Automation, ICRA\n. IEEE, 2025, pp. 9989–9996.",
    "preview_text": "Achieving agile and generalized legged locomotion across terrains requires tight integration of perception and control, especially under occlusions and sparse footholds. Existing methods have demonstrated agility on parkour courses but often rely on end-to-end sensorimotor models with limited generalization and interpretability. By contrast, methods targeting generalized locomotion typically exhibit limited agility and struggle with visual occlusions. We introduce AME-2, a unified reinforcement learning (RL) framework for agile and generalized locomotion that incorporates a novel attention-based map encoder in the control policy. This encoder extracts local and global mapping features and uses attention mechanisms to focus on salient regions, producing an interpretable and generalized embedding for RL-based control. We further propose a learning-based mapping pipeline that provides fast, uncertainty-aware terrain representations robust to noise and occlusions, serving as policy inputs. It uses neural networks to convert depth observations into local elevations with uncertainties, and fuses them with odometry. The pipeline also integrates with parallel simulation so that we can train controllers with online mapping, aiding sim-to-real transfer. We validate AME-2 with the proposed mapping pipeline on a quadruped and a biped robot, and the resulting controllers demonstrate strong agility and generalization to unseen terrains in simulation and in real-world experiments.\n\nAME-2: Agile and Generalized Legged Locomotion via Attention-Based Neural Map Encoding\nChong Zhang\n123∗\n, Victor Klemm\n1\n, Fan Yang\n1\n, Marco Hutter\n1\nWebsite:\nsites.google.com/leggedrobotics.com/ame-2\n1\nRobotic Systems Lab, ETH Zurich, Switzerland\n2\nSecure, Reliable, and Intelligent Systems Lab, ETH Zurich, Switzerland\n3\nETH AI Center, Switzerland\n∗\nCorresponding: chong.zhang@ai.ethz.ch\nAbstract\nAchieving agile and generalized legged locomotion across terrains requires tight integration of perception a",
    "is_relevant": true,
    "relevance_score": 9.0,
    "extracted_keywords": [
        "Reinforcement Learning",
        "locomotion",
        "whole body control"
    ],
    "one_line_summary": "AME-2是一个基于强化学习和注意力机制的地图编码框架，用于实现敏捷和通用的腿式机器人运动控制。",
    "detailed_summary": "## 论文《AME-2：基于注意力神经地图编码的敏捷通用腿式运动》详细摘要\n\n### 1. 研究背景和动机\n实现腿式机器人在复杂地形上的**敏捷且通用**的移动，需要紧密耦合感知与控制。现有方法存在局限：基于显式地图的模型方法通常**敏捷性不足**且对遮挡敏感；而基于原始传感器的端到端学习方法虽能实现高敏捷性，但**泛化能力有限**且缺乏可解释性。因此，亟需一个能同时兼顾**敏捷性、泛化性、鲁棒性和可解释性**的统一框架。\n\n### 2. 核心方法和技术创新\n本文提出 **AME-2**，一个统一的强化学习框架，其核心创新在于：\n- **注意力神经地图编码器 (AME-2 Encoder)**：从高程地图中提取**局部特征**（地形细节）和**全局特征**（地形上下文），并利用全局特征与本体感知通过注意力机制动态加权局部特征，生成**地形感知**的表示，从而提升策略对不同地形的泛化能力。\n- **轻量级、不确定性感知的神经建图流水线**：使用轻量级CNN，通过贝叶斯学习从深度图像预测**局部高程及其不确定性**，并通过一种**概率性赢家通吃**策略与里程计融合，构建全局地图。该流水线**显式建模遮挡和噪声**，且计算高效，可同时在仿真和真机上运行。\n- **师生学习方案**：先使用**真实地图**训练一个“教师”策略，再在“学生”策略训练中，使用上述神经建图流水线，并同时结合**强化学习损失、动作蒸馏损失和表征对齐损失**进行监督，最终得到一个可直接部署、保持教师策略性能的“学生”策略。\n\n### 3. 主要实验结果\n在ANYmal-D四足机器人和LimX TRON1双足机器人上进行了仿真与实物验证：\n- **敏捷性**：在未训练过的复杂跑酷和碎石地形上实现了**零样本**穿越，攀爬高度达到或超过现有先进水平。\n- **泛化性**：在多种未见过的**稀疏地形**（如窄梁、浮石、高台阶）上表现出强大的适应能力。\n- **鲁棒性**：对传感器噪声、部分点云缺失甚至单相机失效具有**强鲁棒性**；能在移动的不稳定地形上恢复平衡。\n- **建图质量**：建图流水线能实时生成包含**不确定性估计**的高质量地图，支持敏捷运动。\n- **可解释性**：AME-2编码器的注意力权重可视化显示，其能根据地形类型关注不同的关键区域（如边缘、平台表面）。\n\n### 4. 研究意义和价值\n本研究的意义在于：\n- **技术整合**：成功地将**学习型建图**与**学习型控制**在一个框架内结合，在保持模块化系统优点的同时，通过端到端训练克服了传统方法在敏捷性和不确定性处理上的瓶颈。\n- **性能突破**：首次在**同一训练设置下**，于四足和双足两个平台上同时实现了**先进水平的敏捷性与强大的零样本地形泛化能力**，为腿式机器人在复杂非结构化环境中的实际应用提供了更可靠的解决方案。\n- **工程实用**：提出的**轻量级神经建图流水线**和**师生训练方案**有效弥合了仿真到现实的鸿沟，推动了高性能学习控制器在真实机器人上的部署。",
    "qa_pairs": [
        {
            "question": "这篇论文的核心创新点是什么，他想解决什么问题，怎么解决的？",
            "answer": "## 论文核心分析：AME-2\n\n### **一、 核心问题**\n论文旨在解决**足式机器人感知运动**领域的一个关键矛盾：现有方法通常在**敏捷性**（如跑酷）和**泛化性**（适应未知复杂地形）之间难以兼顾。\n*   **传统模型方法**：依赖显式地图和规划，泛化性好但计算重、对模型误差敏感，难以实现高速动态运动。\n*   **端到端学习方法**：直接从原始传感器数据映射到动作，能实现高敏捷性，但泛化能力有限、可解释性差，且难以处理遮挡和稀疏立足点。\n\n### **二、 核心创新点**\n论文提出了一个统一的强化学习框架 **AME-2**，其创新是一个**系统性的组合**，而非单一技术，旨在同时实现**敏捷性、泛化性、可解释性和可部署性**。\n\n#### **1. 创新的注意力地图编码器 (AME-2 Encoder)**\n*   **是什么**：控制策略中的核心模块，用于处理高程地图输入。\n*   **怎么创新**：\n    *   **双路特征提取**：同时提取**局部特征**（地形细节）和**全局特征**（地形整体上下文）。\n    *   **上下文感知的注意力机制**：利用**全局特征**和**本体感知状态**生成查询向量，通过多头注意力（MHA）模块对局部特征进行加权。这使得策略能根据当前地形全局信息和机器人状态，动态关注地图中与当前任务最相关的区域。\n    *   **与AME-1的区别**：相比前作AME-1（仅基于本体感知加权局部特征），AME-2引入了全局上下文，使其能学习不同地形下的差异化运动模式，从而显著提升泛化能力（论文第VII-A节验证）。\n\n#### **2. 轻量级、不确定性感知的神经高程建图管道**\n*   **解决的问题**：摆脱对经典建图栈的依赖，提供快速、能处理噪声和遮挡、且易于仿真的地形表示。\n*   **怎么创新**：\n    *   **基于学习的单帧预测**：使用轻量级CNN（U-Net）直接从单帧深度图投影的局部网格中，**联合预测高程值和每个单元格的不确定性（方差）**。不确定性显式建模了噪声和遮挡。\n    *   **概率性“赢家通吃”融合策略**：将带不确定性的局部预测与基于里程计的全局地图融合。该策略能防止对遮挡区域的过度自信更新，同时允许在获得高置信度测量时快速更新地图。\n    *   **面向泛化的数据合成**：使用大规模随机生成的地形（包括机器人不可通行地形）训练建图模型，提升其面对未知地形的泛化能力。\n    *   **仿真-现实一致性**：同一套建图管道可无缝运行于大规模并行仿真和真实机器人上，直接缩小了仿真与现实差距。\n\n#### **3. 教师-学生训练范式与统一训练框架**\n*   **解决的问题**：高效训练出能直接部署、且保持教师策略性能的控制器。\n*   **怎么创新**：\n    *   **两阶段训练**：\n        1.  **教师策略**：在仿真中使用**真实高程地图**训练，学习敏捷和泛化的运动技能。\n        2.  **学生策略**：使用**上述神经建图管道**作为输入，在教师策略的监督下（通过动作蒸馏和表征对齐损失）结合RL进行训练。\n    *   **统一的奖励与课程设计**：为四足（ANYmal-D）和双足（TRON1）机器人设计了**同一套目标到达奖励函数和训练设置**，无需针对不同机器人平台进行繁琐调整，证明了框架的通用性。\n\n### **三、 解决方案总结**\n论文通过一个**紧密耦合的软硬件协同设计**来解决核心问题：\n\n1.  **感知层（输入）**：使用**不确定性感知神经建图管道**，提供鲁棒、快速、可泛化的地形表示。\n2.  **决策与控制层（核心）**：采用**AME-2编码器**的策略架构，从地图和本体感知中提取具有可解释性的、地形感知的特征表示，以驱动强化学习策略。\n3.  **训练与迁移层（桥梁）**：通过**教师-学生范式**，将在理想感知（真实地图）下学到的技能，高效迁移到使用实际建图管道的可部署策略上。\n\n### **四、 实际价值与验证**\n*   **性能表现**：在仿真和实物实验中，ANYmal-D和TRON1机器人均展示了**先进的敏捷性**（成功零样本通过高难度跑酷、攀爬地形）和**强大的泛化能力**（在大量未见过的稀疏、混合地形上稳定运动）。\n*   **涌现行为**：控制器表现出**主动感知**（通过交互更新地图）、**局部导航**（避障、对齐地形）、**全身接触**（使用膝盖辅助）和**冲击减缓**等高级智能行为。\n*   **可部署性**：整个系统（建图+控制）可在机载计算机上实时运行（策略推理约2ms，建图约5ms/帧），满足了现实应用的需求。\n\n**结论**：AME-2的核心贡献在于**系统性地整合了创新的注意力机制、不确定性感知建图和高效的仿真到现实迁移方法**，首次在足式机器人上实现了**敏捷性与泛化性的高水平统一**，为机器人在复杂非结构化环境中的可靠自主运行提供了强有力的解决方案。",
            "timestamp": "2026-01-20T17:51:17.396468",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "基于他的前作，梳理这个方向的整个发展脉络，每一步相比于之前的工作都改进了什么，着重于几个不同的发展方向。",
            "answer": "## 论文分析：AME-2 及其技术脉络梳理\n\n本文提出的 **AME-2** 是足式机器人感知-运动一体化领域的一项最新工作。要理解其创新与价值，必须将其置于该领域的发展脉络中。其核心发展路径可以概括为：从**基于模型的模块化方法**，到**结合经典地图的强化学习方法**，再到**端到端感知-运动策略**，最终走向 **AME-2 所代表的“结构化端到端”或“神经模块化”方法**。\n\n下图梳理了该领域几个关键发展方向及其演进关系：\n\n```mermaid\nflowchart TD\n    A[“早期工作<br>基于模型的模块化方法”] --> B[“方向一：结合显式地图的RL”]\n    B --> B1[“使用经典地图栈<br>（如Elevation Mapping）”]\n    B1 --> B2[“使用学习式地图<br>（神经重建）”]\n    B2 --> E[“AME-2<br>（神经地图+注意力编码）”]\n    \n    A --> C[“方向二：端到端感知-运动策略”]\n    C --> C1[“从原始传感器到动作<br>（如视觉、激光）”]\n    C1 --> C2[“特权-学生蒸馏框架<br>（如Parkour in the Wild）”]\n    C2 --> E\n    \n    B --> D[“方向三：学习式地图生成”]\n    D --> D1[“为控制定制的神经重建”]\n    D1 --> D2[“不确定性感知的神经过程”]\n    D2 --> E\n    \n    E --> F[“核心创新与整合<br>1. AME-2注意力编码器<br>2. 轻量不确定性神经地图<br>3. 统一训练框架”]\n```\n\n### 发展脉络与核心改进\n\n#### 方向一：结合显式地图的强化学习 (RL with Explicit Maps)\n此方向旨在保留可解释的地图表征，同时利用RL克服模型不匹配和规划计算瓶颈。\n\n1.  **早期结合 (如RLOC, DTC)**：\n    *   **做法**：将RL作为模块嵌入经典管线（如用于轨迹跟踪或规划），或使用经典规划器来跟踪RL输出的轨迹。\n    *   **改进**：相比纯模型方法，提升了鲁棒性。\n    *   **局限**：敏捷性受限于底层模型假设和规划器计算速度；泛化能力受地图质量影响大。\n\n2.  **使用在线经典地图栈 (如Anymal Robust, Attention-based Map Encoding [AME-1])**：\n    *   **做法**：使用实时构建的经典高程图（Elevation Map）作为RL策略的输入。\n    *   **改进**：实现了更强的地形泛化能力（AME-1），因为策略学习直接处理几何信息。\n    *   **局限**：地图更新频率和启发式滤波可能限制敏捷性；对遮挡和噪声处理能力有限；地图管线计算成本高。\n\n3.  **使用学习式地图重建 (如Anymal Parkour, DPL)**：\n    *   **做法**：用神经网络从传感器数据实时重建用于控制的自中心地图。\n    *   **改进**：地图生成更快，支持高敏捷性运动（如跑酷）；通过模拟数据训练，简化了仿真到现实的转移。\n    *   **局限**：重建网络容易过拟合到训练地形分布，**在未见过的、非结构化地形上泛化能力有限**；通常不显式建模不确定性。\n\n#### 方向二：端到端感知-运动策略 (End-to-End Sensorimotor Policies)\n此方向追求极致的敏捷性和系统简洁性，绕过显式地图构建。\n\n1.  **原始传感器到动作 (如Vision-Locomotion, Extreme Parkour)**：\n    *   **做法**：单个神经网络直接从原始视觉（RGB-D）或激光雷达数据与本体感知映射到关节动作。\n    *   **改进**：在特定复杂地形（如跑酷赛道）上展示了极高的敏捷性。\n    *   **局限**：策略像一个黑盒，**可解释性差**；学习到的地形推理隐式且不明确，导致**泛化能力严重受限**，容易过拟合训练环境。\n\n2.  **特权-学生蒸馏框架 (如Parkour in the Wild)**：\n    *   **做法**：先训练多个使用特权信息（如真值地图）的“教师”策略，再将其蒸馏到一个从原始传感器输入操作的“学生”策略中。\n    *   **改进**：整合了多个教师的技能，得到一个相对通用的“通才”策略；微调效率高。\n    *   **局限**：论文指出，其**零样本泛化到全新地形的能力仍然有限**；学生策略仍属端到端黑箱，地形表征能力不如显式地图。\n\n#### 方向三：学习式地图生成 (Learning-Based Mapping)\n此方向独立于控制策略发展，旨在为机器人提供更好的环境表征。\n\n1.  **为控制定制的神经重建**：\n    *   **做法**：训练轻量网络快速重建局部地形几何，作为控制输入。\n    *   **改进**：速度快，适合实时控制。\n    *   **局限**：泛化性不足，不确定性建模不明确。\n\n2.  **不确定性感知的神经过程 (如Neural Processes for Elevation Modeling)**：\n    *   **做法**：利用神经过程等模型，预测每帧地形高程及其不确定性，再进行时序融合。\n    *   **改进**：**显式输出不确定性**，能更好处理噪声和遮挡；数据效率更高。\n    *   **局限**：模型计算开销大，难以集成到需要数千个并行环境的大规模RL训练中。\n\n---\n\n### **AME-2 的核心整合与创新**\n\nAME-2 并非简单延续某个方向，而是对上述多个方向优点的**创造性整合与突破**，其改进体现在：\n\n1.  **创新的策略编码器 (AME-2 Encoder)**：\n    *   **相比 AME-1**：AME-1 仅基于本体感知信息对局部地图特征进行注意力加权。AME-2 **引入了全局地形特征**，并联合全局特征和本体感知来生成注意力权重。这使得策略能根据**地形全局上下文**动态调整关注点，学习不同地形下的差异化运动模式，从而实现了**质的泛化能力提升**（见表II，在混合地形上远超AME-1）。\n\n2.  **轻量且不确定性感知的神经地图管线**：\n    *   **相比经典地图栈**：速度更快，专为敏捷控制优化；通过贝叶斯学习显式输出每单元格的不确定性，自然建模了遮挡和噪声。\n    *   **相比之前的学习式地图**：通过**概率赢家通吃融合策略**和**在广阔地形分布（包括不可通行地形）上的训练**，获得了强大的泛化能力。它不像某些重建网络那样“想象”或补全遮挡区域，而是保持其高不确定性，这更适合需要精确几何的敏捷运动。\n    *   **相比重型神经过程模型**：极度轻量化，可在大规模并行仿真中运行，实现了训练与部署管线的统一。\n\n3.  **统一的训练与迁移框架**：\n    *   **采用“教师-学生”框架**，但**学生策略并非端到端黑箱**，而是使用与教师相同的、可解释的AME-2架构，输入是神经地图产生的带不确定性的高程图。\n    *   **训练时**，在仿真中运行完整的神经地图管线，而非使用理想地图，极大缩小了仿真到现实的差距。\n    *   **损失函数**结合了RL损失、教师动作蒸馏损失和**表征对齐损失**（让学生和教师的地图嵌入相似），这稳定了训练并保持了泛化能力（见表III，其学生策略在未见地形上显著优于端到端视觉循环学生策略）。\n\n### 总结\n\nAME-2 的发展脉络表明，足式机器人感知运动控制正从 **“模块化”** 与 **“端到端”** 的二元对立，走向一条 **“神经模块化”** 或 **“结构化端到端”** 的中间道路。它保留了地图这一可解释的中间表征，但用学习到的、轻量的、不确定性感知的模块来生成它；它使用端到端RL训练控制器，但通过创新的注意力架构使策略具备地形上下文理解能力。最终，AME-2 在**敏捷性**（媲美顶尖端到端方法）和**零样本泛化能力**（远超以往方法）之间取得了突破性的平衡，为足式机器人在复杂、未知现实环境中的可靠部署提供了强有力的框架。",
            "timestamp": "2026-01-20T17:52:21.013507",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他的前作有哪些？使用表格仔细讲讲他的每篇前作，他和前作的区别是什么，主要改善是什么？着重于具体相比于之前文章的改动",
            "answer": "## AME-2 的前作分析\n\n作者团队（特别是 Chong Zhang 等人）在足式机器人感知与强化学习控制领域有一系列重要工作。以下是其核心前作的详细梳理，以及与 AME-2 的主要区别和改进。\n\n### 前作概览表\n\n| 论文简称/标题 | 发表年份/会议 | 核心贡献 | 与 AME-2 的主要区别 | AME-2 的主要改进 |\n| :--- | :--- | :--- | :--- | :--- |\n| **AME-1** (Attention-based Map Encoding) | 2025, Science Robotics | 提出了首个**基于注意力的地图编码器**，用于学习**泛化的足式运动**。控制器使用高程图作为输入，通过注意力机制聚焦于局部地形特征。 | 1. **编码器设计**：AME-1 的注意力权重仅基于**本体感知**（proprioception）计算，缺乏全局地形上下文。<br>2. **泛化能力**：在混合复杂地形（如稀疏与攀爬地形组合）上泛化能力有限。<br>3. **敏捷性**：依赖于经典在线建图栈，更新速率和建图质量限制了敏捷性。<br>4. **建图模块**：未集成学习型建图，依赖传统几何建图。 | 1. **编码器升级**：引入**全局特征**，并与本体感知共同生成注意力权重，使策略能根据**全局地形上下文**调整运动模式，显著提升在**混合/未见地形**的泛化能力（测试地形平均成功率从51.2%提升至95.2%）。<br>2. **统一框架**：将**学习型、轻量化、不确定性感知的神经建图管道**与控制器训练深度集成，摆脱对传统建图栈的依赖。<br>3. **敏捷性提升**：得益于快速神经建图，实现了与最先进端到端策略相当的敏捷性（如零样本通过高难度跑酷地形）。<br>4. **系统整合**：采用**教师-学生训练方案**，使最终可部署的学生策略能直接使用在线神经建图，实现了**敏捷性、泛化性与可部署性**的统一。 |\n| **Learning Agile Locomotion on Risky Terrains** | 2024, IROS | 专注于在**高风险稀疏落脚点地形**（如窄梁、踏脚石）上学习敏捷运动。使用**目标到达**（goal-reaching）奖励公式来激励复杂技能。 | 1. **感知输入**：依赖于**特权信息**（ground-truth地图）或经典建图，未解决真实世界感知的不确定性与遮挡问题。<br>2. **泛化范围**：主要针对稀疏地形，未系统解决在密集、攀爬等多种地形类别间的泛化。<br>3. **架构**：未采用注意力机制进行地图编码。 | 1. **感知鲁棒性**：提出了完整的**不确定性感知神经建图管道**，显式建模遮挡和噪声，解决了从仿真到真实的关键差距。<br>2. **泛化扩展**：将训练和评估地形扩展到三大类（密集、攀爬、稀疏）及其组合，证明了**跨类别泛化**能力。<br>3. **编码器增强**：在AME-1的基础上，通过引入全局上下文进一步优化了地图编码，形成了更强大的AME-2编码器。 |\n| **Anymal Parkour** | 2024, Science Robotics | 实现了四足机器人的**跑酷**能力，展示了高度的敏捷性。采用了**学习型场景表示**（神经建图）来重建以自我为中心的地形。 | 1. **建图性质**：其学习型建图是为特定地形分布（如跑酷障碍）拟合的，**泛化到未见非结构化地形能力有限**。<br>2. **不确定性**：建图模块没有显式输出不确定性估计，无法妥善处理遮挡。<br>3. **训练效率**：建图网络与策略联合训练，计算成本高，难以支持大规模并行仿真训练。 | 1. **建图泛化**：设计了在**多样化合成地形**（包括不可通行地形）上预训练的轻量建图网络，并采用**概率赢家通吃融合策略**，显著提升了建图对未见地形的泛化能力。<br>2. **显式不确定性**：建图网络直接预测每个单元格的高程**不确定性**，使控制器能感知信息缺失区域。<br>3. **训练解耦**：建图模块独立预训练，能与控制器训练高效并行，支持数千个仿真环境同时运行。 |\n| **Parkour in the Wild** | 2025, arXiv | 通过**多专家蒸馏与RL微调**，学习了一个**通用且可扩展的敏捷运动策略**。学生策略直接处理原始深度图像，是当前端到端敏捷泛化运动的先进方法。 | 1. **架构**：采用**端到端**的视觉循环网络，直接从深度图像映射到动作。<br>2. **泛化表现**：在**未见稀疏地形**上零样本泛化能力较弱（在混合测试地形上平均成功率51.5%）。<br>3. **可解释性**：地形推理隐含在网络中，缺乏可解释的中间表示。 | 1. **模块化与可解释性**：保持了**显式建图模块**，提供了地形的高度和不确定性网格，系统更具可解释性。AME-2编码器的注意力权重可视化揭示了策略关注的地形区域。<br>2. **泛化优势**：在需要**精确落脚点**的稀疏和混合地形上，AME-2学生策略的泛化性能大幅超越该端到端基线（平均成功率82.4% vs 51.5%）。<br>3. **记忆机制**：通过全局地图进行**显式空间记忆**，解决了该基线方法在靠近高障碍物时因缺乏长期记忆而失败的问题。 |\n\n### 核心改进总结\n\nAME-2 相对于其前作，特别是在与 AME-1 和 *Parkour in the Wild* 的对比中，实现了以下**关键性整合与突破**：\n\n1.  **编码器架构的质变**：在 AME-1 的基础上，创新性地将**全局地形特征**引入注意力权重的计算。这使得策略不再是“盲目的反应式”，而是能根据地形全局结构（如“这是一个需要攀爬的平台”还是“一个需要谨慎行走的窄梁”）来动态调整其局部关注点和运动模式，这是实现**强跨地形泛化**的核心。\n\n2.  **感知-控制闭环的重构**：不再将建图视为一个独立的、最好是完美的输入模块。而是设计了一个**为敏捷运动量身定制**的神经建图管道，其特点包括：\n    *   **轻量与高效**：可运行于大规模并行仿真和真实机载CPU。\n    *   **不确定性感知**：显式输出方差，区分“已知平坦”、“已知障碍”和“未知/遮挡区域”。\n    *   **泛化性训练**：使用远超机器人可行范围的多样化合成地形进行预训练。\n    *   **在线训练集成**：该管道可无缝接入RL训练循环，使策略从一开始就学习处理有噪声、不完整的建图。\n\n3.  **统一敏捷与泛化的目标**：此前工作或在特定领域（如跑酷）追求极致敏捷，或在较保守设定下追求地形泛化。AME-2 通过上述技术，首次在**同一框架、同一策略**中实现了与最先进敏捷控制器媲美的动态性能，同时又在广泛且复杂的未见地形上保持了高成功率。\n\n4.  **系统级可部署性**：通过**教师-学生训练范式**，将拥有特权信息（真实地图）的、泛化能力强的“教师”策略的知识，蒸馏到使用实际神经建图输入的“学生”策略中。最终得到的策略是**可直接部署**的，且继承了教师的泛化能力和敏捷性。\n\n**结论**：AME-2 不是对单一前作的简单改进，而是一次**系统性的整合与升级**。它继承了 AME-1 的注意力地图编码思想并加以增强，吸收了 *Anymal Parkour* 中学习型建图的思路但大幅提升了其泛化性和实用性，同时在泛化性能上显著超越了最新的端到端泛化方法 *Parkour in the Wild*，最终在一个框架内同时攻克了足式机器人感知 locomotion 中**敏捷性、泛化性、鲁棒性和可部署性**难以兼得的长期挑战。",
            "timestamp": "2026-01-20T17:53:26.142130",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文提出了哪些关键技术方法，请列表格具体详细说明技术细节，需要包含具体的数学原理推导，以及具体参数。",
            "answer": "## 论文关键技术方法分析\n\n本文提出了一种名为AME-2的统一强化学习框架，旨在实现足式机器人在复杂地形上的敏捷且泛化的运动。其核心创新在于**注意力神经地图编码器**和**轻量级、不确定性感知的神经建图流水线**的结合。以下是关键技术方法的详细说明：\n\n### 1. AME-2：基于注意力的神经地图编码器\n\n| 技术组件 | 技术细节与数学原理 | 具体参数 |\n| :--- | :--- | :--- |\n| **整体架构** | 策略网络由**本体感觉编码器**、**AME-2地图编码器**和一个**多层感知机**动作解码器组成。AME-2编码器负责处理高程地图输入，生成地形感知的嵌入表示。 | 策略运行频率：50 Hz。动作（关节PD目标）跟踪频率：400 Hz。 |\n| **地图输入表示** | **教师策略**：使用真实高程图，每个网格点表示为3D坐标 `(x, y, z)`。<br>**学生策略**：使用神经建图流水线输出的地图，每个网格点表示为4D `(x, y, z, u)`，其中 `u` 为不确定性度量（方差）。 | **ANYmal-D（四足）**：地图尺寸 36 × 14，分辨率 8 cm，中心位于基坐标系 `(x=0.6 m, y=0 m)`。<br>**TRON1（双足）**：地图尺寸 18 × 13，分辨率 8 cm，中心位于 `(x=0.32 m, y=0 m)`。 |\n| **AME-2编码器工作流程** | 1. **局部特征提取**：使用CNN处理地图，得到逐点的局部特征 `f_local`。<br>2. **全局特征提取**：对局部特征进行MLP处理，然后通过**最大池化**得到全局特征 `f_global`，捕获地形整体上下文。<br>3. **注意力加权**：将全局特征 `f_global` 与本体感觉嵌入 `e_proprio` 拼接，通过MLP生成**查询向量** `q`。使用**多头注意力**机制，以 `f_local` 作为键和值，`q` 作为查询，计算注意力权重并加权局部特征，得到 `f_local_weighted`。<br>4. **特征融合**：将加权后的局部特征 `f_local_weighted` 与全局特征 `f_global` 拼接，形成最终的地图嵌入 `e_map`。 | 注意力机制采用标准的多头注意力（MHA）。与AME-1（前代工作）的关键区别在于引入了**全局特征**来指导注意力，使策略能根据地形全局上下文调整关注区域。 |\n| **本体感觉编码器** | **教师**：使用简单的MLP处理无噪声的本体感觉观测值（包括基座线速度 `v_b`）。<br>**学生**：为应对现实不确定性，堆叠过去20步的本体感觉观测（不包括 `v_b` 和命令），使用**长短时输入输出网络** 提取时序嵌入，再与命令一起输入MLP。 | LSIO网络用于提取机器人状态和环境动态的时序表征。 |\n| **非对称演员-评论家训练** | **演员**：使用上述AME-2架构。<br>**评论家**：不采用计算昂贵的注意力机制，而是使用**混合专家** 架构，该架构函数拟合能力强且优化效率更高。评论家额外接收每个连杆的接触状态信息。 | 使用PPO算法进行优化。为提升样本效率和运动风格，对评论家应用了左右对称增强。 |\n\n### 2. 轻量级、不确定性感知的神经建图流水线\n\n| 技术组件 | 技术细节与数学原理 | 具体参数 |\n| :--- | :--- | :--- |\n| **整体流程** | 1. **局部网格投影**：将深度图像点云投影到机器人基座系的局部2D高度网格中。每个单元格保留最高的 `z` 值（对运动最相关），无点区域赋予固定最小值。<br>2. **神经高程预测**：使用轻量级CNN（基于U-Net的门控残差设计）预测每个单元格的**相对高程估计值 `μ`** 和**不确定性（对数方差 `log σ^2`）**。<br>3. **概率赢家通吃融合**：利用里程计位姿，将带不确定性的局部预测融合到全局地图 `ℳ` 中。 | **ANYmal-D**：局部网格尺寸 51 × 31，分辨率 4 cm，中心位于 `(x=1.0 m, y=0 m)`。<br>**TRON1**：局部网格尺寸 31 × 31，分辨率 4 cm，中心位于 `(x=0.6 m, y=0 m)`。<br>全局地图尺寸：8 m × 8 m（可动态重定中心）。 |\n| **不确定性建模与损失函数** | 使用 **β-NLL损失** 训练建图网络，鼓励网络在预测不准时输出高不确定性，预测准确时输出低不确定性。<br>`L_{0.5} = E_{X,Y}[ sg[σ̂(X)] * ( (log σ̂²(X))/2 + (Y - μ̂(X))²/(2σ̂²(X)) ) ]`<br>其中 `X` 为输入局部网格，`Y` 为真实高程，`μ̂` 和 `σ̂²` 为网络预测的均值和方差，`sg[·]` 为停止梯度操作。`β=0.5` 可防止网络通过简单增大不确定性来降低损失。 | 训练数据：5400万帧合成数据。批量训练时，根据样本的**总变差** 对损失进行重加权，让地形更复杂的样本拥有更高权重：`TV(Y_b) = (‖∇_x Y_b‖_1 + ‖∇_y Y_b‖_1) / (H*W)`。 |\n| **概率赢家通吃地图更新** | 对于全局地图中每个被局部预测覆盖的单元格 `(u, v)`：<br>1. 计算有效测量方差：`σ̂_t² = max(σ_t², 0.5 * σ_prior²)`，防止过度自信。<br>2. 更新有效条件：`σ̂_t² < 1.5 * σ_prior²` 或 `σ̂_t² < 0.2²`。<br>3. 计算胜出概率：`p_win = (σ̂_t²)^{-1} / ( (σ̂_t²)^{-1} + (σ_prior²)^{-1} )`。<br>4. 随机更新：采样 `ξ ~ U[0,1]`，若 `ξ < p_win`，则用新预测 `(h_t, σ̂_t²)` 覆盖旧值；否则保留旧值 `(h_prior, σ_prior²)`。 | 这种策略能：a) 防止对同一遮挡区域因持续预测而错误降低不确定性；b) 阻止非一致的高置信度预测覆盖地图；c) 在获得高置信度测量时快速更新地图。 |\n| **仿真集成与部署** | 建图流水线在仿真（数千个并行环境）和真实硬件上完全一致。在CPU上单帧处理时间约5 ms（其中神经网络推理约2.5 ms），满足实时性要求。 | 仿真中（1000个ANYmal-D环境），模型推理时间 <0.3 ms，GPU内存消耗约3 GB。 |\n\n### 3. 教师-学生强化学习框架\n\n| 技术组件 | 技术细节与数学原理 | 具体参数 |\n| :--- | :--- | :--- |\n| **训练流程** | 1. **教师策略训练**：在仿真中使用**真实高程地图**和**无噪声本体感觉**进行训练。<br>2. **学生策略训练**：使用上述**神经建图流水线**提供的地图（含噪声和不确定性）作为输入，在教师策略的监督下进行训练。 | **教师训练**：80,000 次迭代。<br>**学生训练**：40,000 次迭代（前5,000次迭代禁用PPO替代损失）。 |\n| **学生训练目标函数** | 学生策略的总体损失是以下三项的线性组合：<br>1. **PPO的RL损失**（价值损失和策略损失）。<br>2. **动作蒸馏损失**：使学生策略的输出接近教师策略的输出。<br>3. **表征损失**：学生策略的AME-2编码器输出的地图嵌入与教师策略的对应嵌入之间的均方误差。 | 损失系数：动作蒸馏损失 0.02，表征损失 0.2。学生训练初期使用较高学习率（0.001）且禁用PPO替代损失，以稳定训练并促进与教师的对齐。 |\n| **领域随机化** | 在训练中广泛应用随机化以提升鲁棒性和仿真到现实的转移：<br>- **机器人动力学**：随机化负载、摩擦系数、执行器延迟（双足",
            "timestamp": "2026-01-20T17:54:31.913646",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他使用了哪些评价指标与数据集，列表格具体讲讲他的评价指标的细节与数据集的细节",
            "answer": "## 论文评价指标与数据集分析\n\n### 一、 评价指标\n\n论文主要使用两类评价指标来量化系统性能：**控制器成功率** 和 **地图重建损失**。具体细节如下表所示：\n\n| 指标类别 | 具体指标 | 计算方式 / 定义 | 评估目的与细节 |\n| :--- | :--- | :--- | :--- |\n| **控制器性能** | **成功率** | 在特定地形上，机器人成功到达目标位置并保持稳定姿态的测试回合比例。 | **核心评估指标**，用于衡量控制器的**敏捷性**和**泛化能力**。<br>- **训练地形**：评估在训练见过的原始地形（密集、攀爬、稀疏三类）上的基础性能。<br>- **测试地形**：评估在**未见过的**或**训练地形组合**的复杂地形上的零样本泛化能力（见图4）。<br>- **对比基准**：用于与AME-1、MoE、视觉循环网络等基线方法进行横向比较（表II, III）。 |\n| **地图重建质量** | **L₀.₅ 损失** | 公式：`L₀.₅ = E[ sg[σ̂(X)] * ( log σ̂²(X)/2 + (Y - μ̂(X))²/(2σ̂²(X)) ) ]` <br>其中 `sg[·]` 为停止梯度操作，`μ̂(X)` 为预测高程，`σ̂²(X)` 为预测方差，`Y` 为真实高程。 | 评估**神经地图管道**的预测准确性和不确定性建模质量。<br>- **特点**：该损失函数平衡了高程估计的准确性 (`(Y - μ̂)²`) 和不确定性估计的合理性 (`log σ̂²`)。<br>- **作用**：量化地图模块在不同地形（训练集和测试集）上的重建性能，并对比不同地图设计方案（如本文方法 vs. 时序循环模型）的优劣（表IV）。 |\n| **鲁棒性评估** | **退化感知下的成功率** | 在施加了超出训练随机化范围的传感器退化（如点云缺失、噪声伪影、摄像头禁用）后，重新评估控制器的成功率。 | 评估系统对**真实世界噪声和传感器故障**的鲁棒性。<br>- **测试场景**：20%点云缺失、3%噪声伪影、禁用前上摄像头。<br>- **结果**：展示了策略在严重感知退化下仍能保持较高性能，验证了映射和控制的协同鲁棒性（表V）。 |\n\n**其他隐含指标**：\n- **敏捷性定性展示**：通过机器人实际演示（如攀爬高度、跨越间隙宽度、峰值速度 >1.5 m/s）和与SOTA工作的对比（图9），证明其达到了最先进的敏捷水平。\n- **地图质量定性分析**：通过可视化重建的地图（图14, 19），展示其能捕捉精细地形结构并合理标注不确定性区域。\n\n### 二、 数据集（地形集合）\n\n论文没有使用外部标注数据集，而是通过**程序化生成**和**物理仿真**构建了用于**训练**和**测试**的地形集合。细节如下：\n\n| 数据集类型 | 地形类别与比例 | 生成方式与关键参数 | 用途与细节 |\n| :--- | :--- | :--- | :--- |\n| **训练地形** <br>(用于策略和地图模型训练) | **1. 密集地形 (Dense, 45%)** <br> - 粗糙地面 (5%) <br> - 下行楼梯 (5%) <br> - 上行楼梯 (5%) <br> - 随机箱子 (5%) <br> - 斜坡障碍 (5%) <br> - 平坦地面 (20%) <br><br>**2. 攀爬地形 (Climbing, 30%)** <br> - 攀爬上坑 (20%) <br> - 攀爬下台 (5%) <br> - 连续攀爬环 (5%) <br><br>**3. 稀疏地形 (Sparse, 25%)** <br> - 间隙 (5%) <br> - 平行横梁 (5%) <br> - 随机踏脚石 (15%) | - **程序化生成**：使用高度场、几何基元（楼梯、箱子、横梁、坑洞）组合而成。<br>- **课程学习**：每个地形类别的难度参数（如高度、宽度、坡度）随训练迭代从易到难**动态缩放**（详见附录A）。<br>- **随机化**：地形顶点位置、朝向、平台高度差等加入随机扰动，增加多样性。<br>- **物理/虚拟地面**：对稀疏地形，一半添加物理碰撞地面，另一半添加仅地图可见的虚拟地面，防止机器人“偷懒”走地面。 | **策略训练**：用于训练教师和学生策略，学习基础的移动、攀爬、平衡技能。<br>**地图模型训练**：作为合成训练数据的主要来源之一（与额外生成的地形结合）。 |\n| **测试地形** <br>(用于评估泛化能力) | **Test 1**: 稀疏地形（未见过的踏脚石布局）<br>**Test 2**: 攀爬与稀疏混合地形<br>**Test 3**: 跑酷地形（高障碍物）<br>**Test 4**: 密集、攀爬、稀疏三合一复杂地形 | 由训练中未出现过的地形布局或训练地形的**新颖组合**构成。例如，将不同训练地形的特征（如高台、窄梁、大间隙）以新的空间关系组合。 | **零样本泛化评估**：核心测试集，用于验证控制器对**全新、复杂地形**的适应能力，是衡量“广义 locomotion”的关键。 |\n| **地图模型专用训练地形** <br>(用于训练神经地图网络) | 1. ** locomotion训练地形网格**<br>2. **随机堆叠的箱子**<br>3. **随机高度场**<br>4. **随机漂浮的箱子** | - **扩展性**：包含大量对机器人而言**不可通行**的地形，以拓宽地图模型的感知分布。<br>- **高效采样**：使用Warp库进行光线追踪，直接从网格采样局部高程网格，无需物理仿真，采样速度极快（每秒数十万帧）。<br>- **数据增强**：对采样的局部网格施加均匀噪声、随机裁剪、模拟遮挡、随机点缺失和异常值等，模拟真实传感器缺陷。 | **地图网络训练**：为神经地图预测网络提供大规模、多样化的监督数据，确保其能够泛化到各种地形结构，并正确处理噪声和遮挡。 |\n\n### 总结\nAME-2 工作的评估体系紧密结合其研究目标：\n1.  **指标设计**：以**成功率**为核心量化敏捷与泛化，以**L₀.₅损失**保障地图质量，以**鲁棒性测试**验证系统可靠性。\n2.  **数据集构建**：采用分层的程序化生成方法，严格区分**训练集**（用于学习基础技能）和**测试集**（用于评估零样本泛化），并专门为地图模块构建了更广泛的**地形数据集**。这种数据策略是其实现“广义” locomotion 的关键基础。",
            "timestamp": "2026-01-20T17:55:24.894201",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文在哪些数据集上进行了实验？主要的评估指标和性能提升是多少？",
            "answer": "## 实验数据集与评估指标分析\n\n### 一、 实验数据集（训练与测试地形）\n\n论文在**仿真**和**真实世界**两个层面进行了大量实验，使用的地形数据集主要分为**训练地形**和**测试地形**两大类，旨在验证方法的**敏捷性**和**泛化能力**。\n\n#### 1. 训练地形（Primitive Terrains）\n在仿真训练中，控制器在**三类基础地形**上进行训练，每类包含多种变体，并通过课程学习逐步增加难度：\n- **密集地形**：包括粗糙高度场、上下楼梯、随机箱体、斜坡上的障碍物等。\n- **攀爬地形**：包括爬出凹坑、从平台爬下、连续攀爬环形结构等。\n- **稀疏地形**：包括跨越间隙、平行梁、随机分布的踏脚石、独木桥等。\n\n**关键设计**：训练仅使用这些“基础模块”，**不包含**后续测试中出现的复杂组合地形，以检验泛化能力。\n\n#### 2. 测试地形（Generalization Terrains）\n为了评估泛化性能，论文设计了**4种未见过的复杂测试地形**（见图4）：\n- **Test 1**: 稀疏地形（如踏脚石）。\n- **Test 2**: 密集与稀疏地形的混合（如公园跑酷与梁的组合）。\n- **Test 3**: 高敏捷性要求地形（如复杂的公园跑酷障碍场）。\n- **Test 4**: 攀爬与稀疏地形的混合。\n\n**此外**，在**真实世界**中，论文在多种极具挑战性的**真实、未见地形**上进行了测试，例如：\n- 复杂的公园跑酷赛道（包含高台、间隙）。\n- 狭窄平衡木、浮动方块构成的弯曲梁、带间隙的梁、钻石布局的踏脚石等。\n- 高平台、间隙、楼梯、粗糙地形的组合。\n\n### 二、 主要评估指标\n\n论文采用**定量**与**定性**相结合的评估方式：\n\n1.  **主要定量指标：成功率**\n    - 在仿真中，对每个测试地形进行多次rollout，计算**成功到达目标位置并保持稳定**的比率。\n    - 这是衡量**泛化能力**和**鲁棒性**的核心指标。\n\n2.  **敏捷性评估指标（定性为主，定量为辅）**\n    - **地形难度极限**：机器人能够攀爬/爬下的最大平台高度、能够跨越的最大间隙等，与先前工作对比。\n    - **运动速度**：记录机器人在复杂地形上能达到的峰值前进速度（>1.5 m/s）。\n    - **任务完成度**：能否零样本（zero-shot）完成先前工作中最具挑战性的地形（如最难的公园跑酷和碎石堆）。\n\n3.  **映射质量评估指标**\n    - 使用 **`L₀.₅`损失**（公式9）评估神经映射管道预测高程的准确性和不确定性估计的合理性。该损失平衡了估计误差和不确定性校准。\n\n4.  **鲁棒性评估指标**\n    - 在仿真中测试控制器在**传感器退化**（如点云缺失、噪声伪影、相机禁用）情况下的成功率。\n\n### 三、 性能提升与关键结果\n\n#### 1. 泛化性能显著提升（核心贡献）\n- **AME-2 vs. 基线**：在未见过的混合测试地形上，AME-2教师策略的平均成功率高达**95.2%**，显著优于之前的AME-1架构（**51.2%**）和MoE架构（**45.0%**）。这证明了**引入全局上下文特征的注意力机制**对泛化至关重要。\n- **AME-2学生 vs. 端到端视觉学生**：与当前先进的端到端敏捷通用策略相比，AME-2学生策略在平均测试成功率上取得**82.4%** vs. **51.5%** 的显著优势，尤其在稀疏和混合地形上表现更优。\n\n#### 2. 实现敏捷与泛化的统一\n- **零样本泛化**：仅在基础地形上训练的控制器，能够**零样本**完成真实世界中复杂的公园跑酷赛道（图10）和多种稀疏地形（图11），证明了其强大的泛化能力。\n- **媲美最先进敏捷方法的性能**：在敏捷性方面，ANYmal-D控制器可以零样本完成先前工作（如ANYmal Parkour）中最具挑战性的地形。TRON1双足机器人实现了高达0.48m的攀爬和0.88m的下爬高度，性能与硬件能力更强的双足机器人工作相当。\n\n#### 3. 映射管道高效且鲁棒\n- **实时性**：整个映射管道在板载CPU上仅需约**5ms/帧**，支持50Hz的控制频率。\n- **不确定性感知**：能够显式建模遮挡和噪声区域（高不确定性），为控制器提供更可靠的环境表示。\n- **训练效率**：轻量级设计允许在数千个并行仿真环境中运行，与控制器训练循环集成，助力仿真到真实的迁移。\n\n#### 4. 涌现出高级行为能力\n- **主动感知**：机器人通过与环境交互来更新地图，从而在后续尝试中更成功地完成任务（图15）。\n- **局部导航**：控制器展现出避障和对齐地形等局部导航能力。\n- **全身接触与冲击减缓**：机器人自发使用膝盖等非足部接触点进行稳定，并表现出轻柔落地的行为。\n\n**总结**：AME-2框架通过在**统一架构**下结合**注意力神经地图编码**和**轻量级不确定性感知神经映射**，成功实现了先前工作中难以兼顾的**高水平敏捷性**与**强大零样本泛化能力**，并在四足和双足两种机器人平台上得到了验证。其性能在仿真和真实世界实验中都超越了现有的专注于敏捷或泛化的方法。",
            "timestamp": "2026-01-20T17:56:07.817828",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文的主要局限性有哪些？未来可能的改进方向是什么？",
            "answer": "## 论文主要局限性分析\n\n基于对论文内容的分析，AME-2框架及其相关技术存在以下几个主要局限性：\n\n**1. 环境感知与表示的局限性**\n- **依赖2.5维高程图**：系统使用2.5维高程图（即每个`(x, y)`坐标对应一个高度`z`），无法处理真正的三维结构（如悬垂物、洞穴、多层结构）。这限制了机器人在复杂三维环境（如脚手架、有顶棚的通道）中的操作能力。\n- **对严重退化的感知场景鲁棒性不足**：论文指出，控制器并非为高草丛、积雪等严重遮挡或干扰深度传感器的环境设计。在这些场景下，映射和控制的性能可能会显著下降。\n\n**2. 控制策略与泛化能力的局限性**\n- **技能过渡的失败**：在未见过的复杂测试地形（尤其是需要不同运动技能快速切换的地形，如稀疏落脚点后接攀爬）上，失败率高于训练地形。这表明策略在**零样本泛化**处理复杂技能序列方面仍有提升空间。\n- **运动模式多样性有限**：对于给定的地形类型，学习到的接触模式趋于相似。论文质疑，对于自由度更高的系统（如人形机器人），面对同一地形类型的不同尺度时，AME-2是否能在没有额外先验知识的情况下，自动发现多样化的全身接触策略（如单脚踩、双脚跳、手脚并用攀爬）。\n\n**3. 系统设计与交互的局限性**\n- **目标到达与直接控制的权衡**：采用**目标到达**而非**速度跟踪**的指令形式，虽然鼓励了更敏捷的行为并降低了对高频导航指令的依赖，但也削弱了对机器人中间运动路径的直接控制。当存在语义上不可通行但几何上看似可通行的障碍物时，这可能带来问题。\n- **动态环境处理能力有限**：映射模块在存在严重遮挡的**高度动态环境**中可能失效。当前系统未明确建模场景中的移动物体（如移动的箱子、开关的门）。\n\n**4. 计算与部署的相关考量**\n- **训练成本较高**：ANYmal-D策略的训练需要约60个RTX-4090显卡日。虽然取得了强大性能，但较高的计算资源需求可能影响方法的可及性和快速迭代。\n\n---\n\n## 未来可能的改进方向\n\n针对上述局限性，论文提出了明确的未来工作方向，并暗示了其他潜在的研究路径：\n\n**1. 增强环境感知与表征**\n- **向3D表征扩展**：探索与策略架构兼容的**多层高程图**或**基于注意力的体素表征**，以支持完全三维环境下的运动。\n- **提升对退化感知的鲁棒性**：将专门针对噪声和遮挡设计的鲁棒控制器（如文献中的保守策略）与AME-2的敏捷通用控制器结合，形成一个**场景感知的单一策略**。\n\n**2. 提升控制策略的泛化与多样性**\n- **研究可扩展的零样本技能过渡**：探索能否通过更原则性的方法（如分层强化学习、课程设计的改进、引入技能模块）来学习具有挑战性的技能过渡，实现更好的零样本泛化。\n- **结合多种指令接口**：在单一控制器内整合**目标到达**和**速度跟踪**两种指令模式，例如通过掩码命令和蒸馏技术，以兼顾敏捷性与精确路径控制。\n- **引入运动先验**：对于高自由度系统（如人形机器人），可以引入**运动参考或先验知识**（如人类运动数据、演示），以鼓励发现更多样化、符合物理直觉的全身接触模式。\n\n**3. 改进系统对动态与语义的理解**\n- **显式推理动态物体**：扩展映射模块，使其能够识别、预测并融合场景中**运动元素**的状态，从而在动态环境中做出更安全的决策。\n- **融合语义信息**：将几何地图与**语义感知**相结合，帮助机器人理解“几何上可通过但语义上危险”的区域（如松动的石板、玻璃表面），弥补纯几何控制的不足。\n\n**4. 优化训练效率与框架通用性**\n- **降低训练成本**：研究更高效的训练算法、网络架构或课程学习策略，以在保持性能的同时减少计算需求。\n- **探索更统一的框架**：论文尝试在模块化（感知-规划-控制）和端到端学习之间架起桥梁。未来可以继续深化这一方向，探索如何更优雅地将经典方法的可解释性、安全性优势与学习方法的灵活性、适应性相结合。\n\n**总结而言**，AME-2在敏捷与通用的足式运动方面取得了显著进展，但其局限性主要集中在**三维环境处理、极端感知退化、复杂技能序列的零样本泛化、以及对动态和语义信息的理解**上。未来的改进将沿着**增强环境表征、提升策略泛化能力、融合多模态信息以及优化系统效率**等方向展开。",
            "timestamp": "2026-01-20T17:56:44.460077",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        }
    ],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-13T12:18:50Z",
    "created_at": "2026-01-20T17:49:43.727148",
    "updated_at": "2026-01-20T17:49:43.727155"
}