{
    "id": "2601.08056v1",
    "title": "The embodied brain: Bridging the brain, body, and behavior with neuromechanical digital twins",
    "authors": [
        "Sibo Wang-Chen",
        "Pavan Ramdya"
    ],
    "abstract": "动物行为反映了神经系统、躯体与环境之间的相互作用。因此，解析行为控制算法必须考虑生物力学与环境背景。神经力学数字孪生技术为此提供了可能——该技术通过在模拟环境中将人工神经控制器嵌入逼真的躯体模型来构建计算模型。本文回顾了神经力学数字孪生技术的创建与应用进展，并展望其未来发展的新机遇。首先，我们阐释神经力学模型如何帮助研究者推断实验中难以测量的潜在生物物理变量；通过扰动这些模型，研究者还能生成可供实验验证的新假设。其次，我们探讨神经力学数字孪生如何深化神经科学、机器人学与机器学习领域的交叉融合。最后，我们展示该技术在医疗健康领域的应用前景。我们预见，将动物研究与对其神经力学数字孪生的主动探测相结合，将极大加速神经科学领域的发现进程。",
    "url": "https://arxiv.org/abs/2601.08056v1",
    "html_url": "https://arxiv.org/html/2601.08056v1",
    "html_content": "The embodied brain: Bridging the brain, body, and behavior with neuromechanical digital twins\nSibo Wang-Chen\nCorrespondence:\nsibo.wang@epfl.ch\n,\npavan.ramdya@epfl.ch\nPavan Ramdya\nCorrespondence:\nsibo.wang@epfl.ch\n,\npavan.ramdya@epfl.ch\nGraphical Abstract\nImage attributions:\nhuman model: MyoSuite\n[\n50\n]\n;\nC. elegans\nmodel: BAAIWorm\n[\n54\n]\n;\nrodent model: MIMIC\n[\n1\n]\n;\nzebrafish model: simZFish\n[\n22\n]\n;\nwalking\nDrosophila\nmodel: NeuroMechFly\n[\n23\n,\n51\n]\n;\nflying\nDrosophila\nmodel: FlyBody\n[\n49\n]\n.\nHighlights\n•\nNeuromechanical digital twins comprise a neural controller and a biomechanical hull\n•\nReplaying experimental recordings\nin silico\nenables readout of latent variables\n•\nSimulations help to test neuroscientific hypotheses\n•\nSimulations provide a fully accessible and perturbable surrogate for behavior control\n•\nEmbodied computational models provide a foundation for NeuroAI\n© 2025. This manuscript version is made available under the CC-BY-NC-ND 4.0 license.\nhttps://creativecommons.org/licenses/by-nc-nd/4.0/\nAbstract\nAnimal behavior reflects interactions between the nervous system, body, and environment. Therefore, biomechanics and environmental context must be considered to dissect algorithms for behavioral control. This is enabled by leveraging neuromechanical digital twins: computational models that embed artificial neural controllers within realistic body models in simulated environments. Here we review advances in the creation and use of neuromechanical digital twins while also highlighting emerging opportunities for the future. First, we illustrate how neuromechanical models allow researchers to infer hidden biophysical variables that may be difficult to measure experimentally. Additionally, by perturbing these models, one can generate new experimentally testable hypotheses. Next, we explore how neuromechanical twins have been used to foster a deeper exchange between neuroscience, robotics, and machine learning. Finally, we show how neuromechanical twins can advance healthcare. We envision that coupling studies on animals with active probing of their neuromechanical twins will greatly accelerate neuroscientific discovery.\nKeywords:\nNeuromechanical model, biomechanics, digital twin, artificial neural network, sensorimotor control, physics simulation, NeuroAI\nIntroduction\nAnimal behaviors cannot be understood in isolation from the body and the environments in which they are expressed\n[\n20\n]\n, because they arise from two tightly interconnected feedback loops: one between the nervous system and the body, and the other between the body and external environment. Studying any one component alone, although valuable for addressing specific questions, can only provide a partial view of the integrative whole.\nA wide range of experimental tools have been developed to investigate neural circuits (\ne.g.\n, optogenetics, optical recordings, and electrophysiology), to measure movements of body parts (\ne.g.\n, motion capture, and machine learning-based pose estimation), and to manipulate environments (\ne.g.\n, virtual reality). However, these tools face two fundamental limitations. First, there are considerable\npractical barriers\nto obtaining neuronal recordings. For example, in large animals like primates, it remains challenging to target specific neurons using genetic reagents, and high-density electrode arrays cannot provide information about neuronal identities. Additionally, recordings of muscle physiology can interfere with natural behavior, meaning that the number of muscles that can be recorded simultaneously is limited. Thus, dynamic mechanical variables like joint torques and contact forces can be hard to measure. Second, establishing causality in neuroscience typically requires experimental\nperturbations\nto conclude, for example, that “the firing of neuron A causes behavior B.” However, most existing neural perturbation approaches are either too local (\ne.g.\n, optogenetic tools enabling perturbations of small numbers of neurons), or too broad (\ne.g.\n, pharmacologically or genetically enabled global perturbations based on brain regions or cell types). Patterned manipulation of large numbers of neurons with high specificity is required to test hypotheses regarding higher-level network dynamics, but such experimental capabilities remain mostly out of reach.\nFigure 1:\nParallels between real animals and their neuromechanical digital twins.\nHow physiological, mechanical, and environmental variables can be accessed and manipulated in real animals\n(upper half)\n, or in digital twins\n(lower half)\n. Rows on the lower half summarize the full promise of twins, the current status of the approach, and the challenges that need to be overcome to accomplish its full potential. Real datasets that can be used to link these systems are indicated.\nNeuromechanical digital twins provide an alternative, complementary framework to address these technical challenges in measurements and perturbations. These models typically consist of a\nbiomechanical\nreplica of the body—with varying degrees of morphological realism including joint articulations, muscles and contact dynamics—and a\nneural controller\nmodel including motor/premotor circuits and sensory pathways. Together, at least in principle, body and neural controller models form a fully accessible, closed-loop system in which sensorimotor dynamics can be generated, observed, manipulated, and analyzed\n(\nFigure 1\n)\n. Because digital twins exist entirely\nin silico\n, they can be subject to arbitrary perturbations and counterfactual simulations, enabling researchers to ask “what if” questions. Thus, neuromechanical models constitute a complementary approach to\nin vivo\nexperimentation that can bridge the gaps and integrate across multiple levels of biological organization. In fact, the use of simulated body models controlled by artificial neural networks dates back decades, most prominently in the study of insect stick insect and cockroach locomotion\n[\n3\n]\n. More recently, advances in simulation throughput and accurate physics\n[\n48\n,\n24\n]\nhave enabled the development of more realistic body models, particularly for animal and human neuromechanical simulations\n[\n50\n,\n12\n,\n2\n]\n, greatly expanding opportunities for afforded by this approach.\nFigure 2:\nPrior knowledge of biological systems helps infer structure, behavior, and function from limited experimental data.\n(Top row)\nAs an analogy, consider the task of reconstructing a vase based on a partial sketch. Naïvely, we cannot accurately model the shape of the vase using only partial observations. However, if we apply the prior that the vase should be radially symmetric, we can fill in missing regions and consolidate redundant measurements.\n(Middle and bottom rows)\nSimilarly, embedding biologically plausible features (\ne.g.\n, priors concerning body morphology, musculoskeletal organization, and neural network topology) into the digital twin constrains the solution space and improves reconstruction quality from sparse or noisy experimental data. Since simulated dynamics are fully accessible, this can also greatly extend the amount of information that can be inferred from limited experimental data.\nCrucially, neuromechanical digital twins are designed to be constrained by biological features. For example, joint articulation (\ne.g.\n, the number of degrees of freedom per joint, their ranges of motion, and rotational axes) is based on the anatomy of real animals, and joint movements are subject to passive dynamics including joint damping. Similarly, known neural circuit architecture (\ne.g.\n, from connectomics) and neuronal properties (\ne.g.\n, from electrophysiology) can be used to constrain the neural network model. Embedding such prior knowledge into the model as constraints enables more effective and efficient use of limited experimental data. Akin to observing the shape of an object such as a vase from partial outline based on prior knowledge about vases (\ne.g.\n, symmetry), biologically grounded models improve inference when data are sparse or incomplete\n(\nFigure 2\n)\n.\nHowever, serious challenges remain for the use of neuromechanical simulations in neuroscience. For example, artificial neural networks often have unrealistic connectivity or physiological properties. Body models are often approximated using rigid bodies and lack detailed sensory organs and muscle models. Important biomechanical properties, such as actuator gains, are often left as free parameters due to difficulties in obtaining experimental measurements. As well, detailed environmental features and states can be hard to model, especially for behaviors requiring complex body-environment interaction such as flight and swimming. Finally, even when methods for more realistic simulation are available, practical trade-offs exist between realism, computational cost, and implementation complexity. These challenges, as well as the current state of the art in addressing them and required works going forward, are summarized in\nFigure 1\nand will be discussed in the next sections.\nIn this article, we will survey recent advances in the development of neuromechanical digital twins and their applications to neuroscience, with a focus on studies published within the past five years while also including older works on simulation infrastructure that are still actively used today and review articles on foundational studies. An overview of the works reviewed is available in\nTable 1\n. We organize the review along five major themes: (1) inferring unmeasurable variables from experimental data, (2) hypothesis testing by simulating forward-engineered models, (3) studying closed-loop behavior\nin silico\n, (4) dialog with robotics and the newly emerging field of NeuroAI, and (5) applications in healthcare.\nArticle\nModel organism\nYear\nHighlight\nOriginal research (basic neuroscience)\n••\nÖzdil\net al.\n[\n29\n]\nDrosophila\n2025\nIdentify muscle synergies by motion replay & imitation\nKarashchuk\net al.\n[\n19\n]\nDrosophila\n2025\nModeling sensorimotor delay in locomotion\n•\nÖzdil\net al.\n[\n28\n]\nDrosophila\n2025\nProbing grooming control with network & body models\n••\nVaxenburg\net al.\n[\n49\n]\nDrosophila\n2025\nFlyBody: whole-body fly model and imitation learning\n••\nWang-Chen\net al.\n[\n51\n]\nDrosophila\n2024\nNeuroMechFly v2: complex behaviors & controllers\nLobato-Rios\net al.\n[\n23\n]\nDrosophila\n2022\nNeuroMechFly: realistic fly body model\nGoldsmith\net al.\n[\n17\n]\nDrosophila\n/robot\n2020\nDrosophibot: fly-inspired hexapod robot\n••\nDeWolf\net al.\n[\n13\n]\nRodent (mouse)\n2024\nMuscle-level adaptive learning with MusBioMaus\nRamalingasetty\net al.\n[\n33\n]\nRodent (mouse)\n2024\nFramework for modeling mouse locomotion control\n••\nAldarondo\net al.\n[\n1\n]\nRodent (rat)\n2024\nRealistic rodent model and imitation of real behavior\n•\nRavel\net al.\n[\n35\n]\nZebrafish\n2025\nEscape swim with various water viscosity\n•\nLiu\net al.\n[\n22\n]\nZebrafish\n2024\nZebrafish visuomotor behavior\nRoussel\net al.\n[\n37\n]\nZebrafish\n2021\nCircuits driving movements in developing zebrafish\n•\nZhao\net al.\n[\n55\n]\nC. elegans\n2025\nFeedback loops in\nC. elegans\nlocomotion\n••\nZhao\net al.\n[\n54\n]\nC. elegans\n2024\nBAAIWorm: simulate brain-body-environment loops\nOlivares\net al.\n[\n27\n]\nC. elegans\n2021\nLocomotion driven by pattern generator networks\n•\nPazzaglia\net al.\n[\n31\n]\nSalamander\n2024\nBalancing central control and sensory feedback\nThandiackal\net al.\n[\n47\n]\nLamprey/robot\n2021\nSwimming control via local force sensing\nPallasdies\net al.\n[\n30\n]\nJellyfish\n2025\nSimulation of neuronal synchronization in swimming\nHoover\net al.\n[\n18\n]\nJellyfish\n2021\nNeuromechanical resonance benefits swimming\n•\nMarin Vargas\net al.\n[\n25\n]\nPrimate\n2024\nReplay motion\nin silico\nto test role of proprioception\nRamadan\net al.\n[\n32\n]\nHuman\n2022\nMotor planning for different gaits in a body model\nDi Russo\net al.\n[\n14\n]\nHuman\n2021\nModeling gait patterns in human locomotion\nBellegarda & Ijspeert\n[\n4\n]\nRobot\n2022\nControlling pattern generators with deep learning\nStentiford\net al.\n[\n44\n]\nRobot\n2022\nDeep learning on the Neurorobotics Platform\nStark\net al.\n[\n43\n]\nDog/robot\n2021\nDog musculoskeletal model\nOriginal research (medical applications)\nElisha\net al.\n[\n15\n]\nHuman\n2025\nEsophagus biomechanical model and dysfunction\nSingh\net al.\n[\n41\n]\nHuman\n2025\nNeuromechanical model for Spasticity progression\nSartori\net al.\n[\n38\n]\nHuman/robot\n2024\nCEINMS-RT: Individualized models & wearable robots\nZhao\net al.\n[\n56\n]\nHuman\n2023\nModel-based feedback controller for rehabilitation\nBruel\net al.\n[\n8\n]\nHuman\n2022\nLink biomechanical impairments to pathological gaits\nZhang\net al.\n[\n53\n]\nHuman\n2021\nEMG + body model for ankle torque estimation\nTechnological development\nCotton\n[\n10\n]\nHuman\n2025\nControl motion by imitation at torque/muscle level\nArreguit\net al.\n[\n2\n]\nNon-specific\n2023\nFARMS: framework for simulating animals and robots\nVittorio\net al.\n[\n50\n]\nHuman\n2022\nMyoSuite: human-specific simulation environment\nFeldotto\net al.\n[\n16\n]\nNon-specific\n2022\nSimulating embodied spiking networks at scale\nBohez\net al.\n[\n6\n]\nHuman\n2022\nModulate and reuse motor skills learned by imitation\nMakoviychuk\net al.\n[\n24\n]\nNon-specific\n2021\nIsaac Gym: GPU-accelerated physics simulation\nPeng\net al.\n[\n5\n]\nDog/robot\n2020\nLearning robotic control by imitating animals\nTodorov\net al.\n[\n48\n]\nNon-specific\n2012\nMuJoCo: a widely used physics simulator\nDelp\net al.\n[\n12\n]\nNon-specific\n2007\nOpenSim: biomechanics-specific physics simulator\nReview & perspective articles\nBonanno\net al.\n[\n7\n]\nHuman\n2025\nMotor assessment of neurological disorders\n•\nZador\net al.\n[\n52\n]\nNon-specific\n2023\nNext-generation AI through neuroscience inspiration\n••\nRamdya & Ijspeert\n[\n34\n]\nNon-specific\n2023\nSynergy between neuroscience and robotics\nTaiar\net al.\n[\n46\n]\nHuman\n2022\nClinical link between circuits and biomechanics\nRodrigues da Silva\net al.\n[\n36\n]\nHuman\n2022\nBody models for device-assisted locomotion\nDe Groote & Falisse\n[\n11\n]\nHuman\n2021\nPredictive simulations of human movement\nSmith\net al.\n[\n42\n]\nHuman\n2021\nMusculoskeletal modelling in clinical setting\nSylvester\net al.\n[\n45\n]\nHuman\n2021\nMusculoskeletal modelling of human locomotion\nChen\net al.\n[\n9\n]\nRobot\n2020\nNeurorobotics for neuroethology and explainable AI\nMerel\net al.\n[\n26\n]\nNon-specific\n2019\nHierarchical motor control in animals and AI\nAyali\net al.\n[\n3\n]\nInsects\n2015\nFoundational works on insect biomechanical models\nTable 1:\nOverview of reviewed works.\nInference of experimentally unmeasurable variables\nOne obstacle to understanding how the brain controls behavior is that many variables involved in sensorimotor control are difficult to measure experimentally. For example, internal forces are hard to measure non-invasively, muscle activities are difficult to record at scale, and sensory feedback often can only be recorded indirectly. Neuromechanical digital twins provide a way to predict these variables using only partial experimental data\n(\nFigure 3\na)\n. Typically, this begins with\ninverse kinematics\n—the process of computing joint angles or body configurations that best reproduce recorded movements—followed by\ninverse dynamics\n—estimating internal forces required to generate those replayed movements given the mechanical properties of the body. Inferred quantities have included internal forces\n[\n23\n,\n28\n,\n53\n]\n, muscle activities\n[\n29\n,\n13\n,\n32\n,\n14\n,\n43\n,\n8\n]\n, sensory feedback\n[\n51\n,\n25\n,\n14\n]\n, and energy consumption\n[\n35\n]\n. These quantities can in turn allow researchers to evaluate behavior in new ways, for example by using contact forces as a proxy for grooming vigor\n[\n28\n]\n, and to understand behavior not just kinematically (\ni.e.\n, using only positions, velocities, etc.), but also dynamically with reference to internal and external forces.\nFigure 3:\nTwo directions for creating a dialogue between animal experiments and neuromechanical simulations.\n(\na\n) In reverse simulations, one can replay experimental behavioral data\nin silico\nand use this replay to infer hidden variables like neural and muscle activities that are otherwise difficult to measure. (\nb\n) Starting from a hypothesized neural circuit, one can roll out behavior\nin silico\nand compare it with experimental observations.\nBeyond biomechanics, an additional opportunity afforded by replaying experimentally recorded behavior is the ability to infer neuromuscular dynamics\nin silico\n. Estimating muscle dynamics based on kinematic observations is fundamentally difficult because there are typically more muscles than there are joint degrees of freedom. Consequently, in principle, there can be an infinite number of muscle recruitment patterns that can lead to an observed behavior. One approach to combat this challenge is to impose a set of optimization criteria that favor some solutions over others: for example, by minimizing the sum of muscle activations\n[\n12\n]\nor the total generated forces\n[\n32\n]\n(see in particular the “static optimization” method of OpenSim\n[\n12\n]\n). This approach has already provided insights: for instance, by identifying muscle co-activation patterns and suggesting potential muscle synergies\n[\n29\n,\n43\n]\n. A more dynamically constrained approach is to train models that predict the muscle activities needed to replicate observed\nsequences\nof movements\n[\n29\n,\n32\n,\n10\n]\n. This is a form of\nimitation learning\nthat we will revisit below.\nBecause muscles are the main interface between the brain and body biomechanics, muscle dynamics serve as a gateway to probe the inner workings of the nervous system. For example, Marin Vargas\net al.\n[\n25\n]\npassively replayed experimentally recorded primate reaching behavior in a musculoskeletal model to test hypothesized roles for proprioception. Because all muscle spindle responses can be accessed\nin silico\n, the authors were able to train different machine learning models to investigate what information is best encoded in these proprioceptive signals. In another example, Aldarondo\net al.\n[\n1\n]\ntrained an artificial neural network to imitate recorded rat behaviors in a virtual rodent. The model was then used to replicate the animal’s behavior, effectively acting as an inverse dynamics controller. By comparing activity in the simulated network with recorded neural activity across brain regions, the authors identified candidate regions that may implement inverse dynamics. Neuromechanical twins have also been used to study different sensory modalities beyond mechanosensation. For instance, to study visuomotor behaviors, researchers directly accessed simulated neural activities in the visual system using an artificial neural network constrained by real circuits organization\n[\n22\n,\n51\n]\n.\nTesting hypothesized neural controllers through simulation\nIn the preceding section, we reviewed how neuromechanical models are used to replicate observed behaviors and how readouts from these models can be used to infer physiological variables for the real animal\n(\nFigure 3\na)\n. Conversely, one can also embed a forward-engineered controller into the biomechanical simulation and compare model-controlled behavior with real, experimentally recorded behaviors\n(\nFigure 3\nb)\n. Most prominently, biomechanical models have been used to study how locomotion can emerge from centralized oscillators akin to central pattern generators (CPGs)\n[\n22\n,\n23\n,\n27\n,\n4\n]\n, decentralized controllers depending on mechanosensory feedback\n[\n3\n,\n14\n]\n, and a combination of the two\n[\n51\n,\n33\n,\n47\n]\n. Building upon these models, researchers have also investigated how artificial neural controllers can use modulatory signals to modify behavior, for example to perform steering\n[\n22\n,\n51\n,\n4\n]\nor to fine-tune locomotor gaits (\ne.g.\nstep length, cadence)\n[\n32\n,\n14\n,\n4\n]\n. Similarly, neuromechanical models have been used to evaluate how timing and synchronization in neural circuits regulate coherent behavior\n[\n19\n,\n30\n]\n.\nOne unique strength of neuromechanical simulations is the ability to study how the nervous system and the physical body work together. For example, Hoover\net al.\n[\n18\n]\nembedded a neuromechanical model within a fluid dynamics simulation to show that the speed of a wave of muscle activation in the jellyfish bell matches the speed at which elastic deformation propagates through the soft material itself. This produces a neuromechanical resonance and enables efficient swimming. Similarly, by replicating recorded behavior in a neuromechanical fly model, Özdil\net al.\n[\n29\n]\ndemonstrated that passive joint properties like damping facilitate muscle-driven motor control.\nFinally, neuromechanical models are also used as a platform to study development, learning, and adaptation in motor control. For instance, Roussel\net al.\n[\n37\n]\nmodeled putative neural circuits at different zebrafish developmental stages to explain the appearance of distinct swimming patterns. DeWolf\net al.\n[\n13\n]\nstudied how adult mice learn adaptive movements by replicating recorded behaviors in a body model and reading out postural and muscle-level features. They then modeled how these features might be represented in the brain, identifying how sensorimotor prediction errors might be computed to adapt to unexpected perturbations.\nClosing the sensorimotor loop\nIn the real world, behavior arises from nested feedback loops. For example, the body navigates the environment using senses (\ne.g.\n, vision, olfaction, and audition) that are consequently modified by self-motion. Simultaneously, the nervous system receives feedback about ongoing low-level movements through proprioception. Embodying neural circuit models within a biomechanical hull in a physics simulator closes the first feedback loop\n[\n51\n,\n49\n]\nwhile placing models in a sensory-rich environment opens up the opportunity to explore the second feedback loop\n[\n1\n,\n19\n,\n13\n,\n33\n]\n. For example, Wang-Chen\net al.\n[\n51\n]\nsimulated a fly that, controlled by a hierarchical controller, simultaneously performs odor-guided approach and avoidance and vision-guided obstacle navigation while walking over rugged terrain. Similarly, Vaxenburg\net al.\n[\n49\n]\nmodeled flight in flies using a phenomenological fluid mechanics model, and tasked the fly to to navigate a valley-like corridor based on visual information. In the worm\nC. elegans\n, Zhao\net al.\n[\n54\n]\ncombined a brain model with a body model and simulated zigzag movement toward attractors—a behavior that has been previously identified experimentally. These studies highlight how coupled neural and biomechanical models can be used to simulate complex sensorimotor behaviors that resemble those observed in nature.\nSimulations also enable the performance of precise perturbations to explore the mechanisms underlying closed loop behaviors such as feedback-based locomotor control, thereby circumventing limitations of real experiments where genetic tools—particularly optogenetic tools—are limited by the availability and specificity of driver lines. For example, taking advantage of the full ability to perturb\nin silico\nneural controllers and the body itself, Thandiackal\net al.\n[\n47\n]\nsimulated swimming in a lamprey-based model (as well as using a physical robot) and systematically evaluated the robustness of different hypothesized neural controllers against neuromechanical perturbations including spinal transection.\nFinally, recent studies are simulating neural networks with increasing biological fidelity. This includes the use of biologically grounded circuit properties like (i) connectome-constrained artificial neural networks\n[\n51\n,\n33\n,\n40\n]\n, (ii) experimentally constrained circuit mechanisms\n[\n55\n]\n, and (iii) physiologically realistic neuron models\n[\n31\n,\n40\n]\n. For example, Wang-Chen\net al.\n[\n51\n]\nfit a neuromechanical model of the fly with a visual system model\n[\n21\n]\nbased on the real fly’s brain connectome, enabling the inference of biologically plausible visual system responses which were then used to regulate simulated fly-fly chasing. These approaches showcase the synergy between realistic neural network modeling and realistic biomechanical modeling towards the ultimate goal of faithful integration of realistic neural, biomechanical, and environmental dynamics in simulations.\nSynergies with Robotics and NeuroAI\nNeuroscience and robotics share a long history of mutual interest in understanding how autonomous agents—biological or artificial—are built to behave both flexibly and robustly in complex, unfamiliar environments\n[\n34\n]\n. Insights from studying animal behaviors have inspired the design of robots\n[\n17\n,\n5\n]\n, while robots have reciprocally served as physical platforms to test theories of neural control and sensorimotor integration\n[\n44\n,\n9\n]\n. More recently, rapid progress in machine learning has renewed interest in the dialogue between artificial and biological intelligence. The term “NeuroAI” was coined to describe both the development of next-generation AI inspired by neuroscience\n[\n52\n]\nand the use of AI systems to evaluate and refine neuroscientific hypotheses\n[\n39\n]\n. Neuromechanical models offer a natural bridge between these two areas: machine learning algorithms can be embodied in animal models to test if they can explain observed animal behaviors, and principles enabling biologically realistic neural controllers can be applied to improve AI systems.\nThe most prominent integration between neuroscience and machine learning has been the use of reinforcement learning to replicate naturalistic behavior in animal body models. A particularly effective approach has been the use of\nimitation learning\n[\n6\n,\n5\n]\n, in which an autonomous agent learns from demonstrations rather by trying to achieve an abstract goal. Combined with advances in motion tracking and pose estimation, imitation learning has enabled realistic replication of experimentally recorded behaviors in neuromechanical models\n[\n1\n,\n49\n,\n29\n]\n.\nAnother feature of robotic and artificial controllers inspired by neuroscience is the hierarchical organization of information processing by neural controllers: the brain processes and integrates high-level information (\ne.g.\n, sensory input, memory) and conveys a lower-dimensional representation to motor circuits. Artificial neural controllers can mirror this architecture\n[\n26\n]\n. For example, Wang-Chen\net al.\n[\n51\n]\nand Vaxenburg\net al.\n[\n49\n]\nused models comprising multiple levels of neural processing (\ni.e.\n, visual system, action selection, low-level motor control) to produce fly behaviors. Returning from artificial systems back to neurobiology, Karashchuk\net al.\n[\n19\n]\nsimulated a three-stage controller inspired by the anatomical architecture of\nDrosophila\nmotor circuits to investigate how the fly generates robust walking in the presence of sensorimotor delays. Finally, neuromechanical models have also inspired the design of physical robots directly. For instance, decentralized control in a lamprey-based model that enables robust swimming after spinal injury offers a solution for modular robots\n[\n47\n]\n, neuromechanical resonance in jellyfish swimming can motivate similar designs in soft-body robots\n[\n18\n]\n, and\nDrosophila\nlimb anatomy has informed the design of a hexapod robot\n[\n17\n]\n.\nApplications in healthcare\nThe integration of biomechanical models and neurological data also provides a powerful tool to guide neurorehabilitation\n[\n56\n]\n, our understanding of diseases\n[\n41\n,\n8\n]\n, the development of medical devices\n[\n38\n,\n53\n]\n, and a general understanding of human physiology\n[\n11\n,\n45\n]\n. For example, Bruel\net al.\n[\n8\n]\nsimulated a leg musculoskeletal model driven by a reflex-based gait controller and observed how walking changed when various neural and biomechanical impairments were introduced in simulation. This approach allowed the authors to investigate the potential causes of pathological toe and heel gaits commonly observed in patients with spinal injury, stroke and cerebral palsy. Similarly, Elisha\net al.\n[\n15\n]\ndeveloped a neuromechanical model of the esophagus to replicate Repetitive Antegrade Contractions and understand Esophageal Motility Disorders. Neuromechanical models can also be used for individualized medicine where models are constrained by a particular patient’s physiological recordings (\ne.g.\n, EMG data)\n[\n38\n,\n53\n]\n. A series of review articles details how neuromechanical models can be applied in medical and clinical settings\n[\n46\n,\n42\n]\n, particularly toward developing medical devices\n[\n36\n]\nand treating disorders\n[\n7\n]\n.\nOutlook\nNeuromechanically accurate animal digital twins are emerging as an integrative tool for linking neural circuits, biomechanics, and behavior. Concurrently, rapid progress in connectomics, population physiological recording, and high-performance computing is dramatically expanding the data and approaches available to constrain such models. In this context, we outline several promising research directions that we envision for the future.\nFirst, more realistic models will be generated. Increasingly detailed whole-body scans and advances in soft-body simulation will make it possible to represent muscles, tendons, compliant tissues, and soft materials with greater fidelity. For neural controllers, recently acquired and upcoming connectomics datasets will impose strong topological constraints on the architecture of simulated networks. At the same time, large-scale simulation of more realistic neurons\n[\n16\n,\n40\n]\n—constrained by recordings of large neuronal populations—will help bridge the gap between network structure and function. These advances will also facilitate the development of individualized digital twins that capture the unique morphology and physiology of specific animals or humans, enabling personalized predictions for rehabilitation and clinical interventions.\nSecond, we expect that neuromechanical digital twins will become not just an interpretive tool, but a key step in the experimental pipeline itself. Real-time simulations informed by ongoing measurements will enable closed-loop experimentation. In this way, variables inferred from the model can be used to adaptively guide experimental conditions, analogous to how smart microscopy currently uses online image analysis to steer data acquisition. This approach will allow researchers to efficiently target previously hard-to-access states, explore rare but important behaviors, and—to some extent—perturb the system outside of its normal operating states, thereby steering data collection toward the most informative experiments. In the more distant future, simulation-in-the-loop experimentation has the potential to fundamentally change the design of neuroscience studies, shifting the field from\npost hoc\nanalysis of experimental data (though the experiment itself might involve artificial perturbations) to active probing of brain-body-environment interactions, aided by a digital twin in parallel.\nThird, a key promise of neuromechanical digital twins is the opportunity to identify and explore generalizable principles of sensorimotor control. Comparative studies across species will likely reveal recurring motifs in control architectures (\ne.g.\n, hierarchical versus decentralized), sensorimotor strategies (\ne.g.\n, feedforward versus feedback), mechanical strategies (\ne.g.\n, passive dynamics, soft material properties), and scaling laws (\ne.g.\n, across different body sizes, number of kinematic chains, and kinematic chain lengths). Achieving this will require studying broader and more diverse sets of naturalistic behaviors beyond stereotyped laboratory tasks, and possibly diversifying the study of animal ethology beyond common laboratory animals. The resulting hypotheses can then be tested\nin silico\nand possibly implemented in physical robots to validate neuroscientific insights and inspire the design of next-generation embodied artificial intelligence systems\n[\n52\n]\n.\nUltimately, realizing this exciting future will depend on sustained interdisciplinary exchange and shared infrastructure: faster and more accurate simulation engines, more efficient and affordable pipelines to construct body models, and interoperable software stacks. These needs reveal an underappreciated alignment across research and development domains with vastly diverging goals but shared technical challenges, spanning computer graphics (efficient simulation and rendering), cinematic animation and video gaming (realistic and controllable characters), sports and athletic science (individualized biomechanical models), human-computer interaction and virtual/augmented reality (closed-loop experimentation)—in addition to more conventional targets of collaboration such as machine learning (neural architectures and optimization), control theory (system identification and stability), and industrial digital twins (real-time model updates).\nConcurrently, more detailed categorization of body mechanical properties (\ne.g.\n, joint actuation, compliant materials, sensors and actuators) and neuronal properties (\ne.g.\n, more diverse connectomics datasets) is necessary to better constrain structural elements for the animal digital twins. Beyond mechanical characteristics, joint neural and behavioral recordings of real animals at high spatiotemporal resolution are also required to constrain time-varying, dynamical processes that generate and regulate movement. Together, these developments will enable neuromechanical models to evolve from specialized tools into a general framework for studying behavior. By embedding grounded experimental observations in transparent and fully controllable digital twins, neuromechanical modeling offers a powerful platform for generating hypotheses, guiding experiments, and uncovering general principles of behavior control.\nAnnotated references for articles published since 2023\nPapers of outstanding interest (••)\nAldarondo\net al.\n(2024)\n[\n1\n]\nThis study constructed a “virtual rodent” by embedding an artificial neural network within a biomechanically realistic rat model. The artificial neural controller was trained to imitate experimentally recorded behavior using reinforcement learning. The authors then showed that neural activity in the real animal’s striatum and motor cortex could be predicted by activity in the artificial neural network controlling the virtual rat’s movements. Finally, the authors showed evidence in favor of the minimal intervention principle of optimal feedback control by perturbing latent variables in the control network.\nDeWolf\net al.\n(2024)\n[\n13\n]\nThis study introduced a 50-muscle biomechanical model of the mouse forelimb, “MusBioMouse.” By replaying the recorded behavior\nin silico\n, the authors inferred experimentally inaccessible control signals—namely joint torques and muscle activation—from the model’s muscles. By correlating these with experimentally recorded neural activities, the authors showed that somatosensory and motor cortex encode postural, muscle, and proprioceptive information.\nÖzdil\net al.\n(2025)\n[\n29\n]\nThis study identified muscle synergies in the\nDrosophila\nforelimb based on neuromechanical simulation. To do so, the authors replayed experimentally recorded behavior in a neuromechanical model and inferred muscle activities via an inverse model. Then, they revealed groups of muscles that are recruited in synergy by clustering muscle activities. The study also used imitation learning to construct an artificial neural controller that drives realistic behavior by actuating muscles.\nRamdya and Ijspeert (2023)\n[\n34\n]\nThis article reviews how the fields of neuroscience and robotics have fostered each other, centered around the shared goal of understanding how agile, efficient, and robust movements are controlled by autonomous agents. The article outlines the parallels between biological and artificial systems and surveys shared insights from the two fields of study in the past decades.\nVaxenburg\net al.\n(2025)\n[\n49\n]\nThis study introduced a\nDrosophila\nfull-body model. An artificial neural network trained through end-to-end reinforcement learning was used to control the body model to imitate experimentally recorded walking and flying behavior. The controller was hierarchical—allowing the simulated fly to steer and adjust flying altitude, thus navigating a terrain with bumps and trenches during flight based on visual input.\nWang-Chen\net al.\n(2024)\n[\n51\n]\nThis study expanded the functionality of a biologically realistic fly body model, “NeuroMechFly”\n[\n23\n]\n, by introducing biologically inspired walking control networks and incorporating visual and olfactory inputs. Using these, the authors modeled closed-loop behaviors such as head stabilization while walking over rugged terrain and path integration. The study demonstrated the integrative nature of neuromechanical modeling by training a hierarchical controller to simulate olfactory and visual navigation while walking over rugged terrain. The study also simulated a connectome-constrained visual system model to infer activities of biological neurons during locomotion.\nZhao\net al.\n(2024)\n[\n54\n]\nThis study simulated the three-way interaction between the nervous system, the body, and the environment in\nC. elegans\n. Using this framework, the authors replicated zigzag movements toward attractors in the environment, which had been experimentally observed. Notably, the neuromechanical model incorporated realistic neuronal connections constrained by the connectome, and realistic muscle placements constrained by the body anatomy.\nPapers of special interest (•)\nLiu\net al.\n(2025)\n[\n22\n]\nThis study introduced a realistic neuromechanical model of the larval zebrafish, “simZFish,” to investigate the animal’s optomotor response. By systematically perturbing controller features\nin silico\n—an impossible task in real animals—the authors demonstrated how embodiment is tightly coupled with neural networks in the control of behaviors. Finally, the study constructed a physical robot, “ZFish,” to validate these insights.\nÖzdil\net al.\n(2024)\n[\n28\n]\nAnimal behaviors often require the coordination of multiple body parts. This study used\nDrosophila\ngrooming as a model to study multi-body part coordination. The authors used neuromechanical simulations to infer contact forces between the limbs and the antennae, which are challenging to measure experimentally. The authors also used counterfactual simulations (replaying recorded behavior with different actuator gains) to understand the roles of different movements in achieving the behavioral goal.\nPazzaglia\net al.\n(2024)\n[\n31\n]\nThis study used a salamander neuromechanical model to understand the role of mechanosensory feedback—particularly stretch feedback—in swimming and walking. The study coupled the body mechanical model with a neural network model consisting of leaky integrate-and-fire (LIF) neurons to investigate how stretch feedback signals could help the nervous system generate and maintain locomotor patterns.\nRavel\net al.\n(2025)\n[\n35\n]\nBehaviors often emerge as a result of the interaction between the body and its environment. This study simulated the interaction between the body and the water surrounding it during zebrafish swimming. Using this approach, the study highlights mechanical strategies employed by the animal to efficiently propel itself in waters of different viscosities, especially in terms of power output.\nMarin Vargas\net al.\n(2024)\n[\n25\n]\nThis study replayed primate arm movements in a musculoskeletal model and read out muscle proprioceptive signals\nin silico\n. By training machine learning models to perform tasks that reflect hypothesized roles of proprioception (\ne.g.,\nrecognizing stereotyped actions, estimating body kinematic states, and most efficiently encoding overall sensory information), the authors tested hypotheses on the roles played by proprioception.\nZador\net al.\n(2023)\n[\n52\n]\nThis opinion piece highlights how advances in NeuroAI will accelerate the development of next-generation, embodied artificial intelligence systems that function in the real world.\nZhao\net al.\n(2025)\n[\n55\n]\nBy simulating the locomotion of the worm\nC. elegans\n, this study proposed a feedback-driven control mechanism that comprises motor neurons and muscles. Combined calcium imaging with neuromechanical simulation in its methodology, this study exemplifies how\nin vivo\nobservation and\nin silico\nsimulation can be synergistic, providing a powerful platform for neuroscientific discoveries.\nDeclaration of generative AI and AI-assisted technologies in the writing process\nDuring the preparation of this work the authors used OpenAI ChatGPT to improve the readability and language of the manuscript. After using this tool/service, the authors reviewed and edited the content as needed and take full responsibility for the content of the published article.\nDeclaration of interest\nThe authors declare no competing interests.\nAcknowledgments\nSWC acknowledges support from a Boehringer Ingelheim Fonds PhD fellowship. PR acknowledges support from a Swiss National Science Foundation (SNSF) Project Grant (207806).\nAuthor contributions\nSWC:\nconceptualization, investigation, visualization, writing – original draft, writing – review and editing.\nPR:\nconceptualization, project administration, supervision, visualization, writing – original draft, writing – review and editing.\nReferences\n[1]\nD. Aldarondo, J. Merel, J. D. Marshall, L. Hasenclever, U. Klibaite, A. Gellis, Y. Tassa, G. Wayne, M. Botvinick, and B. P. Ölveczky\n(2024-06)\nA virtual rodent predicts the structure of neural activity across behaviours\n.\nNature\n632\n(\n8025\n),\npp. 594–602\n.\nExternal Links:\nISSN 1476-4687\n,\nLink\n,\nDocument\nCited by:\nGraphical Abstract\n,\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nClosing the sensorimotor loop\n,\nSynergies with Robotics and NeuroAI\n,\nAldarondo\net al.\n(2024)\n[\n1\n]\n.\n[2]\nJ. Arreguit, S. Tata Ramalingasetty, and A. Ijspeert\n(2023-09)\nFARMS: framework for animal and robot modeling and simulation\n.\nbioRxiv\n.\nExternal Links:\nLink\n,\nDocument\nCited by:\nTable 1\n,\nIntroduction\n.\n[3]\nA. Ayali, A. Borgmann, A. Büschges, E. Couzin-Fuchs, S. Daun-Gruhn, and P. Holmes\n(2015-12)\nThe comparative investigation of the stick insect and cockroach models in the study of insect locomotion\n.\nCurrent Opinion in Insect Science\n12\n,\npp. 1–10\n.\nExternal Links:\nISSN 2214-5745\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nIntroduction\n,\nTesting hypothesized neural controllers through simulation\n.\n[4]\nG. Bellegarda and A. Ijspeert\n(2022-10)\nCPG-RL: learning central pattern generators for quadruped locomotion\n.\nIEEE Robotics and Automation Letters\n7\n(\n4\n),\npp. 12547–12554\n.\nExternal Links:\nISSN 2377-3774\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nTesting hypothesized neural controllers through simulation\n.\n[5]\nX. Bin Peng, E. Coumans, T. Zhang, T. Lee, J. Tan, and S. Levine\n(2020-07)\nLearning agile robotic locomotion skills by imitating animals\n.\nIn\nRobotics: Science and Systems XVI\n,\nRSS2020\n.\nExternal Links:\nLink\n,\nDocument\nCited by:\nTable 1\n,\nSynergies with Robotics and NeuroAI\n,\nSynergies with Robotics and NeuroAI\n.\n[6]\nS. Bohez, S. Tunyasuvunakool, P. Brakel, F. Sadeghi, L. Hasenclever, Y. Tassa, E. Parisotto, J. Humplik, T. Haarnoja, R. Hafner, M. Wulfmeier, M. Neunert, B. Moran, N. Siegel, A. Huber, F. Romano, N. Batchelor, F. Casarini, J. Merel, R. Hadsell, and N. Heess\n(2022)\nImitate and Repurpose: learning reusable robot movement skills from human and animal behaviors\n.\narXiv\n.\nExternal Links:\nDocument\n,\nLink\nCited by:\nTable 1\n,\nSynergies with Robotics and NeuroAI\n.\n[7]\nM. Bonanno, P. De Pasquale, B. Fonti, E. Gjonaj, S. De Salvo, A. Quartarone, and R. S. Calabrò\n(2025-06)\nNeural control meets biomechanics in the motor assessment of neurological disorders: a narrative review\n.\nFrontiers in Neural Circuits\n19\n.\nExternal Links:\nISSN 1662-5110\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nApplications in healthcare\n.\n[8]\nA. Bruel, S. B. Ghorbel, A. Di Russo, D. Stanev, S. Armand, G. Courtine, and A. Ijspeert\n(2022-05)\nInvestigation of neural and biomechanical impairments leading to pathological toe and heel gaits using neuromusculoskeletal modelling\n.\nThe Journal of Physiology\n600\n(\n11\n),\npp. 2691–2712\n.\nExternal Links:\nISSN 1469-7793\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nApplications in healthcare\n.\n[9]\nK. Chen, T. Hwu, H. J. Kashyap, J. L. Krichmar, K. Stewart, J. Xing, and X. Zou\n(2020-10)\nNeurorobots as a means toward neuroethology and explainable AI\n.\nFrontiers in Neurorobotics\n14\n.\nExternal Links:\nISSN 1662-5218\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nSynergies with Robotics and NeuroAI\n.\n[10]\nR. J. Cotton\n(2025)\nKinTwin: imitation learning with torque and muscle driven biomechanical models enables precise replication of able-bodied and impaired movement from markerless motion capture\n.\narXiv\n.\nExternal Links:\nDocument\n,\nLink\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n.\n[11]\nF. De Groote and A. Falisse\n(2021-03)\nPerspective on musculoskeletal modelling and predictive simulations of human movement to assess the neuromechanics of gait\n.\nProceedings of the Royal Society B: Biological Sciences\n288\n(\n1946\n),\npp. 20202432\n.\nExternal Links:\nISSN 1471-2954\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nApplications in healthcare\n.\n[12]\nS. L. Delp, F. C. Anderson, A. S. Arnold, P. Loan, A. Habib, C. T. John, E. Guendelman, and D. G. Thelen\n(2007-11)\nOpenSim: open-source software to create and analyze dynamic simulations of movement\n.\nIEEE Transactions on Biomedical Engineering\n54\n(\n11\n),\npp. 1940–1950\n.\nExternal Links:\nISSN 0018-9294\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nIntroduction\n,\nInference of experimentally unmeasurable variables\n.\n[13]\nT. DeWolf, S. Schneider, P. Soubiran, A. Roggenbach, P. Muratore, and M. Mathis\n(2024-09)\nNeuro-musculoskeletal modeling reveals muscle-level neural dynamics of adaptive learning in sensorimotor cortex\n.\nCold Spring Harbor Laboratory\n.\nExternal Links:\nLink\n,\nDocument\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nTesting hypothesized neural controllers through simulation\n,\nClosing the sensorimotor loop\n,\nDeWolf\net al.\n(2024)\n[\n13\n]\n.\n[14]\nA. Di Russo, D. Stanev, S. Armand, and A. Ijspeert\n(2021-05)\nSensory modulation of gait characteristics in human locomotion: a neuromusculoskeletal modeling study\n.\nPLOS Computational Biology\n17\n(\n5\n),\npp. e1008594\n.\nExternal Links:\nISSN 1553-7358\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nTesting hypothesized neural controllers through simulation\n.\n[15]\nG. Elisha, S. Halder, X. Liu, D. A. Carlson, P. J. Kahrilas, J. E. Pandolfino, and N. A. Patankar\n(2024)\nNeurological disorders leading to mechanical dysfunction of the esophagus: an emergent behavior of a neuromechanical dynamical system\n.\narXiv\n.\nExternal Links:\nDocument\n,\nLink\nCited by:\nTable 1\n,\nApplications in healthcare\n.\n[16]\nB. Feldotto, J. M. Eppler, C. Jimenez-Romero, C. Bignamini, C. E. Gutierrez, U. Albanese, E. Retamino, V. Vorobev, V. Zolfaghari, A. Upton, Z. Sun, H. Yamaura, M. Heidarinejad, W. Klijn, A. Morrison, F. Cruz, C. McMurtrie, A. C. Knoll, J. Igarashi, T. Yamazaki, K. Doya, and F. O. Morin\n(2022-05)\nDeploying and optimizing embodied simulations of large-scale spiking neural networks on HPC infrastructure\n.\nFrontiers in Neuroinformatics\n16\n.\nExternal Links:\nISSN 1662-5196\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nOutlook\n.\n[17]\nC. A. Goldsmith, N. S. Szczecinski, and R. D. Quinn\n(2020-09)\nNeurodynamic modeling of the fruit fly Drosophila melanogaster\n.\nBioinspiration & Biomimetics\n15\n(\n6\n),\npp. 065003\n.\nExternal Links:\nISSN 1748-3190\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nSynergies with Robotics and NeuroAI\n,\nSynergies with Robotics and NeuroAI\n.\n[18]\nA. P. Hoover, N. W. Xu, B. J. Gemmell, S. P. Colin, J. H. Costello, J. O. Dabiri, and L. A. Miller\n(2021-03)\nNeuromechanical wave resonance in jellyfish swimming\n.\nProceedings of the National Academy of Sciences\n118\n(\n11\n).\nExternal Links:\nISSN 1091-6490\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nTesting hypothesized neural controllers through simulation\n,\nSynergies with Robotics and NeuroAI\n.\n[19]\nL. Karashchuk, J. S. L. Li, G. M. Chou, S. Walling-Bell, S. L. Brunton, J. C. Tuthill, and B. W. Brunton\n(2025-03)\nSensorimotor delays constrain robust locomotion in a 3D kinematic model of fly walking\n.\neLife\n.\nNote:\nReviewed preprint\nExternal Links:\nLink\n,\nDocument\nCited by:\nTable 1\n,\nTesting hypothesized neural controllers through simulation\n,\nClosing the sensorimotor loop\n,\nSynergies with Robotics and NeuroAI\n.\n[20]\nJ. W. Krakauer, A. A. Ghazanfar, A. Gomez-Marin, M. A. MacIver, and D. Poeppel\n(2017-02)\nNeuroscience needs behavior: correcting a reductionist bias\n.\nNeuron\n93\n(\n3\n),\npp. 480–490\n.\nExternal Links:\nISSN 0896-6273\n,\nLink\n,\nDocument\nCited by:\nIntroduction\n.\n[21]\nJ. K. Lappalainen, F. D. Tschopp, S. Prakhya, M. McGill, A. Nern, K. Shinomiya, S. Takemura, E. Gruntman, J. H. Macke, and S. C. Turaga\n(2024-09)\nConnectome-constrained networks predict neural activity across the fly visual system\n.\nNature\n634\n(\n8036\n),\npp. 1132–1140\n.\nExternal Links:\nISSN 1476-4687\n,\nLink\n,\nDocument\nCited by:\nClosing the sensorimotor loop\n.\n[22]\nX. Liu, M. D. Loring, L. Zunino, K. E. Fouke, F. A. Longchamp, A. Bernardino, A. J. Ijspeert, and E. A. Naumann\n(2025-10)\nArtificial embodied circuits uncover neural architectures of vertebrate visuomotor behaviors\n.\nScience Robotics\n10\n(\n107\n).\nExternal Links:\nISSN 2470-9476\n,\nLink\n,\nDocument\nCited by:\nGraphical Abstract\n,\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nTesting hypothesized neural controllers through simulation\n,\nLiu\net al.\n(2025)\n[\n22\n]\n.\n[23]\nV. Lobato-Rios, S. T. Ramalingasetty, P. G. Özdil, J. Arreguit, A. J. Ijspeert, and P. Ramdya\n(2022-05)\nNeuroMechFly, a neuromechanical model of adult Drosophila melanogaster\n.\nNature Methods\n19\n(\n5\n),\npp. 620–627\n.\nExternal Links:\nISSN 1548-7105\n,\nLink\n,\nDocument\nCited by:\nGraphical Abstract\n,\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nTesting hypothesized neural controllers through simulation\n,\nWang-Chen\net al.\n(2024)\n[\n51\n]\n.\n[24]\nV. Makoviychuk, L. Wawrzyniak, Y. Guo, M. Lu, K. Storey, M. Macklin, D. Hoeller, N. Rudin, A. Allshire, A. Handa, and G. State\n(2021)\nIsaac Gym: high performance GPU based physics simulation for robot learning\n.\nIn\nThirty-fifth Conference on Neural Information Processing Systems\n,\nExternal Links:\nLink\nCited by:\nTable 1\n,\nIntroduction\n.\n[25]\nA. Marin Vargas, A. Bisi, A. S. Chiappa, C. Versteeg, L. E. Miller, and A. Mathis\n(2024-03)\nTask-driven neural network models predict neural dynamics of proprioception\n.\nCell\n187\n(\n7\n),\npp. 1745–1761.e19\n.\nExternal Links:\nISSN 0092-8674\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nInference of experimentally unmeasurable variables\n,\nMarin Vargas\net al.\n(2024)\n[\n25\n]\n.\n[26]\nJ. Merel, M. Botvinick, and G. Wayne\n(2019-12)\nHierarchical motor control in mammals and machines\n.\nNature Communications\n10\n(\n1\n).\nExternal Links:\nISSN 2041-1723\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nSynergies with Robotics and NeuroAI\n.\n[27]\nE. Olivares, E. J. Izquierdo, and R. D. Beer\n(2021-02)\nA neuromechanical model of multiple network rhythmic pattern generators for forward locomotion in C. elegans\n.\nFrontiers in Computational Neuroscience\n15\n.\nExternal Links:\nISSN 1662-5188\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nTesting hypothesized neural controllers through simulation\n.\n[28]\nP. G. Özdil, J. Arreguit, C. Scherrer, A. Ijspeert, and P. Ramdya\n(2024-12)\nCentralized brain networks underlie body part coordination during grooming\n.\nbioRxiv\n.\nExternal Links:\nLink\n,\nDocument\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nÖzdil\net al.\n(2024)\n[\n28\n]\n.\n[29]\nP. G. Özdil, C. Ning, J. S. Phelps, S. Wang-Chen, G. Elisha, A. Blanke, A. Ijspeert, and P. Ramdya\n(2025)\nMusculoskeletal simulation of limb movement biomechanics in Drosophila melanogaster\n.\narXiv\n.\nExternal Links:\nDocument\n,\nLink\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nInference of experimentally unmeasurable variables\n,\nTesting hypothesized neural controllers through simulation\n,\nSynergies with Robotics and NeuroAI\n,\nÖzdil\net al.\n(2025)\n[\n29\n]\n.\n[30]\nF. Pallasdies, P. Norton, J. Schleimer, and S. Schreiber\n(2025-04)\nNeuronal synchronization and bidirectional activity spread explain efficient swimming in a whole-body model of hydrozoan jellyfish\n.\nThe Journal of Neuroscience\n45\n(\n20\n),\npp. e1370242025\n.\nExternal Links:\nISSN 1529-2401\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nTesting hypothesized neural controllers through simulation\n.\n[31]\nA. Pazzaglia, A. Bicanski, A. Ferrario, J. Arreguit, D. Ryczko, and A. Ijspeert\n(2025-01)\nBalancing central control and sensory feedback produces adaptable and robust locomotor patterns in a spiking, neuromechanical model of the salamander spinal cord\n.\nPLOS Computational Biology\n21\n(\n1\n),\npp. e1012101\n.\nExternal Links:\nISSN 1553-7358\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nClosing the sensorimotor loop\n,\nPazzaglia\net al.\n(2024)\n[\n31\n]\n.\n[32]\nR. Ramadan, F. Meischein, and H. Reimann\n(2022-12)\nHigh-level motor planning allows flexible walking at different gait patterns in a neuromechanical model\n.\nFrontiers in Bioengineering and Biotechnology\n10\n.\nExternal Links:\nISSN 2296-4185\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nInference of experimentally unmeasurable variables\n,\nTesting hypothesized neural controllers through simulation\n.\n[33]\nS. T. Ramalingasetty, S. N. Markin, A. B. Lockhart, J. Arreguit, N. A. Shevtsova, A. J. Ijspeert, I. A. Rybak, and S. M. Danner\n(2024)\nOn all fours: a 3D framework to study closed-loop control of quadrupedal mouse locomotion\n.\nIn\nThe 2024 Conference on Artificial Life\n,\nALIFE 2024\n.\nExternal Links:\nLink\n,\nDocument\nCited by:\nTable 1\n,\nTesting hypothesized neural controllers through simulation\n,\nClosing the sensorimotor loop\n,\nClosing the sensorimotor loop\n.\n[34]\nP. Ramdya and A. J. Ijspeert\n(2023-05)\nThe neuromechanics of animal locomotion: from biology to robotics and back\n.\nScience Robotics\n8\n(\n78\n).\nExternal Links:\nISSN 2470-9476\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nSynergies with Robotics and NeuroAI\n,\nRamdya and Ijspeert (2023)\n[\n34\n]\n.\n[35]\nG. Ravel, T. Mercé, M. Bergmann, A. Knoll-Gellida, A. Bouharguane, S. Al Kassir, A. Iollo, and P. J. Babin\n(2025-03)\nModeling zebrafish escape swim reveals maximum neuromuscular power output and efficient body movement adaptation to increased water viscosity\n.\niScience\n28\n(\n3\n),\npp. 112056\n.\nExternal Links:\nISSN 2589-0042\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nRavel\net al.\n(2025)\n[\n35\n]\n.\n[36]\nM. Rodrigues da Silva, F. Marques, M. Tavares da Silva, and P. Flores\n(2022-11)\nA comprehensive review on biomechanical modeling applied to device-assisted locomotion\n.\nArchives of Computational Methods in Engineering\n30\n(\n3\n),\npp. 1897–1960\n.\nExternal Links:\nISSN 1886-1784\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nApplications in healthcare\n.\n[37]\nY. Roussel, S. F. Gaudreau, E. R. Kacer, M. Sengupta, and T. V. Bui\n(2021-09)\nModeling spinal locomotor circuits for movements in developing zebrafish\n.\neLife\n10\n.\nExternal Links:\nISSN 2050-084X\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nTesting hypothesized neural controllers through simulation\n.\n[38]\nM. Sartori, M. I. Refai, L. A. Gaudio, C. P. Cop, D. Simonetti, F. Damonte, D. G. Lloyd, C. Pizzolato, and G. Durandau\n(2024-12)\nCEINMS-RT: an open-source framework for the continuous neuro-mechanical model-based control of wearable robots\n.\nTechRxiv\n.\nExternal Links:\nLink\n,\nDocument\nCited by:\nTable 1\n,\nApplications in healthcare\n.\n[39]\nA. Saxe, S. Nelli, and C. Summerfield\n(2020-11)\nIf deep learning is the answer, what is the question?\n.\nNature Reviews Neuroscience\n22\n(\n1\n),\npp. 55–67\n.\nExternal Links:\nISSN 1471-0048\n,\nLink\n,\nDocument\nCited by:\nSynergies with Robotics and NeuroAI\n.\n[40]\nP. K. Shiu, G. R. Sterne, N. Spiller, R. Franconville, A. Sandoval, J. Zhou, N. Simha, C. H. Kang, S. Yu, J. S. Kim, S. Dorkenwald, A. Matsliah, P. Schlegel, S. Yu, C. E. McKellar, A. Sterling, M. Costa, K. Eichler, A. S. Bates, N. Eckstein, J. Funke, G. S. X. E. Jefferis, M. Murthy, S. S. Bidaye, S. Hampel, A. M. Seeds, and K. Scott\n(2024-10)\nA Drosophila computational brain model reveals sensorimotor processing\n.\nNature\n634\n(\n8032\n),\npp. 210–219\n.\nExternal Links:\nISSN 1476-4687\n,\nLink\n,\nDocument\nCited by:\nClosing the sensorimotor loop\n,\nOutlook\n.\n[41]\nA. K. Singh, K. S. Sridharan, S. Wu, O. Tirosh, and M. Raghavan\n(2025-06)\nIn-silico neuro-musculoskeletal model demonstrates spasticity progression with descending motor tracts loss in simulated clinical triage\n.\nComputers in Biology and Medicine\n192\n,\npp. 110270\n.\nExternal Links:\nISSN 0010-4825\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nApplications in healthcare\n.\n[42]\nS. H.L. Smith, R. J. Coppack, A. J. van den Bogert, A. N. Bennett, and A. M.J. Bull\n(2021-03)\nReview of musculoskeletal modelling in a clinical setting: current use in rehabilitation design, surgical decision making and healthcare interventions\n.\nClinical Biomechanics\n83\n,\npp. 105292\n.\nExternal Links:\nISSN 0268-0033\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nApplications in healthcare\n.\n[43]\nH. Stark, M. S. Fischer, A. Hunt, F. Young, R. Quinn, and E. Andrada\n(2021-05)\nA three-dimensional musculoskeletal model of the dog\n.\nScientific Reports\n11\n(\n1\n).\nExternal Links:\nISSN 2045-2322\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nInference of experimentally unmeasurable variables\n.\n[44]\nR. Stentiford, T. C. Knowles, B. Feldotto, D. Ergene, F. O. Morin, and M. J. Pearson\n(2022)\nIntegrating spiking neural networks and deep learning algorithms on the Neurorobotics Platform\n.\nIn\nBiomimetic and Biohybrid Systems\n,\npp. 68–79\n.\nExternal Links:\nISBN 9783031204708\n,\nISSN 1611-3349\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nSynergies with Robotics and NeuroAI\n.\n[45]\nA. D. Sylvester, S. G. Lautzenheiser, and P. A. Kramer\n(2021-08)\nA review of musculoskeletal modelling of human locomotion\n.\nInterface Focus\n11\n(\n5\n),\npp. 20200060\n.\nExternal Links:\nISSN 2042-8901\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nApplications in healthcare\n.\n[46]\nR. Taiar, M. Bernardo-Filho, B. Sañudo, and Y. Ivanenko\n(2022-02)\nEditorial: the relationship between neural circuitry and biomechanical action\n.\nFrontiers in Human Neuroscience\n16\n.\nExternal Links:\nISSN 1662-5161\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nApplications in healthcare\n.\n[47]\nR. Thandiackal, K. Melo, L. Paez, J. Herault, T. Kano, K. Akiyama, F. Boyer, D. Ryczko, A. Ishiguro, and A. J. Ijspeert\n(2021-08)\nEmergence of robust self-organized undulatory swimming based on local hydrodynamic force sensing\n.\nScience Robotics\n6\n(\n57\n).\nExternal Links:\nISSN 2470-9476\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nTesting hypothesized neural controllers through simulation\n,\nClosing the sensorimotor loop\n,\nSynergies with Robotics and NeuroAI\n.\n[48]\nE. Todorov, T. Erez, and Y. Tassa\n(2012-10)\nMuJoCo: a physics engine for model-based control\n.\nIn\n2012 IEEE/RSJ International Conference on Intelligent Robots and Systems\n,\npp. 5026–5033\n.\nExternal Links:\nLink\n,\nDocument\nCited by:\nTable 1\n,\nIntroduction\n.\n[49]\nR. Vaxenburg, I. Siwanowicz, J. Merel, A. A. Robie, C. Morrow, G. Novati, Z. Stefanidi, G. Both, G. M. Card, M. B. Reiser, M. M. Botvinick, K. M. Branson, Y. Tassa, and S. C. Turaga\n(2025-04)\nWhole-body physics simulation of fruit fly locomotion\n.\nNature\n643\n(\n8074\n),\npp. 1312–1320\n.\nExternal Links:\nISSN 1476-4687\n,\nLink\n,\nDocument\nCited by:\nGraphical Abstract\n,\nTable 1\n,\nClosing the sensorimotor loop\n,\nSynergies with Robotics and NeuroAI\n,\nSynergies with Robotics and NeuroAI\n,\nVaxenburg\net al.\n(2025)\n[\n49\n]\n.\n[50]\nC. Vittorio, W. Huawei, D. Guillaume, S. Massimo, and K. Vikash\n(2022)\nMyoSuite – a contact-rich simulation suite for musculoskeletal motor control\n.\narXiv\n.\nExternal Links:\nDocument\n,\nLink\nCited by:\nGraphical Abstract\n,\nTable 1\n,\nIntroduction\n.\n[51]\nS. Wang-Chen, V. A. Stimpfling, T. K. C. Lam, P. G. Özdil, L. Genoud, F. Hurtak, and P. Ramdya\n(2024-11)\nNeuroMechFly v2: simulating embodied sensorimotor control in adult Drosophila\n.\nNature Methods\n21\n(\n12\n),\npp. 2353–2362\n.\nExternal Links:\nISSN 1548-7105\n,\nLink\n,\nDocument\nCited by:\nGraphical Abstract\n,\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nInference of experimentally unmeasurable variables\n,\nTesting hypothesized neural controllers through simulation\n,\nClosing the sensorimotor loop\n,\nClosing the sensorimotor loop\n,\nSynergies with Robotics and NeuroAI\n,\nWang-Chen\net al.\n(2024)\n[\n51\n]\n.\n[52]\nA. Zador, S. Escola, B. Richards, B. Ölveczky, Y. Bengio, K. Boahen, M. Botvinick, D. Chklovskii, A. Churchland, C. Clopath, J. DiCarlo, S. Ganguli, J. Hawkins, K. Körding, A. Koulakov, Y. LeCun, T. Lillicrap, A. Marblestone, B. Olshausen, A. Pouget, C. Savin, T. Sejnowski, E. Simoncelli, S. Solla, D. Sussillo, A. S. Tolias, and D. Tsao\n(2023-03)\nCatalyzing next-generation artificial intelligence through NeuroAI\n.\nNature Communications\n14\n(\n1\n).\nExternal Links:\nISSN 2041-1723\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nSynergies with Robotics and NeuroAI\n,\nOutlook\n,\nZador\net al.\n(2023)\n[\n52\n]\n.\n[53]\nL. Zhang, Z. Li, Y. Hu, C. Smith, E. M. G. Farewik, and R. Wang\n(2021-04)\nAnkle joint torque estimation using an EMG-driven neuromusculoskeletal model and an artificial neural network model\n.\nIEEE Transactions on Automation Science and Engineering\n18\n(\n2\n),\npp. 564–573\n.\nExternal Links:\nISSN 1558-3783\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nInference of experimentally unmeasurable variables\n,\nApplications in healthcare\n.\n[54]\nM. Zhao, N. Wang, X. Jiang, X. Ma, H. Ma, G. He, K. Du, L. Ma, and T. Huang\n(2024-12)\nAn integrative data-driven model simulating C. elegans brain, body and environment interactions\n.\nNature Computational Science\n4\n(\n12\n),\npp. 978–990\n.\nExternal Links:\nISSN 2662-8457\n,\nLink\n,\nDocument\nCited by:\nGraphical Abstract\n,\nTable 1\n,\nClosing the sensorimotor loop\n,\nZhao\net al.\n(2024)\n[\n54\n]\n.\n[55]\nP. Zhao, B. Wang, Y. Rong, Y. Yuan, J. Liu, H. Huo, Z. Liu, Z. Li, and T. Fang\n(2025-06)\nThe roles of feedback loops in the Caenorhabditis elegans rhythmic forward locomotion\n.\nPLOS Computational Biology\n21\n(\n6\n),\npp. e1013171\n.\nExternal Links:\nISSN 1553-7358\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nClosing the sensorimotor loop\n,\nZhao\net al.\n(2025)\n[\n55\n]\n.\n[56]\nY. Zhao, M. Zhang, H. Wu, X. He, and M. Todoh\n(2023-03)\nNeuromechanics-based neural feedback controller for planar arm reaching movements\n.\nBioengineering\n10\n(\n4\n),\npp. 436\n.\nExternal Links:\nISSN 2306-5354\n,\nLink\n,\nDocument\nCited by:\nTable 1\n,\nApplications in healthcare\n.",
    "preview_text": "Animal behavior reflects interactions between the nervous system, body, and environment. Therefore, biomechanics and environmental context must be considered to dissect algorithms for behavioral control. This is enabled by leveraging neuromechanical digital twins: computational models that embed artificial neural controllers within realistic body models in simulated environments. Here we review advances in the creation and use of neuromechanical digital twins while also highlighting emerging opportunities for the future. First, we illustrate how neuromechanical models allow researchers to infer hidden biophysical variables that may be difficult to measure experimentally. Additionally, by perturbing these models, one can generate new experimentally testable hypotheses. Next, we explore how neuromechanical twins have been used to foster a deeper exchange between neuroscience, robotics, and machine learning. Finally, we show how neuromechanical twins can advance healthcare. We envision that coupling studies on animals with active probing of their neuromechanical twins will greatly accelerate neuroscientific discovery.\n\nThe embodied brain: Bridging the brain, body, and behavior with neuromechanical digital twins\nSibo Wang-Chen\nCorrespondence:\nsibo.wang@epfl.ch\n,\npavan.ramdya@epfl.ch\nPavan Ramdya\nCorrespondence:\nsibo.wang@epfl.ch\n,\npavan.ramdya@epfl.ch\nGraphical Abstract\nImage attributions:\nhuman model: MyoSuite\n[\n50\n]\n;\nC. elegans\nmodel: BAAIWorm\n[\n54\n]\n;\nrodent model: MIMIC\n[\n1\n]\n;\nzebrafish model: simZFish\n[\n22\n]\n;\nwalking\nDrosophila\nmodel: NeuroMechFly\n[\n23\n,\n51\n]\n;\nflying\nDrosophila\nmodel: FlyBody\n[\n49\n]\n.\nHighlights\n•\nNeuromechanical digital twins comprise a neural controller and a biomechanical hull\n•\nReplaying experimental recordings\nin silico\nenables readout of latent variables\n•\nSimulations help to test neuroscientific hypotheses\n•\nSimulations provide a fully accessible and perturbable surrogate for behavior control\n•\nEmbodied computational models provide a fou",
    "is_relevant": false,
    "relevance_score": 1.0,
    "extracted_keywords": [
        "❌ healthcare"
    ],
    "one_line_summary": "论文包含负面关键词「healthcare」，自动标记为不相关",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-12T22:57:45Z",
    "created_at": "2026-01-21T12:09:14.123599",
    "updated_at": "2026-01-21T12:09:14.123606",
    "recommend": 0
}