{
    "id": "2601.22550v1",
    "title": "Exo-Plore: Exploring Exoskeleton Control Space through Human-aligned Simulation",
    "authors": [
        "Geonho Leem",
        "Jaedong Lee",
        "Jehee Lee",
        "Seungmoon Song",
        "Jungdam Won"
    ],
    "abstract": "外骨骼在增强人体活动能力方面展现出巨大潜力，但由于人体对外部力量的适应机制复杂，如何提供恰当助力仍具挑战。当前最先进的外骨骼控制器优化方法需要大量人体实验，参与者需持续行走数小时，这形成了一个悖论：最需要外骨骼辅助的人群（如行动障碍者）往往难以承受如此高强度的实验流程。我们提出Exo-plore仿真框架，该框架将神经力学模拟与深度强化学习相结合，无需真人实验即可优化髋关节外骨骼辅助策略。Exo-plore能够：（1）生成捕捉人体对辅助力适应过程的真实步态数据；（2）在人体步态随机性背景下仍能产生可靠的优化结果；（3）推广至病理步态，在病理严重程度与最优辅助水平之间建立强线性关联。",
    "url": "https://arxiv.org/abs/2601.22550v1",
    "html_url": "https://arxiv.org/html/2601.22550v1",
    "html_content": "Exo-plore: Exploring Exoskeleton Control space through Human-Aligned Simulation\nGeonho Leem\n1\n,\nJaedong Lee\n2\n,\nJehee Lee\n1\n,\nSeungmoon Song\n3\n,\nJungdam Won\n1†\n1\nSeoul National University,\n2\nHoliday Robotics,\n3\nNortheastern University\nAbstract\nExoskeletons show great promise for enhancing mobility, but providing appropriate assistance remains challenging due to the complexity of human adaptation to external forces. Current state-of-the-art approaches for optimizing exoskeleton controllers require extensive human experiments in which participants must walk for hours, creating a paradox: those who could benefit most from exoskeleton assistance, such as individuals with mobility impairments, are rarely able to participate in such demanding procedures.\nWe present Exo-plore, a simulation framework that combines neuromechanical simulation with deep reinforcement learning to optimize hip exoskeleton assistance without requiring real human experiments. Exo-plore can (1) generate realistic gait data that captures human adaptation to assistive forces, (2) produce reliable optimization results despite the stochastic nature of human gait, and (3) generalize to pathological gaits, showing strong linear relationships between pathology severity and optimal assistance\n1\n1\n1\nCode available at\nhttps://daebangstn.github.io/exo-plore\n.\n.\n†\n†\nfootnotetext:\nCorrespondence:\njungdam@imo.snu.ac.kr\n1\nIntroduction\nHuman mobility is fundamental to meeting basic life needs. While exoskeleton research shows promise for enhancing mobility\n(Molinaro\net al.\n,\n2024\n; Slade\net al.\n,\n2022\n)\n, providing appropriate assistance, especially for users with atypical gait patterns, remains a challenge\n(Kim\net al.\n,\n2024\n; Kang\net al.\n,\n2025\n)\n.\nUsers alter their movement patterns and redistribute muscle coordination in response to assistance\n(Song and Collins,\n2021\n)\n, which can erode the benefits predicted by fixed-gait assumptions\n(Dembia\net al.\n,\n2017\n)\n.\nTo personalize assistance, researchers have employed human-in-the-loop optimization (HILO) techniques, which constrain the exoskeleton controller design to a small set of tunable parameters (e.g., peak torque timing, magnitude, and duration) and systematically explore this parameter space through human experiments\n(Zhang\net al.\n,\n2017\n)\n. While HILO has proven effective for able-bodied young and older adults\n(Slade\net al.\n,\n2022\n; Lakmazaheri\net al.\n,\n2024\n)\n, it requires demanding experiments where participants must walk for hours while wearing an exoskeleton. This situation presents a paradox: those who would benefit most from exoskeleton assistance, such as individuals with mobility impairments, are rarely able to participate in these extensive optimization procedures.\nNeuromechanical simulations\n(Song\net al.\n,\n2021\n)\nthat couple musculoskeletal dynamics with control policies to predict how humans adapt to assistance have been proposed as a promising complement to exhaustive HILO\n(Luo\net al.\n,\n2024\n; Firouzi\net al.\n,\n2025\n; Tan\net al.\n,\n2025\n)\n. Yet policy design remains a bottleneck for reliable prediction. Biologically inspired controllers optimized with task cost functions can generate human-like gait in certain scenarios, but application and validation for assistive devices and pathological gaits remain limited\n(Song and Geyer,\n2017\n; Geijtenbeek,\n2019\n; Bersani\net al.\n,\n2023\n)\n. Deep reinforcement learning (Deep RL) offers an alternative that is less constrained by hand-specified control assumptions and potentially more generalizable, but most implementations that produce human-like motions rely on tracking reference motion-capture data to manage large observation and action spaces\n(Lee\net al.\n,\n2019\n; Song\net al.\n,\n2021\n; Park\net al.\n,\n2025\n)\n. Pure prediction is inherently challenging; practical approaches likely require both fitting controllers to existing data and predicting responses in extended scenarios\nPark\net al.\n(\n2022\n)\n. However, there is no unified framework to (i) fit controllers to observed human adaptations and (ii) predict responses in unobserved assistive conditions, particularly for exoskeleton assistance in gait pathology.\nIn this paper, we present Exo-plore, a neuromechanical-simulation framework that discovers hip exoskeleton control parameters by coupling a Deep RL gait data generator with a stochasticity-aware surrogate optimizer.\nThe gait data generator is tuned to fit human experimental trends by matching assistive moment/power scaling across assistance settings and walking speeds.\nThis is achieved through a reward designed to align with empirical adaptation patterns, which combines metabolic energy minimization with a human–exoskeleton-interaction term based on resistance minimization hypothesis. As a result, the generator adapts across hip-assistance levels and musculoskeletal impairments, producing plausible assisted gaits in both healthy and pathological settings that align with empirical trends. We then train a surrogate network on abundant simulation data from the gait data generator to obtain smooth, differentiable CoT (cost of transport) landscapes to stabilize optimization under RL and simulation stochasticity. Using Exo-plore, we (i) reproduce assisted and unassisted gait trends consistent with human experiments, including assistive moment/power scaling and realistic metabolic reduction rates; (ii) identify speed-dependent optimal exoskeleton control parameters for able-bodied gait (optimal torque delay decreases as speed increases); and (iii) generalize to pathological gaits, revealing strong linear relations between pathology severity and optimal assistance in four of five conditions.\n2\nRelated work\nHuman-in-the-loop optimization (HILO) for exoskeletons.\nExoskeletons have demonstrated the ability to provide various benefits, including improved walking speed and reduced metabolic energy consumption\n(Molinaro\net al.\n,\n2024\n; Slade\net al.\n,\n2022\n; Lakmazaheri\net al.\n,\n2024\n)\n. However, their effectiveness varies significantly depending on control parameter settings and users’ adaptation to assistance\n(Poggensee and Collins,\n2021\n)\n. HILO methods have been widely used to address both challenges by iteratively optimizing controllers based on real human responses and by evaluating candidate parameters using metrics such as metabolic cost of transport (CoT) after an adaptation\n(Zhang\net al.\n,\n2017\n; Slade\net al.\n,\n2024\n; Witte\net al.\n,\n2020\n; Bryan\net al.\n,\n2021\n; Song and Collins,\n2021\n)\n.\nIn addition to CoT optimization, several studies have also optimized parameters based on user preference or perceived comfort\n(Ingraham\net al.\n,\n2022\n; Lee\net al.\n,\n2023\n)\n.\nHowever, because experiments involved human participants, the number of iterations that can be performed to update parameters is often limited to fewer than 30 iterations, even when using auxiliary techniques such as online simulation\n(Gordon\net al.\n,\n2022\n)\n. Furthermore, individuals who might benefit most from exoskeleton assistance (e.g., mobility-impaired individuals) often show limited tolerance to this optimization process\n(Welker\net al.\n,\n2021\n; Lakmazaheri\net al.\n,\n2024\n)\n, making the application of HILO often infeasible for these groups.\nNeuromechanical simulation.\nNeuromechanical simulations provide physics-based digital twins for studying human movement, assistive devices, and neuromuscular impairments by coupling multibody musculoskeletal models with Hill-type muscle actuators and a control policy that drives muscle-driven dynamics\n(Song\net al.\n,\n2021\n)\n. Despite advances in modeling and simulation fidelity, predictive capability hinges on the control model, which remains only partially understood and difficult to specify. Existing approaches either (i) treat control as a black box to reproduce target motions, via trajectory optimization\n(De Groote and Falisse,\n2021\n)\nor Deep RL\n(Song\net al.\n,\n2021\n)\n—or (ii) rely on hand-crafted, biologically inspired controllers tuned for habitual gait\n(Song and Geyer,\n2015\n; Bersani\net al.\n,\n2023\n)\n. These strategies can yield plausible motions but often face limits in generalization and computational efficiency, especially when predicting adaptations to novel exoskeleton assistance or pathological conditions.\nDeep RL-based Musculoskeletal Control.\nDeep RL has shown promising results in neuromechanical simulation, but raises open questions about physiological fidelity and generalization\n(Lee\net al.\n,\n2019\n)\n. Recent studies use Deep RL within neuromechanical simulations to explore potential surgical effects, simulate gait impairments arising from altered muscle function, and synthesize diverse movements\n(Lee\net al.\n,\n2019\n; Park\net al.\n,\n2022\n;\n2023\n;\n2025\n)\n. However, the sim-to-real gap remains largely unvalidated for muscle activations, metabolic energy, and adaptability to external assistance, which are critical for translational impact. While\nLuo\net al.\n(\n2024\n)\napplied Deep RL to exoskeleton control, their formulation depends on imitation policies, limiting adaptation to unseen conditions. As a result, the simulation results do not align with natural human movement, and their correlation with real experimental outcomes has not been validated. In contrast, Exo-plore fits to established experimental trends and predicts responses in unseen conditions, enabling estimation of biomechanical metrics essential for exoskeleton applications.\n3\nMethod: The Exo-plore framework\nFigure\n1\npresents an overview of our Exo-plore framework, which operates on a musculoskeletal character equipped with a hip exoskeleton\n(Lim\net al.\n,\n2019a\n)\n. The exoskeleton controller generates hip assistive torque\nτ\nexo\n​\n(\nt\n)\n\\tau_{\\mathrm{exo}}(t)\nas follows:\nτ\nexo\n​\n(\nt\n)\n\\displaystyle\\tau_{\\mathrm{exo}}(t)\n=\nκ\n⋅\nu\n​\n(\nt\n−\nΔ\n​\nt\n)\n\\displaystyle=\\kappa\\cdot u(t-\\Delta t)\n(1)\nwhere\nu\n​\n(\nt\n)\n=\nsin\n⁡\n(\nθ\nr\n)\n−\nsin\n⁡\n(\nθ\nl\n)\nu(t)=\\sin(\\theta_{r})-\\sin(\\theta_{l})\nis a control signal encoding relative motion of the two legs.\nθ\nr\n,\nθ\nl\n\\theta_{r},\\>\\theta_{l}\ndenote the low-pass filtered right and left hip joint angles, respectively. The sine function bounds the joint angle signal to the range [-1, 1].\nκ\n\\kappa\nand\nΔ\n​\nt\n\\Delta t\nare control parameters, where the gain\nκ\n\\kappa\nscales the torque magnitude while the delay\nΔ\n​\nt\n\\Delta t\nintroduces temporal lag for the output (i.e., delayed-feedback control).\nSince the assistive torque is proportional to the relative motion between the two hip joints,\nκ\n\\kappa\neffectively acts as a stiffness parameter.\nThis formulation therefore resembles a simplified impedance-control mechanism.\nThe objective of Exo-plore is to find the optimal control parameters\n(\nκ\n,\nΔ\n​\nt\n)\n(\\kappa,\\,\\Delta t)\nthat minimize the simulated character’s metabolic cost-of-transport during walking. This is achieved through two components: the gait data generator, which produces gait data that align with real human experiments, and the exoskeleton optimizer, which efficiently explores the control parameter space to identify the optimal parameters.\nFigure 1:\nThe Exo-plore framework.\nThe generator produces gait trajectories under hip exoskeleton assistance using a musculoskeletal character with 164 muscles. Through our sim-to-real matching approach, these trajectories replicate the adaptation patterns and metabolic responses observed in real human experiments. The generated data are then used to train a surrogate network, which enables efficient and customizable optimization of exoskeleton control parameters.\n3.1\nGait Data Generator\nThe human controller in the gait data generator consists of three modules: a pose network (PoseNet), which computes positional-derivative (PD) target joint positions\n𝐪\nd\n\\mathbf{q}_{\\mathrm{d}}\n; a PD controller that generates joint torques\n𝝉\nPD\n\\bm{\\tau}_{\\mathrm{PD}}\nto reduce the error between the target and current joint positions;\nthen compensate the exoskeleton assistance\nτ\nexo\n\\tau_{\\mathrm{exo}}\nfrom\n𝝉\nPD\n\\bm{\\tau}_{\\mathrm{PD}}\nto compute the torque to be generated by the muscles\n𝝉\nMCN\n\\bm{\\tau}_{\\mathrm{MCN}}\n;\nand a muscle coordination network (MCN), which maps the computed target joint torques\n𝝉\nMCN\n\\bm{\\tau}_{\\mathrm{MCN}}\nto muscle activations\n𝐚\n\\mathbf{a}\n. These activations are then applied to the underlying musculoskeletal dynamics, and the states of the musculoskeletal character and the exoskeleton are updated accordingly. The PoseNet and MCN are jointly trained during the iterative simulation process using Deep RL and supervised learning, respectively, while a stable PD is used for our PD control\n(Tan\net al.\n,\n2011\n)\n.\nThe detailed architecture of the human controller is provided in Appendix\nA\n.\nTo train the PoseNet, we follow the formulation of Generative GaitNet\n(Park\net al.\n,\n2022\n)\n, but we extend the state, action, and reward to incorporate the exoskeleton and improve motion naturalness. Here, we describe only the crucial components, including our extensions, while other technical details are provided in Appendix\nB\n. The state is defined as\n𝐬\n=\n(\ns\nskeleton\n,\ns\nmuscle\n,\ns\nexo\n)\n\\mathbf{s}=\\left(s_{\\text{skeleton}},\\,s_{\\text{muscle}},\\,s_{\\text{exo}}\\right)\n, where\ns\nskeleton\ns_{\\text{skeleton}}\nand\ns\nmuscle\ns_{\\text{muscle}}\nrepresent the physical states of the musculoskeletal character, and\ns\nexo\ns_{\\text{exo}}\ndenotes the exoskeleton state. The total reward is defined as\nr\ntotal\n=\nw\ngait\n⋅\nr\ngait\n+\nw\narm\n⋅\nr\narm\n+\nw\nenergy\n⋅\nr\nenergy\n+\nw\nHEI\n⋅\nr\nHEI\n\\displaystyle r_{\\text{total}}=\\;w_{\\text{gait}}\\cdot r_{\\text{gait}}+w_{\\text{arm}}\\cdot r_{\\text{arm}}+w_{\\text{energy}}\\cdot r_{\\text{energy}}+w_{\\text{HEI}}\\cdot r_{\\text{HEI}}\n(2)\nwhere\nr\ngait\nr_{\\text{gait}}\nencourages the character to follow the given target gait, and is defined as the product of four components as\nr\ngait\n=\nr\nstep\n⋅\nr\nvel\n⋅\nr\nhead\n⋅\nr\nsway\nr_{\\text{gait}}=r_{\\text{step}}\\cdot r_{\\text{vel}}\\cdot r_{\\text{head}}\\cdot r_{\\text{sway}}\n,\nwhere\nr\nstep\nr_{\\text{step}}\nencourages the specified step length,\nr\nvel\nr_{\\text{vel}}\nencourages the specified walking speed, and\nr\nhead\nr_{\\text{head}}\nand\nr\nsway\nr_{\\text{sway}}\nstabilize the head and body sway, respectively. To prevent unnatural arm movements, an imitation reward\nr\narm\nr_{\\text{arm}}\nis introduced.\nThe energy reward,\nr\ne\n​\nn\n​\ne\n​\nr\n​\ng\n​\ny\n=\n1\n−\nk\ne\n​\nn\n​\ne\n​\nr\n​\ng\n​\ny\n⋅\nMEE\nr_{energy}=1-k_{energy}\\cdot\\mathrm{MEE}\n, regularizes energy expenditure during walking, where\nMEE\n\\mathrm{MEE}\ndenotes the metabolic energy expenditure, computed as follows:\nd\nd\n​\nt\n​\nMEE\n​\n(\n𝐚\n;\nα\n,\nβ\n)\n=\n∑\ni\nm\ni\nα\n​\na\ni\nβ\n\\frac{d}{dt}\\mathrm{MEE}(\\mathbf{a};\\>\\alpha,\\,\\beta)=\\sum_{i}m_{i}^{\\alpha}a_{i}^{\\beta}\n(3)\nwhere\nm\ni\nm_{i}\nand\na\ni\na_{i}\nare the mass and activation of the\ni\ni\n-th muscle, respectively, and\nα\n\\alpha\n,\nβ\n\\beta\nare tunable design parameters. This allows flexible adjustment between effort-like (\nα\n\\alpha\n-dominant) and fatigue-like (\nβ\n\\beta\n-dominant) behaviors, in line with previous studies\n(Ackermann and Van den Bogert,\n2010\n)\n. These are crucial parameters that must be properly adjusted to ensure that the simulation results align with those from real human experiments. The detailed design of\nα\n\\alpha\nand\nβ\n\\beta\nis presented in Section\n3.2\n.\nTo account for human adaptation during exoskeletal assistance, we introduce a novel reward\nr\nHEI\nr_{\\text{HEI}}\nthat explicitly models physical human-exoskeleton interaction (HEI). In our framework,\nr\nHEI\nr_{\\text{HEI}}\nplays a critical role in bridging the sim-to-real gap under exoskeleton assistance. This reward is also further discussed in Section\n3.2\n.\nThe MCN is trained in a supervised manner to learn the mapping from desired joint torque\n𝝉\nd\n\\bm{\\tau}_{\\mathrm{d}}\nto muscle activations\n𝐚\n\\mathbf{a}\n.\nThe total loss is computed as\nℒ\nMCN\n=\n‖\n𝝉\nMCN\n−\n𝝉\n​\n(\n𝐚\n)\n‖\n2\n+\nw\nreg\n​\n‖\n𝐚\n‖\n2\n+\nw\nIMR\n​\nℒ\nIMR\n.\n\\mathcal{L}_{\\text{MCN}}=\\bigl\\|\\bm{\\tau}_{\\mathrm{MCN}}-\\bm{\\tau}(\\mathbf{a})\\bigr\\|^{2}\\;+\\;w_{\\text{reg}}\\,\\bigl\\|\\mathbf{a}\\bigr\\|^{2}\\;+\\;w_{\\text{IMR}}\\,\\mathcal{L}_{\\text{IMR}}.\n(4)\nThe first term guides the generated torque\n𝝉\n​\n(\n𝐚\n)\n\\bm{\\tau}(\\mathbf{a})\nfrom the output muscle activations\n𝐚\n\\mathbf{a}\nto match the desired torque\n𝝉\nMCN\n\\bm{\\tau}_{\\mathrm{MCN}}\n, while the second term penalizes excessively large activations. Please refer to\n(Lee\net al.\n,\n2019\n)\nfor more technical details. Large muscles such as the gluteus medius and soleus are represented by multiple line muscles. Controlling each line muscle independently could lead to physiologically implausible results. To prevent this, we introduce the final term, the intra-muscular regularizer (IMR), which enforces coherent activations among the line muscles belonging to the same anatomical muscle group. Specifically, the IMR penalizes deviations from the mean group activation, which is computed as follows:\nℒ\nIMR\n=\n∑\ng\n=\n1\nN\ng\n∑\nj\n∈\n𝒢\ng\n𝟏\n​\n(\n|\na\nj\n−\na\n¯\ng\n|\n>\n0.1\n)\n​\n(\na\nj\n−\na\n¯\ng\n)\n2\n,\na\n¯\ng\n=\n1\n|\n𝒢\ng\n|\n​\n∑\nj\n∈\n𝒢\ng\na\nj\n.\n\\mathcal{L}_{\\text{IMR}}=\\sum_{g=1}^{N_{g}}\\;\\sum_{j\\in\\mathcal{G}_{g}}\\mathbf{1}\\!\\bigl(\\lvert a_{j}-\\bar{a}_{g}\\rvert>0.1\\bigr)\\,\\bigl(a_{j}-\\bar{a}_{g}\\bigr)^{2},\\qquad\\bar{a}_{g}\\;=\\;\\frac{1}{\\lvert\\mathcal{G}_{g}\\rvert}\\sum_{j\\in\\mathcal{G}_{g}}a_{j}.\n(5)\nwhere\na\nj\na_{j}\ndenotes the activation of the\nj\nj\n-th muscle in muscle group\ng\ng\n, and\na\n¯\ng\n\\bar{a}_{g}\nis its corresponding mean group activation. The number of muscle groups and the set of indices of the line muscles in muscle group\ng\ng\nare denoted by\nN\ng\nN_{g}\nand\n𝒢\ng\n\\mathcal{G}_{g}\n, respectively. For details on\nℒ\nIMR\n\\mathcal{L}_{\\text{IMR}}\n, see Appendix\nC\n.\n3.2\nSim-to-real Matching in Gait Data Generator\nThe simulation results generated by the Gait data generator need to align with real human experimental results to ensure that the control parameters optimized in simulation are applicable to real-world scenarios, a process often referred to as bridging the sim-to-real gap. To this end, we focus on reproducing two core human behaviors observed in several biomechanics studies: the principle of energy minimization and the active adaptation to exoskeleton assistance.\nFirst, many studies have observed that human walking tends toward an energetically optimal gait\n(Umberger and Martin,\n2007\n; Zarrugh\net al.\n,\n1974\n)\n. This means that humans adjust their step size and step frequency at each walking speed to minimize the metabolic cost-of-transport (CoT), which is the metabolic energy expenditure per unit travel distance. As reported in previous studies\n(Maxwell Donelan\net al.\n,\n2001\n)\n, measured CoT values across different walking speeds form an upward-opening parabola, and humans tend to select the minimum point as their preferred walking speed (PWS) under nominal conditions. Based on this, we determine the\nMEE\n\\mathrm{MEE}\nparameters\n(\nα\n,\nβ\n)\n(\\alpha,\\,\\beta)\nin Equation\n3\nso that the resulting\nWalking speed - CoT\ncurve and the corresponding PWS best match those reported in real experiments. For this, we develop two algorithms (Algorithm\n1\nand\n2\n).\nThe first algorithm assumes feasible values of\n(\nα\n,\nβ\n)\n(\\alpha,\\,\\beta)\n(Line 2), trains a gait data generator to compute the PWS (Line 4), and selects the optimal values of\n(\nα\n,\nβ\n)\n(\\alpha,\\,\\beta)\nthat best match real human PWS (Line 5-8). The second algorithm performs rollouts of gait trajectories across feasible parameters (Line 2-3), calculates the CoT for each, and determines the PWS that yields the minimum CoT (Line 4-7).\nWe define two procedures used in algorithm\n1\n,\n2\nand\n3\n.\ntrainGenerator.\nThis procedure trains a human controller conditioned on a given metabolic energy model\nE\nm\nE_{m}\n:\nG\n=\ntrainGenerator\n​\n(\nE\nm\n)\n.\nG=\\texttt{trainGenerator}(E_{m}).\n(6)\nDuring this training process, the simulated musculoskeletal character does not wear an exoskeleton, as we evaluate PWS in the absence of external assistance. Consequently, PoseNet does not use the exoskeleton-related input\nr\nHEI\nr_{\\text{HEI}}\n.\nrollout.\nThis procedure generates a gait trajectory from the trained gait data generator\nG\nG\nfor given gait parameters\n(\nL\n,\nf\n)\n(L,f)\n:\nτ\ncyc\n=\nrollout\n​\n(\nG\n​\n(\nL\n,\nf\n)\n)\n.\n\\tau_{\\mathrm{cyc}}=\\texttt{rollout}(G(L,f)).\n(7)\nTo ensure stable trajectory generation, we discard the first five gait cycles after the simulation starts and use the subsequent ten cycles to construct the trajectory.\nBased on those algorithms, the optimal parameters for our framework were determined as\n(\nα\n,\nβ\n)\n=\n(\n1.5\n,\n1.0\n)\n(\\alpha,\\,\\beta)=(1.5,\\>1.0)\n.\nA detailed technical discussion is provided in the Appendix\nD\nAlgorithm 1\nAdjusting the\nMEE\n\\mathrm{MEE}\nto make Exo-plore to predict human PWS.\nNotation:\nmuscle i mass, activation\nm\ni\n,\na\ni\nm_{i},a_{i}\n1:\nHuman PWS\nv\nreal\nv_{\\mathrm{real}}\n2:\nMEE\n\\mathrm{MEE}\nparameter\n(\nα\n∗\n,\nβ\n∗\n)\n(\\alpha^{*},\\,\\beta^{*})\n3:\ne\nmin\n←\n+\n∞\ne_{\\mathrm{min}}\\leftarrow+\\infty\n,\n(\nα\n∗\n,\nβ\n∗\n)\n←\n∅\n(\\alpha^{*},\\,\\beta^{*})\\leftarrow\\varnothing\n4:\nfor\n(\nα\n,\nβ\n)\n∈\n(\\alpha,\\>\\beta)\\in\ncandidate\ndo\n5:\nE\nm\n←\nMEE\n​\n(\nα\n,\nβ\n)\n\\mathrm{E}_{m}\\leftarrow\\mathrm{MEE}(\\alpha,\\,\\beta)\n6:\nG\ni\n←\ntrainGenerator\n​\n(\nE\nm\n)\nG_{i}\\leftarrow\\texttt{trainGenerator}(\\mathrm{E}_{m})\n7:\nv\nsim\n←\nevalPWS\n​\n(\nG\ni\n,\nE\nm\n)\nv_{\\mathrm{sim}}\\leftarrow\\texttt{evalPWS}(G_{i},\\,\\mathrm{E}_{m})\n8:\ne\n←\n|\nv\nreal\n−\nv\nsim\n|\ne\\leftarrow|v_{\\mathrm{real}}-v_{\\mathrm{sim}}|\n9:\nif\ne\n<\ne\nmin\ne<e_{\\mathrm{min}}\nthen\n10:\ne\nmin\n←\ne\ne_{\\mathrm{min}}\\leftarrow e\n,\n(\nα\n∗\n,\nβ\n∗\n)\n←\n(\nα\n,\nβ\n)\n(\\alpha^{*},\\,\\beta^{*})\\leftarrow(\\alpha,\\,\\beta)\n11:\nend\nif\n12:\nend\nfor\nAlgorithm 2\n(evalPWS) evaluating PWS for gait data generator\nNotation:\ngait step length\nL\nL\n, gait step frequency\nf\nf\n, gait cycle trajectory\nτ\ncyc\n\\tau_{\\mathrm{cyc}}\n1:\nData generator\nG\nG\n, metabolic energy expenditure\nE\nm\n\\mathrm{E}_{m}\n2:\nv\nsim\nv_{\\mathrm{sim}}\n(PWS of\nG\nG\n)\n3:\nCoT\n←\n+\n∞\n\\mathrm{CoT}\\leftarrow+\\infty\n,\nv\nsim\n←\n∅\nv_{\\mathrm{sim}}\\leftarrow\\varnothing\n4:\nfor\n(\nL\n,\nf\n)\n∈\n(L,\\,f)\\in\navailable\ndo\n5:\nτ\ncyc\n←\nrollout\n​\n(\nG\n​\n(\nL\n,\nf\n)\n)\n\\tau_{\\mathrm{cyc}}\\leftarrow\\texttt{rollout}(G(L,\\,f))\n6:\nCoT\n=\n1\nL\n​\n∫\nτ\ncyc\n𝑑\nE\nm\n\\mathrm{CoT}=\\frac{1}{L}\\int_{\\tau_{\\mathrm{cyc}}}d\\mathrm{E}_{m}\n7:\nif\nCoT\n<\nCoT\nmin\n\\mathrm{CoT}<\\mathrm{CoT}_{\\mathrm{min}}\nthen\n8:\nCoT\nmin\n←\nCoT\n\\mathrm{CoT}_{\\mathrm{min}}\\leftarrow\\mathrm{CoT}\n,\nv\nsim\n←\n(\nL\n×\nf\n)\nv_{\\mathrm{sim}}\\leftarrow(L\\times f)\n9:\nend\nif\n10:\nend\nfor\nSecond, experimental studies suggest that humans do not simply adapt to the assistance torque\n(Normand\net al.\n,\n2023\n; Livolsi\net al.\n,\n2025\n)\n. For example, at the same walking speed, increasing the delay parameter (\nΔ\n​\nt\n\\Delta t\n) from 0.15\ns\n\\,\\mathrm{s}\nto 0.25\ns\n\\,\\mathrm{s}\nresults in a 1.5-fold increase in RMS assistive torque (Figure\n6\n). The RMS assistive torque is proportional to the hip joint angle (Equation\n1\n). This indicates that humans actively modify their kinematics, such as increasing step size, to further utilize the assistance.\nTo reproduce this adaptive behavior, we develop the human–exoskeleton interaction (HEI) reward based on a\nresistance-minimization\nhypothesis, which reflects the human tendency to avoid mechanical power loss. This is inspired by the behavioral principle of loss aversion, which states that people are more sensitive to losses than to equivalent profits\n(Kahneman,\n1979\n; Tversky and Kahneman,\n1991\n; Brown\net al.\n,\n2024\n)\n. Our HEI reward is formulated as follows:\nr\nHEI\n=\n1\n+\n1\nκ\n​\n∑\nk\n∈\n{\nL\n,\nR\n}\nmin\n⁡\n(\n0\n,\nP\nk\n)\nr_{\\text{HEI}}=1+\\frac{1}{\\kappa}\\sum_{k\\in\\{L,R\\}}\\min(0,P_{k})\n(8)\nwhere\nP\nk\nP_{k}\ndenotes the mechanical power applied by the exoskeleton on either the left or right side,\nand\nκ\n\\kappa\nis the gain parameter of the exoskeleton controller. Equation\n8\ntakes effect when the exoskeleton applies resistive power to the human (\nP\nk\n<\n0\nP_{k}<0\n), causing\nr\nHEI\nr_{\\text{HEI}}\nto drop below 1.\n3.3\nExoskeleton Optimizer\nThe goal of the exoskeleton optimizer is to identify exoskeleton control parameters that minimize CoT, meaning the parameters that provide the most effective assistance to humans wearing the exoskeleton. Because the mapping between the control parameters and their resulting CoT is often highly non-linear, previous methods (HILO) typically relies on gradient-free and sampling-based optimization methods such as CMA-ES or Bayesian optimization (BO)\n(Slade\net al.\n,\n2024\n; Gordon\net al.\n,\n2022\n)\n. These methods are particularly effective in HILO settings, where data collection is limited and expensive. For instance, BO often employs a Gaussian process (GP) as a surrogate model to approximate the CoT and guide the search more efficiently. However, in our simulation-based framework, where data can be generated as needed with low cost, the assumptions underlying such sample-efficient methods no longer apply. While GP offer excellent performance in low-data regimes, their poor scalability in both time and memory complexity makes them unsuitable for our framework (see Appendix\nE\n). To take advantage of the data-rich simulation environment, we instead use a neural network surrogate based on a multilayer perceptron (MLP). Neural networks scale efficiently with data and support fast, gradient-based optimization, making them a better fit for Exo-plore.\nAlgorithm 3\nOptimizing exoskeleton control parameters\n1:\nSimulation parameter space\n𝒳\n\\mathcal{X}\n, Data generator\nG\nG\n, Target gait parameter\ng\ng\n2:\nOptimal control parameter\n𝐜\n∗\n\\mathbf{c}^{*}\n3:\nℬ\n←\n∅\n\\mathcal{B}\\leftarrow\\varnothing\n4:\nfor\nx\ni\n∈\nx_{i}\\in\nLHS(\n𝒳\n\\mathcal{X}\n)\ndo\n5:\nτ\ncyc\n←\nrollout\n​\n(\nG\n​\n(\nL\n,\nf\n)\n)\n\\tau_{\\mathrm{cyc}}\\leftarrow\\texttt{rollout}(G(L,\\,f))\n6:\ny\n←\n1\nL\n​\n∫\nτ\ncyc\n𝑑\nE\nm\ny\\leftarrow\\frac{1}{L}\\int_{\\tau_{\\mathrm{cyc}}}d\\mathrm{E}_{m}\n7:\nℬ\n←\nℬ\n∪\n{\n(\nx\ni\n,\ny\n)\n}\n\\mathcal{B}\\leftarrow\\mathcal{B}\\cup\\{(x_{i},\\,y)\\}\n8:\nend\nfor\n9:\nf\n^\nθ\n​\n(\n𝐜\n)\n←\nfit\n​\n(\nℬ\n)\n\\hat{f}_{\\theta}(\\mathbf{c})\\leftarrow\\mathrm{fit}(\\mathcal{B})\n10:\n𝐜\n∗\n←\narg\n​\nmin\n𝐜\n⁡\nf\n^\nθ\n​\n(\n𝐜\n;\ng\n)\n\\mathbf{c}^{*}\\leftarrow\\operatorname*{arg\\,min}_{\\mathbf{c}}\\hat{f}_{\\theta}(\\mathbf{c};\\>g)\n11:\n⊳\n\\triangleright\ngradient-based optimization\nSurrogate networks trained on a naive uniform grid-sampled parameter set may exhibit artifacts due to the regularity of the sampling patterns. In particular, grid-based sampling may lead to aliasing effects and lacks the stochastic variation. To mitigate these issues, we instead use Latin hypercube sampling (LHS)\n(Forrester\net al.\n,\n2008\n)\n, which stratifies each parameter range and draws one sample per interval. This stratification reduces aliasing and ensures uniform coverage without the clustering of random sampling. Please refer to Appendix\nF\nfor ablation studies.\nAlgorithm\n3\noutlines the overall process of optimizing the control parameters: For the simulation parameter space\n𝒳\n\\mathcal{X}\nused in training the gait data generator, we perform three steps: sampling candidate parameters and their evaluation through simulation (Line 2-5), training a surrogate network (Line 6), and performing gradient-based optimization to minimize CoT given a target gait (Line 7).\nTo train the surrogate network, we minimize the following loss:\nℒ\nsurrogate\n=\nℒ\nδ\nh\n​\n(\ny\n^\n,\ny\n)\n+\nλ\ngrad\n​\n‖\n∇\nx\ny\n^\n‖\n2\n2\n+\nλ\nL1\n​\n∑\ni\n|\nw\ni\n|\n+\nλ\nL2\n​\n∑\ni\nw\ni\n2\n.\n\\mathcal{L}_{\\text{surrogate}}=\\mathcal{L}_{\\delta_{h}}(\\hat{y},y)+\\lambda_{\\text{grad}}\\left\\|\\nabla_{x}\\hat{y}\\right\\|_{2}^{2}+\\lambda_{\\text{L1}}\\sum_{i}|w_{i}|+\\lambda_{\\text{L2}}\\sum_{i}w_{i}^{2}.\n(9)\nwhere\ny\n^\n\\hat{y}\nis the predicted CoT value from the surrogate network,\ny\ny\nis the ground truth value obtained from simulation.\nWe used Huber loss (\nℒ\nδ\nh\n\\mathcal{L}_{\\delta_{h}}\n)\n(Hastie\net al.\n,\n2009\n)\nto reduce the effect of outliers that may arise from the instability and stochasticity of the simulation.\nThe gradient penalty\n(\n∇\nx\ny\n^\n)\n(\\nabla_{x}\\hat{y})\nencourages smoothness of the surrogate landscape by constraining the norm of the output gradient with respect to its input (Appendix\nG\n). In addition, the L1 and L2 weight penalties act as standard regularizers. This formulation enables the trained surrogate network to generalize well in predicting CoT values for unseen control parameters while ensuring stable gradient behavior.\nFor gradient-based optimization, we use sequential least-squares quadratic programming (SLSQP) and trust-region algorithms. Please refer to Appendix\nH\nfor the optimization objective.\n4\nResults\n4.1\nSimulation Setup\nSimulation model.\nWe use the musculoskeletal model from prior work\n(Lee\net al.\n,\n2019\n; Park\net al.\n,\n2022\n)\n, which consists of 23 bones and 164 muscles. The bones are simulated as rigid bodies, and the muscles are modeled as Hill-type muscle actuators\n(Hill,\n1938\n)\n. The simulation is performed in the DART physics engine\n(Lee\net al.\n,\n2018\n)\n. In this model, tendons are represented as rigid rather than compliant to reduce the computational burden induced by Deep RL. To further reduce computational cost, we apply muscle actuation to the lower body only, while torque-based actuation is used for the upper body. For more technical details about simulated model, see Appendix\nI\n.\nGeneralization to pathological gait.\nWe model five pathological gait conditions (calcaneal gait, foot drop, equinus gait, crouch gait, and waddling gait) by implementing specific alterations to muscle strength and contracture parameters. We trained separate Exo-plore models for each condition, rather than employing a unified mixture-of-experts approach\n(Park\net al.\n,\n2022\n)\n. To enhance generalization, we randomized simulation parameters during human controller training. Technical details are provided in Appendix\nJ\n.\n4.2\nGait Generation – Unassisted\nWe first validate whether our gait data generator can produce results that align with real human experiments under the\nunassisted\nsetup (i.e.,\nκ\n=\n0\n\\kappa=0\n). This serves as a useful sanity check, since several human experiments without assistance have been previously reported.\nFigure 2:\nComparison of joint kinematics over a gait cycle, with simulated results shown in red and human experimental data in gray.\nFigure\n2\nshows a comparison of joint kinematics between our simulated results and human experiments\n(Boo\net al.\n,\n2025\n)\n, where the joint angles of the ankle, knee, and hip are reported. To obtain the simulated results, we trained the gait data generator with multiple random seeds and averaged the resulting joint angles over one gait cycle. Overall, joint kinematics qualitatively match with human data, except for hip internal rotation. We suspect that this discrepancy occurred due to overfitting of the Deep RL policy to the specific training environment, and thus it could be improved by modifying training conditions, such as changing the terrain of the environment. The kinematics of the pathological gaits are shown in Appendix\nK\n.\nFigure 3:\nComparison of simulated and experimental muscle activations.\nFigure\n3\ncompares simulated and experimental muscle activations\n(Boo\net al.\n,\n2025\n)\nover one gait cycle. The results show that similar activation patterns to those observed in humans can be generated, even though we did not explicitly incorporate human muscle activation patterns into the training process. Note that activation timing and patterns are more informative than absolute values because muscle activations in human data (i.e., EMG signals) are normalized to each muscle’s maximum voluntary contraction, which can vary widely with setup. For more discussion, please refer to Appendix\nL\n.\nIn addition, we performed a detailed analysis of the ground reaction forces (GRF). Additional information can be found in the Appendix\nM\n.\nFigure 4:\nWalking speed vs (CoT, Step length, Step frequency)\nAdditionally, we demonstrate the importance of choosing appropriate metabolic energy expenditure (\nMEE\n\\mathrm{MEE}\n, Equation\n3\n) parameters in Figure\n4\n.\nThe leftmost figure shows the\nWalking speed – CoT\ncurves obtained with different parameter choices. The curve with the optimal parameters chosen by Algorithm\n1\nbest matches the human experiment results\n(Browning\net al.\n,\n2006\n)\nin terms of overall trend and PWS.\nThe middle and rightmost figures show the predicted gait parameters (step length and step frequency) as walking speed increases. The prediction results from our gait data generator match reasonably well with human experiments\n(Schwartz\net al.\n,\n2008\n)\n, except for the increased step frequency at low walking speeds (\n<\n<\n4\nkm\n/\nh\n\\,\\mathrm{km/h}\n). This discrepancy might be because the Deep RL policy often had difficulty producing gaits with short step lengths due to the simplified foot model (box-shaped and rigid), which often caused unwanted collisions.\n4.3\nGait Generation – Assisted\nFigure 5:\nComparison of gait kinematics and dynamics under exoskeleton assistance between human experimental results (top) and simulated results (bottom).\nFigure\n5\ncompares our simulation results with human experiments\n(Lim\net al.\n,\n2019b\n)\nunder exoskeleton assistance with the control parameters\n(\nκ\n,\nΔ\n​\nt\n)\n=\n(\n8\n​\nNm\n,\n0.25\n​\ns\n)\n(\\kappa,\\Delta t)=(8\\,\\mathrm{Nm},0.25\\,\\mathrm{s})\n. Two kinematic results (hip flexion angle and its velocity) and two dynamic results (assistive moment and power) are reported, and the overall trends match reasonably across different walking speeds, demonstrating the effectiveness of our framework. Although overall trends are consistent across all four results, gaps in absolute values may result from discrepancies in musculoskeletal conditions between the simulated character and human participants, as well as from potential overfitting of the Deep RL policy to the fixed environment.\nWe incorporated the human-exoskeleton interaction (HEI) reward to better model human adaptation to exoskeleton assistance. To validate its effectiveness, we conducted an ablation study and a comparison with an alternative design choice like\nr\nassist\nr_{\\text{assist}}\nor no\nr\nHEI\nr_{\\text{HEI}}\n(Appendix\nN\n). Figure\n6\nreports RMS assistive moment, mean assistive power, and mean resistive power across different walking speeds. In the human experiment\n(Lim\net al.\n,\n2019b\n)\n, the results resemble an increasing line, a downward-opening parabola, and an upward-opening parabola, respectively.\nr\nHEI\nr_{\\text{HEI}}\nis our original formulation based on resistance minimization,\nno\n​\nr\nHEI\n\\text{no}~r_{\\text{HEI}}\nmeans no HEI reward is incorporated, and\nr\nassist\nr_{\\text{assist}}\nmeans that assistance maximization is used. The results with our HEI reward show similar trends to the human experiments and also yield the highest Pearson correlation with them.\nFor example, at 4\nkm\n/\nh\n\\,\\mathrm{km/h}\n, human experiments show a 1.88-fold increase in assistive power when the delay increases from 0.05\ns\n\\,\\mathrm{s}\nto 0.25\ns\n\\,\\mathrm{s}\n. With\nr\nHEI\nr_{\\text{HEI}}\n, the result showed a similar 1.73-fold increase (correlation = 0.83), whereas\nno\n​\nr\nHEI\n\\text{no}~r_{\\text{HEI}}\nand\nr\nassist\nr_{\\text{assist}}\nshowed weaker or inconsistent scaling (0.67- and 1.04-fold; correlation = 0.69 and 0.23, respectively).\nFigure\n7\nshows the maximum metabolic reduction rate achieved through exoskeleton assistance. Our HEI reward achieved the closest alignment with human experimental results\n(Lim\net al.\n,\n2019b\n)\n, whereas the others produced lower metabolic reduction rate values, indicating that the simulated characters did not realize the same level of benefit observed in human participants.\nEvaluated metabolic reduction rate in the simulation is slightly higher than in human experimental data. Note that simulation metabolic reduction rate is computed relative to the unassisted condition (\nκ\n=\n0\n\\kappa=0\n), whereas human experiments measure it relative to walking without an exoskeleton, partly explaining the discrepancy. Additional details are provided in Appendix\nO\n.\nFigure 6:\nComparison of assistive moment, assistive power, and resistive power across walking speeds, showing that our HEI reward (\nr\nHEI\nr_{\\text{HEI}}\n) reproduces the trends observed in human experiments and achieves the highest correlation with empirical data.\nFigure 7:\nComparison of maximum metabolic reduction rate.\n4.4\nOptimizing Exoskeleton Control Parameters\nWe demonstrate the applicability of Exo-plore by discovering and analyzing optimal exoskeleton control parameters for both able-bodied and disabled individuals.\nAble-bodied Individuals.\nTo optimize exoskeleton control parameters, we train a surrogate network to learn the mapping between CoT (i.e., metabolic energy consumption per unit travel distance) and the control parameters (\nκ\n\\kappa\n: gain,\nΔ\n​\nt\n\\Delta t\n: time delay). Figure\n8\n(a-c) show the raw training data obtained from simulation and the learned mappings with two gradient penalty settings (\nλ\ngp\n=\n0.1\n\\lambda_{\\mathrm{gp}}=0.1\nand\nλ\ngp\n=\n0.01\n\\lambda_{\\mathrm{gp}}=0.01\n), respectively.\nWhile the raw data contain many local minima from simulation stochasticity and Deep RL training, the surrogate network provides a smoother landscape that enables faster and more stable optimization while still capturing essential trends. A trade-off exists between small and large gradient penalties: smaller penalties allow more aggressive optimization but risk overfitting to artifacts, whereas larger penalties reduce this risk but may limit sensitivity.\nFigure\n8\n(d) shows the optimal control parameters obtained from the two surrogate networks. The optimized delay (\nΔ\n​\nt\n\\Delta t\n) decreases monotonically as speed increases.\nFigure 8:\nCoT landscape from raw simulation data (a), surrogate network trained with\nλ\ngp\n=\n0.1\n\\lambda_{\\text{gp}}=0.1\n(b), surrogate network trained with\nλ\ngp\n=\n0.01\n\\lambda_{\\text{gp}}=0.01\n(c), and optimized exoskeleton control parameters (\nκ\n\\kappa\n, left axis;\nΔ\n​\nt\n\\Delta t\n, right axis) across walking speeds (d).\nDisabled Individuals.\nWe evaluate our framework on musculoskeletal impairment profiles representative of pathological gait. Pathology severity is quantified as the degree of deviation in muscle parameters from healthy reference values. We examine five common pathological gait types: equinus, waddling, crouch, calcaneus, and foot drop. Figure\n9\npresents the optimal gains\n(\nκ\n)\n(\\kappa)\nidentified by Exo-plore, averaged across walking speeds from 2 to 3.5\nkm\n/\nh\n\\,\\mathrm{km/h}\n, with values reported for different levels of pathology severity in each gait type. The optimal gains exhibit strong linear correlations with severity across all conditions except foot drop.\nThese correlations can be explained by the characteristics of each pathology. In equinus and waddling gaits, characterized by toe-walking and lateral trunk sway, respectively, the pathological patterns create greater instability compared to normal gait. External forces, such as exoskeleton assistance, may amplify this instability, necessitating minimal and carefully controlled intervention. In contrast, crouch and calcaneal gaits, characterized by excessive knee flexion and reduced ankle plantarflexion, respectively, present stable but metabolically demanding kinematic patterns where exoskeleton assistance effectively reduces energy expenditure without compromising stability. Foot drop exhibited irregular trends causing frequent toe-ground collisions, which substantially increased gait variability and prevented stable optimization convergence.\nFurther detailed analysis is provided in Appendix\nP\n.\nFigure 9:\nOptimal exoskeleton gain over five pathological gait types, with values reported for different levels of pathology severity in each gait type. Each color corresponds to different random seed. Detailed numerical results are provided in Appendix\nP.4\n.\n5\nConclusion and Limitations\nConclusion.\nThis study developed Exo-plore, a simulation-based framework that optimizes exoskeleton controllers through neuromechanical simulation and Deep RL. Through sim-to-real matching, we demonstrated that Exo-plore can serve as an alternative to experimental trials for controller optimization. Furthermore, by extending the framework to pathological gaits, Exo-plore enables the design of exoskeleton controller for mobility-impaired individuals who are not suitable for traditional human-in-the-loop optimization methods.\nLimitations.\nDespite these promising results, key limitations remain. Most importantly, experimental validation with human subjects, including patient populations, is required to establish the validity of simulation-based predictions and the clinical effectiveness of the optimized controllers. Within our framework, several components warrant evidence of real-world impact, including simplified reward models and the current lack of personalization to subject-specific motor control, and the use of approximate muscle dynamics (see Appendix\nR\nfor details) that may fail to capture subject-specific neuromuscular responses to assistance.\nReproducibility Statement\nCode available at\nhttps://daebangstn.github.io/exo-plore\n. The experimental data used in this work are properly cited in their respective figures.\nReferences\nB. Abbott and X. Aubert (1952)\nThe force exerted by active striated muscle during and after change of length\n.\nThe Journal of physiology\n117\n(\n1\n),\npp. 77\n.\nCited by:\nAppendix R\n.\nF. Abdolhosseini, H. Y. Ling, Z. Xie, X. B. Peng, and M. Van de Panne (2019)\nOn learning symmetric locomotion\n.\nIn\nProceedings of the 12th ACM SIGGRAPH Conference on Motion, Interaction and Games\n,\npp. 1–10\n.\nCited by:\n1st item\n.\nM. Ackermann and A. J. Van den Bogert (2010)\nOptimality principles for model-based prediction of human gait\n.\nJournal of biomechanics\n43\n(\n6\n),\npp. 1055–1060\n.\nCited by:\n§3.1\n.\nC. L. Banks, M. M. Pai, T. E. McGuirk, B. J. Fregly, and C. Patten (2017)\nMethodological choices in muscle synergy analysis impact differentiation of physiological characteristics following stroke\n.\nFrontiers in computational neuroscience\n11\n,\npp. 78\n.\nCited by:\nAppendix L\n.\nA. Bersani, G. Davico, and M. Viceconti (2023)\nModeling human suboptimal control: a review\n.\nJournal of Applied Biomechanics\n39\n(\n5\n),\npp. 294–303\n.\nCited by:\n§1\n,\n§2\n.\nJ. Boo, D. Seo, M. Kim, and S. Koo (2025)\nComprehensive human locomotion and electromyography dataset: gait120\n.\nScientific Data\n12\n(\n1\n),\npp. 1023\n.\nCited by:\nTable Q.7\n,\n§4.2\n,\n§4.2\n.\nA. L. Brown, T. Imai, F. M. Vieider, and C. F. Camerer (2024)\nMeta-analysis of empirical estimates of loss aversion\n.\nJournal of Economic Literature\n62\n(\n2\n),\npp. 485–516\n.\nCited by:\n§3.2\n.\nR. C. Browning, E. A. Baker, J. A. Herron, and R. Kram (2006)\nEffects of obesity and sex on the energetic cost and preferred speed of walking\n.\nJournal of Applied Physiology\n100\n(\n2\n),\npp. 390–398\n.\nExternal Links:\nDocument\nCited by:\n§4.2\n.\nG. M. Bryan, P. W. Franks, S. Song, A. S. Voloshina, R. Reyes, M. P. O’Donovan, K. N. Gregorczyk, and S. H. Collins (2021)\nOptimized hip–knee–ankle exoskeleton assistance at a range of walking speeds\n.\nJournal of neuroengineering and rehabilitation\n18\n(\n1\n),\npp. 152\n.\nCited by:\n§2\n.\nJ. W. Chow and W. G. Darling (1999)\nThe maximum shortening velocity of muscle should be scaled with activation\n.\nJournal of Applied Physiology\n86\n(\n3\n),\npp. 1025–1031\n.\nCited by:\nAppendix R\n.\nF. De Groote and A. Falisse (2021)\nPerspective on musculoskeletal modelling and predictive simulations of human movement to assess the neuromechanics of gait\n.\nProceedings of the Royal Society B\n288\n(\n1946\n),\npp. 20202432\n.\nCited by:\n§2\n.\nC. L. Dembia, A. Silder, T. K. Uchida, J. L. Hicks, and S. L. Delp (2017)\nSimulating ideal assistive devices to reduce the metabolic cost of walking with heavy loads\n.\nPloS one\n12\n(\n7\n),\npp. e0180320\n.\nCited by:\n§1\n.\nV. Firouzi, A. Seyfarth, S. Song, O. von Stryk, and M. Ahmad Sharbafi (2025)\nBiomechanical models in the lower-limb exoskeletons development: a review\n.\nJournal of NeuroEngineering and Rehabilitation\n22\n(\n1\n),\npp. 12\n.\nCited by:\n§1\n.\nA. Forrester, A. Sobester, and A. Keane (2008)\nEngineering design via surrogate modelling: a practical guide\n.\nJohn Wiley & Sons\n.\nCited by:\n§3.3\n.\nJ. R. Gardner, G. Pleiss, D. Bindel, K. Q. Weinberger, and A. G. Wilson (2018)\nGPyTorch: blackbox matrix-matrix gaussian process inference with gpu acceleration\n.\nIn\nAdvances in Neural Information Processing Systems\n,\nCited by:\n§E.1\n.\nT. Geijtenbeek (2019)\nScone: open source software for predictive simulation of biological motion\n.\nJournal of Open Source Software\n4\n(\n38\n),\npp. 1421\n.\nCited by:\n§1\n.\nD. F. Gordon, C. McGreavy, A. Christou, and S. Vijayakumar (2022)\nHuman-in-the-loop optimization of exoskeleton assistance via online simulation of metabolic cost\n.\nIEEE Transactions on Robotics\n38\n(\n3\n),\npp. 1410–1429\n.\nCited by:\n§2\n,\n§3.3\n.\nI. Gulrajani, F. Ahmed, M. Arjovsky, V. Dumoulin, and A. C. Courville (2017)\nImproved training of wasserstein gans\n.\nAdvances in neural information processing systems\n30\n.\nCited by:\nAppendix G\n.\nG. G. Handsfield, C. H. Meyer, J. M. Hart, M. F. Abel, and S. S. Blemker (2014)\nRelationships of 35 lower limb muscles to height and body mass quantified using mri\n.\nJournal of biomechanics\n47\n(\n3\n),\npp. 631–638\n.\nCited by:\n§I.1\n.\nT. Hastie, R. Tibshirani, J. Friedman,\net al.\n(2009)\nThe elements of statistical learning\n.\nSpringer series in statistics New-York\n.\nCited by:\n§3.3\n.\nA. V. Hill (1938)\nThe heat of shortening and the dynamic constants of muscle\n.\nProceedings of the Royal Society of London. Series B-Biological Sciences\n126\n(\n843\n),\npp. 136–195\n.\nCited by:\nAppendix R\n,\n§4.1\n.\nF. Horst, D. Slijepcevic, M. Simak, and W. I. Schöllhorn (2021)\nGutenberg gait database, a ground reaction force database of level overground walking in healthy individuals\n.\nScientific data\n8\n(\n1\n),\npp. 232\n.\nCited by:\nAppendix M\n,\nTable Q.7\n.\nK. A. Ingraham, C. D. Remy, and E. J. Rouse (2022)\nThe role of user preference in the customized control of robotic exoskeletons\n.\nScience robotics\n7\n(\n64\n),\npp. eabj3487\n.\nCited by:\n§2\n.\nD. Kahneman (1979)\nProspect theory: an analysis of decisions under risk\n.\nEconometrica\n47\n,\npp. 278\n.\nCited by:\n§3.2\n.\nI. Kang, D. D. Molinaro, D. Park, D. Lee, P. Kunapuli, K. R. Herrin, and A. J. Young (2025)\nOnline adaptation framework enables personalization of exoskeleton assistance during locomotion in patients affected by stroke\n.\nIEEE Transactions on Robotics\n.\nCited by:\n§1\n.\nJ. Kim, F. Porciuncula, H. D. Yang, N. Wendel, T. Baker, A. Chin, T. D. Ellis, and C. J. Walsh (2024)\nSoft robotic apparel to avert freezing of gait in parkinson’s disease\n.\nNature medicine\n30\n(\n1\n),\npp. 177–185\n.\nCited by:\n§1\n.\nA. Lakmazaheri, S. Song, B. B. Vuong, B. Biskner, D. M. Kado, and S. H. Collins (2024)\nOptimizing exoskeleton assistance to improve walking speed and energy economy for older adults\n.\nJournal of NeuroEngineering and Rehabilitation\n21\n(\n1\n),\npp. 1\n.\nCited by:\n§1\n,\n§2\n.\nJ. Lee (2008)\nRepresenting rotations and orientations in geometric computing\n.\nIEEE Computer Graphics and Applications\n28\n(\n2\n),\npp. 75–83\n.\nCited by:\n§B.2\n.\nJ. Lee, M. X. Grey, S. Ha, T. Kunz, S. Jain, Y. Ye, S. S. Srinivasa, M. Stilman, and C. K. Liu (2018)\nDART: dynamic animation and robotics toolkit\n.\nThe Journal of Open Source Software\n3\n(\n22\n),\npp. 500\n.\nExternal Links:\nDocument\n,\nLink\nCited by:\n§4.1\n.\nS. Lee, M. Park, K. Lee, and J. Lee (2019)\nScalable muscle-actuated human simulation and control\n.\nACM Transactions On Graphics (TOG)\n38\n(\n4\n),\npp. 1–13\n.\nCited by:\n§1\n,\n§2\n,\n§3.1\n,\n§4.1\n.\nU. H. Lee, V. S. Shetty, P. W. Franks, J. Tan, G. Evangelopoulos, S. Ha, and E. J. Rouse (2023)\nUser preference optimization for control of ankle exoskeletons using sample efficient active learning\n.\nScience Robotics\n8\n(\n83\n),\npp. eadg3705\n.\nCited by:\n§2\n.\nB. Lim, J. Jang, J. Lee, B. Choi, Y. Lee, and Y. Shim (2019a)\nDelayed output feedback control for gait assistance and resistance using a robotic exoskeleton\n.\nIEEE Robotics and Automation Letters\n4\n(\n4\n),\npp. 3521–3528\n.\nCited by:\n§I.1\n,\n§I.2\n,\nTable I.3\n,\n§3\n.\nB. Lim, J. Lee, J. Jang, K. Kim, Y. J. Park, K. Seo, and Y. Shim (2019b)\nDelayed output feedback control for gait assistance with a robotic hip exoskeleton\n.\nIEEE Transactions on Robotics\n35\n(\n4\n),\npp. 1055–1062\n.\nCited by:\nAppendix O\n,\nTable Q.7\n,\n§I.2\n,\n§4.3\n,\n§4.3\n.\nC. Livolsi, R. Conti, T. Ciapetti, E. Guanziroli, T. Fridriksson, Á. Alexandersson, E. Trigili, F. Giovacchini, R. M. Lova, A. Esquenazi,\net al.\n(2025)\nBilateral hip exoskeleton assistance enables faster walking in individuals with chronic stroke-related gait impairments\n.\nScientific Reports\n15\n(\n1\n),\npp. 2017\n.\nCited by:\n§3.2\n.\nS. Luo, M. Jiang, S. Zhang, J. Zhu, S. Yu, I. Dominguez Silva, T. Wang, E. Rouse, B. Zhou, H. Yuk,\net al.\n(2024)\nExperiment-free exoskeleton assistance via learning in simulation\n.\nNature\n630\n(\n8016\n),\npp. 353–359\n.\nCited by:\n§1\n,\n§2\n.\nJ. Maxwell Donelan, R. Kram, and K. Arthur D (2001)\nMechanical and metabolic determinants of the preferred step width in human walking\n.\nProceedings of the Royal Society of London. Series B: Biological Sciences\n268\n(\n1480\n),\npp. 1985–1992\n.\nCited by:\n§3.2\n.\nD. D. Molinaro, K. L. Scherpereel, E. B. Schonhaut, G. Evangelopoulos, M. K. Shepherd, and A. J. Young (2024)\nTask-agnostic exoskeleton control via biological joint moment estimation\n.\nNature\n635\n(\n8038\n),\npp. 337–344\n.\nCited by:\n§1\n,\n§2\n.\nK. C. Nishikawa, J. A. Monroy, T. E. Uyeno, S. H. Yeo, D. K. Pai, and S. L. Lindstedt (2012)\nIs titin a ‘winding filament’? a new twist on muscle contraction\n.\nProceedings of the royal society B: Biological sciences\n279\n(\n1730\n),\npp. 981–990\n.\nCited by:\nAppendix R\n.\nM. A. Normand, J. Lee, H. Su, and J. S. Sulzer (2023)\nThe effect of hip exoskeleton weight on kinematics, kinetics, and electromyography during human walking\n.\nJournal of biomechanics\n152\n,\npp. 111552\n.\nCited by:\n§3.2\n.\nC. F. Ong, T. Geijtenbeek, J. L. Hicks, and S. L. Delp (2019)\nPredicting gait adaptations due to ankle plantarflexor muscle weakness and contracture using physics-based musculoskeletal simulations\n.\nPLoS computational biology\n15\n(\n10\n),\npp. e1006993\n.\nCited by:\nAppendix C\n.\nJ. Park, E. Jung, J. Lee, and J. Won (2025)\nMAGNET: muscle activation generation networks for diverse human movement\n.\nIn\nProceedings of the Special Interest Group on Computer Graphics and Interactive Techniques Conference Conference Papers\n,\npp. 1–11\n.\nCited by:\n§1\n,\n§2\n.\nJ. Park, S. Min, P. S. Chang, J. Lee, M. S. Park, and J. Lee (2022)\nGenerative gaitnet\n.\nIn\nACM SIGGRAPH 2022 Conference Proceedings\n,\npp. 1–9\n.\nCited by:\n§B.2\n,\n§B.2\n,\n§1\n,\n§2\n,\n§3.1\n,\n§4.1\n,\n§4.1\n.\nJ. Park, M. S. Park, J. Lee, and J. Won (2023)\nBidirectional gaitnet: a bidirectional prediction model of human gait and anatomical conditions\n.\nIn\nACM SIGGRAPH 2023 Conference Proceedings\n,\npp. 1–9\n.\nCited by:\n§2\n.\nK. L. Poggensee and S. H. Collins (2021)\nHow adaptation, training, and customization contribute to benefits from exoskeleton assistance\n.\nScience Robotics\n6\n(\n58\n),\npp. eabf1078\n.\nCited by:\n§2\n.\nA. Rajagopal, C. L. Dembia, M. S. DeMers, D. D. Delp, J. L. Hicks, and S. L. Delp (2016)\nFull-body musculoskeletal model for muscle-driven simulation of human gait\n.\nIEEE transactions on biomedical engineering\n63\n(\n10\n),\npp. 2068–2079\n.\nCited by:\n§I.1\n.\nB. Roszek and P. A. Huijing (1997)\nStimulation frequency history alters length-force characteristics of fully recruited rat muscle\n.\nJournal of electromyography and kinesiology\n7\n(\n3\n),\npp. 161–177\n.\nCited by:\nAppendix R\n.\nM. H. Schwartz, A. Rozumalski, and J. P. Trost (2008)\nThe effect of walking speed on the gait of typically developing children\n.\nJournal of biomechanics\n41\n(\n8\n),\npp. 1639–1650\n.\nCited by:\n§4.2\n.\nM. S. Shourijeh and B. J. Fregly (2020)\nMuscle synergies modify optimization estimates of joint stiffness during walking\n.\nJournal of biomechanical engineering\n142\n(\n1\n),\npp. 011011\n.\nCited by:\nAppendix L\n.\nP. Slade, C. Atkeson, J. M. Donelan, H. Houdijk, K. A. Ingraham, M. Kim, K. Kong, K. L. Poggensee, R. Riener, M. Steinert,\net al.\n(2024)\nOn human-in-the-loop optimization of human–robot interaction\n.\nNature\n633\n(\n8031\n),\npp. 779–788\n.\nCited by:\n§2\n,\n§3.3\n.\nP. Slade, M. J. Kochenderfer, S. L. Delp, and S. H. Collins (2022)\nPersonalizing exoskeleton assistance while walking in the real world\n.\nNature\n610\n(\n7931\n),\npp. 277–282\n.\nCited by:\n§1\n,\n§2\n.\nS. Song and S. H. Collins (2021)\nOptimizing exoskeleton assistance for faster self-selected walking\n.\nIEEE Transactions on Neural Systems and Rehabilitation Engineering\n29\n,\npp. 786–795\n.\nCited by:\n§1\n,\n§2\n.\nS. Song and H. Geyer (2015)\nA neural circuitry that emphasizes spinal feedback generates diverse behaviours of human locomotion\n.\nThe Journal of physiology\n593\n(\n16\n),\npp. 3493–3511\n.\nCited by:\n§2\n.\nS. Song and H. Geyer (2017)\nEvaluation of a neuromechanical walking control model using disturbance experiments\n.\nFrontiers in computational neuroscience\n11\n,\npp. 15\n.\nCited by:\n§1\n.\nS. Song, Ł. Kidziński, X. B. Peng, C. Ong, J. Hicks, S. Levine, C. G. Atkeson, and S. L. Delp (2021)\nDeep reinforcement learning for modeling human locomotion control in neuromechanical simulation\n.\nJournal of neuroengineering and rehabilitation\n18\n(\n1\n),\npp. 126\n.\nCited by:\n§1\n,\n§2\n.\nC. K. Tan, C. Wang, S. Lyu, B. K. Hodossy, P. Schumacher, E. B. Wilson, V. Caggiano, V. Kumar, D. Farina, L. Gionfrida,\net al.\n(2025)\nMyoassist 0.1: myosuite for dexterity and agility in bionic humans\n.\nIn\n2025 International Conference On Rehabilitation Robotics (ICORR)\n,\npp. 437–442\n.\nCited by:\n§1\n.\nJ. Tan, K. Liu, and G. Turk (2011)\nStable proportional-derivative controllers\n.\nIEEE Computer Graphics and Applications\n31\n(\n4\n),\npp. 34–44\n.\nCited by:\n§3.1\n.\nL. H. Ting and S. A. Chvatal (2010)\nDecomposing muscle activity in motor tasks\n.\nMotor control: theories, experiments, and applications\n,\npp. 102–138\n.\nCited by:\nAppendix L\n.\nM. C. Tresch, P. Saltiel, and E. Bizzi (1999)\nThe construction of movement by the spinal cord\n.\nNature neuroscience\n2\n(\n2\n),\npp. 162–167\n.\nCited by:\nAppendix L\n.\nA. Tversky and D. Kahneman (1991)\nLoss aversion in riskless choice: a reference-dependent model\n.\nThe quarterly journal of economics\n106\n(\n4\n),\npp. 1039–1061\n.\nCited by:\n§3.2\n.\nB. R. Umberger and P. E. Martin (2007)\nMechanical power and efficiency of level walking with different stride rates\n.\nJournal of Experimental Biology\n210\n(\n18\n),\npp. 3255–3265\n.\nCited by:\n§3.2\n.\nC. G. Welker, A. S. Voloshina, V. L. Chiu, and S. H. Collins (2021)\nShortcomings of human-in-the-loop optimization of an ankle-foot prosthesis emulator: a case series\n.\nRoyal Society open science\n8\n(\n5\n),\npp. 202020\n.\nCited by:\n§2\n.\nK. A. Witte, P. Fiers, A. L. Sheets-Singer, and S. H. Collins (2020)\nImproving the energy economy of human running with powered and unpowered ankle exoskeleton assistance\n.\nScience Robotics\n5\n(\n40\n),\npp. eaay9108\n.\nCited by:\n§2\n.\nJ. Won and J. Lee (2019)\nLearning body shape variation in physics-based characters\n.\nACM Transactions on Graphics (TOG)\n38\n(\n6\n),\npp. 1–12\n.\nCited by:\nAppendix J\n.\nM. Zarrugh, F. Todd, and H. Ralston (1974)\nOptimization of energy expenditure during level walking\n.\nEuropean journal of applied physiology and occupational physiology\n33\n(\n4\n),\npp. 293–306\n.\nCited by:\n§3.2\n.\nJ. Zhang, P. Fiers, K. A. Witte, R. W. Jackson, K. L. Poggensee, C. G. Atkeson, and S. H. Collins (2017)\nHuman-in-the-loop optimization of exoskeleton assistance during walking\n.\nScience\n356\n(\n6344\n),\npp. 1280–1284\n.\nCited by:\n§1\n,\n§2\n.\nAppendix A\nArchitecture of Human Controller\nFigure A.1:\nThe human controller computes muscle activations from the musculoskeletal simulation state and applies them back to the simulation.\nAppendix B\nDetails of the RL Formulation for PoseNet\nB.1\nState Representation\n•\nKinematics (\nℝ\n349\n\\mathbb{R}^{349}\n):\nAll simulated rigid bodies are represented in a root-centered local coordinate frame, including their relative positions, orientations, and linear and angular velocities. Phase-based mirroring is applied to account for gait symmetry\n(Abdolhosseini\net al.\n,\n2019\n)\n.\n–\nRoot height:\nℝ\n1\n\\mathbb{R}^{\\text{1}}\n–\nRoot linear velocities:\nℝ\n3\n\\mathbb{R}^{\\text{3}}\n–\nBody part positions:\nℝ\n69\n\\mathbb{R}^{\\text{69}}\n–\nBody part rotations:\nℝ\n138\n\\mathbb{R}^{\\text{138}}\n–\nBody part linear velocities:\nℝ\n69\n\\mathbb{R}^{\\text{69}}\n–\nBody part angular velocities:\nℝ\n69\n\\mathbb{R}^{\\text{69}}\n•\nGait features (\nℝ\n9\n\\mathbb{R}^{9}\n):\n–\nTarget foot position:\nℝ\n3\n\\mathbb{R}^{\\text{3}}\n–\nFoot contact state:\nℝ\n2\n\\mathbb{R}^{\\text{2}}\n–\nTarget gait velocity:\nℝ\n1\n\\mathbb{R}^{\\text{1}}\n–\nCurrent/Target/Reference gait phase:\nℝ\n3\n\\mathbb{R}^{\\text{3}}\n•\nMuscle-related terms (\nℝ\n59\n\\mathbb{R}^{59}\n):\nPassive muscle forces, lower and upper torque bounds per joint, and dynamic muscle-specific parameters like muscle length.\n–\nMuscle weakness and contracture:\nℝ\n5\n\\mathbb{R}^{\\text{5}}\n–\nPassive forces:\nℝ\n18\n\\mathbb{R}^{\\text{18}}\n–\nTorque bounds:\nℝ\n36\n\\mathbb{R}^{\\text{36}}\n•\nExoskeleton assist torque history: (\nℝ\n64\n\\mathbb{R}^{64}\n):\nRecent history of assistive torques applied at the hip joints (left/right), representing the temporal profile of exoskeletal assistance to the human.\nB.2\nAction Representation\nAs in\nPark\net al.\n(\n2022\n)\n, we employ the residual pose action formulation. The action consists of pose and phase modulation:\n𝐀\n=\n(\nΔ\n​\nϕ\n,\nΔ\n​\nM\n)\n,\n\\mathbf{A}=\\left(\\Delta\\phi,\\,\\Delta M\\right),\n(10)\nwhere\nΔ\n​\nM\n\\Delta M\ndenotes the pose displacement, and\nΔ\n​\nϕ\n\\Delta\\phi\nrepresents the phase increment\nthat either advances or delays gait phase with respect to the reference gait motion.\nThe gait phase(\nϕ\n\\phi\n) and target pose(\nM\n​\n(\nϕ\n)\nM(\\phi)\n) for the PD controller is then updated according to\nϕ\nt\n+\n1\n\\displaystyle\\phi_{t+1}\n=\nϕ\nt\n+\nΔ\n​\nϕ\n,\n\\displaystyle=\\phi_{t}+\\Delta\\phi,\n(11)\nM\nt\n\\displaystyle M_{t}\n=\nM\nref\n⊕\nΔ\n​\nM\n.\n\\displaystyle=M_{\\text{ref}}\\oplus\\Delta M.\nwhere\nM\nref\nM_{\\mathrm{ref}}\ndenotes the reference motion (obtained from\nPark\net al.\n(\n2022\n)\n) and\n⊕\n\\oplus\ndenotes the operation between a pose and a displacement, which includes operations in SO(3) to properly update 3D rotations. For more technical details, refer to\nLee (\n2008\n)\nB.3\nReward Design\nWe use a composite reward consisting of four terms:\nr\ntotal\n=\nw\ngait\n⋅\nr\ngait\n+\nw\nenergy\n⋅\nr\nenergy\n+\nw\narm\n⋅\nr\narm\n+\nw\nHEI\n⋅\nr\nHEI\nr_{\\mathrm{total}}=w_{\\mathrm{gait}}\\cdot r_{\\mathrm{gait}}+w_{\\mathrm{energy}}\\cdot r_{\\mathrm{energy}}+w_{\\mathrm{arm}}\\cdot r_{\\mathrm{arm}}+w_{\\mathrm{HEI}}\\cdot r_{\\mathrm{HEI}}\n(12)\nSince we previously mentioned\nr\nenergy\nr_{\\mathrm{energy}}\nand\nr\nHEI\nr_{\\mathrm{HEI}}\nwe now discuss the remaining one. There are four terms in the\nr\ngait\n=\nr\nstep\n⋅\nr\nvel\n⋅\nr\nhead\n⋅\nr\nsway\nr_{\\text{gait}}=r_{\\text{step}}\\cdot r_{\\text{vel}}\\cdot r_{\\text{head}}\\cdot r_{\\text{sway}}\n. Specifically,\nr\nstep\nr_{\\text{step}}\nand\nr\nvel\nr_{\\text{vel}}\n, encourage the agent to maintain a target step size and walking velocity:\nr\nstep\n\\displaystyle r_{\\text{step}}\n=\nexp\n⁡\n(\n−\n(\n‖\n𝐡\n−\n𝐡\nd\n​\ne\n​\ns\n​\ni\n​\nr\n​\ne\n​\nd\n‖\n/\nσ\nstep\n)\n2\n)\n,\n\\displaystyle=\\exp\\left(-\\left({\\|\\mathbf{h}-\\mathbf{h}_{desired}\\|}/{\\sigma_{\\text{step}}}\\right)^{2}\\right),\n(13)\nr\nvel\n\\displaystyle r_{\\text{vel}}\n=\nexp\n⁡\n(\n−\n(\n‖\n𝐯\n−\n𝐯\nd\n​\ne\n​\ns\n​\ni\n​\nr\n​\ne\n​\nd\n‖\n/\nσ\nvel\n)\n2\n)\n.\n\\displaystyle=\\exp\\left(-\\left({\\|\\mathbf{v}-\\mathbf{v}_{desired}\\|}/{\\sigma_{\\text{vel}}}\\right)^{2}\\right).\nHere,\n𝐡\n\\mathbf{h}\ndenotes the current foot position, and\n𝐯\n\\mathbf{v}\ndenotes the average forward walking velocity of the simulated character. Both values are compared against their respective targets to guide the agent toward producing the desired gait pattern.\nHumans generally maintain head stability during walking, as key sensory systems like vision and balance are located there.\nr\nhead\nr_{\\text{head}}\nencourages consistent head motion by penalizing abrupt changes in head angle, linear acceleration, and angular acceleration.\nr\nhead\n\\displaystyle r_{\\text{head}}\n=\nf\nr\n⋅\nf\nv\n⋅\nf\nω\n,\n\\displaystyle=f_{r}\\cdot f_{v}\\cdot f_{\\omega},\n(14)\nf\nr\n\\displaystyle f_{r}\n=\nk\nalive\n+\n(\n1\n−\nk\nalive\n)\n​\nexp\n⁡\n(\n−\n(\nθ\nhead\n/\nσ\nhead\n)\n2\n)\n,\n\\displaystyle=k_{\\mathrm{alive}}+(1-k_{\\mathrm{alive}})\\exp\\!\\left(-\\left({\\theta_{\\text{head}}}/{\\sigma_{\\text{head}}}\\right)^{2}\\right),\nif\n​\nθ\nhead\n>\nλ\nr\n,\nelse\n​\n1\n,\n\\displaystyle\\text{if }\\theta_{\\text{head}}>\\lambda_{r},\\;\\text{else }1,\nf\nv\n\\displaystyle f_{v}\n=\nk\nalive\n+\n(\n1\n−\nk\nalive\n)\n​\nexp\n⁡\n(\n−\n(\na\nlin\n/\nσ\nhead\n)\n2\n)\n,\n\\displaystyle=k_{\\mathrm{alive}}+(1-k_{\\mathrm{alive}})\\exp\\!\\left(-\\left({a_{\\text{lin}}}/{\\sigma_{\\text{head}}}\\right)^{2}\\right),\nif\n​\na\nlin\n>\nλ\nv\n,\nelse\n​\n1\n,\n\\displaystyle\\text{if }a_{\\text{lin}}>\\lambda_{v},\\;\\text{else }1,\nf\nω\n\\displaystyle f_{\\omega}\n=\nk\nalive\n+\n(\n1\n−\nk\nalive\n)\n​\nexp\n⁡\n(\n−\n(\na\nang\n/\nσ\nhead\n)\n2\n)\n,\n\\displaystyle=k_{\\mathrm{alive}}+(1-k_{\\mathrm{alive}})\\exp\\!\\left(-\\left({a_{\\text{ang}}}/{\\sigma_{\\text{head}}}\\right)^{2}\\right),\nif\n​\na\nang\n>\nλ\nω\n,\nelse\n​\n1\n.\n\\displaystyle\\text{if }a_{\\text{ang}}>\\lambda_{\\omega},\\;\\text{else }1.\nHere,\nθ\nhead\n\\theta_{\\text{head}}\ndenotes the head orientation with respect to the frame aligned to the progression direction and the global up direction.\na\nlin\na_{\\text{lin}}\nand\na\nang\na_{\\text{ang}}\nrepresent the linear and angular accelerations of the head, respectively.\nTo prevent the emergence of unrealistic gait patterns due to model inaccuracies or excessive energy minimization, a sway reward discourages abnormal deviations in musculoskeletal body orientations, promoting kinematics that remain close to typical human walking behavior.\nr\nsway\n,\nb\n\\displaystyle r_{\\text{sway},b}\n=\nexp\n⁡\n(\n−\n(\n|\nq\nb\n−\nq\n¯\nb\n|\n−\nδ\nb\nσ\nsway\n)\n2\n)\nif\n​\n|\nq\nb\n−\nq\n¯\nb\n|\n≤\nδ\nb\n,\n1\n​\notherwise\n,\n\\displaystyle=\\exp\\!\\left(-\\left(\\tfrac{|q_{b}-\\bar{q}_{b}|-\\delta_{b}}{\\sigma_{\\text{sway}}}\\right)^{2}\\right)\\quad\\text{if }|q_{b}-\\bar{q}_{b}|\\leq\\delta_{b},1\\;\\text{otherwise},\n(15)\nr\nsway\n\\displaystyle r_{\\text{sway}}\n=\n∏\nb\n∈\nℬ\nr\nsway\n,\nb\n,\nB\n=\n{\npelvis\n,\nspine\n,\nfoot\n}\n.\n\\displaystyle=\\prod_{b\\in\\mathcal{B}}r_{\\text{sway},b},\\quad B=\\{\\text{pelvis},\\text{spine},\\text{foot}\\}.\nwhere\nq\nb\nq_{b}\ndenotes the angle of body\nb\nb\n,\nq\n¯\nb\n\\bar{q}_{b}\nis the angle derived from normative gait data, and\nδ\nb\n\\delta_{b}\nrepresents the deviation threshold for body\nb\nb\n. The total sway reward\nR\nsway\nR_{\\text{sway}}\nis computed as the product of body-wise sway terms\nr\nsway\n,\nb\nr_{\\text{sway},b}\nacross joints.\nTo promote natural arm movements during gait, we introduce an upper-arm imitation reward. This reward measures the deviation between the simulated and reference upper-arm joint angles, encouraging the musculoskeletal model to align its arm posture with the reference motion. The reward is computed as:\nr\narm\n=\nexp\n⁡\n(\n−\n∑\nj\n∈\narm\n(\n‖\n𝐪\n^\nj\n−\n𝐪\nj\n‖\n/\nσ\narm\n)\n2\n)\nr_{\\text{arm}}=\\exp\\left(-\\sum\\limits_{j\\in\\text{arm}}\\left(\\|\\hat{\\mathbf{q}}_{j}-\\mathbf{q}_{j}\\|/\\sigma_{\\mathrm{arm}}\\right)^{2}\\right)\n(16)\nwhere\n𝐪\n^\nj\n\\hat{\\mathbf{q}}_{j}\ndenotes the joint angle of joint j\nj\nj\nin the reference motion\nM\nref\nM_{\\mathrm{ref}}\n,\n𝐪\nj\n\\mathbf{q}_{j}\nrepresents the current joint angle.\nB.4\nTraining Curves\nFigure B.2:\nTraining curves of each reward component. Shaded regions indicate\n±\n2\n​\nσ\n\\pm 2\\sigma\nover\nn\n=\n5\nn=5\nruns.\nAppendix C\nIntramuscular Regularization Enhances Physiological Plausibility of Muscle Activation\nIn this section, we investigate how\nℒ\nIMR\n\\mathcal{L}_{\\text{IMR}}\naffects both the training dynamics and the actual activations computed by the MCN. As shown in Figure\nC.3\n, during the training process with the intramuscular regularizer (IMR), the IMR-specific loss decreased steadily while the activation discrepancies across line segments of the same anatomical muscle also diminished. In contrast, training without the IMR often led to large differences between line-muscle activations where human experimental data does not show\n(Ong\net al.\n,\n2019\n)\n. Although the baseline MCN loss includes an activation regularizer that prevents over-reliance on individual muscles, this alone was insufficient to avoid highly imbalanced segment activations. Such imbalances are physiologically implausible, since humans cannot selectively control individual line segments of a single muscle. Therefore, the IMR is essential for producing activation patterns that are both stable and physiologically plausible.\nFigure C.3:\nℒ\nIMR\n\\mathcal{L}_{\\text{IMR}}\nover training epochs (a), Line-wise activation profiles (colored) across the gait cycle, in comparison with human data (b)\nAppendix D\nDetermining Metabolic Energy Expenditure Parameters\nFigure D.4:\nSelection of\nMEE\n\\mathrm{MEE}\nexponents parameter pair\n(\nα\n,\nβ\n)\n(\\alpha,\\beta)\nbased on resulting PWS.\nWe selected the\nMEE\n\\mathrm{MEE}\nexponent parameter pair\n(\nα\n,\nβ\n)\n=\n(\n1.5\n,\n1.0\n)\n(\\alpha,\\,\\beta)=(1.5,\\,1.0)\n. For each pair, we trained multiple data generators with different random seeds and computed the resulting PWS using Algorithm\n2\n. Figure\nD.4\nshows the result which revealed that\nα\n\\alpha\nhad a significant influence on the simulated preferred walking speed (PWS), whereas\nβ\n\\beta\nhad relatively little effect. Therefore, we chose\nα\n=\n1.5\n\\alpha=1.5\n, which produced a PWS closest to the human reference value (\nv\nreal\n=\n1.25\nv_{\\text{real}}=1.25\nm/s). For\nβ\n\\beta\n, we selected a value of 1.0 to ensure that metabolic cost scaled linearly with muscle mass, allowing the total cost to remain consistent regardless of whether mass was considered per-muscle or globally.\nAppendix E\nLimitations of Gaussian Processes as a Surrogate Model\nE.1\nGaussian processes Consume Excessive Memory\nWe conduct a feasibility comparison between Gaussian processes (GP) and neural network (NN) by analyzing peak runtime memory consumption. For a fair comparison, we employed a GPU-based GP implementation\n(Gardner\net al.\n,\n2018\n)\n. All experiments were conducted on an RTX 3070 GPU. Since GP require\nO\n​\n(\nN\n2\n)\nO(N^{2})\nmemory, datasets larger than 20k samples exceeded the GPU VRAM limit (8GB).\ndataset size\nGP (MB)\nNN (MB)\n20,000\nOut-of-memory\n538\n10,000\n2232\n360\n500\n258\n226\nTable E.1:\nComparison of peak runtime memory usage between GP and NN.\nE.2\nDataset Size Required for Plausible Results Exceeds GP’s Computational Limit\nFigure\nE.5\nillustrates the relationship between optimized exoskeleton parameters and the size of the training dataset when using a neural network as a surrogate. With 5k and 10k sample sizes, the resulting optimization landscapes are noisy and contain unrealistic local minima, making them unsuitable for robust parameter selection. Increasing the dataset size to 20k samples improves the smoothness and plausibility of the parameter predictions; however, the memory requirements quickly become prohibitive for GP (see Appendix\nE.1\n). In contrast, neural network surrogates can efficiently utilize large datasets with relatively low computational resources, enabling stable and physiologically plausible optimization results.\nFigure E.5:\nExoskeleton controller optimization results across different dataset sizes (5k, 10k, 20k, and 60k parameter samples).\nAppendix F\nHuber loss and Latin Hypercube sampling are required for smooth surrogate network landscape\nFigure\nF.6\nshows the surrogate network landscape across walking speeds. Our proposed combination of Huber loss and Latin Hypercube Sampling (LHS) produces the smoothest landscape compared to other approaches. The MSE-based surrogate network exhibited excessive sensitivity to noisy gait data, resulting in jagged cost landscapes, especially at higher exoskeleton gains (\nκ\n\\kappa\n), where external assistance amplifies gait variability. Similarly, the surrogate network trained on uniformly sampled data displayed aliasing artifacts due to poor sample coverage, despite using the same sample size (\nN\n=\n60\nN=60\nk).\nFigure F.6:\nLandscape of CoT from gait data generator across walking speeds and exoskeleton gains (\nκ\n\\kappa\n) normalized to the exoskeleton-off condition (first panel). Surrogate predictions under different training setups: Our proposed configuration (second panel) yields a smoother landscape than alternative approaches (third and forth panels).\nAppendix G\nMotivation of the gradient penalty loss of the exoskeleton optimizer\nThis penalty is motivated by the Lipschitz condition:\n‖\nf\n​\n(\nx\n1\n)\n−\nf\n​\n(\nx\n2\n)\n‖\n\\displaystyle\\|f(x_{1})-f(x_{2})\\|\n≤\n‖\nx\n1\n−\nx\n2\n‖\n\\displaystyle\\leq\\|x_{1}-x_{2}\\|\\quad\n∀\nx\n1\n,\nx\n2\n∈\n𝒳\n,\n\\displaystyle\\forall x_{1},x_{2}\\in\\mathcal{X},\n(17)\n‖\nf\n​\n(\nx\n1\n)\n−\nf\n​\n(\nx\n2\n)\n‖\n‖\nx\n1\n−\nx\n2\n‖\n\\displaystyle\\frac{\\|f(x_{1})-f(x_{2})\\|}{\\|x_{1}-x_{2}\\|}\n≤\n1\n,\n\\displaystyle\\leq 1,\nlim\nx\n2\n→\nx\n1\n‖\nf\n​\n(\nx\n1\n)\n−\nf\n​\n(\nx\n2\n)\n‖\n‖\nx\n1\n−\nx\n2\n‖\n\\displaystyle\\lim_{x_{2}\\to x_{1}}\\frac{\\|f(x_{1})-f(x_{2})\\|}{\\|x_{1}-x_{2}\\|}\n=\n‖\n∇\nf\n​\n(\nx\n1\n)\n‖\n≤\n1\n.\n\\displaystyle=\\|\\nabla f(x_{1})\\|\\leq 1.\nA small gradient norm implies local Lipschitz continuity, and a uniform bound on the gradient norm ensures global Lipschitz continuity\n(Gulrajani\net al.\n,\n2017\n)\n. Enforcing this property prevents abrupt shifts in predicted CoT values across the parameter space and yields stable gradients that can be exploited by downstream optimization.\nAppendix H\nOptimizing exoskeleton with surrogate network\nLet\n{\ng\nn\n}\nn\n=\n1\nM\n\\{g_{n}\\}_{n=1}^{M}\ndenote the set of gait parameters.\nκ\nn\n\\kappa_{n}\nand\nΔ\n​\nt\nn\n\\Delta t_{n}\nare the optimal parameters corresponding to each\ng\nn\ng_{n}\n, and the optimization is performed with the following objective:\nℒ\n​\n(\nκ\nn\n,\nΔ\n​\nt\nn\n)\n\\displaystyle\\mathcal{L}(\\kappa_{n},\\Delta t_{n})\n=\n∑\nn\n=\n1\nM\ny\n^\n​\n(\ng\nn\n;\nκ\nn\n,\nΔ\n​\nt\nn\n)\n\\displaystyle=\\sum_{n=1}^{M}\\hat{y}\\!\\left(g_{n};\\>\\kappa_{n},\\,\\Delta t_{n}\\right)\n(18)\n+\nλ\n1\n​\n∑\nn\n=\n1\nM\n|\nκ\nn\n|\n+\nλ\n2\n​\n∑\nn\n=\n1\nM\n−\n1\n(\n|\nκ\nn\n+\n1\n−\nκ\nn\n|\n+\n|\nΔ\n​\nt\nn\n+\n1\n−\nΔ\n​\nt\nn\n|\n)\n.\n\\displaystyle\\quad+\\lambda_{1}\\sum_{n=1}^{M}|\\kappa_{n}|+\\lambda_{2}\\sum_{n=1}^{M-1}\\Big(|\\kappa_{n+1}-\\kappa_{n}|+|\\Delta t_{n+1}-\\Delta t_{n}|\\Big).\nHere,\ny\n^\n\\hat{y}\nrepresents the surrogate-predicted metabolic cost of transport. However, surrogate predictions can exhibit minor fluctuations across the parameter space due to the inherent complexity of the energy landscape or errors introduced during model training. These fluctuations can lead to abrupt variations in the exoskeleton control parameters when optimizing solely for CoT. To mitigate this issue, we introduce two additional regularization terms. The first regularizer discourages extreme parameter magnitudes, while the second promotes smooth variation of solutions across speeds. Together, these regularizers ensure that the optimized parameters minimize metabolic cost while remaining realistic and consistent across varying gait parameters. All hyperparameters used in the exoskeleton optimizer are provided in Appendix\nT\n.\nAppendix I\nSimulation model\nI.1\nSimulated character\nKey muscle parameters, including isometric force and tendon slack length, were adjusted to match the OpenSim model by\nRajagopal\net al.\n(\n2016\n)\n, and muscle mass distributions followed the estimates of\nHandsfield\net al.\n(\n2014\n)\n. The simulated subject’s body mass and height were set to match average values reported in the target exoskeleton study\n(Lim\net al.\n,\n2019a\n)\n. Anthropometric data are provided in Table\nI.2\n.\nItem\nUnit\nValue\nHeight\ncm\n169\nMass\nkg\n72.9\nTable I.2:\nPhysical properties of the musculoskeletal character.\nI.2\nExoskeleton\nWe adopted Samsung Electronics’ gait enhancing and motivating system (GEMS)\n(Lim\net al.\n,\n2019b\n;\na\n)\n. See Table\nI.3\nfor mechanical properties.\nItem\nUnit\nValue\nBody segment\nkg\n1.7\nThigh segment\nkg\n0.6\nTotal mass\n∗\nkg\n2.3\nTable I.3:\nPhysical properties of the exoskeleton.\n∗\nThe total mass differs slightly from\nLim\net al.\n(\n2019a\n)\nbecause we imposed a minimum mass of 50 g on each exoskeleton element to prevent numerical instability caused by nearly singular dynamics when solving Newton’s equations.\nIn the human controller of the data generator, the stable PD controller computes the final desired joint torque as:\nτ\nMCN\n(\nj\n)\n=\nτ\nPD\n(\nj\n)\n−\nτ\nexo\n(\nj\n)\n∀\nj\n∈\n𝒥\nhip\n.\n\\tau_{\\text{MCN}}^{(j)}=\\tau_{\\text{PD}}^{(j)}-\\tau_{\\text{exo}}^{(j)}\\quad\\forall j\\in\\mathcal{J}_{\\text{hip}}.\n(19)\nwhere\nτ\nexo\n\\tau_{\\text{exo}}\ndenotes the torque applied by the exoskeleton,\nτ\nPD\n\\tau_{\\text{PD}}\ndenotes computed torque from the PD-target in the PD-controller and\nτ\nMCN\n\\tau_{\\text{MCN}}\nserves as the input to the MCN for computing muscle activations. This formulation ensures that the MCN receives only the net torque required for joint motion, effectively reflecting the dynamics under exoskeletal assistance.\nAppendix J\nSimulation parameters\nParameters for the simulation are displayed in Table\nJ.4\n. Gait parameters and exoskeleton control parameters are uniformly sampled, while muscle parameters are sampled in an adaptive manner\n(Won and Lee,\n2019\n)\n. Adaptive sampling is a training technique in reinforcement learning that adjusts the parameter sampling rate during RL training based on the learning difficulty of each parameter. Specifically, the muscle parameter sampling interval is divided into 8 bins. For each bin, we evaluate the average episode length of the human controller while training. If some bins have lower average episode lengths than other bins, we increase the sampling rate for those bins.\nCategory\nName\nUnit\nRange\nMuscle\nparameter\n\\cellcolor\ngray!25\nMuscle weakness\n(maximum isometric force)\nTriceps surae (Calcaneous)\nN.A.\n[\n0\n,\n0.4\n]\n[0,0.4]\nTibialis anterior (Footdrop)\nN.A.\n[\n0\n,\n0.5\n]\n[0,0.5]\nGluteal muscles (Waddling)\nN.A.\n[\n0\n,\n0.4\n]\n[0,0.4]\n\\cellcolor\ngray!25\nMuscle contracture\n(optimal muscle fiber length)\nTriceps surae (Equinus)\nN.A.\n[\n0.73\n,\n1\n]\n[0.73,1]\nPsoas (Crouch)\nN.A.\n[\n0.55\n,\n1\n]\n[0.55,1]\nGait\nparameter\nStep length\ncm\n[13.4, 93.8]\nStep frequency\nspm\n[1.27, 2.55]\nExoskeleton\ncontrol\nparameter\nGain\n(\nκ\n)\n(\\kappa)\nNm\n[0, 21]\nDelay\n(\nΔ\n​\nt\n)\n(\\Delta t)\nsec\n[0, 0.5]\nTable J.4:\nSimulation parameter name and its range.\nAppendix K\nGenerated pathological gait kinematics\nFigure K.7:\nComparison of simulation results between normal muscle conditions and each pathological condition.\nExo-plore was trained with pathological muscle conditions using parameters specified in Appendix\nJ\n, and the resulting gait patterns are presented in Figure\nK.7\n. Rendered images with descriptive annotations are provided to facilitate understanding of each pathological condition. Close-up images of the feet include ground reaction force visualization to illustrate contact states during the gait cycle.\nWe compare pathological gaits with unimpaired gait to clearly show deviation patterns.\nFor pathological gait cases, the walking speed was fixed at 3.5 km/h to ensure consistent comparison across severities. In contrast, for unimpaired gait, we used the preferred walking speed (PWS) identified by Algorithm\n2\n, and selected gait parameters that minimized the CoT at that speed.\nName\nCause\nDescription\nEquinus\nContracture in Triceps surae\nWalking on the toes due to persistent plantarflexion of the ankle. The heel does not touch the ground during gait.\nWaddling\nWeakness in Gluteus\nSwaying of the trunk from side to side while walking due to weakness of the gluteal muscles, which fail to stabilize the pelvis. This gait is also referred to as a waddling or “duck-like” gait.\nCrouch\nContracture in Psoas\nWalking in a flexed, crouched posture, which maintains the hips in persistent flexion, often accompanied by knee flexion.\nCalcaneous\nWeakness in Triceps surae\nWalking with the heel contacting the ground first due to weakness of the triceps surae muscles, leading to excessive dorsiflexion of the ankle.\nFootdrop\nWeakness in Tibialis anterior\nInability to dorsiflex the ankle during foot-off, resulting in the toes dragging on the ground. Patients often compensate with high-stepping gait.\nTable K.5:\nTypes of pathological gait patterns, their causes, and descriptions.\nAppendix L\nOveractivation of the rectus femoris in the simulation\nFigure\n3\nshows the muscle activation of rectus femoris (RF) have the largest sim-to-real gap. Simulated RF is activated much more than humans typically utilize it, especially around the foot-off phase. This increased activation of the RF in the gait data generator is related to the superior motor performance of the human controller, as mentioned earlier. Humans tend to control the RF together with the vastus lateralis and vastus medialis, as these muscles are located close to each other and work in coordination, rather than using it independently. Consequently, human activation data shows that these three muscles are activated in similar patterns. However, the RF, being a biarticular muscle, can move two joints and is more metabolically efficient when activated alone. This provides an incentive for the controller to actively utilize it. To investigate this, we trained the human controller while artificially deactivating the RF, and while kinematics remained nearly unchanged, we observed a slightly higher (\n∼\n4\n%\n\\sim 4\\%\n) CoT (See Figure\nL.8\n). Therefore, to address the excessive use of the RF, an additional regularizer that reflects the limitations of human motor control, such as synergy control\n(Tresch\net al.\n,\n1999\n; Ting and Chvatal,\n2010\n; Banks\net al.\n,\n2017\n; Shourijeh and Fregly,\n2020\n)\n, should be applied.\nFigure L.8:\nInclusion of rectus femoris in the model reduces normalized cost of transport compared to the deactivated rectus femoris condition.\nAppendix M\nGround Reaction Force of Unassisted Gait\nFigure M.9:\nComparison of simulated and experimental ground reaction forces (GRF).\nFigure\nM.9\ncompares the simulated and experimental ground reaction forces (GRF)\n(Horst\net al.\n,\n2021\n)\nover a single stance cycle, with all forces normalized by body weight (BW) for consistency with the reference human data. Overall, the simulated GRF profiles exhibit characteristic patterns similar to those observed in human locomotion. The primary discrepancy appears in the vertical component, where the simulation produces a sharper peak than the experimental measurements. This difference likely arises from structural modeling: while the human foot features an arched and compliant architecture that distributes load more gradually, our simulation employs a box-shaped rigid element, resulting in a more abrupt transfer of force during stance.\nAppendix N\nAlternative HEI rewards\n•\nAssist Maximization:\nEncourages the agent to align with assistive power by promoting positive power contributions:\nr\nHEI\n=\nr\nassist\n=\n1\nZ\n​\n∑\ns\n∈\n{\nL\n,\nR\n}\nmax\n⁡\n(\n0\n,\nP\ns\n)\nr_{\\text{HEI}}=r_{\\text{assist}}=\\frac{1}{Z}\\sum_{s\\in\\{L,R\\}}\\max(0,P_{s})\n(20)\n•\nNo HEI Reward:\nWith\nr\nHEI\n=\n0\nr_{\\text{HEI}}=0\n, the human is modeled as minimizing metabolic energy expenditure without incorporating any additional considerations related to exoskeletal assistance.\nAppendix O\nHEI Makes Higher Metabolic Reduction Rate than the alternative models\nFigure\n7\ndemonstrates that our HEI reward accurately predicts the metabolic reduction rate (MRR) achieved through exoskeleton assistance. This finding may appear counterintuitive, as the HEI reward does not explicitly regulate metabolic energy expenditure. Furthermore, one might expect the HEI reward to impede metabolic reduction by exoskeleton, given its potential competition with\nr\ne\n​\nn\n​\ne\n​\nr\n​\ng\n​\ny\nr_{energy}\n, which directly minimizes metabolic energy consumption. To investigate this apparent paradox, we analyze the relationship between gait parameters and their metabolic benefits as follows:\nBenefit\n=\nCoT\n​\n(\nκ\n=\n0\n)\n−\nmin\n⁡\n(\nCoT\n​\n(\nκ\n>\n0\n)\n)\n\\mathrm{Benefit}=\\mathrm{CoT}(\\kappa=0)-\\min\\bigl(\\mathrm{CoT}(\\kappa>0)\\bigr)\n(21)\nFigure\nO.10\nreveals that the maximum normalized\nBenefit\n\\mathrm{Benefit}\nremains consistent across different HEI reward configurations. While the mean values are nearly identical across reward conditions, the gait parameters at which these maxima occur differ significantly. In the absence of HEI, the maximum\nBenefit\n\\mathrm{Benefit}\ncoincides with the highest cost of transport (CoT) values. This observation aligns with expectations, as\nr\ne\n​\nn\n​\ne\n​\nr\n​\ng\n​\ny\nr_{energy}\nprimarily aims to reduce\nMEE\n\\mathrm{MEE}\n, leading the human controller to learn exoskeleton utilization strategies at parameters corresponding to maximum CoT.\nIn contrast, when our proposed HEI reward is employed, the maximum benefit occurs at large gait parameters (Step frequency=2.5\nHz\n\\,\\mathrm{Hz}\n, Step length=0.6\nm\n\\,\\mathrm{m}\n, walking speed=5.2\nkm\n/\nh\n\\,\\mathrm{km/h}\n) than former. This phenomenon can be attributed to the enhanced effectiveness of the HEI reward at higher walking speeds, where exoskeleton assistance power is relatively elevated. Consequently, the human controller learns to exploit exoskeleton assistance more effectively under these conditions, resulting in higher measured MRR values despite the lower baseline CoT. This finding is consistent with human experimental studies\n(Lim\net al.\n,\n2019b\n)\n, which report maximum MRR at relatively high walking speeds of 4 km/h.\nFigure O.10:\nComparison of the simulated cost of transport (top),\nBenefit\n\\mathrm{Benefit}\n(middle) and metabolic reduction rate (bottom) between our proposed HEI reward(\nr\nH\n​\nE\n​\nI\nr_{HEI}\n) and the alternatives (\nr\na\n​\ns\n​\ns\n​\ni\n​\ns\n​\nt\nr_{assist}\n, no\nr\nH\n​\nE\n​\nI\nr_{HEI}\n).\nAppendix P\nOptimal exoskeleton gain trends in pathological gait\nP.1\nPathology-specific trends in optimal gain\nAlthough the absolute scale of the optimal gain differed between pathological gait data generator, the gains consistently follow severity-dependent trends. This suggests that pathology-specific gain patterns can serve as distinguishing characteristics, since the gain trend is less sensitive to surrogate hyperparameters than the absolute gain value. Based on these trends, we identified two distinct groups reflecting fundamentally different assistance requirements:\nGroup A (Benefit from hip exoskeleton).\nCrouch and calcaneus gaits show increasing optimal gains with severity. Crouch gait, caused by psoas contracture, maintains stable but energetically expensive postures with sustained knee and hip flexion. Similarly, calcaneus gait from triceps surae weakness results in heel-walking, relying heavily on hip flexion to compensate for the inability to plantarflex the ankle. Both conditions feature stable but metabolically demanding gait patterns where exoskeleton assistance effectively reduces energy expenditure without compromising stability.\nGroup B (Limited benefit from hip exoskeleton).\nEquinus and waddling gaits exhibit decreasing optimal gains with severity. Equinus, resulting from triceps surae contracture, causes inherently unstable toe-walking where external forces exacerbate balance issues. Waddling gait, stemming from gluteus weakness, involves lateral trunk sway for pelvic stabilization, where compensatory strategy that external hip assistance can disrupt. These pathologies prioritize maintaining precarious stability over energy optimization, making them less amenable to hip exoskeleton intervention.\nFootdrop presents a unique case with no clear severity correlation. While hip exoskeleton assistance was expected to benefit the compensatory high-stepping pattern, the frequent toe-ground collisions during toe-off introduced substantial gait variability, preventing stable optimization convergence. Detailed discussion is provided in Appendix\nP.2\n.\nThis classification reveals a fundamental principle: pathologies with stable but energy-intensive compensation patterns (Group A) benefit from increasing assistance, while those with unstable compensation mechanisms (Group B) require minimal intervention to preserve their delicate balance strategies. Thus, effective exoskeleton prescription depends not on pathology severity alone, but on the underlying stability-energy trade-off inherent to each condition’s biomechanical adaptation.\nP.2\nThe cause of unclear trend of foot drop is excessive gait variability of foot drop\nFoot drop did not follow a clear trend due to its inherently unstable gait dynamics. This pathology, characterized by insufficient toe clearance from tibialis anterior weakness, leads to frequent toe-ground collisions that substantially increase gait variability. As shown in Figure\nP.11\n, severe foot drop exhibited a coefficient of variation (CV) in CoT nearly four times higher than that of other pathologies. While most conditions maintained consistent CV values across severity levels, foot drop’s variability increased dramatically with severity. This elevated stochasticity in the simulated gait, arising from unpredictable toe-catching events, obscures any systematic relationship between pathology severity and optimal exoskeleton gain.\nFigure P.11:\nThe foot drop pathology exhibits the highest coefficient of variation among all pathology types.\nP.3\nEffect of HEI reward on optimal gain trends\nThe HEI reward (\nr\nHEI\nr_{\\text{HEI}}\n) proved essential for capturing clinically relevant exoskeleton optimization outcomes. For example, calcaneus gait, which should benefit from assistance due to its high hip muscle demands, only showed the expected positive correlation (Group A) when\nr\nHEI\nr_{\\text{HEI}}\nwas included. Without this reward term, calcaneus incorrectly appeared in Group B with decreasing gains, despite maintaining strong linearity. This demonstrates that\nr\nHEI\nr_{\\text{HEI}}\nis a necessary component for revealing the true biomechanical characteristics of pathological gait, ensuring that optimization captures the actual assistance needs.\nFigure P.12:\nOur proposed HEI reward reverses the average optimal gain trend with respect to pathology severity.\nP.4\nR\n2\nR^{2}\nvalues for linear fits of optimal gain across pathology severities\nIn the Table\nP.6\n, we examined the linear relationship between optimal exoskeleton gain and pathology severity by calculating Pearson’s R² values across different random seeds.\nCategory\nSeed\nR\n2\nEquinus\nseed1\n0.972\nseed2\n0.914\nseed3\n0.787\nseed4\n0.941\nWaddling\nseed1\n0.574\nseed2\n0.930\nseed3\n0.991\nseed4\n0.825\nCrouch\nseed1\n0.949\nseed2\n0.611\nseed3\n0.875\nseed4\n0.956\nCategory\nSeed\nR\n2\nCalcaneus\nseed1\n0.944\nseed2\n0.589\nseed3\n0.885\nseed4\n0.845\nFoot drop\nseed1\n0.509\nseed2\n0.711\nseed3\n0.808\nseed4\n0.321\nCalcaneus\n(no\nr\nH\n​\nE\n​\nI\nr_{HEI}\n)\nseed1\n0.819\nseed2\n0.845\nseed3\n0.923\nseed4\n0.708\nTable P.6:\nPearson’s R\n2\nvalues for linearity between optimal exoskeleton gain and pathology severity.\nAppendix Q\nAnthropomorphic Consistency Between Real and Simulated Data\nTo validate the consistency between simulation and experiment, we confirmed that the anthropometric parameters of our simulated character match those of subjects in the real datasets. As shown in Table\nQ.7\n, the model’s height and weight fall within the natural variability of the populations in all referenced datasets, indicating that these datasets are appropriate for use in our comparisons.\nDataset\nHeight (cm)\nWeight (kg)\nn=\nSimulation\n169\n72.9\n–\nKinematics\n(Boo\net al.\n,\n2025\n)\n173.2\n±\n5.6\n173.2\\pm 5.6\n74.1\n±\n12.5\n74.1\\pm 12.5\n120\n120\nGEMS\n(Lim\net al.\n,\n2019b\n)\n173\n±\n8.2\n173\\pm 8.2\n68.4\n±\n6.3\n68.4\\pm 6.3\n5\n5\nGRF\n(Horst\net al.\n,\n2021\n)\n176\n±\n9\n176\\pm 9\n70.7\n±\n12.0\n70.7\\pm 12.0\n350\n350\nTable Q.7:\nComparison between the anthropometric parameters of the simulated character and real human datasets.\nAppendix R\nLimitations of Hill type muscle dynamics.\nThe Hill muscle model, which was originally proposed based on experiments on frog muscle in 1938\n(Hill,\n1938\n)\n, has since been used as the mathematical description of muscle in almost all musculoskeletal simulation studies. In this section, we discuss the limitations of the simulation that arise from the known shortcomings of the Hill muscle model.\nThe contractile force of a Hill-type muscle is formulated as follows:\nf\n=\nf\n​\n(\nl\n,\nl\n˙\n,\na\n)\n=\na\n⋅\nf\nl\n​\n(\nl\n)\n⋅\nf\nv\n​\n(\nl\n˙\n)\n+\nf\np\n​\n(\nl\n)\n,\nf=f(l,\\dot{l},a)=a\\cdot f_{l}(l)\\cdot f_{v}(\\dot{l})+f_{p}(l),\nwhere\nf\nl\nf_{l}\n,\nf\nv\nf_{v}\n, and\nf\np\nf_{p}\nrepresent the force–length, force–velocity, and passive force–length relationships, respectively. The variables\nl\nl\nand\na\na\ndenote the muscle fibre length and activation level. Hill’s original experiments imply that these three factors—activation, length, and shortening velocity—contribute independently to muscle force generation. Despite its wide adoption, several important limitations of the Hill model have been identified.\nInability to reproduce history-dependent behavior.\nReal muscles exhibit clear history-dependent behavior. When a muscle is stretched, the resulting contractile force exceeds the force produced when the muscle is activated directly at the same length. This phenomenon is known as force enhancement following stretch. Conversely, active shortening results in force depression. Because the Hill muscle model is stateless, it cannot reproduce these history-dependent properties\n(Abbott and Aubert,\n1952\n; Nishikawa\net al.\n,\n2012\n)\n.\nThis limitation becomes particularly problematic in the simulation of fast running. During high-speed locomotion, muscles such as the hamstrings and calf muscles are activated while being stretched at ground contact. In real muscles, this stretch-induced force enhancement allows them to sustain substantially higher forces at a lower energetic cost, enabling rapid and efficient running. In contrast, Hill-based simulations underestimate the available force and overestimate metabolic expenditure, thereby producing a significant sim-to-real gap.\nLack of activation-dependent changes in muscle parameters.\nExperimental studies have shown that key muscle parameters, such as optimal fibre length\n(Roszek and Huijing,\n1997\n)\nand maximum shortening velocity\n(Chow and Darling,\n1999\n)\n, depend on the activation level of the muscle. However, in the Hill muscle model these quantities are typically treated as fixed constants.\nAppendix S\nQuantitative Comparison Between Simulated and Experimental Data\nTo evaluate the similarity between the simulated and experimental time-series data, we report three metrics: the normalized root-mean-square error (NRMSE), the Pearson correlation coefficient (\nR\nR\n), and a normalized dynamic time warping (NDTW) distance.\nThe NRMSE quantifies the overall magnitude error between the two signals and is normalized by the range of the experimental data, allowing comparisons across different variables. Lower NRMSE values indicate better amplitude agreement. The\nR\nR\nmeasures the similarity in waveform shape between the signals, independent of scale. Values closer to 1 indicate stronger similarity in the temporal pattern. The NDTW distance assesses temporal alignment between the two signals while allowing local time stretching or compression. The distance is normalized by the amplitude range and warping-path length, so smaller values indicate closer temporal correspondence.\nS.1\nUnassisted Gait\nJoint\nNRMSE\nR\nR\nNDTW\nAnkle Dorsiflexion\n0.563\n0.892\n0.200\nKnee Flexion\n0.185\n0.966\n0.108\nHip Flexion\n0.210\n0.965\n0.068\nHip Abduction\n0.244\n0.777\n0.067\nHip Internal Rotation\n1.436\n-0.443\n1.019\nTable S.8:\nSimilarity metrics between simulated and real joint kinematics.\nMuscle\nNRMSE\nR\nR\nNDTW\nBicep Femoris Longus\n0.799\n0.835\n0.266\nBicep Femoris Short\n0.533\n-0.216\n0.344\nGastrocnemius Lateral Head\n0.531\n0.775\n0.129\nGastrocnemius Medial Head\n0.348\n0.605\n0.057\nSoleus\n0.419\n0.575\n0.086\nGluteus Maximus\n1.296\n0.207\n1.254\nGluteus Medius\n0.283\n0.574\n0.025\nVastus Lateralis\n0.271\n0.634\n0.061\nVastus Medialis\n0.366\n0.649\n0.151\nRectus Femoris\n5.565\n-0.430\n2.040\nTibialis Anterior\n1.780\n0.516\n0.395\nPeroneus Brevis\n0.321\n0.823\n0.097\nPeroneus Longus\n0.223\n0.931\n0.072\nSemitendinosus\n0.596\n0.353\n0.117\nTable S.9:\nSimilarity metrics between simulated and real muscle activations.\nGRF Axis\nNRMSE\nR\nR\nNDTW\nVertical\n0.216\n0.563\n0.057\nMedial-Lateral\n0.159\n0.807\n0.039\nAnterior-Posterior\n0.113\n0.923\n0.028\nTable S.10:\nSimilarity metrics between simulated and real ground reaction forces.\nS.2\nAssisted Gait\nMetric\nWalking\nvelocity (km/h)\nHip flexion\nangle\nHip flexion\nvelocity\nExo assist\nmoment\nExo assist\npower\nNRMSE\n2.0\n0.267\n0.247\n0.210\n0.294\n3.0\n0.241\n0.204\n0.158\n0.290\n4.0\n0.227\n0.187\n0.154\n0.311\n5.0\n0.242\n0.173\n0.111\n0.289\nR\nR\n2.0\n0.896\n0.645\n0.916\n0.328\n3.0\n0.922\n0.775\n0.962\n0.754\n4.0\n0.887\n0.856\n0.932\n0.507\n5.0\n0.867\n0.927\n0.969\n0.737\nNDTW\n2.0\n0.120\n0.067\n0.089\n0.113\n3.0\n0.106\n0.068\n0.058\n0.105\n4.0\n0.074\n0.072\n0.051\n0.129\n5.0\n0.066\n0.078\n0.033\n0.102\nTable S.11:\nSimilarity metrics between simulated and real kinematics and dynamics.\nData Type\nr\nHEI\nr_{\\text{HEI}}\nr\nassist\nr_{\\text{assist}}\nno\nr\nHEI\nr_{\\text{HEI}}\nRMS Assist Moment\n0.964\n0.745\n0.726\nMean Assist Power\n0.462\n-0.180\n-0.082\nMean Resist Power\n0.919\n0.623\n0.589\nTable S.12:\nCorrelation (r) between simulated and real human–exoskeleton interaction.\nAppendix T\nHyperparameters\nT.1\nHuman controller\nReward parameters\nw\ngait\nw_{\\text{gait}}\n1.0\nw\nenergy\nw_{\\text{energy}}\n0.35\nw\narm\nw_{\\text{arm}}\n1.0\nw\nHEI\nw_{\\text{HEI}}\n0.1\nσ\nstep\n\\sigma_{\\text{step}}\n1.581\nσ\nvel\n\\sigma_{\\text{vel}}\n3.162\nσ\nhead\n\\sigma_{\\text{head}}\n4.0\nσ\nsway\n\\sigma_{\\text{sway}}\n0.816\nσ\narm\n\\sigma_{\\text{arm}}\n1.0\nλ\nr\n\\lambda_{r}\n0.018\nλ\nv\n\\lambda_{v}\n0.0105\nλ\nω\n\\lambda_{\\omega}\n0.045\nδ\npelvis\n\\delta_{\\text{pelvis}}\n10\n∘\n10^{\\circ}\nδ\nspine\n\\delta_{\\text{spine}}\n3\n∘\n3^{\\circ}\nδ\nfoot\n\\delta_{\\text{foot}}\n12\n∘\n12^{\\circ}\nk\nenergy\nk_{\\text{energy}}\n0.2\nk\na\n​\nl\n​\ni\n​\nv\n​\ne\nk_{alive}\n0.1\nPPO parameters for PDN\nBatch size\n8192\nl\n​\nr\nlr\n5\n​\ne-5\n5\\text{e-5}\nlog\n⁡\nσ\n\\log\\sigma\n1.0\nγ\n\\gamma\n0.99\nλ\n\\lambda\n0.99\ne\nclip\ne_{\\text{clip}}\n0.2\nk\n​\nl\ncoeff\nkl_{\\text{coeff}}\n0.01\nk\n​\nl\ntarget\nkl_{\\text{target}}\n0.01\nMCN learning parameters\nN\nepoch\nN_{\\text{epoch}}\n5\nl\n​\nr\nlr\n1\n​\ne-4\n1\\text{e-4}\nw\nreg\nw_{\\text{reg}}\n0.01\nw\nIMR\nw_{\\text{IMR}}\n0.1\nT.2\nExoskeleton optimizer\nδ\nh\n\\delta_{h}\n1.0\nλ\ngrad\n\\lambda_{\\text{grad}}\n5\ne-2\nλ\nL1\n\\lambda_{\\text{L1}}\n5\ne-4\nλ\nL2\n\\lambda_{\\text{L2}}\n5\ne-4\nEpoch\n1\ne4\nHidden\n[256, 256]\nl\n​\nr\ninit\nlr_{\\text{init}}\n0.1\nl\n​\nr\nend\nlr_{\\text{end}}\n5\ne-4\nAppendix U\nNomenclature\nU.1\nHuman controller and exoskeleton\nτ\nexo\n\\tau_{\\text{exo}}\nHip assistive torque generated by the exoskeleton controller.\nκ\n\\kappa\nGain scaling the magnitude of exoskeleton torque.\nΔ\n​\nt\n\\Delta t\nTime delay of the delayed-output feedback controller.\nu\n​\n(\nt\n)\nu(t)\nControl signal encoding relative hip motion.\nθ\nr\n,\nθ\nl\n\\theta_{r},\\,\\theta_{l}\nLow-pass filtered right and left hip joint angles.\ns\ns\nFull simulation state.\ns\nskeleton\ns_{\\text{skeleton}}\nState of the musculoskeletal skeleton (kinematics and dynamics).\ns\nmuscle\ns_{\\text{muscle}}\nMuscle-related state (forces, bounds, and dynamic parameters).\ns\nexo\ns_{\\text{exo}}\nExoskeleton state, including recent assistive torques.\nq\nd\nq_{d}\nPD target joint positions produced by PoseNet.\na\na\nMuscle activations applied to the musculoskeletal model.\nτ\n​\n(\na\n)\n\\tau(a)\nJoint torque resulting from muscle activations as computed by the simulation model.\nτ\nPD\n\\tau_{\\text{PD}}\nOutput torque of the PD controller (before subtracting exoskeleton torque).\nτ\nMCN\n\\tau_{\\text{MCN}}\nTarget joint torque fed into the MCN to compute muscle activations.\nU.2\nRL Reward\nr\ntotal\nr_{\\text{total}}\nTotal reinforcement learning reward for the PoseNet.\nr\ngait\nr_{\\text{gait}}\nGait tracking reward composed of step, velocity, head, and sway terms.\nr\nstep\nr_{\\text{step}}\nReward encouraging target step length.\nr\nvel\nr_{\\text{vel}}\nReward encouraging target walking speed.\nr\nhead\nr_{\\text{head}}\nReward encouraging stable head orientation and motion.\nr\nsway\nr_{\\text{sway}}\nReward penalizing abnormal body sway.\nr\narm\nr_{\\text{arm}}\nUpper-arm imitation reward encouraging natural arm posture.\nr\nenergy\nr_{\\text{energy}}\nReward regularizing metabolic energy expenditure.\nr\nHEI\nr_{\\text{HEI}}\nHuman–exoskeleton interaction reward based on resistance minimization.\nh\nh\nCurrent foot position.\nh\ndesired\nh_{\\text{desired}}\nTarget foot position corresponding to the desired step length.\nv\nv\nAverage forward walking velocity of the character.\nv\ndesired\nv_{\\text{desired}}\nTarget forward walking velocity.\nσ\nstep, vel\n\\sigma_{\\text{step, vel}}\nScale parameter for\nr\nstep, vel\nr_{\\text{step, vel}}\nθ\nhead\n\\theta_{\\text{head}}\nHead orientation with respect to the progression and global up directions.\na\nlin\na_{\\text{lin}}\nLinear acceleration of the head.\na\nang\na_{\\text{ang}}\nAngular acceleration of the head.\nk\nalive\nk_{\\text{alive}}\nBaseline term preventing full suppression of the head reward.\nλ\nr\n,\nλ\nv\n,\nλ\nω\n\\lambda_{r},\\,\\lambda_{v},\\,\\lambda_{\\omega}\nThresholds for head angle, linear acceleration, and angular acceleration.\nσ\nhead\n\\sigma_{\\text{head}}\nScale parameter used in the head-stability reward.\nq\nb\nq_{b}\nOrientation angle of body segment\nb\nb\n.\nq\n¯\nb\n\\bar{q}_{b}\nReference body angle from normative gait data.\nδ\nb\n\\delta_{b}\nAllowed deviation threshold for segment\nb\nb\n.\nB\nB\nSet of body segments considered in the sway reward.\nr\nsway\n,\nb\nr_{\\text{sway},b}\nSway reward term for body segment\nb\nb\n.\nq\n^\nj\n\\hat{q}_{j}\nReference joint angle of upper-arm joint\nj\nj\nin the reference motion.\nq\nj\nq_{j}\nCurrent joint angle of upper-arm joint\nj\nj\n.\nσ\narm\n\\sigma_{\\text{arm}}\nScale parameter for arm imitation error.\nP\nk\nP_{k}\nMechanical power applied by the exoskeleton on side\nk\n∈\n{\nL\n,\nR\n}\nk\\in\\{L,R\\}\n.\nU.3\nRL action\nΔ\n​\nϕ\n\\Delta\\phi\nPhase increment controlling advancement or delay of the gait phase.\nΔ\n​\nM\n\\Delta M\nResidual pose displacement applied to the reference pose.\nϕ\nt\n\\phi_{t}\nGait phase at time step\nt\nt\n.\nM\nt\nM_{t}\nTarget pose for the PD controller at time step\nt\nt\n.\nM\nref\nM_{\\text{ref}}\nReference gait motion from which residuals are applied.\n⊕\n\\oplus\nOperator combining a reference pose with a residual displacement.\nU.4\nMCN loss and intramuscular regularization\nL\nMCN\nL_{\\text{MCN}}\nTotal loss for training the muscle coordination network.\nL\nIMR\nL_{\\text{IMR}}\nIntramuscular regularization loss enforcing coherent line-muscle activations.\nw\nreg\nw_{\\text{reg}}\nWeight for activation regularization in the MCN loss.\nw\nIMR\nw_{\\text{IMR}}\nWeight for the intramuscular regularizer term.\nN\ng\nN_{g}\nNumber of anatomical muscle groups.\nG\ng\nG_{g}\nIndex set of line muscles belonging to group\ng\ng\n.\na\n¯\ng\n\\bar{a}_{g}\nMean activation over all line muscles in group\ng\ng\n.\nU.5\nMetabolic Energy\nMEE\n\\mathrm{MEE}\nMetabolic energy expenditure.\nm\ni\nm_{i}\n/\na\ni\na_{i}\nMass / Activation associated with the\ni\ni\n-th muscle.\nα\n,\nβ\n\\alpha,\\>\\beta\nExponent parameters governing effort- and fatigue-like behavior in the MEE model.\nCoT\n\\mathrm{CoT}\nMetabolic cost of transport (energy per unit distance).\nL\nL\nStep length in the PWS evaluation routine.\nf\nf\nStep frequency in the PWS evaluation routine.\nτ\ncyc\n\\tau_{\\text{cyc}}\nTime interval corresponding to one gait cycle.\nBenefit\nImprovement in CoT due to assistance\nU.6\nExoskeleton optimizer\nX\nX\nSimulation parameter space.\nx\ni\nx_{i}\nSampled parameter point from\nX\nX\n.\nℬ\n\\mathcal{B}\nBuffer of parameter–CoT pairs collected from simulation.\nc\nc\nExoskeleton control parameter vector.\nc\n∗\nc^{*}\nOptimal exoskeleton control parameter identified by the optimizer.\nf\n^\nθ\n​\n(\nc\n)\n\\hat{f}_{\\theta}(c)\nSurrogate network predicting CoT from control parameters\nc\nc\n.\nL\nsurrogate\nL_{\\text{surrogate}}\nTraining loss for the surrogate network.\ny\n^\n\\hat{y}\nSurrogate prediction of CoT.\ny\ny\nGround-truth CoT obtained from simulation.\nL\nδ\nh\nL_{\\delta_{h}}\nHuber loss.\n∇\nx\ny\n^\n\\nabla_{x}\\hat{y}\nGradient of surrogate output with respect to its input parameters.\nλ\ngrad\n\\lambda_{\\text{grad}}\nCoefficient for the gradient penalty term.\nλ\nL\n​\n1\n,\nλ\nL\n​\n2\n\\lambda_{L1},\\,\\lambda_{L2}\nCoefficients for\nL\n1\nL_{1}\nand\nL\n2\nL_{2}\nregularization on network weights.\nw\ni\nw_{i}\nIndividual weight parameter of the surrogate network.\ng\nn\ng_{n}\nDiscrete gait parameter (e.g., walking speed) index\nn\nn\n.\nκ\nn\n\\kappa_{n}\nOptimal exoskeleton gain corresponding to gait parameter\ng\nn\ng_{n}\n.\nΔ\n​\nt\nn\n\\Delta t_{n}\nOptimal time delay corresponding to gait parameter\ng\nn\ng_{n}\n.\nλ\n1\n,\nλ\n2\n\\lambda_{1},\\lambda_{2}\nRegularization weights in the final exoskeleton optimization objective.\nM\nM\nNumber of discrete gait parameter settings used in the optimization.\nU.7\nOther Hyperparameters\nBatch size\nNumber of samples per PPO update batch.\nl\n​\nr\nlr\nLearning rate (PPO or MCN, depending on context).\nlog\n⁡\nσ\n\\log\\sigma\nLog standard deviation of the action distribution.\nγ\n\\gamma\nDiscount factor in PPO.\nλ\n\\lambda\nGAE parameter for advantage estimation.\ne\nclip\ne_{\\text{clip}}\nPPO clipping parameter.\nk\n​\nl\ncoeff\nkl_{\\text{coeff}}\nKL penalty coefficient in PPO.\nk\n​\nl\ntarget\nkl_{\\text{target}}\nTarget KL divergence in PPO.\nN\nepoch\nN_{\\text{epoch}}\nNumber of epochs for MCN training.\nw\nIMR\nw_{\\text{IMR}}\nWeight of the IMR term in the MCN loss.\nEpoch\nNumber of training epochs for the surrogate network.\nHidden\nHidden-layer dimensions of the surrogate network MLP.\nl\n​\nr\ninit\n/\nl\n​\nr\nend\nlr_{\\text{init}}/lr_{\\text{end}}\nInitial / Final learning rate of the optimizer schedule.",
    "preview_text": "Exoskeletons show great promise for enhancing mobility, but providing appropriate assistance remains challenging due to the complexity of human adaptation to external forces. Current state-of-the-art approaches for optimizing exoskeleton controllers require extensive human experiments in which participants must walk for hours, creating a paradox: those who could benefit most from exoskeleton assistance, such as individuals with mobility impairments, are rarely able to participate in such demanding procedures. We present Exo-plore, a simulation framework that combines neuromechanical simulation with deep reinforcement learning to optimize hip exoskeleton assistance without requiring real human experiments. Exo-plore can (1) generate realistic gait data that captures human adaptation to assistive forces, (2) produce reliable optimization results despite the stochastic nature of human gait, and (3) generalize to pathological gaits, showing strong linear relationships between pathology severity and optimal assistance.\n\nExo-plore: Exploring Exoskeleton Control space through Human-Aligned Simulation\nGeonho Leem\n1\n,\nJaedong Lee\n2\n,\nJehee Lee\n1\n,\nSeungmoon Song\n3\n,\nJungdam Won\n1†\n1\nSeoul National University,\n2\nHoliday Robotics,\n3\nNortheastern University\nAbstract\nExoskeletons show great promise for enhancing mobility, but providing appropriate assistance remains challenging due to the complexity of human adaptation to external forces. Current state-of-the-art approaches for optimizing exoskeleton controllers require extensive human experiments in which participants must walk for hours, creating a paradox: those who could benefit most from exoskeleton assistance, such as individuals with mobility impairments, are rarely able to participate in such demanding procedures.\nWe present Exo-plore, a simulation framework that combines neuromechanical simulation with deep reinforcement learning to optimize hip exoskeleton assistance without requiring real human experiments. Exo-plore ",
    "is_relevant": true,
    "relevance_score": 6.0,
    "extracted_keywords": [
        "Reinforcement Learning",
        "locomotion",
        "whole body control",
        "fine tune",
        "offline Reinforcement Learning",
        "constrained reinforcement learning",
        "safe reinforcement learning",
        "goal conditioned reinforcement learning",
        "world model"
    ],
    "one_line_summary": "Exo-Plore是一个结合神经力学模拟和深度强化学习的仿真框架，用于优化髋部外骨骼辅助控制，无需真实人体实验，可生成适应辅助力的人类步态数据并推广到病理步态。",
    "detailed_summary": "## 论文《Exo-Plore：通过人体对齐仿真探索外骨骼控制空间》详细摘要\n\n**1. 研究背景和动机**\n外骨骼在增强人体移动能力方面潜力巨大，但提供合适的辅助仍面临挑战，主要源于人体对外部力的复杂适应性。当前最先进的控制器优化方法依赖于**人机闭环优化**，需要参与者进行数小时的行走实验。这形成了一个悖论：最需要外骨骼辅助的群体（如行动不便者）往往无法承受如此繁重的实验过程。因此，亟需一种无需真人实验即可优化外骨骼控制器的仿真框架。\n\n**2. 核心方法和技术创新**\n本文提出了 **Exo-Plore** 框架，它结合了神经力学仿真与深度强化学习。其核心技术创新在于：\n- **人体对齐的步态数据生成器**：通过深度强化学习训练一个肌肉骨骼模型控制器。其奖励函数不仅包含代谢能量最小化，还创新性地引入了基于**阻力最小化假设**的人机交互奖励，使仿真模型能像真人一样主动适应外骨骼辅助，有效弥合了仿真与现实的差距。\n- **随机性感知的代理优化器**：使用拉丁超立方采样收集大量仿真数据，训练一个**神经网络代理模型**来拟合代谢能耗与控制参数之间的平滑、可微映射。该模型结合了梯度惩罚等正则化技术，能在强化学习和仿真的随机性中实现稳定、高效的优化。\n\n**3. 主要实验结果**\n- **仿真验证**：生成的未辅助/辅助步态在关节运动学、肌肉激活、地面反作用力以及辅助力矩/功率缩放关系、代谢降低率等方面，与真实人体实验数据趋势高度一致。\n- **参数优化**：成功为健康步态发现了速度依赖的最优控制参数（例如，最优扭矩延迟随速度增加而减小）。\n- **病理步态泛化**：框架成功推广至五种病理步态（马蹄足、摇摆步、蹲踞步、跟行步、足下垂）。在除足下垂外的四种情况中，均发现**病理严重程度与最优辅助增益之间存在强线性关系**，揭示了不同病理类型对髋部外骨骼辅助的不同需求模式。\n\n**4. 研究意义和价值**\nExo-Plore 首次提供了一个**统一框架**，既能拟合观察到的人体适应数据，又能预测在未观察到的辅助条件下的响应。其核心价值在于：\n- **解决关键悖论**：为无法承受传统人机闭环优化实验的弱势群体（如行动障碍患者）提供了一种可行的、个性化的外骨骼控制器设计途径。\n- **推动仿真应用**：通过系统性的“仿真到现实”匹配方法，证明了高保真神经力学仿真可作为外骨骼控制器优化中**替代或补充昂贵真人实验**的有效工具，具有重要的科研与临床转化潜力。",
    "qa_pairs": [
        {
            "question": "这篇论文的核心创新点是什么，他想解决什么问题，怎么解决的？",
            "answer": "## 论文核心分析：Exo-Plore\n\n### **一、 拟解决的核心问题**\n论文旨在解决外骨骼控制器优化中的一个根本性矛盾：\n- **问题**：当前最先进的外骨骼控制器优化方法依赖于**人在环优化**，需要受试者穿戴设备行走数小时进行实验。这对于最需要外骨骼辅助的**行动不便人群**（如患者）而言，是**不可行或极具负担的**。\n- **悖论**：受益最大的人群，反而最无法参与优化过程。\n\n### **二、 核心创新点**\n论文提出了 **Exo-Plore** 框架，这是一项**方法论上的集成创新**，核心在于构建了一个**与人类行为对齐的仿真环境**，用以替代昂贵且受限的真实人体实验。具体创新体现在以下三个层面：\n\n1.  **“仿真-现实”对齐的步态数据生成器**\n    - **技术创新**：结合了神经肌肉力学仿真与深度强化学习，并引入了**新颖的奖励函数设计**。\n    - **关键组件**：\n        - **能量最小化奖励**：调整代谢能量模型参数，使仿真角色的首选步行速度与人类实验数据匹配。\n        - **人机交互奖励**：基于 **“阻力最小化”假说** 设计 `r_HEI`。该奖励惩罚外骨骼产生的阻力功率，促使仿真角色像真人一样主动调整步态（如增大步长）以更好地利用辅助力，而非被动接受。这是实现真实“适应行为”仿真的关键。\n        - **肌肉内正则化**：确保同一解剖肌肉的不同肌纤维束激活协调，生成更生理合理的肌肉激活模式。\n\n2.  **面向仿真的、随机性感知的外骨骼优化器**\n    - **技术创新**：放弃了样本效率高但扩展性差的传统优化方法（如贝叶斯优化），转而利用仿真数据量大的优势，采用**神经网络代理模型**。\n    - **关键设计**：\n        - 使用**拉丁超立方采样**收集数据，避免网格采样的混叠效应。\n        - 在代理模型损失函数中加入**梯度惩罚项**，确保学习到的能耗-参数关系曲面平滑、可微，从而支持稳定、高效的基于梯度的参数优化。\n        - 此设计专门用于克服深度强化学习策略和仿真本身固有的**随机性**，提取出稳定的优化趋势。\n\n3.  **框架的泛化能力：应用于病理步态**\n    - **价值创新**：首次将此类仿真优化框架系统性地扩展到**五种常见病理步态**。通过调整肌肉模型参数模拟不同严重程度的病理状态，并分别训练Exo-Plore模型。\n    - **重要发现**：优化出的外骨骼辅助增益与病理严重程度在四种步态中呈现**强线性关系**，并可根据 biomechanical adaptation 分为两类，揭示了不同病理对髋部辅助的**根本性需求差异**。\n\n### **三、 解决方案路径**\nExo-Plore通过一个清晰的**两步流程**解决问题：\n\n```mermaid\ngraph TD\n    A[问题: 患者无法承受人在环优化] --> B(第一步: 构建人类对齐的仿真器)\n    B --> C[“步态数据生成器<br/>（DRL + 神经肌肉模型）”]\n    C --> D[“关键: 精心设计的奖励函数<br/>（能量最小化 + 人机交互）”]\n    D --> E{“产出: 与真实实验趋势一致的<br/>辅助/非辅助步态数据”}\n    \n    E --> F(第二步: 在仿真中进行高效优化)\n    F --> G[“外骨骼优化器<br/>（代理神经网络 + 梯度优化）”]\n    G --> H[“关键: 处理仿真随机性，<br/>获得平滑的能耗曲面”]\n    H --> I[“产出: 最优外骨骼控制参数<br/>（增益κ, 延迟Δt）”]\n    \n    I --> J[“最终成果: <br/>1. 为健步者发现速度依赖的最优参数<br/>2. 为病理步态量化辅助需求与严重度的关系”]\n```\n\n### **四、 实际价值与意义**\n- **临床前设计工具**：为面向患者的外骨骼控制器提供了**低成本、无风险、可扩展的预优化与设计工具**，有望加速个性化辅助技术的临床应用。\n- **机理研究平台**：提供了一个可控的“数字孪生”环境，用于深入研究人类适应外骨骼辅助的**生物力学与神经控制机理**。\n- **方法学贡献**：为基于仿真的辅助设备优化设立了一个新范式，强调 **“仿真-现实”对齐** 和 **处理仿真不确定性** 的重要性，对机器人学、生物力学和康复工程领域具有借鉴意义。\n\n**局限性**：论文明确指出，其预测的有效性最终需要**真实人体实验验证**，且仿真模型在肌肉动力学、个性化运动控制等方面仍有简化。然而，它为解决“优化悖论”提供了一个强大且富有前景的替代方案。",
            "timestamp": "2026-02-03T15:54:32.960481",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "基于他的前作，梳理这个方向的整个发展脉络，每一步相比于之前的工作都改进了什么，着重于几个不同的发展方向。",
            "answer": "## 论文《Exo-Plore: Exploring Exoskeleton Control Space through Human-aligned Simulation》技术脉络与发展方向分析\n\n本文提出的 **Exo-Plore** 框架是外骨骼控制器优化领域的一个重要进展。要理解其创新性，需要将其置于该领域（特别是基于仿真的方法）的发展脉络中。其核心前作和关键技术路径主要围绕 **“人机交互仿真”** 和 **“数据驱动的控制器学习”** 两个方向演进。\n\n以下是基于本文及相关引文梳理出的发展脉络、关键改进点及不同发展方向：\n\n### 发展脉络与关键改进\n\n整个方向的发展可以概括为：从**基于实验的优化** -> **引入仿真作为辅助** -> **构建高保真、可预测的仿真框架**。Exo-Plore 处于第三阶段的尖端。\n\n#### 第一阶段：基于真人实验的优化 (Human-in-the-loop Optimization, HILO)\n*   **代表工作**: Zhang et al. (2017), Slade et al. (2022) 等。\n*   **核心思想**: 将穿戴者置于优化循环中，直接测量其生理指标（如代谢成本 CoT），使用贝叶斯优化等方法在线调整外骨骼控制参数。\n*   **优点**: 结果直接反映真人响应，个性化程度高。\n*   **局限性 (催生后续研究的原因)**:\n    1.  **实验成本极高**: 需要参与者长时间行走，迭代次数有限（通常<30次）。\n    2.  **人群局限性**: 行动不便的患者难以承受此过程，形成了“最需要帮助的人最难参与优化”的悖论。\n    3.  **探索效率低**: 参数空间探索受限于真人实验的耗时和疲劳。\n\n#### 第二阶段：引入神经力学仿真作为补充\n*   **代表工作**: Song et al. (2021), Luo et al. (2024) 等。\n*   **核心思想**: 构建肌肉-骨骼模型与控制器耦合的仿真环境，预测人体对外部助力的适应性，以减少对真人实验的依赖。\n*   **关键挑战**: **控制策略的设计**是可靠预测的瓶颈。\n*   **两个子方向的发展**:\n    1.  **基于生物启发式控制器**:\n        *   **代表**: Song and Geyer (2015, 2017), Bersani et al. (2023)。\n        *   **方法**: 设计基于反射、中枢模式发生器等生物原理的手工控制器。\n        *   **改进点**: 能在特定场景下生成类人步态，提供了可解释性。\n        *   **局限性**: 泛化能力有限，难以预测对新型外骨骼助力或病理步态的适应，且调参复杂。\n    2.  **基于深度强化学习 (Deep RL)**:\n        *   **代表**: Lee et al. (2019), Park et al. (2022, 2023)。\n        *   **方法**: 使用DRL训练控制策略，通常需要**模仿参考运动捕捉数据**来管理巨大的状态和动作空间。\n        *   **改进点**: 减少了对手工控制假设的依赖，能生成更丰富、多样的运动，泛化潜力更大。\n        *   **局限性**:\n            *   **“仿真-现实”差距**: 在肌肉激活、代谢能量、对外部助力的适应性等关键指标上缺乏验证。\n            *   **依赖模仿学习**: 如 Luo et al. (2024) 的工作依赖于模仿策略，限制了其对未见条件（如新的助力模式）的适应能力，仿真结果与真实人体运动趋势不符。\n\n#### 第三阶段：构建面向外骨骼优化、人类行为对齐的高保真仿真框架 (Exo-Plore 的定位)\nExo-Plore 整合并超越了前两个阶段，其核心改进在于**系统性地解决了“仿真-现实”对齐问题**，并专门为**外骨骼控制器优化**任务设计。\n\n*   **相比于第二阶段基于生物启发控制器的工作**:\n    *   **改进点1: 数据驱动的自适应能力**。不再依赖固定的、手工调参的生物模型，而是通过DRL学习出能适应不同助力水平和肌肉损伤的策略，动态响应能力更强。\n    *   **改进点2: 优化流程的自动化与高效性**。将仿真生成的步态数据与下游的优化器无缝衔接，实现了从数据生成到参数寻优的全自动流程。\n\n*   **相比于第二阶段基于Deep RL的仿真工作**:\n    *   **改进点1: 从“模仿”到“预测与对齐”**。这是最核心的进步。Exo-Plore 不满足于模仿特定运动，而是通过精心设计的奖励函数，使其生成的步态数据**匹配真实人类实验观察到的宏观行为趋势**。\n        *   **代谢能量对齐**: 通过算法自动调整代谢能量模型参数 `(α, β)`，使仿真角色的**首选步行速度 (PWS)** 和 **速度-代谢成本曲线** 与人类数据一致。\n        *   **人机交互对齐**: 创新性地提出 **“人机交互奖励”** ，基于 **“阻力最小化假设”** 。这使得仿真角色能像真人一样，主动调整步态（如增大步长）以更好地利用外骨骼助力，复现了助力力矩/功率随控制参数变化的实验趋势。\n    *   **改进点2: 面向优化的稳定性设计**。针对DRL和仿真的随机性会导致CoT景观崎岖不平、难以优化的问题，Exo-Plore 引入了**代理网络**。\n        *   用神经网络替代高斯过程作为代理模型，**解决了大数据下的可扩展性问题**。\n        *   在代理网络损失函数中加入**梯度惩罚项**，确保学习到的CoT景观平滑、可微，从而支持稳定、高效的梯度优化。\n    *   **改进点3: 向病理步态的泛化与机理探索**。不仅验证了在健康步态上的有效性，还将框架扩展到五种病理步态。其重要发现是：**最优助力增益与病理严重程度在多数情况下呈强线性关系**，并揭示了不同病理类型（稳定但耗能 vs. 不稳定）对外骨骼助力的根本性不同需求，这为个性化处方提供了仿真依据。\n\n### 着重发展的几个不同方向\n\n基于上述脉络，该领域目前主要沿着以下几个方向深化：\n\n1.  **仿真保真度与对齐方向**:\n    *   **目标**: 不断缩小“仿真-现实”差距，使仿真预测在生物力学（关节角度、力矩、肌肉激活）、生理（代谢能量）和行为（适应策略）多个层面都与真人高度一致。\n    *   **Exo-Plore的贡献**: 提出了系统化的“仿真-现实”匹配方法（PWS匹配、HEI奖励），并进行了多指标定量验证（见附录S）。\n    *   **未来挑战**: 纳入更真实的肌肉模型（如克服Hill模型局限）、个体化的神经肌肉控制特性（如协同肌控制）。\n\n2.  **高效优化与决策方向**:\n    *   **目标**: 在获得可靠仿真数据的基础上，发展更高效、鲁棒的优化算法，为不同用户、不同任务快速寻找最优或个性化控制器参数。\n    *   **Exo-Plore的贡献**: 提出了“DRL数据生成 + 神经网络代理模型优化”的范式，克服了传统HILO的耗时问题和纯仿真优化的随机性问题。\n    *   **未来挑战**: 在线自适应优化、多目标优化（权衡代谢、速度、舒适度）、以及如何将仿真中寻优的参数安全、有效地迁移到真人设备上。\n\n3.  **泛化与个性化方向**:\n    *   **目标**: 使仿真框架能够覆盖多样化的用户群体（不同年龄、体型、病理条件）和运动场景（走、跑、上下楼）。\n    *   **Exo-Plore的贡献**: 通过随机化肌肉参数训练，成功将框架泛化到多种病理步态，并发现了病理严重程度与最优助力之间的规律，迈出了从“通用仿真”到“个性化预测”的关键一步。\n    *   **未来挑战**: 构建更丰富的病理和人群模型库，研究如何用少量真人数据对通用仿真模型进行微调，实现真正的“个人数字孪生”。\n\n4.  **控制器架构与交互机理方向**:\n    *   **目标**: 不仅优化参数，也探索更优的外骨骼控制器架构和人机交互机理。\n    *   **Exo-Plore的贡献**: 虽然本文主要优化延迟反馈控制的参数 `(κ, Δt)`，但其框架本身是一个测试平台。其关于HEI奖励的研究，从计算模型的角度支持了“人类主动适应以减少阻力”的行为假设，加深了对人机交互机理的理解。\n    *   **未来挑战**: 探索更复杂的控制器（如基于模型预测控制、神经网络控制器），并利用仿真研究人体长期学习与适应的神经机制。\n\n**总结**：Exo-Plore 代表了外骨骼仿真优化领域从“**能否仿真**”到“**仿真是否可靠且有用**”的范式转变。它通过**仿真-现实对齐**和**面向优化的稳定学习**两大核心技术，构建了一个既能复现实验现象又能预测未知场景的有效工具，特别是为难以进行传统实验的患者群体提供了一种全新的控制器开发途径。未来的发展将在其开创的“高保真、可泛化、支持优化”的仿真框架基础上，向更高精度、更强个性化、更复杂交互",
            "timestamp": "2026-02-03T15:55:48.026514",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他的前作有哪些？使用表格仔细讲讲他的每篇前作，他和前作的区别是什么，主要改善是什么？着重于具体相比于之前文章的改动",
            "answer": "## 论文前作分析\n\n根据论文内容，作者团队（特别是Jungdam Won、Jehee Lee、Jaedong Lee等）在**神经力学模拟、深度强化学习（Deep RL）控制肌肉骨骼模型、以及步态生成**方面有一系列重要的前期工作。这些工作是构建**Exo-plore**框架的基础。\n\n以下是主要相关前作的详细分析：\n\n### 前作汇总表\n\n| 论文标题 | 发表年份/会议 | 核心贡献 | 与本文（Exo-plore）的主要区别与改进 |\n| :--- | :--- | :--- | :--- |\n| **Scalable muscle-actuated human simulation and control** | 2019, SIGGRAPH | 1. **首次大规模**将深度强化学习应用于驱动**164块肌肉**的复杂肌肉骨骼模型。<br>2. 提出了**肌肉协调网络（MCN）**，用于将目标关节力矩映射到肌肉激活。<br>3. 实现了多样化的运动技能（走、跑、跳）。 | **区别**：专注于**生成**多样化的运动，而非**预测**人类对外部干预（如外骨骼）的适应性反应。<br>**改进**：Exo-plore 继承了其肌肉骨骼模型和MCN架构，但**核心目标不同**。Exo-plore 旨在模拟人类在辅助下的**适应性**，并优化外骨骼控制器，这需要新的奖励函数和仿真到现实的匹配方法。 |\n| **Generative GaitNet** | 2022, SIGGRAPH | 1. 提出了一个**生成式框架**，可以合成与给定**肌肉骨骼条件**（如无力、挛缩）相对应的步态。<br>2. 使用**条件化深度RL策略**，根据输入的病理参数生成相应的步态模式。<br>3. 实现了从正常步态到多种病理步态的连续过渡。 | **区别**：主要是一个**步态数据生成器**，用于“如果人有某种肌肉状况，他会怎么走”。它没有集成外骨骼模型，也没有优化外骨骼参数。<br>**改进**：Exo-plore **直接借鉴并扩展了Generative GaitNet的框架**作为其“步态数据生成器”部分。关键改进在于：<br>1. **引入了外骨骼状态和交互**：在状态(`s_exo`)和奖励(`r_HEI`)中加入了外骨骼模型。<br>2. **新的奖励函数**：增加了基于“损失厌恶”原理的**人机交互奖励（HEI）**，以模拟人类主动利用/适应外骨骼辅助的行为，这是实现仿真到现实匹配的关键。 |\n| **Bidirectional GaitNet** | 2023, SIGGRAPH | 在Generative GaitNet基础上，实现了**双向预测**：既可以从肌肉条件生成步态，也可以从观察到的步态反推潜在的肌肉骨骼异常。 | **区别**：侧重于步态与病理条件的**双向映射诊断**，仍然不涉及外骨骼辅助的优化。<br>**改进**：Exo-plore 使用了类似的**条件化训练思路**，但条件不仅是病理参数，还包括**外骨骼控制参数（κ, Δt）和步速**。目标是从这些条件**预测**代谢消耗（CoT）并找到最优解，而非进行病理诊断。 |\n| **MAGNET: Muscle Activation Generation Networks for diverse human movement** | 2025, SIGGRAPH | 进一步改进了肌肉激活生成网络，旨在生成更自然、更多样化的人类运动对应的肌肉激活模式。 | **区别**：聚焦于**肌肉激活模式生成**的普适性和质量提升，是底层技术模块的演进。<br>**改进**：Exo-plore 可能受益于其更先进的肌肉控制技术，但论文核心创新点在于**将这类生成模型置于一个“仿真-优化”闭环中**，用于解决外骨骼控制这一特定应用问题。 |\n| **Deep reinforcement learning for modeling human locomotion control in neuromechanical simulation** (Song et al.) | 2021, J Neuroeng Rehabil | 1. 一篇重要的相关领域综述/方法论文，阐述了用Deep RL构建神经力学模拟控制器的框架。<br>2. 指出了单纯模仿参考运动（mocap数据）的局限性，并提出了结合任务目标进行优化的方向。 | **区别**：该工作更偏向于**方法论探讨**和框架提出，而非一个完整的、针对外骨骼优化的端到端系统。<br>**改进**：Exo-plore 是该方法论的一个**具体、深入的应用实例**。它直接回应了该文中提到的挑战——如何预测在**未见过的辅助条件**下的人类反应。Exo-plore 通过**HEI奖励**和**仿真到现实匹配算法**，实现了对适应性行为的预测，而不仅仅是模仿已有数据。 |\n\n---\n\n## 与前作的核心区别与主要改进（着重具体改动）\n\n相比于之前的工作，Exo-plore 做出了以下**具体而关键的改动**：\n\n### 1. **研究目标的根本转变：从“生成”到“预测与优化”**\n- **前作（如Generative GaitNet）**：目标是**生成**符合特定生理条件的步态。这是一个“开环”过程：输入条件，输出步态。\n- **Exo-plore**：目标是**预测**人类在特定外骨骼辅助参数下的适应性步态及代谢反应，并**优化**这些参数以最小化代谢消耗。这是一个“闭环”优化系统。这是最根本的区别。\n\n### 2. **模型输入的扩展：集成外骨骼动力学**\n- **具体改动**：在强化学习智能体的**状态空间(`s`)** 中，显式加入了 `s_exo`，即外骨骼状态（如近期施加在髋关节的辅助力矩历史）。这使得控制策略能够感知并响应外骨骼的作用。\n- **在控制器中的体现**：在PD控制器计算出的关节期望力矩 `τ_PD` 中，**减去**外骨骼提供的力矩 `τ_exo`，再将净力矩 `τ_MCN` 输入给MCN去计算肌肉激活（公式19）。这**物理上正确**地模拟了外骨骼分担部分负荷的情况。\n\n### 3. **奖励函数的核心创新：人机交互奖励（`r_HEI`）**\n- **具体改动**：引入了全新的奖励项 `r_HEI`，其设计基于 **“阻力最小化”假设**，灵感来源于行为经济学的“损失厌恶”原理。\n    ```math\n    r_{\\text{HEI}} = 1 + \\frac{1}{\\kappa} \\sum_{k \\in \\{L,R\\}} \\min(0, P_k)\n    ```\n    其中 `P_k` 是外骨骼施加在人体上的机械功率。**只有当外骨骼做负功（阻碍人体运动）时，奖励才会降低**。\n- **改进意义**：这是实现“仿真到现实匹配”的**关键**。没有这个奖励，模拟人物只会被动地最小化代谢能量（`r_energy`），而不会主动调整步态（如增大步长）去更好地“利用”外骨骼的辅助力。实验表明（图6，7），只有加入 `r_HEI`，模拟的辅助力矩缩放、代谢下降率等趋势才能与真实人体实验数据高度相关。\n\n### 4. **仿真到现实（Sim-to-Real）的主动对齐方法**\n- **具体改动**：提出了两套算法（Algorithm 1 & 2），用于校准仿真模型使其符合人类基础生物力学规律。\n    1.  **代谢能量模型（MEE）参数校准**：通过网格搜索 `(α, β)` 参数对，选择能使模拟人物的**首选步行速度（PWS）** 与真实人类数据匹配的那一组 `(α=1.5, β=1.0)`。\n    2.  **外骨骼适应性行为校准**：通过上述 `r_HEI` 奖励，使模拟人物在辅助下表现出的**辅助力矩随延迟变化的缩放关系**与实验数据一致。\n- **改进意义**：前作虽然能生成看似合理的步态，但未经过如此系统性的、以关键生物力学指标为目标的校准。这一步确保了优化出的外骨骼参数具有**转移到现实世界的潜力**。\n\n### 5. **构建并利用替代模型进行高效优化**\n- **具体改动**：由于仿真生成数据成本低但仍有噪声，Exo-plore 没有使用HILO中常见的样本高效但扩展性差的贝叶斯优化，而是**用大量仿真数据训练一个神经网络替代模型（MLP）** 来拟合“控制参数 -> CoT”的映射。\n- **技术增强**：在训练替代模型时，采用了**Huber损失**（抗噪声）、**梯度惩罚**（保证预测景观平滑）、**拉丁超立方采样**（避免混叠效应）等技术，确保了优化过程的稳定性和效率（图8，附录F）。\n- **改进意义**：这使得Exo-plore能够进行快速、梯度辅助的优化，探索整个参数空间，从而发现如“最优扭矩延迟随步速增加而减小”等规律。\n\n### 6. **应用于病理步态的泛化与发现**\n- **具体改动**：将框架扩展到五种病理步态（马蹄足、鸭步、蹲踞步、跟行步、足下垂）。通过调整肌肉的**最大等长力（",
            "timestamp": "2026-02-03T15:57:03.091381",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文提出了哪些关键技术方法，请列表格具体详细说明技术细节，需要包含具体的数学原理推导，以及具体参数。",
            "answer": "## Exo-Plore 关键技术方法分析\n\nExo-Plore 框架的核心是通过**神经力学仿真**与**深度强化学习**相结合，在仿真中优化外骨骼控制器，从而避免耗时的真人实验。其关键技术方法可归纳为以下三个主要部分，每个部分都包含具体的数学原理和参数细节。\n\n### 1. 步态数据生成器\n此部分的目标是训练一个能够模拟人类在有无外骨骼辅助下步态适应行为的“数字人”控制器。\n\n| 组件 | 技术细节与数学原理 | 具体参数/设计 |\n| :--- | :--- | :--- |\n| **1.1 人体控制器架构** | 控制器由三个模块组成：<br>1. **姿态网络**：输入状态 `s`，输出PD控制器的目标关节位置 `q_d`。<br>2. **PD控制器**：根据 `q_d` 和当前关节位置 `q` 计算关节扭矩 `τ_PD`。<br>3. **肌肉协调网络**：将净需求扭矩 `τ_MCN = τ_PD - τ_exo` 映射为164块肌肉的激活度 `a`。 | - **状态 `s`**：包含骨骼运动学（349维）、肌肉相关项（59维）、外骨骼辅助扭矩历史（64维）。<br>- **动作 `A`**：包含相位增量 `Δφ` 和相对于参考运动的姿态残差 `ΔM`。<br>- **参考运动 `M_ref`**：来自 Generative GaitNet 的正常步态数据。 |\n| **1.2 强化学习奖励函数** | 总奖励 `r_total` 是四个加权项的线性组合，用于引导智能体生成符合人类生理和适应行为的步态：<br>`r_total = w_gait * r_gait + w_energy * r_energy + w_arm * r_arm + w_HEI * r_HEI` | - **`r_gait`**：鼓励达到目标步长 (`r_step`)、速度 (`r_vel`)，并稳定头部 (`r_head`) 和身体摆动 (`r_sway`)。具体为高斯形式：`r_step = exp(-(‖h - h_desired‖/σ_step)^2)`。<br>- **`r_energy`**：正则化代谢能耗，`r_energy = 1 - k_energy * MEE`。<br>- **`r_arm`**：模仿参考运动的上臂姿态。<br>- **`r_HEI`**：**人机交互奖励**，核心创新点，基于“阻力最小化”假设。 |\n| **1.3 人机交互奖励** | 这是实现“仿真-现实对齐”的关键。其数学形式基于行为经济学中的“损失厌恶”原理，鼓励模拟人主动利用辅助，避免抵抗功率：<br>`r_HEI = 1 + (1/κ) * Σ_{k∈{L,R}} min(0, P_k)`<br>其中，`P_k` 是外骨骼施加在左/右髋关节的机械功率（`P = τ * ω`）。当外骨骼提供阻力 (`P_k < 0`) 时，奖励值降低。 | - **设计动机**：模拟人类会主动调整步态（如增大步长）以更好地利用辅助扭矩，而非被动接受。这与真实实验观察到的“辅助扭矩随延迟增加而增大”的现象一致。<br>- **对比方案**：论文对比了“辅助最大化”奖励 (`r_assist ∝ max(0, P_k)`) 和“无HEI奖励”方案，证明 `r_HEI` 在重现实验趋势上最有效。 |\n| **1.4 代谢能量模型** | 代谢能量消耗率 `MEE` 的计算模型决定了能量优化行为，其参数需校准以匹配人类的优选步行速度：<br>`d/dt MEE(a; α, β) = Σ_i (m_i^α * a_i^β)`<br>其中 `m_i` 和 `a_i` 分别是第 `i` 块肌肉的质量和激活度。 | - **参数确定**：通过算法1和2搜索，使仿真PWS匹配真实人类PWS (1.25 m/s)。最终选定 `(α, β) = (1.5, 1.0)`。<br>- **意义**：`α` 主导“努力型”行为，`β` 主导“疲劳型”行为。此参数对生成符合生理的能耗-速度曲线至关重要。 |\n| **1.5 肌肉协调网络训练** | MCN 通过监督学习训练，损失函数包含扭矩匹配、激活度正则化和**肌肉内正则化**：<br>`ℒ_MCN = ‖τ_MCN - τ(a)‖² + w_reg * ‖a‖² + w_IMR * ℒ_IMR` | - **肌肉内正则化 `ℒ_IMR`**：强制同一解剖肌肉（由多条线肌肉表示）的各线段激活度保持一致。公式为对偏离组平均激活度超过0.1的线段进行惩罚：`ℒ_IMR = Σ_g Σ_{j∈𝒢_g} 1(|a_j - ā_g| > 0.1) * (a_j - ā_g)²`。<br>- **目的**：防止出现生理上不可能的单条线肌肉独立激活，提升肌肉激活模式的真实性。 |\n\n### 2. 仿真-现实对齐方法\n此部分确保步态生成器产生的数据与真实人类实验数据在关键指标上一致。\n\n| 关键技术 | 数学原理与实现方法 | 具体参数/目标 |\n| :--- | :--- | :--- |\n| **2.1 代谢成本对齐** | **目标**：使仿真的“步行速度-运输成本”曲线及优选步行速度与人类数据一致。<br>**方法**：<br>1. **算法1**：在候选 `(α, β)` 参数空间中搜索，对每组参数训练一个生成器 `G_i`。<br>2. **算法2 (evalPWS)**：对每个训练好的生成器，在不同步长 `L` 和步频 `f` 组合下进行仿真滚动，计算CoT，将CoT最低对应的速度 `(L*f)` 定为该生成器的PWS。<br>3. 选择使仿真PWS `v_sim` 最接近真实PWS `v_real` 的 `(α, β)`。 | - **输入**：真实人类PWS (`v_real = 1.25 m/s`)。<br>- **输出**：最优代谢模型参数 `(α*, β*) = (1.5, 1.0)`。<br>- **评估指标**：CoT = (一个步态周期内的总代谢能) / 步长 `L`。 |\n| **2.2 人机交互行为对齐** | **目标**：重现人类在辅助下主动调整步态以利用外骨骼扭矩的现象。<br>**方法**：通过引入基于“阻力最小化”假设的 `r_HEI` 奖励（见1.3），使仿真人物在遇到外骨骼阻力时调整步态以减少阻力，在获得辅助时调整步态以增大辅助功率。 | - **验证指标**：比较仿真与实验在以下方面的趋势和相关性：<br>  &nbsp;&nbsp;• 均方根辅助力矩随步行速度和延迟参数的变化。<br>  &nbsp;&nbsp;• 平均辅助功率和平均阻力功率。<br>  &nbsp;&nbsp;• 最大代谢降低率。 |\n\n### 3. 外骨骼优化器\n此部分利用生成器产生的大量仿真数据，高效、平滑地优化外骨骼控制参数 `(κ, Δt)`。\n\n| 关键技术 | 数学原理与实现方法 | 具体参数/设计 |\n| :--- | :--- | :--- |\n| **3.1 替代网络** | **问题**：直接从仿真数据中优化参数因数据噪声和随机性而不稳定。<br>**解决方案**：训练一个多层感知机作为替代模型，学习从控制参数 `(κ, Δt)` 和步态参数到CoT的平滑映射 `ŷ = f_θ(c; g)`。 | - **网络结构**：MLP，隐藏层维度 `[256, 256]`。<br>- **训练数据**：使用**拉丁超立方采样** 在参数空间 `𝒳` 中采样约60k个点，通过仿真得到其CoT值 `y`。<br>- **优点**：相比高斯过程，神经网络能高效处理大规模数据，内存复杂度低。 |\n| **3.2 替代网络损失函数** | 损失函数设计旨在获得平滑、可微且稳健的CoT景观：<br>`ℒ_surrogate = ℒ_δ_h(ŷ, y) + λ_grad * ‖∇_x ŷ‖₂² + λ_L1 * Σ_i |w_i| + λ_L2 * Σ_i w_i²` | - **Huber损失 `ℒ_δ_h`**：减少仿真异常值的影响 (`δ_h = 1.0`)。<br>- **梯度惩罚项 `",
            "timestamp": "2026-02-03T15:58:14.822010",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他使用了哪些评价指标与数据集，列表格具体讲讲他的评价指标的细节与数据集的细节",
            "answer": "## 论文评价指标与数据集分析\n\n### 一、 主要评价指标\n\n论文使用了多层次的评价指标，以验证其仿真框架（Exo-plore）在生成真实步态、优化外骨骼控制参数以及泛化到病理步态方面的有效性。这些指标可分为三大类：**生物力学匹配度指标**、**优化性能指标**和**统计相关性指标**。\n\n#### 1. 生物力学匹配度指标（Sim-to-Real Validation）\n这些指标用于量化仿真结果与真实人体实验数据之间的相似性，是验证框架有效性的核心。\n\n| 指标类别 | 具体指标 | 计算方式与细节 | 目的 |\n| :--- | :--- | :--- | :--- |\n| **运动学** | 关节角度时间序列 | 对比踝、膝、髋关节在一个步态周期内的角度曲线。论文使用**归一化均方根误差（NRMSE）**、**皮尔逊相关系数（R）** 和**归一化动态时间规整距离（NDTW）** 进行量化（见附录S）。 | 验证仿真步态在运动模式上是否与人类步态一致。 |\n| **动力学** | 肌肉激活时间序列 | 对比关键下肢肌肉（如股直肌、腓肠肌、比目鱼肌等）的激活曲线。同样使用NRMSE、R、NDTW进行量化。论文强调**激活时序和模式**比绝对值更重要。 | 验证神经肌肉控制策略的生理合理性。 |\n| | 地面反作用力时间序列 | 对比垂直、前后、内外方向的GRF曲线。使用NRMSE、R、NDTW量化。 | 验证步态动力学和足地交互的真实性。 |\n| | 外骨骼辅助力矩与功率 | 对比外骨骼施加的髋关节辅助力矩和机械功率曲线。使用NRMSE、R、NDTW量化。 | 验证在辅助条件下，人机交互动力学的真实性。 |\n| **代谢与能量** | 代谢能耗运输成本 | **CoT = 代谢总能耗 / 行走距离**。这是优化的核心目标函数。论文通过调整代谢能耗模型参数，使仿真的 **“步行速度-CoT”曲线** 及**首选步行速度（PWS）** 与实验数据匹配。 | 确保仿真的能量消耗特性与人类一致，是优化有效的前提。 |\n| | 代谢降低率 | **MRR = (无辅助CoT - 有辅助CoT) / 无辅助CoT**。用于评估外骨骼辅助的最大效益，并与实验值对比。 | 验证仿真能准确预测外骨骼的实际节能效果。 |\n| **人机交互** | RMS辅助力矩、平均辅助功率、平均阻力功率 | 计算不同步行速度和外骨骼控制参数下，辅助力矩的均方根、平均正功率（辅助）和平均负功率（阻力）。计算与实验数据的**皮尔逊相关系数（r）**。 | 验证提出的“人机交互奖励”能否复现人类主动适应外骨骼的行为趋势（如为获得更大辅助而调整步态）。 |\n\n#### 2. 优化性能指标\n这些指标用于评估外骨骼控制参数优化过程的有效性和结果。\n\n| 指标类别 | 具体指标 | 计算方式与细节 | 目的 |\n| :--- | :--- | :--- | :--- |\n| **优化景观平滑度** | 代理网络预测的CoT景观 | 对比**原始仿真数据**、**使用Huber损失和拉丁超立方采样的代理网络**、以及使用MSE损失或均匀采样的替代方案的CoT景观平滑度。 | 验证所提方法能生成平滑、可微的CoT景观，以支持稳定、高效的梯度优化。 |\n| **最优参数趋势** | 最优控制参数（κ, Δt） | 对于健康步态，分析最优扭矩**延迟（Δt）** 随**步行速度**变化的趋势。对于病理步态，分析最优**增益（κ）** 随**病理严重程度**变化的线性关系（计算R²）。 | 验证优化结果符合生物力学直觉（如速度越快，辅助需越及时），并能揭示病理特异性规律。 |\n\n#### 3. 统计相关性指标\n| 指标 | 应用场景 | 细节 |\n| :--- | :--- | :--- |\n| **皮尔逊相关系数** | 广泛用于时间序列（运动学、动力学）和标量（人机交互指标）的相似性比较。 | 衡量仿真与实验数据波形形状的相似性，值越接近1越好。 |\n| **决定系数** | 用于病理步态分析，衡量最优外骨骼增益与病理严重程度之间的线性关系强度。 | R²值高表明存在强线性趋势，有助于对病理类型进行分类（如哪些病理需要更多/更少辅助）。 |\n| **变异系数** | 用于分析病理步态的稳定性，特别是足下垂步态。 | **CV = 标准差 / 均值**。足下垂的高CV值解释了其优化趋势不清晰的原因——步态变异过大导致优化不稳定。 |\n\n### 二、 使用的数据集\n论文没有创建新的实验数据集，而是广泛引用了已发表的、权威的生物力学实验数据集进行对比验证。这增强了其仿真结果的可信度。\n\n| 数据集名称 / 来源 | 数据类型 | 论文中的用途 | 关键细节 |\n| :--- | :--- | :--- | :--- |\n| **Boo et al. (2025) - Gait120** | 1. 健康成人关节运动学（角度）<br>2. 表面肌电信号 | 1. 验证无辅助条件下仿真步态的运动学真实性（图2）。<br>2. 验证肌肉激活模式的生理合理性（图3）。 | - 样本量：n=120名健康成人。<br>- 数据提供了全面的步态周期数据。 |\n| **Lim et al. (2019b) - GEMS外骨骼研究** | 1. 佩戴髋部外骨骼时的运动学（髋角、角速度）。<br>2. 外骨骼动力学（辅助力矩、功率）。<br>3. 代谢消耗数据。 | 1. 验证有辅助条件下仿真与实验趋势的一致性（图5）。<br>2. 验证人机交互奖励（`r_HEI`）复现实验趋势的能力（图6）。<br>3. 验证代谢降低率的预测（图7）。 | - 样本量：n=5。<br>- 使用了三星GEMS髋部外骨骼，论文的仿真模型参数（如质量）基于此系统设定。 |\n| **Browning et al. (2006)** | 步行速度与代谢消耗运输成本的关系曲线。 | 用于校准仿真的代谢能耗模型参数，使仿真的“速度-CoT”曲线及PWS与人类数据匹配（图4，算法1&2）。 | - 提供了肥胖与正常体重人群的CoT基线，论文参考了正常体重数据。 |\n| **Schwartz et al. (2008)** | 步行速度与步长、步频的关系。 | 验证仿真步态生成器在不同速度下预测的步态参数（步长、步频）是否与人类实验趋势一致（图4）。 | - 研究对象为儿童，但展示了步态参数随速度变化的普遍规律。 |\n| **Horst et al. (2021) - Gutenberg步态数据库** | 地面反作用力。 | 验证仿真GRF曲线的形态是否真实（附录M）。 | - 大样本量（n=350），数据可靠。 |\n| **其他多项研究** | 首选步行速度、人适应外骨骼的行为原理等。 | 作为理论依据，用于设计仿真框架的奖励函数（如能量最小化原则、损失厌恶启发的人机交互奖励）。 | 包括Umberger & Martin (2007), Zarrugh et al. (1974), Normand et al. (2023)等。 |\n\n### 总结\n**Exo-plore** 论文构建了一个严谨的评估体系：\n1.  **指标全面**：从运动学、动力学、代谢到人机交互，多维度验证仿真真实性。\n2.  **量化细致**：不仅进行定性对比，还广泛采用NRMSE、相关系数、DTW等量化指标，使比较客观可信。\n3.  **数据权威**：全部使用已发表的同行评议实验数据作为“金标准”，避免了自建数据集可能带来的偏差问题。\n4.  **目标明确**：所有指标最终服务于两个核心目标：**证明仿真能替代真实实验**、**证明优化结果具有生理和临床意义**。\n\n这种评估方法显著增强了该模拟框架结论的说服力，为其作为传统“人在环”优化替代方案的论点提供了坚实支撑。",
            "timestamp": "2026-02-03T15:59:23.517606",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文在哪些数据集上进行了实验？主要的评估指标和性能提升是多少？",
            "answer": "## 论文实验数据集、评估指标与性能分析\n\n### 一、 实验数据集\n论文的实验数据主要来源于**公开的人类生物力学数据集**和**自行生成的仿真数据**，用于验证仿真结果与真实人类实验的一致性。具体使用的数据集如下：\n\n| 数据集类型 | 具体来源与描述 | 用途 |\n| :--- | :--- | :--- |\n| **健康步态运动学与肌电数据** | Boo et al., 2025 的 `Gait120` 数据集。包含120名受试者的关节角度和肌肉激活（EMG）数据。 | 验证无外骨骼辅助时，仿真生成的步态运动学和肌肉激活模式是否与人类数据一致。 |\n| **健康步态地面反作用力** | Horst et al., 2021 的 `Gutenberg Gait Database`。包含大量受试者的地面反作用力数据。 | 验证仿真生成的地面反作用力曲线是否合理。 |\n| **外骨骼辅助步态实验数据** | Lim et al., 2019b 关于髋关节外骨骼（GEMS）的研究数据。包含不同步行速度下，外骨骼辅助的关节运动学、动力学（辅助力矩/功率）和代谢消耗数据。 | **核心验证集**：验证仿真框架在**有外骨骼辅助**时，能否复现人类真实的适应行为（如辅助力矩缩放、代谢减少率）。 |\n| **步行速度-代谢成本关系** | Browning et al., 2006 等研究中关于步行速度与代谢运输成本（CoT）的关系数据，特别是**首选步行速度**。 | 用于校准仿真中的代谢能量消耗模型参数，确保仿真的能量优化行为与人类一致。 |\n| **步长-步频关系** | Schwartz et al., 2008 关于步态参数随速度变化的数据。 | 验证仿真生成的步态参数（步长、步频）趋势是否合理。 |\n| **病理步态参数** | 基于文献（如 Ong et al., 2019）定义的肌肉无力/挛缩参数范围。**非真实患者数据**，而是基于生物力学原理在仿真中构建的病理模型。 | 用于生成和评估五种病理步态（马蹄足、摇摆步、蹲踞步、跟行步、足下垂），并探索其与外骨骼辅助的关系。 |\n\n### 二、 主要评估指标\n论文采用**定量与定性相结合**的评估方式，核心指标分为以下几类：\n\n1.  **仿真真实性验证指标（Sim-to-Real Gap）**：\n    *   **运动学一致性**：比较仿真与真实实验的**关节角度曲线**（踝、膝、髋）。\n    *   **动力学一致性**：比较**地面反作用力曲线**。\n    *   **肌肉激活模式一致性**：比较主要下肢肌肉的**激活时序和模式**。\n    *   **外骨骼交互一致性**：\n        *   **均方根辅助力矩** 和 **平均辅助/阻力功率** 随步行速度和控制器参数的变化趋势。\n        *   **代谢减少率**：`(无辅助CoT - 有辅助CoT) / 无辅助CoT`。\n    *   **定量相似度指标**（附录S）：\n        *   **归一化均方根误差**：衡量幅度误差。\n        *   **皮尔逊相关系数**：衡量波形形状相似性。\n        *   **归一化动态时间规整距离**：衡量时间对齐后的曲线相似性。\n\n2.  **外骨骼控制器优化指标**：\n    *   **核心优化目标**：**代谢运输成本**。通过优化外骨骼控制器参数来最小化CoT。\n    *   **优化结果评估**：分析**最优控制参数**随**步行速度**和**病理严重程度**的变化趋势及其合理性。\n\n### 三、 性能提升与关键结果\n论文的性能提升主要体现在**方法有效性验证**和**新发现**上，而非与传统方法的直接数值对比。\n\n1.  **成功复现人类实验趋势（验证框架有效性）**：\n    *   **无辅助步态**：生成的关节运动学、肌肉激活模式、地面反作用力与真实数据在趋势上高度一致（例如，髋/膝屈曲相关系数 > 0.96）。\n    *   **有辅助步态**：成功复现了人类实验中关键的“适应行为”：\n        *   辅助力矩随延迟增加而增大的缩放关系（仿真与实验相关系数 **0.964**）。\n        *   代谢减少率与实验值接近（例如，在4 km/h时，仿真预测最大代谢减少率约 **21%**，实验值约 **17%**）。\n\n2.  **核心技术创新带来的性能提升**：\n    *   **人机交互奖励的有效性**：论文提出的基于**阻力最小化**的HEI奖励，相比“无HEI奖励”或“辅助最大化奖励”，在复现上述人类适应行为上**显著更优**（相关系数普遍更高）。\n    *   **优化框架的稳定性与效率**：使用**代理网络**处理仿真随机性，相比直接使用原始仿真数据或高斯过程，能获得**更平滑、可微的CoT景观**，从而实现稳定、高效的梯度优化。\n\n3.  **在新场景下的应用与发现（主要贡献）**：\n    *   **健康步态优化**：发现了**最优扭矩延迟随步行速度增加而单调递减**的规律。\n    *   **病理步态泛化**：首次在仿真中系统探索了病理步态的外骨骼优化，并取得了关键发现：\n        *   在五种病理步态中的四种（马蹄足、摇摆步、蹲踞步、跟行步），**最优辅助增益与病理严重程度呈强线性关系**（R² 值普遍高于 **0.8**）。\n        *   根据趋势将病理分为两类：\n            *   **A类（受益组）**：蹲踞步、跟行步。**最优增益随严重程度增加而增加**，表明外骨骼能有效补偿其稳定但耗能的步态。\n            *   **B类（受限组）**：马蹄足、摇摆步。**最优增益随严重程度增加而减小**，表明不稳定的代偿机制限制了外骨骼的干预空间。\n        *   **足下垂**因步态变异性过大，未呈现清晰趋势。\n\n### 总结\n该论文没有在标准基准数据集上追求单一的“性能提升百分比”，而是通过**系统性的仿真-实验对齐验证**，证明了Exo-plore框架能够**可靠地复现**人类在外骨骼辅助下的复杂适应行为。其核心价值在于：\n*   **方法有效性**：提供了一个可替代部分耗时、高成本真人实验的仿真优化流程。\n*   **新知识发现**：揭示了步行速度和外骨骼控制参数的规律，以及不同病理步态对髋关节外骨骼辅助的**差异化需求**，为个性化康复外骨骼控制器的设计提供了全新的理论依据和筛选工具。",
            "timestamp": "2026-02-03T16:00:18.859783",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文的主要局限性有哪些？未来可能的改进方向是什么？",
            "answer": "## 论文主要局限性分析\n\n基于对论文内容的分析，其局限性主要集中在以下几个方面：\n\n### 1. **缺乏真实人体实验验证**\n   - **核心问题**：论文提出的框架（Exo-plore）完全基于仿真，**尚未在真实人体（包括患者群体）上进行实验验证**。这是将研究成果转化为临床应用的最大障碍。\n   - **具体表现**：\n     - 优化出的外骨骼控制参数的有效性和安全性未经验证。\n     - 仿真中预测的代谢节省率、步态适应性等指标与真实人体的符合度有待检验。\n\n### 2. **仿真模型与真实生理的差距**\n   - **肌肉动力学模型简化**：论文使用了经典的**希尔（Hill）型肌肉模型**，该模型存在已知缺陷：\n     - **无法模拟历史依赖行为**：如肌肉拉伸后的力增强和缩短后的力衰减现象，这在高强度或快速运动中影响显著。\n     - **参数固定**：将最优纤维长度、最大缩短速度等关键参数视为常数，而实际上它们随肌肉激活水平变化。\n     - **影响**：可能导致在模拟跑步等高速运动时，低估肌肉力量并高估代谢消耗，产生“仿真-现实差距”。\n   - **控制策略的简化**：奖励函数（如 `r_HEI`）是对复杂人类行为（如损失厌恶）的近似建模，可能无法完全捕捉个体特异性的运动控制策略。\n\n### 3. **策略过拟合与泛化能力限制**\n   - **过拟合特定环境**：深度强化学习（DRL）策略可能在训练用的固定仿真环境中过拟合。例如，论文指出髋关节内旋的 kinematics 与实验数据不符，推测是策略过拟合所致。\n   - **个性化不足**：当前框架使用了一个“平均化”的肌肉骨骼模型。**缺乏对个体受试者特异性神经肌肉特性、运动控制策略的个性化建模**，这限制了为特定用户提供最优辅助的潜力。\n   - **病理步态建模的挑战**：对于足下垂等高度不稳定的病理步态，由于频繁的脚趾拖地碰撞导致步态变异性极大，优化过程难以收敛，显示出框架在处理极端不稳定步态时的局限性。\n\n### 4. **计算与模型复杂度**\n   - **计算成本**：尽管避免了耗时的人体实验，但训练DRL策略和生成大量仿真数据本身需要可观的计算资源。\n   - **模型简化**：为了降低计算负担，对模型进行了简化（如使用刚性肌腱、上肢采用基于扭矩的驱动），这些简化可能牺牲了生物力学的保真度。\n\n---\n\n## 未来可能的改进方向\n\n针对上述局限性，未来的研究可以从以下几个方向展开：\n\n### 1. **推进实验验证与临床转化**\n   - **核心步骤**：必须开展**严格的真实人体实验**，将Exo-plore优化出的控制参数应用于健康受试者和目标患者群体（如中风、脊髓损伤患者）。\n   - **验证内容**：\n     - 对比仿真预测的代谢节省、步态参数与实测数据。\n     - 评估优化控制策略的安全性、舒适性和实际辅助效果。\n     - 进行长期适应性研究，观察人体对仿真优化参数的持续反应。\n\n### 2. **增强仿真模型的生理真实性与个性化**\n   - **升级肌肉模型**：集成更先进的、能模拟历史依赖性和激活依赖参数变化的肌肉模型（如基于横桥动力学的模型），以缩小高速、高强度运动下的仿真差距。\n   - **引入个性化建模**：\n     - **个体参数标定**：利用医学影像（如MRI）和简单运动测试，获取个体受试者的肌肉几何、力学属性，构建个性化数字孪生。\n     - **融合神经控制先验**：在DRL奖励或网络结构中引入**肌肉协同**约束，使生成的肌肉激活模式更符合人类生理（论文已提及此方向，见附录L）。\n   - **改进环境与交互**：使用更真实的足部接触模型（柔性、带足弓）来改善地面反作用力等动力学指标的预测精度。\n\n### 3. **提升框架的鲁棒性与泛化能力**\n   - **改进DRL训练**：在训练中引入**更丰富的环境随机化**（如地面不平度、扰动），增强策略的鲁棒性，防止过拟合。\n   - **开发统一/自适应模型**：探索**混合专家模型**或**元学习**方法，使单个模型能更好地泛化到不同的步行速度、辅助水平和病理严重程度，而非为每种情况单独训练。\n   - **处理高变异性步态**：针对如足下垂等步态，开发能显式建模或容忍高碰撞变异性的新优化目标或稳定性约束。\n\n### 4. **拓展应用场景与优化维度**\n   - **多关节辅助**：将框架从目前的**髋关节外骨骼**拓展到踝关节、膝关节或多关节协同辅助的外骨骼优化。\n   - **多目标优化**：除了最小化代谢成本（CoT），将**舒适度、稳定性、运动对称性**等多重用户反馈指标纳入优化框架，使其更符合临床康复需求。\n   - **在线自适应**：结合仿真框架与少量在线人体数据，开发**在线个性化微调算法**，实现控制参数在穿戴过程中的实时适配。\n\n### 5. **提高计算与框架效率**\n   - **模型压缩与加速**：对训练好的DRL策略和代理网络进行优化，降低其计算开销，为未来部署在嵌入式系统或实现实时交互提供可能。\n   - **流程自动化**：进一步自动化从个体测量到生成个性化仿真模型、再到优化控制参数的完整流程，降低使用门槛。\n\n**总结**：Exo-plore作为一个创新的仿真驱动优化框架，其最大价值在于为外骨骼控制研究提供了一个高效、可扩展且符合伦理的探索平台，尤其适用于难以进行大量人体实验的群体。然而，其从“仿真有效”到“临床有效”的跨越，严重依赖于后续扎实的实验验证、模型生理真实性的提升以及个性化能力的增强。未来的工作应致力于**构建“仿真-实验”闭环**，利用实验数据不断迭代和修正仿真模型，最终实现真正个性化、高效且安全的外骨骼辅助。",
            "timestamp": "2026-02-03T16:01:09.502940",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        }
    ],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-30T04:45:35Z",
    "created_at": "2026-02-03T15:53:05.625399",
    "updated_at": "2026-02-03T15:53:05.625407"
}