{
  "id": "2601.09708v1",
  "title": "Fast-ThinkAct: Efficient Vision-Language-Action Reasoning via Verbalizable Latent Planning",
  "authors": [
    "Chi-Pin Huang",
    "Yunze Man",
    "Zhiding Yu",
    "Min-Hung Chen",
    "Jan Kautz",
    "Yu-Chiang Frank Wang",
    "Fu-En Yang"
  ],
  "abstract": "Vision-Language-Action (VLA) tasks require reasoning over complex visual scenes and executing adaptive actions in dynamic environments. While recent studies on reasoning VLAs show that explicit chain-of-thought (CoT) can improve generalization, they suffer from high inference latency due to lengthy reasoning traces. We propose Fast-ThinkAct, an efficient reasoning framework that achieves compact yet performant planning through verbalizable latent reasoning. Fast-ThinkAct learns to reason efficiently with latent CoTs by distilling from a teacher, driven by a preference-guided objective to align manipulation trajectories that transfers both linguistic and visual planning capabilities for embodied control. This enables reasoning-enhanced policy learning that effectively connects compact reasoning to action execution. Extensive experiments across diverse embodied manipulation and reasoning benchmarks demonstrate that Fast-ThinkAct achieves strong performance with up to 89.3\\% reduced inference latency over state-of-the-art reasoning VLAs, while maintaining effective long-horizon planning, few-shot adaptation, and failure recovery.",
  "url": "https://arxiv.org/abs/2601.09708v1",
  "html_url": "https://arxiv.org/html/2601.09708v1",
  "html_content": "\\correspondingauthor\nX\nFast-ThinkAct: Efficient Vision-Language-Action Reasoning via Verbalizable Latent Planning\nChi-Pin Huang\n1\nYunze Man\n2\nZhiding Yu\nMin-Hung Chen\nJan Kautz\nYu-Chiang Frank Wang\n1\nFu-En Yang\nNVIDIA\nAbstract\nVision-Language-Action (VLA) tasks require reasoning over complex visual scenes and executing adaptive actions in dynamic environments. While recent studies on reasoning VLAs show that explicit chain-of-thought (CoT) can improve generalization, they suffer from high inference latency due to lengthy reasoning traces. We propose Fast-ThinkAct, an efficient reasoning framework that achieves compact yet performant planning through verbalizable latent reasoning. Fast-ThinkAct learns to reason efficiently with latent CoTs by distilling from a teacher, driven by a preference-guided objective to align manipulation trajectories that transfers both linguistic and visual planning capabilities for embodied control. This enables reasoning-enhanced policy learning that effectively connects compact reasoning to action execution. Extensive experiments across diverse embodied manipulation and reasoning benchmarks demonstrate that Fast-ThinkAct achieves strong performance with up to 89.3% reduced inference latency over state-of-the-art reasoning VLAs, while maintaining effective long-horizon planning, few-shot adaptation, and failure recovery.\nLinks:\nProject Page\n\\abscontent\n1\nIntroduction\nFigure 1\n:\nOverview of Fast-ThinkAct.\nPrevious reasoning VLAs generate lengthy reasoning traces (\n∼\n\\sim\n250 tokens). Our approach learns compact continuous tokens (e.g., 6) (\nblue\n) and parallel spatial tokens (\ngreen\n) as internal reasoning. The bottom-right plot shows that we achieve\n9.3\n×\n9.3\\times\nfaster inference than ThinkAct-7B\nhuang2025thinkact\n, while delivering improved performance on the SimplerEnv-Google benchmark.\nRecent large vision-language models (VLMs)\nliu2023visual\n;\ncomanici2025gemini\n;\nliu2024nvila\n;\nbai2025qwen2\n;\nshi2024eagle\n;\nli2025eagle\n;\nchen2025eagle\n;\nwang2025internvl3\n;\nxie2024show\nhave achieved remarkable capabilities in visual-language understanding across diverse multimodal tasks. To extend these capabilities to embodied-centric tasks, recent works leverage large-scale robot demonstrations\no2024open\nto develop Vision-Language-Action (VLA) foundation models\nbrohan2022rt\n;\nbrohan2023rt\n;\nteam2024octo\n;\nbjorck2025gr00t\n;\nli2025hamster\n;\nblack2024pi_0\n;\nyang2025magma\n;\nkim24openvla\n. These VLA tasks require agents to perceive complex visual scenes, reason over spatial and temporal contexts, and execute adaptive actions within dynamic environments, demanding robust long-horizon planning and contextual adaptation. However, as these VLA models primarily rely on supervised training from action data, they excel at basic skills (e.g., pick-and-place) but struggle to generalize beyond training distributions, such as long-horizon planning, self-correction from failures, and adaptation to novel scenarios, due to the impracticality of collecting exhaustive robot demonstrations.\nReasoning VLAs\nzawalski2024robotic\n;\nzhao2025cot\n;\nlee2025molmoact\n;\nwu2025you\n;\nqu2025eo\n;\nhuang2025thinkact\n;\nkim2025robot\naddress these limitations by incorporating intermediate thinking processes, improving generalization and task-solving capability. Supervised chain-of-thought (CoT) methods\nzawalski2024robotic\n;\nzhao2025cot\n;\nlee2025molmoact\n;\nqu2025eo\naddress this by learning from intermediate reasoning annotations. These approaches can be categorized into textual reasoning methods that leverage off-the-shelf LLMs and VLMs to generate pseudo CoT labels\nzawalski2024robotic\n, and visual reasoning methods that generate structured visual reasoning representations such as sub-goal images, image depth, and 2D visual traces\nzhao2025cot\n;\nlee2025molmoact\n. However, these supervised approaches require substantial reasoning annotations and remain limited by training data coverage. To address this, ThinkAct\nhuang2025thinkact\nemploys RL-based reasoning\nshao2024deepseekmath\nto generate long textual CoTs guided by action-aligned visual rewards. While these reasoning methods effectively improve task generalization and planning capabilities, they require generating lengthy chain-of-thought steps that introduce substantial reasoning latency, which hampers embodied applications with\nreal-time\nrequirements.\nIn embodied AI applications such as robotic manipulation and autonomous driving, agents must make rapid decisions at high frequencies (e.g., 1-15 Hz)\nguan2025efficient\n. However, generating lengthy reasoning traces can take several seconds per decision (e.g., 0.1 Hz)\nhuang2025thinkact\n;\nlee2025molmoact\n, creating a critical bottleneck that limits real-time performance\nguan2025efficient\n;\nyu2025survey\nand poses safety risks in time-critical scenarios\nwang2025alpamayo\n. To mitigate this efficiency bottleneck while preserving reasoning capabilities, very recent works\nchen2025training\n;\nyu2025survey\n;\nguan2025efficient\nhave explored approaches to reduce inference latency in embodied reasoning. For instance, ECoT-Lite\nchen2025training\nproposes reasoning dropout to accelerate inference, yet directly reducing textual reasoning length risks performance degradation due to critical information loss. How to preserve reasoning capability while enabling compact representations that properly capture essential spatial-temporal dynamics remains a crucial challenge for reasoning VLA models.\nIn this paper, we propose\nFast-ThinkAct\n, an efficient embodied reasoning framework for Vision-Language-Action tasks that achieves compact yet expressive planning through verbalizable latent reasoning. As depicted in Figure\n1\n, unlike prior reasoning VLAs that generate lengthy explicit textual CoT traces, we introduce reward-guided preference distillation with visual trajectory alignment to compress linguistic and visual planning into compact continuous latents that enable implicit internal reasoning. Our student VLM encodes reasoning into compact latents decodable by a verbalizer, enabling preference-based optimization that leverages RL-derived reward signals to distill high-quality reasoning patterns from a textual teacher VLM while suppressing low-quality ones. We further align trajectory latents between teacher and student to transfer visual planning capabilities essential for embodied control. Once trained, the student VLM enables reasoning-enhanced policy learning that bridges implicit multimodal planning with action execution, achieving significantly faster inference while outperforming existing reasoning VLAs.\nOur contributions can be summarized as follows:\n•\nWe propose\nFast-ThinkAct\n, an efficient reasoning framework that compresses reasoning into verbalizable latent thoughts while maintaining expressive planning abilities.\n•\nWe introduce preference-guided distillation with manipulation trajectory alignment that compresses linguistic and visual planning into compact continuous latents.\n•\nWe bridge high-level visual planning to low-level action execution through reasoning-enhanced policy learning guided by manipulation trajectory latents.\n•\nWe achieve up to 89.3% inference latency reduction over state-of-the-art reasoning VLAs while maintaining strong performance across diverse embodied benchmarks.\n2\nRelated Works\n2.1\nVision-Language-Action (VLA) Models\nFoundation VLAs.\nVision-Language-Action (VLA) models\nbrohan2022rt\n;\nbrohan2023rt\n;\nteam2024octo\n;\nbjorck2025gr00t\n;\nli2025hamster\n;\nblack2024pi_0\n;\nyang2025magma\n;\npertsch2025fast\n;\ndriess2025knowledge\n;\nbu2025agibot\n;\nteam2025gemini\n;\nwang2025vla\nhave recently emerged as a promising paradigm for embodied AI by training vision-language backbones on large-scale robot demonstrations. Works such as OpenVLA\nkim24openvla\nand\nπ\n0\n\\pi_{0}\nblack2024pi_0\nachieve language-conditioned manipulation through end-to-end policy learning, while Magma\nyang2025magma\nco-trains on heterogeneous human and robot data. HAMSTER\nli2025hamster\nand TraceVLA\nzheng2024tracevla\nfurther leverage 2D visual trajectories to boost spatial-action connections. Despite success on routine manipulation, these imitation-based approaches struggle with long-horizon planning and generalization to novel scenarios due to limited training data coverage.\nReasoning VLAs.\nTo overcome these limitations, recent works\nzawalski2024robotic\n;\nzhao2025cot\n;\nlee2025molmoact\n;\nwu2025you\n;\nqu2025eo\n;\nhuang2025thinkact\n;\nkim2025robot\n;\nyuan2025embodied\n;\nabdolmaleki2025gemini\nintegrate explicit reasoning mechanisms into VLA architectures. Supervised approaches\nzawalski2024robotic\n;\nzhao2025cot\n;\nlee2025molmoact\n;\nqu2025eo\nintroduce intermediate reasoning through chain-of-thought annotations. Embodied CoT\nzawalski2024robotic\nand Hi-Robot\nshi2025hi\nsynthesize reasoning labels via pretrained foundation models. To perform vision-centric reasoning\nman2025argus\n;\nsarch2025grounded\nbeyond pure text, CoT-VLA\nzhao2025cot\nemploys visual goal generation and MolmoAct\nlee2025molmoact\nstructures reasoning by spatial representations. Additionally, EO-1\nqu2025eo\nintroduces interleaved vision-language-action pre-training to bridge reasoning and interaction. Recent works\nyuan2025embodied\n;\nhuang2025thinkact\nalternatively leverage reinforcement fine-tuning to generate reasoning chains with designed rewards. Despite improved generalization, these reasoning VLAs suffer from high inference latency and inevitably introduce extraneous information that degrades action quality.\n2.2\nEfficient Reasoning\nTo address the inference latency of reasoning, recent LLM research explores various efficiency techniques\nlee2025vlsi\n;\ndai2025stable\n;\nyuan2025efficient\n;\nxiang2025just\n;\naggarwal2025l1\n;\nlee2025unified\n. For example, RL-based approaches\ndai2025stable\n;\nyuan2025efficient\n;\nxiang2025just\n;\naggarwal2025l1\nintroduce length penalties to encourage shorter reasoning chains, though such methods can suffer from training instability. Beyond length control, latent reasoning methods\nhao2024training\n;\nshen2025codi\n;\nzhang2025soft\n;\ncheng2024compressed\n;\nxu2025softcot\nenable reasoning in continuous spaces, such as Coconut\nhao2024training\nusing hidden states as continuous thoughts, CODI\nshen2025codi\ndistilling explicit CoT into continuous space via teacher-student alignment, and Soft Thinking\nzhang2025soft\ngenerating weighted concept tokens. However, these LLM techniques cannot directly transfer to VLA tasks due to the need for spatial-temporal understanding and bridging semantic reasoning with embodied control.\nRecently, ECoT-Lite\nchen2025training\nproposes reasoning dropout to accelerate embodied reasoning by skipping test-time reasoning traces. However, reasoning dropout can lead to inconsistent planning as it builds on supervised embodied CoT. Our proposed Fast-ThinkAct distills reasoning into compact latent representations that naturally encode multimodal information, enabling robust reasoning-enhanced policy learning.\n3\nMethod\nFigure 2\n:\nOverview of Fast-ThinkAct.\n(a) Given observation\no\nt\no_{t}\nand instruction\nl\nl\n, the Textual Teacher VLM\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\ngenerates explicit reasoning chains. The Latent Student VLM\nℱ\nθ\n\\mathcal{F}_{\\theta}\ndistills these into compact latent tokens\n𝐳\n\\mathbf{z}\nguided by reward preferences. Verbalizer LLM\n𝒱\nψ\n\\mathcal{V}_{\\psi}\ndecodes latents to text for preference-based learning via\nℒ\nverb\n\\mathcal{L}_{\\text{verb}}\n, while\nℒ\ndistill\n\\mathcal{L}_{\\text{distill}}\ntransfers visual planning capability from teacher, and spatial tokens enable parallel visual trajectory prediction via\nℒ\nans\n\\mathcal{L}_{\\text{ans}}\n, ensuring latents are verbalizable and grounded in visual planning. (b) Reasoning-Enhanced Policy Learning. The Action Model\nπ\nϕ\n\\pi_{\\phi}\nis trained with\nℒ\nIL\n\\mathcal{L}_{\\text{IL}}\nwhile freezing the latent student\nℱ\nθ\n\\mathcal{F}_{\\theta}\nand state encoder.\n3.1\nProblem Formulation\nWe first define the setting and notations. At each timestep\nt\nt\n, given a language instruction\nl\nl\n, the model observes a visual input\no\nt\no_{t}\nand generates an action chunk\na\nt\na_{t}\n, represented as a sequence of continuous robot control vectors (e.g., 7- or 14-DOF for single- or bimanual robots, respectively).\nTo address this problem, we propose Fast-ThinkAct, an efficient reasoning framework that bridges high-level planning with low-level action execution. Our approach employs a VLM\nℱ\nθ\n\\mathcal{F}_{\\theta}\nto perform reasoning in\ncontinuous latent space\n, integrated with an action model\nπ\nϕ\n\\pi_{\\phi}\nfor executable action generation. Specifically,\nℱ\nθ\n\\mathcal{F}_{\\theta}\nprocesses observation-instruction pairs\n(\no\nt\n,\nl\n)\n(o_{t},l)\nthrough latent chain-of-thought (CoT) reasoning to produce a compact visual plan latent\nc\nt\nc_{t}\nthat encapsulates the intended trajectory in visual space (Sec.\n3.2\n). This\nc\nt\nc_{t}\nsubsequently guides\nπ\nϕ\n\\pi_{\\phi}\nto predict executable actions\na\nt\na_{t}\n(Sec.\n3.3\n). By distilling reasoning into a continuous latent space rather than discrete text, Fast-ThinkAct achieves significantly improved inference efficiency while enhancing action performance through better preservation of spatial and visual information.\n3.2\nEfficient Embodied Reasoning\nTo enable efficient embodied reasoning that meets the real-time requirements of embodied AI tasks, we aim to compress long textual CoTs into a compact set of continuous latent representations. However, compressing reasoning traces into latents is challenging, as there is no direct supervision signal in the latent space to guide what reasoning patterns should be encoded.\n3.2.1\nVerbalizable Latent CoT by Reward Preferences\nTo address this challenge, we propose to perform distillation in natural language space by introducing a verbalizer LLM that decodes latents into verbalizable reasoning. This approach grounds latent learning in an interpretable textual form, ensuring that the learned latents faithfully preserve the underlying reasoning structure. Since reasoning traces generated by the teacher model\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\nexhibit varying quality, we adopt a preference-based learning framework that exploits reward signals from the teacher’s GRPO training to guide the latent student\nℱ\nθ\n\\mathcal{F}_{\\theta}\ntoward high-quality reasoning patterns while suppressing low-quality ones.\nSpecifically, we employ a teacher-student framework where a textual teacher model\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\nfirst learns explicit reasoning through GRPO\nshao2024deepseekmath\ntraining by maximizing:\n𝒥\nGRPO\n​\n(\nθ\n)\n=\n𝔼\nτ\n∼\nℱ\nθ\nT\n​\n[\nmin\n⁡\n(\nr\nθ\n​\n(\nτ\n)\n​\nA\n​\n(\nτ\n)\n,\nclip\n​\n(\nr\nθ\n​\n(\nτ\n)\n,\n1\n−\nϵ\n,\n1\n+\nϵ\n)\n​\nA\n​\n(\nτ\n)\n)\n]\n,\n\\mathcal{J}_{\\text{GRPO}}(\\theta)=\\mathbb{E}_{\\tau\\sim\\mathcal{F}^{T}_{\\theta}}\\Big[\\min\\big(r_{\\theta}(\\tau)A(\\tau),\\text{clip}(r_{\\theta}(\\tau),1-\\epsilon,1+\\epsilon)A(\\tau)\\big)\\Big],\n(1)\nwhere\nτ\n\\tau\ndenotes a reasoning trace and\nr\nθ\n​\n(\nτ\n)\n=\nℱ\nθ\nT\n​\n(\nτ\n)\nℱ\nold\nT\n​\n(\nτ\n)\nr_{\\theta}(\\tau)=\\frac{\\mathcal{F}^{T}_{\\theta}(\\tau)}{\\mathcal{F}^{T}_{\\text{old}}(\\tau)}\nis the probability ratio. The advantage function for group rewards\n{\nR\ni\n}\ni\n∈\nG\n​\n(\nτ\n)\n\\{R_{i}\\}_{i\\in G(\\tau)}\nis represented as:\nA\n​\n(\nτ\n)\n=\nR\nτ\n−\nmean\n​\n(\n{\nR\ni\n}\ni\n∈\nG\n​\n(\nτ\n)\n)\nstd\n​\n(\n{\nR\ni\n}\ni\n∈\nG\n​\n(\nτ\n)\n)\n.\nA(\\tau)=\\frac{R_{\\tau}-\\text{mean}(\\{R_{i}\\}_{i\\in G(\\tau)})}{\\text{std}(\\{R_{i}\\}_{i\\in G(\\tau)})}.\n(2)\nThis training process produces textual CoTs with varying quality, where the advantage function\nA\n​\n(\nτ\n)\nA(\\tau)\nnaturally serves as a quality indicator. To construct preference pairs for distillation, we select the highest and lowest advantage traces from each rollout group:\nτ\n+\n=\narg\n⁡\nmax\nτ\n∈\nG\n⁡\nA\n​\n(\nτ\n)\n​\nand\n​\nτ\n−\n=\narg\n⁡\nmin\nτ\n∈\nG\n⁡\nA\n​\n(\nτ\n)\n.\n\\displaystyle\\tau^{+}=\\arg\\max_{\\tau\\in G}A(\\tau)\\text{ and }\\tau^{-}=\\arg\\min_{\\tau\\in G}A(\\tau).\n(3)\nInstead of generating textual tokens, the student model\nℱ\nθ\n\\mathcal{F}_{\\theta}\nperforms latent reasoning by autoregressively generating\nM\nM\ncontinuous latent vectors\n𝐳\n=\n{\nz\nm\n}\nm\n=\n1\nM\n\\mathbf{z}=\\{z_{m}\\}_{m=1}^{M}\nwith\nz\nm\n∈\nℝ\nd\nz_{m}\\in\\mathbb{R}^{d}\n, where\nd\nd\nis the hidden size. We then train the verbalizer LLM\n𝒱\nψ\n\\mathcal{V}_{\\psi}\nto decode these latents\n𝐳\n\\mathbf{z}\ninto natural language. The training objective encourages the verbalizer to assign a higher likelihood to decoding latents into high-quality reasoning\nτ\n+\n\\tau^{+}\nthan low-quality reasoning\nτ\n−\n\\tau^{-}\n. Inspired by DPO\nrafailov2023direct\n, we formulate this as an optimization guided by the reward preferences:\nℒ\nverb\n=\n−\n𝔼\n​\n[\nlog\n⁡\nσ\n​\n(\nβ\n​\n(\nlog\n⁡\np\nψ\n​\n(\nτ\n+\n∣\n𝐳\n)\np\nref\n​\n(\nτ\n+\n)\n−\nlog\n⁡\np\nψ\n​\n(\nτ\n−\n∣\n𝐳\n)\np\nref\n​\n(\nτ\n−\n)\n)\n)\n]\n,\n\\mathcal{L}_{\\text{verb}}=-\\mathbb{E}\\Big[\\log\\sigma\\Big(\\beta\\big(\\log\\tfrac{p_{\\psi}(\\tau^{+}\\mid\\mathbf{z})}{p_{\\text{ref}}(\\tau^{+})}-\\log\\tfrac{p_{\\psi}(\\tau^{-}\\mid\\mathbf{z})}{p_{\\text{ref}}(\\tau^{-})}\\big)\\Big)\\Big],\n(4)\nwhere\np\nref\np_{\\text{ref}}\nis the reference model (i.e.,\n𝒱\nψ\n\\mathcal{V}_{\\psi}\nwithout latent conditioning),\nσ\n\\sigma\nis the sigmoid function, and\nβ\n=\n0.1\n\\beta=0.1\ncontrols preference strength. This encourages the student VLM\nℱ\nθ\n\\mathcal{F}_{\\theta}\nto encode latents that the verbalizer decodes into high-quality reasoning while suppressing low-quality patterns.\n3.2.2\nAction-Aligned Visual Plan Distillation\nWhile the verbalizer loss (Eq.\n4\n) enables the student\nℱ\nθ\n\\mathcal{F}_{\\theta}\nto capture high-level reasoning patterns, it does not explicitly ensure that latent representations encode the visual planning capability crucial for embodied control. To address this, we introduce action-aligned visual plan distillation to transfer the teacher\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\n’s spatial reasoning ability to the student\nℱ\nθ\n\\mathcal{F}_{\\theta}\n.\nWe distill spatial reasoning from the teacher, which is trained with trajectory-level rewards (e.g., goal completion and trajectory alignment\nhuang2025thinkact\n) for grounded visual planning. We align the trajectory-level representations by minimizing the L2 distance between hidden states of the\n<answer>\ntoken that encodes the visual plan:\nℒ\ndistill\n=\n‖\nh\nt\nT\n−\nh\nt\n‖\n2\n2\n,\n\\mathcal{L}_{\\text{distill}}=\\|h_{t}^{T}-h_{t}\\|_{2}^{2},\n(5)\nwhere\nh\nt\nT\nh_{t}^{T}\nand\nh\nt\nh_{t}\nare the hidden states from teacher (corresponding to\nτ\n+\n\\tau^{+}\n) and student, respectively.\nTo enable efficient parallel trajectory prediction, unlike the textual teacher that autoregressively generates verbose text sequences of waypoints\n{\np\nk\n}\nk\n=\n1\nK\n\\{p_{k}\\}_{k=1}^{K}\nwith\np\nk\n∈\n[\n0\n,\n1\n]\n2\np_{k}\\in[0,1]^{2}\n(tokenized into 60-70 tokens when\nK\n=\n5\nK=5\n), the student uses\nK\nK\nlearnable spatial tokens\n{\n𝐬\ni\n}\ni\n=\n1\nK\n\\{\\mathbf{s}_{i}\\}_{i=1}^{K}\nappended to the reasoning latent sequence, with each output hidden state simultaneously projected to a waypoint via an MLP. The total objective for training\nℱ\nθ\n\\mathcal{F}_{\\theta}\ncombines all three components:\nℒ\nstudent\n\\displaystyle\\mathcal{L}_{\\text{student}}\n=\nℒ\nverb\n+\nℒ\ndistill\n+\nℒ\nans\n,\nwhere\n\\displaystyle=\\mathcal{L}_{\\text{verb}}+\\mathcal{L}_{\\text{distill}}+\\mathcal{L}_{\\text{ans}},\\quad\\text{where }\n(6)\nℒ\nans\n\\displaystyle\\mathcal{L}_{\\text{ans}}\n=\n∑\ni\n=\n1\nK\n‖\np\ni\n−\np\n^\ni\n‖\n2\n2\n,\nwith\n​\np\ni\n=\nMLP\n​\n(\nh\n′\n​\n(\n𝐬\ni\n)\n)\n,\n\\displaystyle=\\sum_{i=1}^{K}\\|p_{i}-\\hat{p}_{i}\\|_{2}^{2},\\text{ with }p_{i}=\\text{MLP}(h^{\\prime}(\\mathbf{s}_{i})),\nwhere\nh\n′\n​\n(\n𝐬\ni\n)\nh^{\\prime}(\\mathbf{s}_{i})\ndenotes the output hidden state of the\ni\ni\n-th spatial token and\np\n^\ni\n\\hat{p}_{i}\nare ground-truth waypoints. Through this unified framework, the student model\nℱ\nθ\n\\mathcal{F}_{\\theta}\nperforms compact yet expressive latent reasoning and generates visual trajectory plans efficiently.\n3.3\nReasoning-Enhanced Policy Learning\nAfter the student VLM\nℱ\nθ\n\\mathcal{F}_{\\theta}\nperforms compact latent reasoning and generates visual trajectory planning through spatial tokens, we leverage these representations to guide a diffusion Transformer-based action model\nπ\nϕ\n\\pi_{\\phi}\n(e.g., RDT\nliu2024rdt\n) for action prediction. To bridge the high-level visual planning with low-level action generation, we connect the visual latent planning\nc\nt\nc_{t}\nencoded in the key-value cache corresponding to the spatial tokens to the action model.\nSpecifically, we extract visual latent planning\nc\nt\nc_{t}\nfrom the KV cache of spatial tokens in earlier VLM layers (since\nℱ\nθ\n\\mathcal{F}_{\\theta}\nhas more layers than\nπ\nϕ\n\\pi_{\\phi}\n) and concatenate with KV pairs from the action model’s state encoder. The action model’s cross-attention then attends to both the visual planning context and state observations. We post-train on action-annotated robot data by\nfreezing\nℱ\nθ\n\\mathcal{F}_{\\theta}\nand the state encoder while updating only\nπ\nϕ\n\\pi_{\\phi}\nwith the imitation learning objective:\nℒ\nIL\n​\n(\nϕ\n)\n=\nℓ\n​\n(\nπ\nϕ\n​\n(\no\nt\n,\nl\n,\nc\nt\n)\n,\na\n^\nt\n)\n,\n\\mathcal{L}_{\\text{IL}}(\\phi)=\\ell\\left(\\pi_{\\phi}(o_{t},l,c_{t}),\\hat{a}_{t}\\right),\n(7)\nwhere\nℓ\n\\ell\ndenotes the denoising objective for diffusion policy and\na\n^\nt\n\\hat{a}_{t}\nis the ground-truth action. Through this post-training, the action model effectively translates visual planning from compact latent reasoning into low-level robot actions.\nFigure 3\n:\nEvaluation of robot manipulation and reasoning efficiency.\n(a)-(e) Success rates on LIBERO\nliu2023libero\nand SimplerEnv\nli24simpler\nbenchmarks compared with state-of-the-art 7B reasoning VLAs. (f) Latency comparison across 3B and 7B reasoning VLAs. Our approach achieves up to 89.3% inference latency reduction while maintaining superior task success rates.\n3.4\nLearning Strategy and Inference\nTraining Strategy.\nWe initialize both teacher\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\nand student\nℱ\nθ\n\\mathcal{F}_{\\theta}\nfrom the same checkpoint obtained through SFT and CoT-SFT on a pre-trained VLM. The teacher is trained with GRPO using action-aligned rewards\nhuang2025thinkact\n, while the student is trained with\nℒ\nstudent\n\\mathcal{L}_{\\text{student}}\nto compress reasoning into compact latents. We then connect the trained\nℱ\nθ\n\\mathcal{F}_{\\theta}\nwith action model\nπ\nϕ\n\\pi_{\\phi}\n(initialized from\nliu2024rdt\n) by freezing\nℱ\nθ\n\\mathcal{F}_{\\theta}\nand the state encoder while updating the latent projector and\nπ\nϕ\n\\pi_{\\phi}\nwith\nℒ\nIL\n\\mathcal{L}_{\\text{IL}}\non large-scale robotic data. For target environment adaptation (e.g., LIBERO\nliu2023libero\n, RoboTwin2.0\nchen2025robotwin2\n), we fine-tune on environment-specific demonstrations.\nInference.\nThe\nℱ\nθ\n\\mathcal{F}_{\\theta}\nprocesses\n(\no\nt\n,\nl\n)\n(o_{t},l)\nby compact latent reasoning, generating visual trajectories via\nK\nK\nspatial tokens. The visual latent planning\nc\nt\nc_{t}\n, extracted from the spatial tokens’ KV cache, conditions\nπ\nϕ\n\\pi_{\\phi}\nto predict actions\na\nt\na_{t}\n. Inference requires only\nℱ\nθ\n\\mathcal{F}_{\\theta}\nand\nπ\nϕ\n\\pi_{\\phi}\n; the verbalizer\n𝒱\nψ\n\\mathcal{V}_{\\psi}\nis used solely during training and optionally for interpretability.\n4\nExperiment\n4.1\nExperimental Setup\nImplementation Details.\nWe use Qwen2.5-VL 3B\nbai2025qwen2\nas the VLM backbone. The SFT stage runs for 1 epoch with batch size 64 and learning rate\n1\n​\ne\n−\n5\n1\\text{e}{-5}\n, followed by CoT-SFT for 15K iterations with the same hyperparameters. For teacher-student training, both\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\nand\nℱ\nθ\n\\mathcal{F}_{\\theta}\nare initialized from the CoT-SFT checkpoint and trained for 4,500 iterations with batch size 128 and learning rate\n1\n​\ne\n−\n6\n1\\text{e}{-6}\n. The teacher is optimized with GRPO\nshao2024deepseekmath\nusing action-aligned visual rewards\nhuang2025thinkact\nand QA-style rewards (detailed in supplementary material). For the first 3,000 iterations of the student training, we train the verbalizer\n𝒱\nψ\n\\mathcal{V}_{\\psi}\nwith standard language modeling loss, then switch to\nℒ\nverb\n\\mathcal{L}_{\\text{verb}}\nfor the remaining 1,500 iterations. For reasoning-enhanced policy learning, we initialize\nπ\nϕ\n\\pi_{\\phi}\nfrom DiT-Policy\nchi2023diffusion\npre-trained on OXE\no2024open\nfor SimplerEnv, and from RDT\nliu2024rdt\nfor LIBERO and RoboTwin2.0. A linear projection adapts the VLM’s KV cache to the action model dimension (1,024 for DiT-Policy and 2,048 for RDT). Training runs for 20K iterations with batch size 256 and learning rate\n1\n​\ne\n−\n4\n1\\text{e}{-4}\n. All diffusion hyperparameters follow those of the respective action models. All experiments are conducted on 16 NVIDIA A100 GPUs with 80 GB memory.\nTraining Datasets and Evaluation Benchmarks.\nFor reasoning VLM training, we utilize single-arm visual trajectories labeled by\nlee2025molmoact\nand dual-arm visual trajectories from the AIST dataset\naist2025aist\n, along with QA tasks from PixMo\ndeitke2024molmo\n, RoboFAC\nlu2025robofac\n, RoboVQA\nsermanet2024robovqa\n, ShareRobot\nji2025robobrain\n, EgoPlan\nchen2023egoplan\n, and Video-R1\nfeng2025video\n. For reasoning-enhanced policy learning, we use action data from the OXE dataset\no2024open\n(following OpenVLA\nkim24openvla\n) when training with DiT-Policy, and augment with bimanual data from the static Aloha dataset\nshi2023waypoint\n;\nzhao2023learning\nwhen training with RDT.\nWe evaluate Fast-ThinkAct on four embodied reasoning benchmarks and three robot manipulation benchmarks. For embodied reasoning, we use EgoPlan-Bench2\nqiu2024egoplan2\n(accuracy on multiple-choice questions), RoboVQA\nsermanet2024robovqa\n(BLEU score\npapineni2002bleu\n), OpenEQA\nmajumdar2024openeqa\n, and RoboFAC\nlu2025robofac\n(both using LLM-based scoring). Notably, RoboVQA and RoboFAC contain videos captured from real robots. For robot manipulation, we evaluate on SimplerEnv\nli24simpler\n, which demonstrates strong correlation with real-world performance, LIBERO\nliu2023libero\ncovering diverse manipulation tasks including long-horizon scenarios, and RoboTwin2.0\nchen2025robotwin2\nfor complex bimanual manipulation. All robot manipulation tasks use task success rate as the metric. Additional details are provided in the supplementary material.\n4.2\nQuantitative Evaluation\nRobot Manipulation.\nTable 1\n:\nQuantitative evaluation on RoboTwin2.0\nchen2025robotwin2\n.\nE and H denote easy and hard settings (without/with domain randomization). Background colors indicate task length based on expert demonstrations:\nshort (80-100)\n,\nmedium (110-220)\n,\nlong (270-470)\nsteps.\nModel\nclick\nalarm\nclick\nbell\nturn\nswitch\nadjust\nbottle\nbeat\nblock\nhandover\nmic\nhandover\nblock\nhanging\nmug\nstack\nblocks two\nstack\nbowls three\nAverage\nE\nH\nE\nH\nE\nH\nE\nH\nE\nH\nE\nH\nE\nH\nE\nH\nE\nH\nE\nH\nE\nH\nDP\nchi2023diffusion\n61\n5\n54\n0\n36\n1\n97\n0\n42\n0\n53\n0\n10\n0\n8\n0\n7\n0\n63\n0\n43.1\n0.6\nACT\nzhao2023learning\n32\n4\n58\n3\n5\n2\n97\n23\n56\n3\n85\n0\n42\n0\n7\n0\n25\n0\n48\n0\n45.5\n3.5\nπ\n0\n\\pi_{0}\nblack2024pi_0\n63\n11\n44\n3\n27\n23\n90\n56\n43\n21\n98\n13\n45\n8\n11\n3\n42\n1\n66\n24\n52.9\n16.3\nRDT\nliu2024rdt\n61\n12\n80\n9\n35\n15\n81\n75\n77\n37\n90\n31\n45\n14\n23\n16\n21\n2\n51\n17\n56.4\n22.8\nThinkAct\nhuang2025thinkact\n64\n13\n84\n11\n40\n19\n94\n70\n79\n33\n92\n40\n56\n15\n31\n18\n30\n5\n54\n23\n62.4\n24.7\nFast-ThinkAct\n70\n17\n82\n12\n37\n21\n92\n72\n82\n33\n99\n42\n65\n15\n30\n22\n45\n5\n55\n25\n65.7\n26.4\nTable 2\n:\nQuantitative evaluation on EgoPlan-Bench2\nqiu2024egoplan2\n, RoboVQA\nsermanet2024robovqa\n, and OpenEQA\nmajumdar2024openeqa\nbenchmarks for embodied reasoning.\nMethod\nEgoPlan-Bench2\nRoboVQA\nOpenEQA\nOverall\nDaily.\nWork.\nRec.\nHobbies\nAvg.\nB-1\nB-2\nB-3\nB-4\nB-Avg.\nScore\nAvg.\nGPT-4V\nachiam2023gpt\n36.7\n27.7\n33.9\n32.5\n32.6\n32.2\n26.5\n24.7\n23.9\n26.8\n49.6\n36.4\nGemini-2.5-Flash\ncomanici2025gemini\n44.2\n42.3\n43.2\n39.1\n42.4\n39.1\n31.6\n22.9\n22.1\n28.9\n45.3\n38.9\nInternVL2.5-2B\nchen2024expanding\n30.9\n27.8\n28.6\n33.1\n30.1\n36.6\n33.7\n31.0\n29.4\n32.7\n47.1\n36.6\nInternVL3-2B\nzhu2025internvl3\n36.9\n29.9\n35.6\n31.5\n33.4\n34.4\n33.9\n33.5\n33.3\n33.8\n48.8\n38.7\nNVILA-2B\nliu2024nvila\n34.6\n26.7\n33.3\n31.6\n31.4\n38.7\n34.3\n31.1\n29.2\n33.3\n47.0\n37.2\nQwen2.5-VL-3B\nbai2025qwen2\n29.0\n27.0\n30.2\n28.9\n28.5\n42.5\n36.3\n28.7\n31.8\n34.8\n43.4\n35.6\nMagma-8B\nyang2025magma\n32.1\n25.7\n34.4\n29.3\n29.8\n38.6\n31.5\n28.1\n26.7\n31.2\n49.1\n36.7\nRoboBrain2.0-3B\nteam2025robobrain2\n45.3\n37.6\n45.9\n39.7\n41.8\n54.4\n47.7\n43.1\n41.0\n46.5\n50.1\n46.1\nThinkAct-3B\nhuang2025thinkact\n46.6\n41.4\n45.9\n42.5\n44.0\n62.4\n57.3\n52.0\n49.6\n55.3\n48.9\n49.4\nFast-ThinkAct-3B\n50.3\n44.3\n46.4\n43.2\n46.4\n70.1\n63.0\n57.2\n53.0\n60.8\n51.2\n52.8\nWe evaluate Fast-ThinkAct on robotic manipulation using LIBERO\nliu2023libero\nand SimplerEnv\nli24simpler\nbenchmarks. LIBERO covers diverse subtasks, including Spatial, Object, Goal, and Long, while SimplerEnv provides a simulated benchmark with strong real-world correlation, featuring variations in lighting, object appearance, and camera viewpoints. As shown in Fig.\n3\n(a)-(e), Fast-ThinkAct consistently outperforms all baselines, achieving the highest success rates across all LIBERO subtasks and SimplerEnv-Google. This includes substantial improvements over foundation VLAs such as OpenVLA\nkim24openvla\n, and reasoning VLAs including CoT-VLA\nzhao2025cot\n, ThinkAct\nhuang2025thinkact\n, and MolmoAct\nlee2025molmoact\n. Moreover, as shown in Fig.\n3\n(f), our compact latent reasoning achieves 89.3% and 88.0% latency reduction compared to ThinkAct-7B\nhuang2025thinkact\nand MolmoAct-7B\nlee2025molmoact\nrespectively, and\n7\n×\n7\\times\nfaster inference than ThinkAct-3B, demonstrating substantial efficiency gains without sacrificing performance.\nTo further validate Fast-ThinkAct on more complex scenarios, we evaluate on RoboTwin2.0\nchen2025robotwin2\n, a challenging bimanual manipulation benchmark requiring long-horizon planning. As shown in Tab.\n1\n, Fast-ThinkAct significantly outperforms previous VLAs including DP\nchi2023diffusion\n, ACT\nzhao2023learning\n,\nπ\n0\n\\pi_{0}\nblack2024pi_0\n, RDT\nliu2024rdt\n, and ThinkAct\nhuang2025thinkact\nacross both easy and hard settings. Compared to RDT, Fast-ThinkAct achieves 9.3% and 3.6% higher success rates on easy and hard settings, respectively. Against the reasoning VLA ThinkAct, it improves success by 3.3% and 1.7% while maintaining substantially higher efficiency, as shown in Fig.\n3\n(f). These results demonstrate that our compact reasoning design enables both superior accuracy and computational efficiency on complex bimanual manipulation tasks.\nEmbodied Reasoning.\nIn Tab.\n2\n, we evaluate the reasoning capabilities of Fast-ThinkAct in embodied scenarios across three benchmarks: EgoPlan-Bench2\nqiu2024egoplan2\n, RoboVQA\nsermanet2024robovqa\n, and OpenEQA\nmajumdar2024openeqa\n. These benchmarks assess multi-step planning in egocentric everyday scenarios, long-horizon reasoning for robotic manipulation tasks, and zero-shot understanding of embodied scenes in diverse environments, respectively. We observed that, Fast-ThinkAct surpasses all comparison methods, including two proprietary models (i.e., GPT-4V\nachiam2023gpt\nand Gemini-2.5-Flash\ncomanici2025gemini\n), exceeding the runner-up by 2.4% on EgoPlan-Bench2, 5.5 BLEU score on RoboVQA, and 1.1 points on OpenEQA. These results demonstrate that Fast-ThinkAct effectively handles complex planning sequences and extended reasoning horizons while generalizing to novel environments, showcasing robust capabilities for scene comprehension and multi-step task execution in embodied AI applications.\nFigure 4\n:\nVisualization of predicted visual trajectories and action execution results on long-horizon tasks.\nExamples from (a) SimplerEnv-Google, (b) LIBERO-Long, and (c) RoboTwin2.0-Hard with long (278) steps. Yellow traces indicate single-arm/left gripper trajectories; red traces indicate right gripper trajectories for bimanual tasks.\nFigure 5\n:\nFailure recovery capability on RoboFAC\nlu2025robofac\n.\nLeft: Qualitative examples (from both simulation and real robot) of corrective guidance for manipulation errors. Right: Quantitative evaluation on simulation (RoboFAC-Sim) and real-robot (RoboFAC-Real) settings.\n4.3\nAnalysis of Fast-ThinkAct\nReasoning Enables Long-Horizon Planning.\nFigure 6\n:\nFew-shot adaptation results on RoboTwin2.0 benchmark.\nWe use 10 demonstrations per task for fine-tuning.\nWe analyze Fast-ThinkAct’s capability on long-horizon tasks in Tab.\n1\nand Fig.\n4\n. We focus on long-horizon tasks (average length exceeding 270 steps) in RoboTwin2.0\nchen2025robotwin2\nthat require multi-step reasoning and extended planning horizons. As shown in Tab.\n1\n, Fast-ThinkAct achieves average scores of 48.8 and 16.8 on easy and hard settings of long-horizon tasks, respectively, surpassing RDT (35.0/12.3) and ThinkAct (42.8/15.3). Fig.\n4\nvisualizes predicted 2D visual traces and execution results on representative tasks from SimplerEnv-Google\nli24simpler\n, LIBERO-Long\nliu2023libero\n, and RoboTwin2.0\nchen2025robotwin2\n. For example, the LIBERO-Long task requires sequentially turning on the stove and placing a moka pot on it, while the RoboTwin2.0 handover task requires bimanual coordination to transfer a block between grippers. The visual traces successfully predict feasible solution paths, with their corresponding representations serving as visual planning guidance for successful execution. These results demonstrate that our compact latent reasoning effectively supports long-horizon planning in complex manipulation scenarios.\nReasoning Enables Failure Recovery.\nFigure 7\n:\nReasoning trace comparison on RoboVQA.\n(a) Teacher’s textual reasoning. (b) Student’s verbalized latent reasoning.\nGreen\n: relevant content;\norange\n: less relevant content.\nA key advantage of reasoning-based VLAs\nhuang2025thinkact\n;\nabdolmaleki2025gemini\nis their ability to identify runtime failures and provide corrective guidance for recovery. To evaluate this capability, we conduct experiments on RoboFAC\nlu2025robofac\n, a benchmark specifically designed to assess failure identification and correction in embodied VLMs. As shown in Fig.\n5\n, Fast-ThinkAct substantially outperforms the second-best baseline RoboFAC-3B\nlu2025robofac\nby 10.9 points on the simulation split and 16.4 points on the real-world split. The qualitative examples demonstrate Fast-ThinkAct’s ability to reason over manipulation videos, identify failures, and propose recovery steps. For instance, in the right example where the target object drops mid-execution, Fast-ThinkAct generates a concrete recovery plan: first moving the arm backward to create space, then adjusting laterally to align with the target object, and finally lowering to the appropriate height for a secure grasp. These results demonstrate that our latent reasoning supports both fast task execution and crucial failure analysis capabilities essential for robust robotic manipulation.\nReasoning Enables Few-Shot Adaptation.\nTable 3\n:\nAblation study of training objectives and learning stages.\nNote that Fast-ThinkAct w/o\nℒ\nverb\n,\nℒ\ndistill\n\\mathcal{L}_{\\text{verb}},\\mathcal{L}_{\\text{distill}}\ndenotes the student VLM\nℱ\nθ\n\\mathcal{F}_{\\theta}\ntrained without the corresponding loss components.\nMethod\nEgoPlan\nRoboVQA\nOpenEQA\nAverage\nFast-ThinkAct\n46.4\n60.8\n51.2\n52.8\nw/o\nℒ\nverb\n\\mathcal{L}_{\\text{verb}}\n42.1\n53.8\n49.5\n48.5\nw/o\nℒ\nverb\n,\nℒ\ndistill\n\\mathcal{L}_{\\text{verb}},\\mathcal{L}_{\\text{distill}}\n41.6\n52.7\n48.9\n47.7\nTextual Teacher\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\n41.7\n58.2\n49.4\n49.8\nSFT + CoT-SFT\n40.0\n46.1\n48.8\n45.0\nSFT only\n40.5\n53.6\n45.3\n46.5\nTo assess how reasoning capability improves few-shot adaptation, we conduct few-shot experiments on the RoboTwin2.0 benchmark\nchen2025robotwin2\n, fine-tuning models using only 10 demonstrations per task. As illustrated in Fig.\n6\n, Fast-ThinkAct significantly enhances our adopted action model RDT\nliu2024rdt\nand outperforms the state-of-the-art VLAs, including\nπ\n0\n\\pi_{0}\nblack2024pi_0\nand ThinkAct\nhuang2025thinkact\non both medium and long-horizon tasks. Notably, our method achieves these gains while operating with significantly lower reasoning latency compared to ThinkAct, highlighting the advantage of efficient yet effective reasoning for few-shot action adaptation in complex robot manipulation scenarios.\nVisualization of Verbalizable Latent Reasoning.\nIn Fig.\n7\n, we compare the teacher’s textual reasoning with the student’s verbalized latent reasoning on RoboVQA. While both capture task-relevant information (\ngreen\n), the teacher generates verbose outputs with less directly relevant content (\norange\n), whereas our student produces more concise and focused responses when verbalized. This demonstrates that our preference-guided distillation not only reduces computational cost but also distills concise reasoning patterns while filtering out redundant information.\nAblation Study.\nIn Tab.\n3\n, we ablate training stages and loss components. Starting from the full Fast-ThinkAct, removing\nℒ\nverb\n\\mathcal{L}_{\\text{verb}}\ncauses performance drops as latent CoTs lack preference-based guidance to align with high-quality reasoning and suppress low-quality patterns. Further removing\nℒ\ndistill\n\\mathcal{L}_{\\text{distill}}\nleads to additional decline, indicating that aligning trajectory-level representations is crucial for transferring visual planning capabilities. Comparing training strategies, CoT-SFT underperforms SFT on EgoPlan-Bench2 and RoboVQA but improves on OpenEQA, suggesting naïve chain-of-thought supervision benefits open-ended QA but introduces verbosity that hinders structured reasoning tasks. Our preference-guided approach distills high-quality reasoning while maintaining efficiency. This validates the necessity of our proposed distillation framework and visual trajectory alignment. We provide additional ablation studies in the supplementary material.\n5\nConclusion\nWe presented\nFast-ThinkAct\n, an efficient reasoning framework for vision-language-action tasks that achieves compact yet expressive planning through verbalizable latent reasoning. By distilling lengthy textual reasoning into compact latent representations via preference-guided distillation and visual trajectory alignment, our approach bridges high-level embodied reasoning with low-level action execution through reasoning-enhanced policy learning. Extensive experiments across diverse robotic manipulation and embodied reasoning benchmarks demonstrate that Fast-ThinkAct achieves strong performance with significantly reduced inference latency while enabling effective long-horizon planning, few-shot adaptation, and failure recovery capabilities.\nLimitations and Future Works.\nAs our verbalizer\n𝒱\nψ\n\\mathcal{V}_{\\psi}\nis built upon a pre-trained LLM, it inevitably inherits language model limitations, including hallucination, occasionally producing plausible but inaccurate descriptions. However, this does not affect action execution during inference, as the verbalizer serves only for interpretability while action prediction uses the grounded latent representations from visual plan distillation. To further improve the faithfulness of verbalized reasoning, we can consider incorporating grounding-aware objectives or hallucination suppression techniques in future work.\nAppendix A\nAdditional Experimental Setup\nA.1\nAlgorithm\nInput:\nCoT-SFT checkpoint\nℱ\nθ\n0\n\\mathcal{F}_{\\theta_{0}}\n, training data\n𝒟\n\\mathcal{D}\n, rollout size\nN\nN\n, latent reasoning steps\nM\nM\n, number of waypoints\nK\nK\n, total iterations\nT\ntotal\nT_{\\text{total}}\nOutput:\nTrained student model\nℱ\nθ\n\\mathcal{F}_{\\theta}\n//\nInitialize models\nℱ\nθ\nT\n←\nℱ\nθ\n0\n\\mathcal{F}_{\\theta}^{T}\\leftarrow\\mathcal{F}_{\\theta_{0}}\n,\nℱ\nθ\n←\nℱ\nθ\n0\n\\mathcal{F}_{\\theta}\\leftarrow\\mathcal{F}_{\\theta_{0}}\n;\nInitialize verbalizer\n𝒱\nψ\n\\mathcal{V}_{\\psi}\nfrom pre-trained LLM;\nt\n←\n0\nt\\leftarrow 0\n;\nwhile\nt\n<\nT\ntotal\nt<T_{\\text{total}}\ndo\nSample batch\n(\no\n,\nl\n,\np\n^\n)\n(o,l,\\hat{p})\nfrom\n𝒟\n\\mathcal{D}\n;\n//\nSuppose bs=1 for simplicity\n0.5em\n//\nTeacher GRPO training\nGenerate\nN\nN\nrollouts\n{\nτ\ni\n}\ni\n=\n1\nN\n\\{\\tau_{i}\\}_{i=1}^{N}\nfrom\nℱ\nθ\nT\n​\n(\no\n,\nl\n)\n\\mathcal{F}_{\\theta}^{T}(o,l)\n;\nCompute trajectory rewards\n{\nr\ni\n}\ni\n=\n1\nN\n\\{r_{i}\\}_{i=1}^{N}\n;\nCompute group-wise advantages\n{\nA\ni\n}\ni\n=\n1\nN\n\\{A_{i}\\}_{i=1}^{N}\n;\nUpdate\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\nwith\n𝒥\nGRPO\n\\mathcal{J}_{\\text{GRPO}}\n(Eq. 1);\nτ\n+\n←\narg\n⁡\nmax\ni\n⁡\nA\ni\n\\tau^{+}\\leftarrow\\arg\\max_{i}A_{i}\n,\nτ\n−\n←\narg\n⁡\nmin\ni\n⁡\nA\ni\n\\tau^{-}\\leftarrow\\arg\\min_{i}A_{i}\n(Eq. 3) ;\n//\nFor student distillation\nh\nt\nT\n←\nh_{t}^{T}\\leftarrow\nhidden state of\nτ\n+\n\\tau^{+}\nat\n<answer>\ntoken from\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\n;\n//\nFor distillation loss\n//\nStudent latent distillation\n𝐳\n=\n{\nz\nm\n}\nm\n=\n1\nM\n←\nℱ\nθ\n​\n(\no\n,\nl\n)\n\\mathbf{z}=\\{z_{m}\\}_{m=1}^{M}\\leftarrow\\mathcal{F}_{\\theta}(o,l)\n;\n//\nPerform auto-regressive latent reasoning\nCompute\nℒ\nverb\n\\mathcal{L}_{\\text{verb}}\nwith\n𝐳\n\\mathbf{z}\n,\n𝒱\nψ\n\\mathcal{V}_{\\psi}\n,\nτ\n+\n\\tau^{+}\n,\nτ\n−\n\\tau^{-}\n(Eq. 4);\nForward\nK\nK\nspatial tokens from\nℱ\nθ\n​\n(\no\n,\nl\n,\n𝐳\n)\n\\mathcal{F}_{\\theta}(o,l,\\mathbf{z})\nto obtain\nh\nt\nh_{t}\nand\n{\nh\n′\n​\n(\n𝐬\ni\n)\n}\ni\n=\n1\nK\n\\{h^{\\prime}(\\mathbf{s}_{i})\\}_{i=1}^{K}\n;\nCompute\nℒ\ndistill\n\\mathcal{L}_{\\text{distill}}\nwith\nh\nt\nT\nh_{t}^{T}\n,\nh\nt\nh_{t}\n(Eq. 5);\nCompute\nℒ\nans\n\\mathcal{L}_{\\text{ans}}\nwith\n{\nh\n′\n​\n(\n𝐬\ni\n)\n}\ni\n=\n1\nK\n\\{h^{\\prime}(\\mathbf{s}_{i})\\}_{i=1}^{K}\n,\np\n^\n\\hat{p}\n(Eq. 6);\nUpdate\nℱ\nθ\n\\mathcal{F}_{\\theta}\nwith\nℒ\nstudent\n=\nℒ\nverb\n+\nℒ\ndistill\n+\nℒ\nans\n\\mathcal{L}_{\\text{student}}=\\mathcal{L}_{\\text{verb}}+\\mathcal{L}_{\\text{distill}}+\\mathcal{L}_{\\text{ans}}\n;\nt\n←\nt\n+\n1\nt\\leftarrow t+1\n;\nend while\nreturn\nℱ\nθ\n\\mathcal{F}_{\\theta}\n;\nAlgorithm 1\nTraining Fast-ThinkAct (Sec. 3.2)\nAlgorithm\n1\npresents the complete training procedure corresponding to Sec. 3.2. It shows how we jointly optimize the teacher model with GRPO and distill its reasoning into the student’s compact latent representations.\nA.2\nImplementation Details\nOur implementation follows the setup described in Sec. 4.1 of the main paper. Here we provide additional details. The verbalizer\n𝒱\nψ\n\\mathcal{V}_{\\psi}\nis initialized from a small LLM, Qwen3-0.6B, with cross-attention layers inserted at each layer to condition on latent CoTs\n𝐳\n\\mathbf{z}\n. For the student model training, in the first 3,000 iterations, we replace verbalization loss\nℒ\nverb\n\\mathcal{L}_{\\text{verb}}\nwith language modeling loss using\nτ\n+\n\\tau^{+}\nas ground truth to warm up\n𝒱\nψ\n\\mathcal{V}_{\\psi}\n’s alignment with the latent representations\n𝐳\n\\mathbf{z}\n. We then freeze\n𝒱\nψ\n\\mathcal{V}_{\\psi}\nand use the\nℒ\nverb\n\\mathcal{L}_{\\text{verb}}\nfor the remaining 1,500 iterations. The student\nℱ\nθ\n\\mathcal{F}_{\\theta}\nis optimized throughout both phases. For waypoint prediction in Eq. 6, each\np\ni\n∈\nℝ\n6\np_{i}\\in\\mathbb{R}^{6}\nencodes coordinates in the format\n[\nx\nsingle\n,\ny\nsingle\n,\nx\nleft\n,\ny\nleft\n,\nx\nright\n,\ny\nright\n]\n[x_{\\text{single}},y_{\\text{single}},x_{\\text{left}},y_{\\text{left}},x_{\\text{right}},y_{\\text{right}}]\n, where the first two dimensions are for single-arm and the last four are for bimanual robot. For ground-truth\np\n^\n​\ni\n\\hat{p}i\n, we fill the corresponding dimensions based on robot type and mask out the unused dimensions when computing\nℒ\nans\n\\mathcal{L}_{\\text{ans}}\n. For GRPO training, we follow the configuration of ThinkAct\nhuang2025thinkact\n, using rollout size\nN\n=\n5\nN=5\n. Following\nlee2025molmoact\n, we set the number of waypoints in trajectory to\nK\n=\n5\nK=5\n. We use\nM\n=\n6\nM=6\nlatent reasoning tokens, with ablation study provided in Fig.\n8\n.\nDuring reasoning-enhanced policy learning, for SimplerEnv\nli24simpler\nevaluation, to ensure fair comparison with previous works\nkim24openvla\n;\nlee2025molmoact\n, we initialize\nπ\nϕ\n\\pi_{\\phi}\nfrom DiT-Policy\nchi2023diffusion\npre-trained on the same OXE dataset\no2024open\n;\nkim24openvla\nand conduct reasoning-enhanced policy learning (Sec. 3.3) using the same OXE data. For LIBERO\nliu2023libero\nand RoboTwin2.0\nchen2025robotwin2\nevaluations, we initialize\nπ\nϕ\n\\pi_{\\phi}\nfrom RDT\nliu2024rdt\n, which has demonstrated strong performance on RoboTwin2.0, and conduct policy learning using OXE\no2024open\nand static ALOHA datasets\nshi2023waypoint\n;\nzhao2023learning\n. Our method further enhances RDT’s manipulation capabilities on both benchmarks. The use of different action models also demonstrates that our approach is agnostic to the underlying action model choice.\nA.3\nTraining Data Details\nA.3.1\nDataset Sources\n2D Visual Trace of Manipulation Tasks.\nFor single-arm manipulation, we utilize 2D visual trajectories labeled by MolmoAct\nlee2025molmoact\nfrom the Open X-Embodiment (OXE) dataset\no2024open\n, comprising approximately 1.3M trajectories. For bimanual manipulation, we extract dual-arm visual trajectories from the AIST dataset\naist2025aist\n, resulting in approximately 92K trajectory samples. Specifically, we first use Molmo-72B\ndeitke2024molmo\nto detect left and right gripper positions (following\nlee2025molmoact\n) in the first frame, then apply CoTracker3\nkaraev2025cotracker3\nto track and parse the manipulation trajectories throughout the video sequences.\nRoboFAC\nlu2025robofac\n.\nRoboFAC is a robotic failure analysis dataset containing 9,440 erroneous manipulation trajectories across 16 tasks in both simulated and real-world environments. We utilize the training set with 64K QA pairs covering various failure types for developing failure identification and correction planning capabilities.\nRoboVQA\nsermanet2024robovqa\n.\nRoboVQA contains robot manipulation videos with QA tasks covering task understanding. The dataset includes approximately 5K long-horizon and 92K medium-horizon video sequences from diverse robotic platforms, resulting in total 798K QA pairs. Videos are annotated with multiple questions probing spatial reasoning, action prediction, and task comprehension.\nShareRobot\nji2025robobrain\n.\nShareRobot is a large-scale dataset collected by RoboBrain\nji2025robobrain\n, containing over 1M QA pairs covering task planning, object affordances, and manipulation strategies across diverse robot embodiments and scenes. The dataset features fine-grained annotations linking task descriptions to frame-level execution details, facilitating learning of transferable manipulation knowledge.\nEgoPlan-Bench\nchen2023egoplan\n.\nEgoPlan-Bench features egocentric videos of daily activities annotated with task planning information including goals, execution history, and current states. The dataset contains approximately 53K video-text pairs for training long-horizon planning and progress tracking capabilities from egocentric view.\nVideo-R1-CoT\nfeng2025video\n.\nVideo-R1 comprises 165K video question-answer pairs with chain-of-thought reasoning annotations generated by large-scale vision-language models. The dataset covers diverse reasoning domains including mathematical logic, spatial understanding, OCR, and visual analytics. All samples are quality-filtered to ensure annotation consistency and correctness.\nPixMo\ndeitke2024molmo\n.\nPixMo is a general-purpose vision-language dataset with diverse image captions and question-answer pairs. Following MolmoAct\nlee2025molmoact\n, we incorporate PixMo dataset to preserve general visual understanding and prevent catastrophic forgetting when training on embodied dataset. Specifically, we use approximately 726K samples from the\nask_model_anything\n,\ncap\n, and\ncap-qa\nsplits.\nA.3.2\nData Processing and Formatting\nSupervised Fine-Tuning (SFT).\nTo enhance foundational embodied knowledge, we perform supervised fine-tuning on approximately 4M samples combining 2D visual trajectories from MolmoAct\nlee2025molmoact\nand AIST\naist2025aist\n, along with QA data from PixMo\ndeitke2024molmo\n, RoboFAC\nlu2025robofac\n, RoboVQA\nsermanet2024robovqa\n, ShareRobot\nji2025robobrain\n, and EgoPlan\nchen2023egoplan\n. This stage enables the model to acquire basic visual understanding, task comprehension, and manipulation knowledge across diverse embodiments and scenarios.\nChain-of-Thought SFT (CoT-SFT).\nTo develop reasoning capabilities while preserving embodied understanding, we sample 5% from the SFT data (approximately 200K samples) and augment with 165K samples from Video-R1-CoT\nfeng2025video\n. For data with CoT annotations, we format prompts to elicit structured reasoning enclosed in\n<think>\ntags followed by answers in\n<answer>\ntags; for data without CoT annotations, we prompt for direct answers only. This enables the model to learn reasoning capabilities from CoT-annotated data and generalize them to embodied tasks.\nTeacher-Student Training.\nBuilding upon the CoT-SFT checkpoint, we curate a balanced training set by sampling approximately 5,000 instances from each dataset and data type, totaling nearly 50K samples. We adopt the prompt formatting strategy from CoT-SFT for both teacher GRPO training and student latent distillation. We train both the teacher with GRPO and the student with latent distillation (as detailed in Sec. 3.2) on this data, efficiently transferring high-quality reasoning patterns into compact latent representations.\nTable 4\n:\nQuantitative results with larger model size (7B or 8B) on embodied reasoning benchmarks.\nMethod\nEgoPlan-Bench2\nRoboVQA\nOpenEQA\nOverall\nDaily.\nWork.\nRec.\nHobbies\nAvg.\nB-1\nB-2\nB-3\nB-4\nB-Avg.\nScore\nAvg.\nInternVL2.5-8B\nchen2024expanding\n36.2\n28.7\n34.4\n35.4\n33.5\n40.5\n33.3\n29.6\n27.5\n32.7\n54.4\n40.2\nInternVL3-8B\nzhu2025internvl3\n38.5\n32.9\n36.1\n37.2\n36.2\n44.3\n36.5\n31.6\n28.9\n35.3\n55.5\n42.3\nNVILA-8B\nliu2024nvila\n35.8\n28.7\n37.2\n35.4\n33.7\n42.7\n39.7\n37.6\n36.1\n39.0\n54.0\n42.2\nQwen2.5-VL-7B\nbai2025qwen2\n31.4\n26.7\n29.5\n28.6\n29.1\n47.8\n41.2\n36.2\n33.7\n39.7\n50.8\n39.9\nMagma-8B\nyang2025magma\n32.1\n25.7\n34.4\n29.3\n29.8\n38.6\n31.5\n28.1\n26.7\n31.2\n49.1\n36.7\nRoboBrain2.0-7B\nteam2025robobrain2\n39.4\n27.0\n33.9\n32.2\n33.2\n44.9\n38.2\n34.7\n33.5\n37.8\n51.1\n40.7\nThinkAct-7B\nhuang2025thinkact\n50.1\n49.8\n44.8\n45.2\n48.2\n69.1\n61.8\n56.0\n52.4\n59.8\n56.2\n54.7\nFast-ThinkAct-7B\n51.3\n47.3\n41.5\n45.9\n47.5\n70.4\n63.3\n57.3\n53.2\n61.1\n59.0\n55.9\nTable 5\n:\nResults on LIBERO and SimplerEnv benchmarks with additional ThinkAct-3B comparison.\nMethod\nLIBERO\nSimplerEnv-Google\nLatency (\n↓\n\\downarrow\n)\nOpenVLA-7B\nkim24openvla\n76.5\n40.2\nN/A\nCoT-VLA-7B\nzhao2025cot\n83.9\nN/A\nN/A\nThinkAct-7B\nhuang2025thinkact\n84.4\n68.3\n7513\nMolmoAct-7B\nlee2025molmoact\n86.8\n64.9\n6723\nThinkAct-3B\nhuang2025thinkact\n83.1\n64.7\n5674\nFast-ThinkAct-3B\n89.7\n68.7\n805 (\n↓\n\\downarrow\n7.0\n×\n\\times\n)\nTable 6\n:\nComparison with efficient textual reasoning methods.\nMethod\nEgoPlan-\nBench2\nRoboVQA\nOpenEQA\nAverage\nTextual Teacher\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\n41.7\n58.2\n49.4\n49.8\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\nInference w/o thinking\n42.7\n55.0\n41.7\n46.5\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\nInference w/ 6 textual tokens\n39.3\n53.0\n46.5\n46.3\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\nw/ RL Length-Penalty\narora2025training\n41.2\n57.5\n44.7\n47.8\nFast-ThinkAct-3B\n46.4\n60.8\n52.8\n53.3\nA.4\nEvaluation Setup\nA.4.1\nEmbodied Reasoning Benchmarks\nWe evaluate on three benchmarks assessing different aspects of embodied reasoning. EgoPlan-Bench2\nchen2023egoplan\ntests egocentric task planning across 24 daily-life scenarios with 1,321 multiple-choice questions, measuring accuracy in predicting next steps given task goals and progress history. RoboVQA\nsermanet2024robovqa\nevaluates visual reasoning in manipulation contexts through 1,893 free-form QA pairs from robot and human demonstrations, assessed via BLEU score. OpenEQA\nmajumdar2024openeqa\nassesses spatial and functional understanding through 1,600+ questions spanning 180+ real-world environments, evaluated using LLM-based scoring aligned with human preferences. These benchmarks comprehensively evaluate embodied reasoning capability across planning, manipulation, and spatial understanding.\nA.4.2\nRobotic Manipulation Benchmarks\nFigure 8\n:\nVisualization of predicted visual trajectories and action execution results on RoboTwin2.0.\nYellow traces indicate left gripper trajectories; red traces indicate right gripper trajectories for bimanual tasks.\nFigure 9\n:\nFailure identification and analysis capabilities on RoboFAC\nlu2025robofac\n.\nTop row shows identification of failure types and execution stages. Bottom row demonstrates failure root cause analysis.\nFigure 10\n:\nReasoning trace comparison on OpenEQA.\n(a) Teacher’s textual reasoning. (b) Student’s verbalized latent reasoning.\nGreen\n: reasonable reasoning trace;\nred\n: incorrect trace.\nWe evaluate on three simulation benchmarks covering diverse manipulation scenarios. SimplerEnv\nli24simpler\nprovides manipulation tasks with strong sim-to-real correlation, featuring diverse visual variations in lighting, textures, backgrounds, and camera poses. Following MolmoAct\nlee2025molmoact\n, we evaluate on the Google Robot tasks using the standard protocol\nkim24openvla\n;\nlee2025molmoact\nof directly evaluating on SimplerEnv after training on OXE. LIBERO\nliu2023libero\ntargets different generalization challenges through four task suites: spatial layout variation (LIBERO-Spatial), object diversity (LIBERO-Object), goal variation (LIBERO-Goal), and long-horizon planning with mixed variations (LIBERO-Long). We evaluate each suite over 500 trials using 3 random seeds following prior works\nkim24openvla\n;\nlee2025molmoact\n. RoboTwin2.0\nchen2025robotwin2\nfeatures challenging bimanual manipulation with easy and hard difficulty settings, where the hard setting introduces domain randomization including clutter, lighting variations, diverse textures, and height changes. Following the original protocol, we train on 50 clean expert demonstrations per task and evaluate with 100 rollouts under both settings. We assess 10 tasks categorized into short, medium, and long horizons based on demonstration lengths.\nAppendix B\nAdditional Experiment Results\nB.1\nAdditional Quantitative Results\nResults of Larger Model Size.\nTo demonstrate the scalability of our approach, we apply Fast-ThinkAct to a larger backbone, Qwen2.5-VL-7B, and evaluate its performance on embodied reasoning benchmarks. As shown in Tab.\n4\n, Fast-ThinkAct consistently achieves strong performance across EgoPlan-Bench2\nqiu2024egoplan2\n, RoboVQA\nsermanet2024robovqa\n, and OpenEQA\nmajumdar2024openeqa\n, validating that our latent reasoning distillation method effectively scales to larger model backbones.\nPerformance Comparison with ThinkAct-3B.\nTab.\n5\npresents detailed numerical results corresponding to Fig. 3 with additional ThinkAct-3B results. At the same 3B model size, Fast-ThinkAct achieves notable performance gains (89.7 vs. 83.1 on LIBERO, 68.7 vs. 64.7 on SimplerEnv-Google) while dramatically improving efficiency with\n7\n×\n\\times\nfaster inference (805ms vs. 5674ms).\nComparison with Efficient Reasoning Baselines.\nTable\n6\ncompares our method with efficient textual reasoning alternatives applied to the textual teacher\nℱ\nθ\nT\n\\mathcal{F}_{\\theta}^{T}\n. We evaluate three baselines: removing reasoning during inference entirely (0 tokens), constraining the teacher to generate only 6 textual tokens during inference, and applying RL training with a length penalty\narora2025training\nto encourage concise reasoning (\n∼\n\\sim\n50 tokens). These achieve 46.5, 46.3, and 47.8 respectively, all degrading from the teacher’s 49.8. In contrast, Fast-ThinkAct uses only 6 latent tokens and achieves\n53.3\n, demonstrating superior efficiency and performance.\nB.2\nAdditional Qualitative Results\nQualitative Robot Execution.\nWe provide qualitative robot execution comparisons between the base action model RDT\nliu2024rdt\nand Fast-ThinkAct in the supplementary video\nFast-ThinkAct.mp4\n. Our method shows substantial improvements on challenging robotic execution tasks, where reasoning capabilities provide better spatial understanding and coordination for successful manipulation.\nBimanual Manipulation Results.\nIn Fig.\n8\n, we present visualized trajectories and execution results for\nhanging mug\nand\nhandover mic\ntasks under easy and hard settings in RoboTwin2.0\nchen2025robotwin2\n. The hard setting includes different backgrounds and distractor objects. These examples show successful bimanual coordination where predicted waypoints accurately guide both grippers through the manipulation sequence, demonstrating Fast-ThinkAct’s spatial reasoning ability across varied visual conditions.\nFailure Identification and Recovery.\nIn Fig.\n9\n, we demonstrate Fast-ThinkAct’s failure identification and analysis capabilities, complementing the recovery planning shown in the main paper. The top row shows that Fast-ThinkAct identifies failure types (e.g., position deviation) and execution stages (e.g., reaching for the cube). The bottom row illustrates root cause analysis, for instance, in the bottom-right example, the model correctly infers that the failure to push the cube with an L-shaped tool stems from an improper initial grasp. These results demonstrate Fast-ThinkAct’s comprehensive understanding of manipulation failures beyond recovery planning.\nVerbalized Latent Reasoning.\nFig.\n10\nvisualizes teacher textual reasoning and student verbalized reasoning. While the student generates compact and correct (\ngreen\n) reasoning, the teacher’s lengthy output sometimes contains erroneous steps (\nred\n) that might degrade the performance.\nB.3\nAdditional Ablation Study and Analysis\nAdditional Ablation Results on Manipulation Benchmarks.\nTable\n8\nshows ablation results on LIBERO\nliu2023libero\n, SimplerEnv-Google\nli24simpler\n, and RoboTwin2.0\nchen2025robotwin2\n. Removing\nℒ\nverb\n\\mathcal{L}_{\\text{verb}}\nor\nℒ\ndistill\n\\mathcal{L}_{\\text{distill}}\nprogressively degrades performance, confirming their contributions. Our full model consistently outperforms the textual teacher and models without teacher-student training (CoT-SFT, SFT only), demonstrating the benefits of compact latent reasoning distillation.\nTable 7\n:\nAdditional ablation study of training objectives and learning stages on robot manipulation benchmarks.\nMethod\nLIBERO\nSimplerEnv\nGoogle\nRoboTwin2.0\nAverage\nFast-ThinkAct\n89.7\n68.7\n46.1\n68.2\nw/o\nℒ\nverb\n\\mathcal{L}_{\\text{verb}}\n88.6\n67.3\n44.9\n66.9\nw/o\nℒ\nverb\n,\nℒ\ndistill\n\\mathcal{L}_{\\text{verb}},\\mathcal{L}_{\\text{distill}}\n86.3\n65.7\n42.6\n64.9\nTextual Teacher\n88.5\n67.3\n45.8\n67.2\nSFT + CoT-SFT\n87.2\n65.8\n43.3\n65.4\nSFT only\n86.9\n64.5\n42.8\n64.7\nTable 8\n:\nAblation of Latent Reasoning Steps\nM\nM\n.\nAblation Study on Action Model Conditioning.\nIn Sec. 3.3, we extract visual latent planning\nc\nt\nc_{t}\nfrom early-layer KV cache of spatial tokens to condition the action model. We compare this against using late-layer KV cache (last\nN\nN\nlayers, where\nN\nN\nis the action model depth) and directly using spatial tokens’ output hidden states. Our approach achieves\n89.7\non LIBERO, outperforming late-layer KV at 88.3 and output hidden states at 87.1, demonstrating that early-layer representations better capture visual planning information for action prediction. Therefore, we adopt early-layer KV conditioning as our default configuration.\nAblation Study on Latent Reasoning Steps.\nIn Fig.\n8\n, we study the effect of latent reasoning steps\nM\nM\n. We observe that too few steps (\nM\n=\n1\nM=1\n) limit reasoning capacity, while excessive steps (\nM\n=\n30\n,\n100\nM=30,100\n) might introduce redundant or noisy information. Therefore, we adopt\nM\n=\n6\nM=6\n, which achieves optimal performance, as our default.\nReferences",
  "preview_text": "Vision-Language-Action (VLA) tasks require reasoning over complex visual scenes and executing adaptive actions in dynamic environments. While recent studies on reasoning VLAs show that explicit chain-of-thought (CoT) can improve generalization, they suffer from high inference latency due to lengthy reasoning traces. We propose Fast-ThinkAct, an efficient reasoning framework that achieves compact yet performant planning through verbalizable latent reasoning. Fast-ThinkAct learns to reason efficiently with latent CoTs by distilling from a teacher, driven by a preference-guided objective to align manipulation trajectories that transfers both linguistic and visual planning capabilities for embodied control. This enables reasoning-enhanced policy learning that effectively connects compact reasoning to action execution. Extensive experiments across diverse embodied manipulation and reasoning benchmarks demonstrate that Fast-ThinkAct achieves strong performance with up to 89.3\\% reduced inference latency over state-of-the-art reasoning VLAs, while maintaining effective long-horizon planning, few-shot adaptation, and failure recovery.\n\n\\correspondingauthor\nX\nFast-ThinkAct: Efficient Vision-Language-Action Reasoning via Verbalizable Latent Planning\nChi-Pin Huang\n1\nYunze Man\n2\nZhiding Yu\nMin-Hung Chen\nJan Kautz\nYu-Chiang Frank Wang\n1\nFu-En Yang\nNVIDIA\nAbstract\nVision-Language-Action (VLA) tasks require reasoning over complex visual scenes and executing adaptive actions in dynamic environments. While recent studies on reasoning VLAs show that explicit chain-of-thought (CoT) can improve generalization, they suffer from high inference latency due to lengthy reasoning traces. We propose Fast-ThinkAct, an efficient reasoning framework that achieves compact yet performant planning through verbalizable latent reasoning. Fast-ThinkAct learns to reason efficiently with latent CoTs by distilling from a teacher, driven by a preference-guided objective to align manipulation trajectories ",
  "is_relevant": true,
  "relevance_score": 8.0,
  "extracted_keywords": [
    "Reinforcement Learning",
    "VLA",
    "locomotion",
    "whole body control"
  ],
  "one_line_summary": "Fast-ThinkAct 是一个高效的视觉-语言-动作推理框架，通过可言语化的潜在规划减少推理延迟，提升具身控制性能。",
  "detailed_summary": "## 论文摘要：Fast-ThinkAct: Efficient Vision-Language-Action Reasoning via Verbalizable Latent Planning\n\n### 1. 研究背景和动机\n视觉-语言-动作模型在具身智能任务中需要处理复杂的视觉场景并执行自适应动作。现有基于显式思维链的推理方法虽然提升了泛化能力，但冗长的推理过程导致**推理延迟极高**（例如每秒0.1次决策），无法满足机器人等实时应用的需求。如何在保持强大推理能力的同时，大幅提升效率，成为关键挑战。\n\n### 2. 核心方法和技术创新\n本文提出 **Fast-ThinkAct**，一个高效的具身推理框架，其核心创新在于将冗长的文本思维链**压缩为可言语化的潜在表示**。\n- **可言语化潜在规划**：采用师生蒸馏框架。教师模型（文本VLM）生成显式思维链；学生模型则学习生成**紧凑的连续潜在向量**来编码推理过程。通过一个**言语化器**，这些潜在向量可被解码回文本，确保了潜在空间的语义可解释性。\n- **偏好引导的蒸馏**：利用教师模型强化学习训练中的奖励信号构建**高质量与低质量推理对**，指导学生模型的潜在表示更倾向于编码高质量的推理模式。\n- **视觉轨迹对齐**：除了语言推理，还通过对齐师生模型在视觉轨迹规划上的隐藏状态，将关键的**空间视觉规划能力**蒸馏到学生模型中。\n- **推理增强的策略学习**：训练完成后，冻结学生VLM，将其生成的紧凑视觉规划潜在表示作为条件，指导一个扩散Transformer动作模型生成低层机器人动作，从而桥接高层规划与底层执行。\n\n### 3. 主要实验结果\n在多个具身操作与推理基准测试中，Fast-ThinkAct取得了卓越的性能与效率：\n- **性能领先**：在LIBERO、SimplerEnv、RoboTwin2.0等机器人操作任务上，成功率超越OpenVLA、ThinkAct等先进模型。在EgoPlan、RoboVQA等具身推理基准上，也超过了GPT-4V、Gemini等通用大模型。\n- **效率飞跃**：相比ThinkAct-7B，实现了高达**89.3%的推理延迟降低**，推理速度提升约9.3倍，同时性能更优。\n- **关键能力**：实验验证了该方法在**长时程规划、小样本适应、失败恢复**等方面均具备强大能力。\n\n### 4. 研究意义和价值\nFast-ThinkAct首次系统性地解决了推理VLA模型的效率瓶颈问题。其价值在于：\n- **技术贡献**：提出了“可言语化潜在推理”的新范式，通过偏好蒸馏与视觉对齐，在压缩表示的同时保留了丰富的语义和空间信息，为高效多模态推理提供了新思路。\n- **实际应用**：大幅提升的推理速度使得复杂的在线规划与决策能够应用于对实时性要求严格的真实机器人场景，推动了具身智能走向实用化。\n- **开源与可复现**：基于开源模型构建，为社区提供了高效VLA研究的新基线。",
  "qa_pairs": [
    {
      "question": "这篇论文的核心创新点是什么，他想解决什么问题，怎么解决的？",
      "answer": "## 论文核心分析：Fast-ThinkAct\n\n### **一、 核心问题**\n论文旨在解决**视觉-语言-动作（VLA）模型在具身推理任务中的“效率-性能”权衡难题**。具体而言：\n- **问题**：现有的“推理型VLA”模型（如ThinkAct）通过生成显式的、冗长的思维链（CoT）来提升任务泛化能力和规划能力，但这导致了**极高的推理延迟**（例如每秒仅能做出0.1次决策），无法满足机器人等**实时性要求高**的具身AI应用需求。\n- **矛盾**：直接缩短文本推理链（CoT）会丢失关键信息，导致性能下降。如何在保持强大推理能力的同时，实现高效、紧凑的规划，是当前领域的核心挑战。\n\n### **二、 核心创新点**\n论文提出了 **Fast-ThinkAct** 框架，其核心创新在于 **“可言语化的潜在规划”** 。这是一种**范式转换**：从生成冗长的显式文本推理链，转向学习紧凑的、连续的潜在表示来进行内部推理。\n\n1.  **创新方法：可言语化的潜在推理**\n    - **传统方法**：VLM → 生成冗长文本CoT（~250个token）→ 指导动作。\n    - **Fast-ThinkAct**：VLM → 生成少量**连续潜在向量**（如6个） + **并行空间token** → 指导动作。\n    - **关键**：这些潜在向量可以通过一个额外的“言语化器”LLM解码回自然语言，从而保证了潜在空间的**可解释性**，并在训练阶段利用语言偏好进行对齐。\n\n2.  **创新训练机制：偏好引导的蒸馏与轨迹对齐**\n    为了将教师模型（生成文本CoT）的能力压缩到学生模型（生成潜在向量）中，论文设计了一个多目标蒸馏框架：\n    - **偏好引导的言语化损失**：利用教师模型在强化学习（GRPO）训练中产生的**奖励信号**，区分高质量与低质量的推理链。通过类似DPO的目标，训练学生模型生成的潜在向量，使其被“言语化器”解码时，更倾向于对应高质量的推理文本。\n    - **动作对齐的视觉规划蒸馏损失**：直接对齐教师和学生模型在关键视觉规划表征（如`<answer>` token的隐藏状态）上的距离，确保学生模型继承教师对**空间-时间动态**的理解能力，这对于具身控制至关重要。\n    - **并行空间轨迹预测**：使用一组可学习的空间token，并行预测未来轨迹的多个路径点，替代了教师模型自回归生成文本路径点的低效方式。\n\n3.  **创新架构：推理增强的策略学习**\n    - 训练完成后，**冻结**已学会潜在推理的学生VLM。\n    - 将其生成的**视觉潜在规划**（从空间token的Key-Value缓存中提取）作为**高级条件**，输入到扩散Transformer等动作模型中，指导低层动作的生成。\n    - 这实现了**高层紧凑规划**与**底层动作执行**的高效、紧密耦合。\n\n### **三、 解决方案总结**\n**如何解决效率问题？**\n1.  **表示压缩**：将数百个文本token的推理链压缩为少数几个连续潜在向量和并行空间token，极大减少了自回归生成的步数。\n2.  **并行预测**：对视觉轨迹路径点进行并行预测，避免了逐点生成的序列延迟。\n3.  **训练-推理解耦**：复杂的“言语化器”和偏好学习**仅在训练阶段使用**，推理时只需轻量的学生VLM和动作模型，流程简洁。\n\n**如何保证性能不降反升？**\n1.  **高质量知识蒸馏**：通过基于奖励的偏好学习，蒸馏了教师模型中最有效的推理模式，过滤了冗长文本中的噪声和无关信息。\n2.  **多模态对齐**：通过视觉规划蒸馏损失，显式地保留了对于具身控制至关重要的**空间视觉信息**，这是纯文本压缩容易丢失的。\n3.  **高效表征利用**：紧凑的潜在表征作为强条件信号，更直接、高效地引导动作模型，可能比冗长文本的语义信息更易于模型利用。\n\n### **四、 实际价值与技术贡献**\n- **性能**：在LIBERO、SimplerEnv、RoboTwin2.0等多个机器人操作和具身推理基准测试中，**性能超越**包括ThinkAct在内的最先进推理VLA。\n- **效率**：实现了**高达89.3%的推理延迟降低**（相比ThinkAct-7B），提速达**9.3倍**，同时模型参数量更小（3B vs 7B）。\n- **能力**：保持了强大的**长时程规划**、**小样本适应**和**故障恢复**能力，证明了紧凑推理的有效性。\n- **启发性**：为**实时具身AI**系统提供了一条可行的技术路径，展示了通过“潜在规划”来平衡推理深度与计算效率的巨大潜力。其“教师-学生”蒸馏框架和“可言语化潜在空间”的设计，对多模态高效推理领域具有普适的参考意义。\n\n```mermaid\ngraph TD\n    A[问题: 推理VLA延迟高] --> B[核心创新: 可言语化潜在规划];\n    B --> C{关键方法};\n    C --> D[偏好引导蒸馏];\n    C --> E[视觉轨迹对齐];\n    C --> F[并行空间预测];\n    D & E & F --> G[训练出高效学生VLM];\n    G --> H[推理增强策略学习];\n    H --> I[结果: 高性能 + 极低延迟];\n```",
      "timestamp": "2026-01-20T17:57:49.643942",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "基于他的前作，梳理这个方向的整个发展脉络，每一步相比于之前的工作都改进了什么，着重于几个不同的发展方向。",
      "answer": "## 论文分析：Fast-ThinkAct 及其技术脉络梳理\n\n基于论文内容，Fast-ThinkAct 是 Vision-Language-Action (VLA) 推理模型发展脉络中的一个最新工作。其核心贡献在于**通过可言语化的潜在规划，在保持高性能的同时，大幅降低了推理延迟**。以下将梳理该方向的发展脉络，重点分析每一步的改进以及几个不同的发展方向。\n\n### 发展脉络总览\n\n该领域的发展可以概括为三个阶段：\n1.  **基础 VLA 模型**：通过模仿学习从大规模机器人演示数据中学习技能，但泛化能力有限。\n2.  **显式推理 VLA**：引入链式思维等显式推理机制，提升泛化与规划能力，但带来高昂的推理延迟。\n3.  **高效推理 VLA**：旨在压缩或优化推理过程，在保持性能的同时实现实时或近实时决策。**Fast-ThinkAct 属于此阶段的最新工作**。\n\n---\n\n### 第一阶段：基础 VLA 模型 (模仿学习)\n\n*   **代表工作**：RT-1/2, Octo, OpenVLA, π₀, Magma 等。\n*   **核心思想**：将视觉-语言模型 (VLM) 在大规模机器人动作数据集上进行端到端的监督微调，学习语言条件化的策略。\n*   **改进与价值**：\n    *   **证明了数据驱动的可行性**：展示了利用互联网规模的机器人数据训练通用策略的潜力。\n    *   **实现了基础技能**：在训练分布内的拾取、放置等任务上表现良好。\n*   **局限性**：\n    *   **泛化能力差**：严重受限于训练数据分布，难以应对长视野规划、新场景适应、从失败中恢复等任务。\n    *   **缺乏显式推理**：模型是“黑箱”，决策过程不透明，难以进行复杂的问题分解和逻辑规划。\n\n### 第二阶段：显式推理 VLA (提升泛化)\n\n为了克服基础 VLA 的局限性，研究者们引入了**显式的中间推理过程**。这个方向又可分为几个子方向：\n\n#### 发展方向 1: 基于监督的链式思维 (Supervised CoT)\n*   **代表工作**：Embodied CoT, CoT-VLA, MolmoAct, EO-1。\n*   **核心思想**：利用标注的或由大模型生成的中间推理步骤（文本或视觉形式）作为监督信号，训练模型先“思考”再“行动”。\n*   **技术改进**：\n    *   **文本推理**：使用现成的 LLM/VLM 生成伪 CoT 标签，引导模型进行语言推理。\n    *   **视觉推理**：生成结构化的视觉表示（如子目标图像、深度图、2D 视觉轨迹）作为中间规划，更好地连接空间理解与动作。\n    *   **价值**：显著提升了模型在长视野任务、少样本适应和组合泛化上的能力，使决策过程更可解释。\n*   **局限性**：\n    *   **依赖标注**：需要大量高质量的推理标注，数据获取成本高。\n    *   **覆盖有限**：性能受限于监督数据的覆盖范围。\n    *   **推理延迟高**：生成冗长的文本或视觉推理链（~250个token）导致推理速度慢（秒级），无法满足实时机器人控制的需求。\n\n#### 发展方向 2: 基于强化学习的推理 (RL-based Reasoning)\n*   **代表工作**：**ThinkAct** (Fast-ThinkAct 的前作)。\n*   **核心思想**：不依赖人工标注，而是使用强化学习 (RL)，通过设计**与动作对齐的视觉奖励**来引导模型生成有益的链式思维。\n*   **技术改进**：\n    *   **免于标注**：利用 RL（如 GRPO）自动探索和优化推理路径，摆脱了对大量标注数据的依赖。\n    *   **奖励驱动**：推理质量直接由任务完成度、轨迹对齐等下游指标衡量和优化，确保了推理对最终动作的有效性。\n*   **局限性**：\n    *   **延迟问题加剧**：RL 训练倾向于生成更长、更详细的推理链以最大化奖励，使得推理延迟问题比监督方法更突出。\n    *   **训练不稳定**：RL 训练本身具有挑战性，可能不稳定。\n\n### 第三阶段：高效推理 VLA (压缩与加速)\n\n针对显式推理 VLA 的高延迟瓶颈，近期工作开始探索如何**压缩推理过程**。Fast-ThinkAct 在此背景下提出，并针对几个不同的高效化方向做出了创新。\n\n#### 发展方向 1: 推理长度惩罚/丢弃\n*   **代表工作**：ECoT-Lite, 以及一些 LLM 中的 RL 长度惩罚方法。\n*   **核心思想**：在训练或推理时，强制或鼓励模型生成更短的推理链。例如，ECoT-Lite 在测试时随机“丢弃”部分推理步骤。\n*   **技术改进**：直接减少了需要生成的 token 数量，从而降低延迟。\n*   **局限性**：\n    *   **性能下降风险**：简单缩短或丢弃可能损失关键推理信息，导致规划不一致或性能下降。\n    *   **非本质压缩**：未改变推理的表示形式，效率提升有限。\n\n#### 发展方向 2: 潜在空间推理 (Latent Reasoning) - **Fast-ThinkAct 的核心贡献**\n*   **代表工作**：**Fast-ThinkAct**，以及 LLM 领域的 Coconut, CODI 等。\n*   **核心思想**：**将冗长的离散文本推理，蒸馏/压缩成紧凑的连续潜在向量**。模型在潜在空间进行“思考”，这些潜在向量蕴含了规划信息，并能被一个“言语化器”解码回文本以供解释。\n*   **技术改进 (Fast-ThinkAct 的贡献)**：\n    1.  **可言语化的潜在规划**：提出“学生-教师”蒸馏框架。教师模型（如 ThinkAct）生成显式文本 CoT，学生模型学习生成极少数（如6个）连续潜在 token。通过一个可训练的言语化器 LLM 和基于偏好的损失函数，确保这些潜在 token 能够对应到高质量的推理模式。\n    2.  **视觉规划对齐**：除了语言推理，还通过对齐教师和学生模型的轨迹级隐藏状态，将**视觉规划能力**蒸馏到潜在表示中，这对于具身控制至关重要。\n    3.  **并行空间轨迹预测**：引入可学习的空间 token，并行预测未来路径点，替代了教师模型自回归生成文本路径点的低效方式。\n    4.  **推理增强的策略学习**：将训练好的学生 VLM 生成的潜在视觉规划，通过 KV 缓存注入到动作模型中，桥接了高层规划与底层动作执行。\n*   **价值与改进**：\n    *   **极致效率**：实现了 **~89.3% 的推理延迟降低**，比其前作 ThinkAct-7B 快 9.3 倍。\n    *   **保持甚至提升性能**：在多个机器人操作和具身推理基准上达到 SOTA，证明了紧凑潜在表示的有效性。\n    *   **保留关键能力**：成功保持了长视野规划、少样本适应和失败恢复等由推理带来的核心优势。\n*   **局限性**：\n    *   **言语化器可能幻觉**：用于解释潜在向量的言语化器可能产生不准确的描述，但这不影响动作执行。\n    *   **框架复杂性**：涉及多阶段训练（教师 RL 训练、学生蒸馏、策略学习），流程相对复杂。\n\n---\n\n### 总结：不同发展方向的对比\n\n| 发展方向 | 核心思路 | 优点 | 缺点 | 代表工作 |\n| :--- | :--- | :--- | :--- | :--- |\n| **监督 CoT** | 学习标注的推理步骤 | 提升泛化，过程可解释 | 依赖标注，延迟高 | CoT-VLA, MolmoAct |\n| **RL CoT** | 用奖励优化推理生成 | 免标注，推理与任务强相关 | 延迟极高，训练不稳定 | **ThinkAct** (前作) |\n| **长度控制** | 强制生成更短推理 | 简单，直接提速 | 易损失信息，性能下降 | ECoT-Lite |\n| **潜在推理** | 将推理压缩为连续向量 | **高效与性能兼得**，保留规划能力 | 框架复杂，解释依赖额外模型 | **Fast-ThinkAct** |\n\n**结论**：Fast-ThinkAct 站在其前作 ThinkAct（RL CoT）的肩膀上，敏锐地抓住了“推理延迟”这一制约具身 AI 实际应用的瓶颈。它没有选择简单的“缩短文本”路径，而是开创性地转向“**潜在空间推理**”，通过精心设计的偏好蒸馏和视觉对齐机制，成功地将丰富的语言和视觉规划信息压缩到极少的潜在 token 中。这项工作标志着 VLA 推理模型从“追求能力”到“**兼顾能力与效率**”的重要转变，为实时、高效的具身智能系统提供了可行的技术方案。未来的工作可能会进一步探索更简单的单阶段训练、更鲁棒的潜在表示学习，以及如何彻底消除对独立言语化器的依赖。",
      "timestamp": "2026-01-20T17:58:55.371186",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "他的前作有哪些？使用表格仔细讲讲他的每篇前作，他和前作的区别是什么，主要改善是什么？着重于具体相比于之前文章的改动",
      "answer": "## Fast-ThinkAct 的前作分析\n\n根据论文内容，Fast-ThinkAct 的核心前作是 **ThinkAct** (Huang et al., 2025)。此外，论文在“相关工作”部分详细回顾了其他几类相关研究，包括基础VLA模型和推理VLA模型。Fast-ThinkAct 主要是在 ThinkAct 的基础上进行改进，旨在解决其推理延迟高的问题。\n\n以下表格详细列出了其核心前作（ThinkAct）及其他关键相关工作的对比，并重点阐述了 Fast-ThinkAct 的具体改进。\n\n| 前作/相关工作 | 核心方法 | 主要贡献/特点 | 与 Fast-ThinkAct 的区别及主要改善 |\n| :--- | :--- | :--- | :--- |\n| **ThinkAct** (Huang et al., 2025) | **基于RL的显式文本推理**。使用GRPO（Group Relative Policy Optimization）训练，生成冗长的文本链式推理（CoT）轨迹，以视觉奖励（如目标完成度、轨迹对齐）为指导。 | 首次将强化学习与推理相结合用于VLA任务，显著提升了长视野规划、泛化能力和失败恢复能力。 | **核心区别：推理形式与效率**。<br>1. **推理形式**：ThinkAct 生成**显式、冗长的文本CoT**（约250个token），而 Fast-ThinkAct 学习**紧凑、连续的潜在表示**（如6个潜在token）进行内部推理。<br>2. **效率提升**：Fast-ThinkAct 通过**可言语化的潜在规划**，实现了高达 **89.3% 的推理延迟降低**（相比ThinkAct-7B），同时性能还有所提升。<br>3. **训练机制**：ThinkAct 依赖RL直接优化文本生成；Fast-ThinkAct 采用**偏好引导的蒸馏**，从一个经过RL训练的教师模型（即ThinkAct风格的模型）中，将高质量推理模式提炼到学生的潜在空间中。 |\n| **监督式推理VLA** (如 Embodied CoT, CoT-VLA, MolmoAct) | **基于标注的显式推理**。使用带有中间推理步骤（文本或视觉子目标/轨迹）的标注数据进行监督训练。 | 通过引入明确的推理过程，改善了基础VLA模型在规划、泛化方面的不足。 | **核心区别：对标注数据的依赖与推理效率**。<br>1. **数据需求**：监督方法需要大量人工或模型生成的推理标注，成本高且受限于数据覆盖范围。Fast-ThinkAct 通过**从RL训练的教师模型中进行蒸馏**，减少了对大量标注数据的直接依赖。<br>2. **推理效率**：这些方法同样生成显式推理步骤，存在延迟问题。Fast-ThinkAct 的**潜在推理**从根本上压缩了推理过程，效率更高。<br>3. **信息保真度**：直接减少文本推理长度（如ECoT-Lite的推理丢弃）可能导致关键信息丢失。Fast-ThinkAct 通过**视觉轨迹对齐损失**，确保潜在空间保留了对于具身控制至关重要的**空间-时间动态信息**。 |\n| **基础VLA模型** (如 RT-2, Octo, OpenVLA) | **模仿学习**。在大规模机器人演示数据上进行端到端策略训练，直接学习从观察到动作的映射。 | 建立了强大的VLA基础，在训练分布内的技能（如抓取-放置）上表现优异。 | **核心区别：推理与泛化能力**。<br>1. **泛化能力**：基础VLA模型缺乏显式推理机制，在**长视野规划、应对新场景、失败恢复**方面能力有限。Fast-ThinkAct 明确引入了**内部推理模块**，显著增强了这些能力。<br>2. **架构**：基础VLA通常是单一的策略网络。Fast-ThinkAct 采用**两阶段架构**：一个进行潜在推理的VLM，后接一个以推理结果为条件的动作模型，实现了**高层规划与底层执行的解耦与桥接**。 |\n| **高效推理的LLM方法** (如 CODI, Soft Thinking) | **潜在空间推理**。将链式思维提炼到连续空间（如隐藏状态、概念token）。 | 在纯语言模型中探索了压缩推理、提升效率的方法。 | **核心区别：模态与任务适配**。<br>1. **多模态需求**：LLM的潜在推理方法无法直接处理**视觉空间理解和时空动态**。Fast-ThinkAct 专门设计了**动作对齐的视觉规划蒸馏**和**空间token并行预测轨迹**，使潜在表示能够承载视觉规划信息。<br>2. **与动作执行的连接**：Fast-ThinkAct 不仅进行推理，还通过**推理增强的策略学习**，将学到的潜在规划明确地连接到下游动作模型的KV缓存中，指导动作生成，这是纯文本模型不具备的。 |\n\n## Fast-ThinkAct 相比于前作（ThinkAct）的具体改动与改善\n\n1.  **推理表示的根本性变革**：\n    *   **前作 (ThinkAct)**：输出为离散的、人类可读的**文本序列**作为推理链。生成过程自回归，速度慢。\n    *   **本文 (Fast-ThinkAct)**：输出为**紧凑的连续潜在向量** (`z`) 和**并行的空间token** (`s`)。潜在向量编码抽象推理逻辑，空间token直接映射为视觉轨迹路径点。这实现了**推理的隐式化和并行化**，是速度提升的核心。\n\n2.  **创新的训练框架：偏好引导蒸馏与视觉对齐**：\n    *   **前作 (ThinkAct)**：使用GRPO直接优化文本生成策略，奖励信号基于最终动作的成功与否。\n    *   **本文 (Fast-ThinkAct)**：\n        *   **教师-学生框架**：使用一个经过GRPO训练的**文本教师模型**（即ThinkAct）来生成质量不一的推理轨迹。\n        *   **偏好蒸馏** (`ℒ_verb`)：引入一个**言语化器**，将学生模型生成的潜在向量解码回文本。利用教师模型推理轨迹的优势函数构建偏好对，通过类似DPO的目标，鼓励言语化器将潜在向量解码为高质量推理，抑制低质量推理。这确保了**潜在空间保留了有效的推理模式**。\n        *   **视觉规划蒸馏** (`ℒ_distill`)：除了语言推理，还通过对齐教师和学生模型在`<answer>` token的隐藏状态，直接**蒸馏教师的视觉规划能力**到学生的潜在表示中。这是保证潜在表示对具身任务有效的关键。\n        *   **轨迹预测** (`ℒ_ans`)：学生模型使用并行的空间token直接回归2D视觉轨迹路径点，替代了教师模型自回归生成文本描述路径点的方式，效率更高。\n\n3.  **推理与动作执行的高效桥接**：\n    *   **前作 (ThinkAct)**：推理文本作为条件输入到策略网络中，连接可能不够紧密。\n    *   **本文 (Fast-ThinkAct)**：从学生VLM的**空间token的Key-Value缓存（早期层）中提取视觉潜在规划** (`c_t`)，将其与动作模型的状态编码KV缓存拼接。动作模型通过交叉注意力同时关注原始观察和这个**富含规划信息的潜在上下文**。这种在表示层面的融合更直接、高效。\n\n4.  **性能与效率的显著提升**：\n    *   **效率**：在多个基准测试上，相比ThinkAct-7B实现**最高89.3%的延迟降低**，相比ThinkAct-3B快**7倍**。\n    *   **性能**：在LIBERO、SimplerEnv、RoboTwin2.0等机器人操作基准上，**成功率达到或超过ThinkAct**。在EgoPlan-Bench2、RoboVQA等具身推理基准上，**性能显著超过ThinkAct及其他基线**。实现了**“既快又好”** 的目标。\n\n**总结**：Fast-ThinkAct 的核心创新在于将 ThinkAct 的**显式、缓慢的文本推理过程**，通过一套精心设计的**偏好引导蒸馏与视觉对齐机制**，压缩并转化为**隐式、高效的潜在空间表示**。它不仅大幅提升了推理速度，还通过更好的信息保留（尤其是视觉规划信息）和与动作模型更紧密的集成，维持甚至提升了在复杂具身任务上的性能。这是对前作ThinkAct在**效率瓶颈**问题上的一个根本性解决方案。",
      "timestamp": "2026-01-20T17:59:57.248252",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文提出了哪些关键技术方法，请列表格具体详细说明技术细节，需要包含具体的数学原理推导，以及具体参数。",
      "answer": "## 论文关键技术方法分析\n\n论文《Fast-ThinkAct: Efficient Vision-Language-Action Reasoning via Verbalizable Latent Planning》的核心创新在于提出了一种**高效、可言语化的潜在规划框架**，将冗长的显式思维链（CoT）压缩为紧凑的潜在表示，从而在保持强大推理能力的同时，大幅降低推理延迟。其关键技术方法可归纳为以下四个相互关联的模块：\n\n| 关键技术方法 | 核心目标 | 技术细节与数学原理 | 具体参数与实现 |\n| :--- | :--- | :--- | :--- |\n| **1. 基于奖励偏好的可言语化潜在思维链** | 将教师模型生成的质量不一的冗长文本CoT，蒸馏到学生模型的紧凑潜在空间中，并确保该潜在表示可被“言语化”为高质量推理文本。 | **1.1 教师模型训练 (GRPO):** <br> 教师视觉语言模型 $\\mathcal{F}_{\\theta}^{T}$ 通过分组相对策略优化（GRPO）进行训练，以生成与动作奖励对齐的推理轨迹 $\\tau$。其目标函数为： <br> $\\mathcal{J}_{\\text{GRPO}}(\\theta) = \\mathbb{E}_{\\tau\\sim\\mathcal{F}^{T}_{\\theta}}[\\min(r_{\\theta}(\\tau)A(\\tau), \\text{clip}(r_{\\theta}(\\tau),1-\\epsilon,1+\\epsilon)A(\\tau))]$ <br> 其中，$r_{\\theta}(\\tau) = \\frac{\\mathcal{F}^{T}_{\\theta}(\\tau)}{\\mathcal{F}^{T}_{\\text{old}}(\\tau)}$ 为概率比，$A(\\tau)$ 为优势函数，计算基于组内奖励 $\\{R_i\\}_{i\\in G(\\tau)}$ 的标准化值：$A(\\tau) = \\frac{R_{\\tau} - \\text{mean}(\\{R_i\\})}{\\text{std}(\\{R_i\\})}$。 <br><br> **1.2 偏好对构建与潜在蒸馏:** <br> 从每组 rollout 中根据优势函数 $A(\\tau)$ 选择最优推理 $\\tau^+$ 和最差推理 $\\tau^-$ 构成偏好对。学生模型 $\\mathcal{F}_{\\theta}$ 不生成文本，而是自回归地生成 **M 个连续潜在向量** $\\mathbf{z} = \\{z_m\\}_{m=1}^{M}, z_m \\in \\mathbb{R}^d$。 <br><br> **1.3 可言语化损失 ($\\mathcal{L}_{\\text{verb}}$):** <br> 引入一个**言语化器** LLM $\\mathcal{V}_{\\psi}$，其任务是将潜在向量 $\\mathbf{z}$ 解码为自然语言。训练目标借鉴 DPO，鼓励言语化器将 $\\mathbf{z}$ 解码为高质量推理 $\\tau^+$ 的概率远高于解码为低质量推理 $\\tau^-$ 的概率： <br> $\\mathcal{L}_{\\text{verb}} = -\\mathbb{E}[\\log \\sigma(\\beta(\\log\\frac{p_{\\psi}(\\tau^+ \\mid \\mathbf{z})}{p_{\\text{ref}}(\\tau^+)} - \\log\\frac{p_{\\psi}(\\tau^- \\mid \\mathbf{z})}{p_{\\text{ref}}(\\tau^-)}))]$ <br> 其中，$p_{\\text{ref}}$ 是无潜在条件约束的参考模型，$\\sigma$ 为 sigmoid 函数，$\\beta$ 控制偏好强度。 | - **骨干模型:** Qwen2.5-VL 3B。 <br> - **潜在向量维度 $d$:** 与模型隐藏层大小一致（未明确给出，通常为1024或2048）。 <br> - **潜在推理步数 $M$:** **6**（经消融实验确定为最优）。 <br> - **偏好强度 $\\beta$:** **0.1**。 <br> - **言语化器模型:** 基于 Qwen3-0.6B 初始化，并插入跨注意力层以接收潜在向量 $\\mathbf{z}$ 作为条件。 <br> - **GRPO Rollout 大小 $N$:** **5**。 |\n| **2. 动作对齐的视觉规划蒸馏** | 确保学生模型的潜在表示不仅编码语言推理逻辑，还能捕获对具身控制至关重要的**空间视觉规划能力**。 | **2.1 轨迹表示对齐 ($\\mathcal{L}_{\\text{distill}}$):** <br> 最小化教师模型和学生模型在编码视觉规划信息的关键位置（如 `<answer>` 标记）的隐藏状态之间的差异： <br> $\\mathcal{L}_{\\text{distill}} = \\| h_t^T - h_t \\|_2^2$ <br> 其中，$h_t^T$ 和 $h_t$ 分别来自教师（对应 $\\tau^+$）和学生模型。 <br><br> **2.2 并行空间轨迹预测 ($\\mathcal{L}_{\\text{ans}}$):** <br> 教师模型以自回归方式生成描述路径点 $\\{p_k\\}_{k=1}^K$ 的长文本序列（$K=5$ 时约60-70个token）。为提升效率，学生模型使用 **K 个可学习的空间token** $\\{\\mathbf{s}_i\\}_{i=1}^K$ 附加在潜在序列后，并通过一个 MLP 将每个空间token的输出隐藏状态 $h'(\\mathbf{s}_i)$ 并行投影为路径点坐标 $p_i$。损失函数为： <br> $\\mathcal{L}_{\\text{ans}} = \\sum_{i=1}^{K} \\| p_i - \\hat{p}_i \\|_2^2$， 其中 $p_i = \\text{MLP}(h'(\\mathbf{s}_i))$，$\\hat{p}_i$ 是真实路径点。 | - **路径点数量 $K$:** **5**。 <br> - **路径点坐标 $p_i$:** 对于单臂任务为 $[x_{\\text{single}}, y_{\\text{single}}]$，对于双臂任务为 $[x_{\\text{left}}, y_{\\text{left}}, x_{\\text{right}}, y_{\\text{right}}]$，统一用 $\\mathbb{R}^6$ 向量表示，未使用的维度在计算损失时被掩码。 <br> - **学生模型总损失:** $\\mathcal{L}_{\\text{student}} = \\mathcal{L}_{\\text{verb}} + \\mathcal{L}_{\\text{distill}} + \\mathcal{L}_{\\text{ans}}$。 |\n| **3. 推理增强的策略学习** | 将高层、紧凑的潜在视觉规划与低层动作执行桥接起来，使策略模型能够利用推理结果生成精确动作。 | **3.1 视觉潜在规划提取:** <br> 训练完成后，冻结学生 VLM $\\mathcal{F}_{\\theta}$。在推理时，从 $\\mathcal{F}_{\\theta}$ **较浅层**的空间token的 Key-Value (KV) 缓存中提取视觉潜在规划表示 $c_t$。论文发现浅层表示比深层或最终隐藏状态更能有效保留规划信息。 <br><br> **3.2 策略模型条件化与训练:** <br> 动作模型 $\\pi_{\\phi}$（如基于 Diffusion Transformer 的 RDT）通过交叉注意力机制，同时关注状态编码器的 KV 对和来自 VLM 的规划上下文 $c_t$。策略通过模仿学习进行微调，损失函数为： <br> $\\mathcal{L}_{\\text{IL}}(\\phi) = \\ell(\\pi_{\\phi}(o_t, l, c_t), \\hat{a}_t)$ <br> 其中 $\\ell$ 是扩散策略的去噪目标（如均方误差），$\\hat{a}_t$ 是真实动作。训练时，$\\mathcal{F}_{\\theta}$ 和状态编码器被冻结，仅更新 $\\pi_{\\phi}$ 和用于适配 $c_t$ 维度的线性投影层。 | - **动作模型:** 在 SimplerEnv 上使用 DiT-Policy，在 LIBERO 和 RoboTwin2.0 上使用 RDT。 <br> - **规划上下文 $c_t$ 的融合:** 通过线性投影将 VLM KV 缓存维度适配到动作模型注意力维度（DiT-Policy为1024，RDT为2048）。 <br> - **训练数据:** 大规模机器人动作数据（如 OXE 数据集），针对特定环境（如 LIBERO）进行少量演示的微调。 |\n| **4. 整体训练与推理流程** | 整合以上方法，实现从教师模型知识蒸馏到学生模型高效推理的策略学习全流程。 | **训练分三个阶段:** <br> 1. **SFT + CoT-SFT:** 在混合数据集上对基础 VLM 进行监督微调，学习基本视觉理解和链式思维。 <br> 2. **教师-学生蒸馏:** 教师用 GRPO 训练；学生用 $\\mathcal{L}_{\\text{student}}$ 训练，将推理压缩到潜在空间。言语化器前3000步用语言建模损失预热，后1500步用 $\\mathcal{L}_{\\text{verb}}$ 进行偏好学习。 <br> 3. **策略学习:** 冻结训练好的学生 V",
      "timestamp": "2026-01-20T18:01:00.910467",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "他使用了哪些评价指标与数据集，列表格具体讲讲他的评价指标的细节与数据集的细节",
      "answer": "## 论文评价指标与数据集分析\n\n### 一、 评价指标\n\n论文使用了**两大类评价指标**：**机器人操作成功率**和**具身推理能力评分**。具体细节如下表所示：\n\n| 指标类别 | 具体指标 | 适用任务/基准 | 指标细节与说明 |\n| :--- | :--- | :--- | :--- |\n| **机器人操作** | **任务成功率** | SimplerEnv, LIBERO, RoboTwin2.0 | 核心指标。在模拟环境中执行任务，以**成功完成任务的试验次数比例**作为衡量标准。例如，在LIBERO的每个子任务套件上进行500次试验，计算平均成功率。 |\n| | | | **RoboTwin2.0** 进一步区分了**简单**和**困难**两种设置（后者包含领域随机化），并依据专家演示步骤数将任务分为**短、中、长**视野任务。 |\n| **具身推理** | **准确率** | EgoPlan-Bench2 | 评估以自我为中心视角的多步任务规划能力。数据集包含1,321道**多项选择题**，模型需根据任务目标和进度历史预测下一步动作，以**回答正确的比例**作为得分。 |\n| | **BLEU分数** | RoboVQA | 评估对机器人操作视频的理解和推理能力。数据集包含1,893个**开放式问答对**。使用**BLEU-1到BLEU-4**以及**BLEU-Avg**（平均）分数来衡量模型生成的文本答案与标准答案之间的**n-gram重叠度**，分数越高说明语义匹配越好。 |\n| | **LLM评分** | OpenEQA, RoboFAC | 评估对开放世界场景的零样本理解和失败分析能力。使用**大型语言模型**根据人类偏好对齐的评分标准，对模型生成的答案进行打分。这是一种**自动化、可扩展的评估方式**，用于衡量答案的合理性和准确性。 |\n| **效率** | **推理延迟** | 所有任务（对比分析） | 关键创新指标。测量模型从接收输入（观察和指令）到输出动作所需的**单次推理时间**。论文强调，Fast-ThinkAct通过压缩推理过程，实现了高达**89.3%的延迟降低**和**9.3倍的加速**。 |\n\n### 二、 数据集\n\n论文使用了**多种大规模、多模态数据集**进行训练和评估，涵盖视觉轨迹、问答对和机器人演示数据。\n\n#### 1. 训练数据集\n用于训练推理VLM和策略模型，具体如下：\n\n| 数据集名称 | 类型/内容 | 用途与细节 |\n| :--- | :--- | :--- |\n| **MolmoAct (OXE)** | **单臂2D视觉轨迹** | 从Open X-Embodiment (OXE)数据集中提取，约**130万条轨迹**。用于学习单臂操作的空间规划和动作关联。 |\n| **AIST** | **双臂2D视觉轨迹** | 从AIST数据集中提取双手机器人操作轨迹，约**9.2万条样本**。使用CoTracker3进行轨迹跟踪，用于学习双臂协调。 |\n| **PixMo** | 通用视觉-语言问答 | 约72.6万样本，用于保持模型的**通用视觉理解能力**，防止在具身数据上训练时发生灾难性遗忘。 |\n| **RoboFAC** | 机器人失败分析与纠正QA | 包含9,440条错误操作轨迹和6.4万QA对，用于训练模型的**失败识别、原因分析和恢复规划**能力。 |\n| **RoboVQA** | 机器人操作视频QA | 约79.8万QA对，涵盖任务理解、空间推理和动作预测，用于提升长视野推理能力。 |\n| **ShareRobot** | 大规模机器人任务规划QA | 超过**100万QA对**，涵盖任务规划、物体功能、操作策略，促进可迁移操作知识的学习。 |\n| **EgoPlan-Bench** | 自我中心视频任务规划 | 约5.3万视频-文本对，用于训练从第一人称视角进行**长视野规划和进度跟踪**的能力。 |\n| **Video-R1-CoT** | 带思维链注释的视频QA | 16.5万样本，涵盖数学逻辑、空间理解等复杂推理，用于注入**链式思维推理能力**。 |\n| **OXE (动作数据)** | 机器人演示动作数据 | 用于**推理增强的策略学习**阶段，训练动作模型生成低层控制指令。 |\n| **静态ALOHA数据集** | 双臂机器人演示数据 | 与OXE数据结合，用于训练在LIBERO和RoboTwin2.0上评估的RDT动作模型。 |\n\n**训练流程**：\n1.  **监督微调**：混合上述多种数据（约400万样本），学习基础视觉理解和操作知识。\n2.  **思维链微调**：从SFT数据中采样5%，并加入Video-R1-CoT数据，学习生成结构化推理。\n3.  **师生训练**：在CoT-SFT检查点基础上，使用平衡采样的约5万样本，进行GRPO教师训练和潜在空间学生蒸馏。\n\n#### 2. 评估基准数据集\n用于全面测试模型的泛化能力，具体如下：\n\n| 基准名称 | 评估重点 | 任务细节与指标 |\n| :--- | :--- | :--- |\n| **SimplerEnv-Google** | **操作泛化与仿真到真实关联** | 模拟Google机器人任务，包含光照、纹理、背景、相机视角的多样化。评估**任务成功率**，该基准与真实世界性能有强相关性。 |\n| **LIBERO** | **多样化操作泛化** | 包含四个子套件：<br>• **Spatial**：空间布局变化。<br>• **Object**：物体多样性。<br>• **Goal**：目标变化。<br>• **Long**：长视野、混合变化的规划任务。<br>每个套件进行500次试验，评估**任务成功率**。 |\n| **RoboTwin2.0** | **复杂双臂操作与长视野规划** | 具有挑战性的双臂操作基准。提供**简单**和**困难**（含领域随机化）两种设置。任务根据演示长度分为**短、中、长**视野。评估**任务成功率**。 |\n| **EgoPlan-Bench2** | **自我中心长视野任务规划** | 包含24个日常生活场景，1,321道多项选择题。评估模型在给定目标和历史进度下预测下一步的**准确率**。 |\n| **RoboVQA** | **机器人操作视频的视觉推理** | 包含来自机器人和人类演示的1,893个自由形式QA对。使用**BLEU分数**评估生成答案的质量。 |\n| **OpenEQA** | **开放世界场景的零样本空间与功能理解** | 包含超过1,600个问题，涵盖180多个真实世界环境。使用**LLM基于评分**评估答案的合理性和准确性。 |\n| **RoboFAC** | **失败识别与纠正能力** | 专门评估对操作失败的分析和纠正规划能力。在**仿真**和**真实机器人**两个分集上，使用**LLM评分**进行评估。 |\n\n### 总结\nFast-ThinkAct论文通过精心设计，使用了**覆盖机器人操作成功率和多维度具身推理能力的综合评价体系**，并在**大规模、多样化的训练数据集**上进行学习，最终在**一系列具有挑战性的标准基准**上验证了其方法在**性能、效率和泛化能力**上的显著优势。其评价指标不仅关注“做得对”（成功率、准确率），也关注“做得快”（推理延迟），并深入检验了模型的核心价值——**长视野规划、少样本适应和失败恢复**能力。",
      "timestamp": "2026-01-20T18:01:56.003666",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文在哪些数据集上进行了实验？主要的评估指标和性能提升是多少？",
      "answer": "## 论文实验数据集、评估指标与性能提升分析\n\n### 一、 实验数据集\n论文在两大类数据集上进行了实验：**机器人操作数据集**和**具身推理数据集**。\n\n#### 1. 机器人操作数据集（用于训练与评估策略）\n- **训练数据**：\n    - **OXE (Open X-Embodiment)**：大规模机器人演示数据集，用于基础策略学习。\n    - **静态ALOHA数据集**：用于增强双手机器人操作能力。\n    - **AIST数据集**：提供约92K条双手机器人视觉轨迹。\n    - **MolmoAct标注的2D视觉轨迹**：从OXE中提取，约130万条单臂操作轨迹。\n- **评估基准**：\n    - **LIBERO**：涵盖空间、物体、目标和长视野任务，评估多样化操作和泛化能力。\n    - **SimplerEnv-Google**：具有强仿真到真实世界相关性的基准，包含光照、外观和视角变化。\n    - **RoboTwin2.0**：具有挑战性的**双手机器人长视野操作**基准，包含简单和困难（带域随机化）设置。\n\n#### 2. 具身推理数据集（用于训练与评估推理能力）\n- **训练数据**：\n    - **PixMo**：通用视觉语言数据集，用于保持基础视觉理解能力。\n    - **RoboFAC**：机器人失败分析数据集，包含错误操作轨迹和QA对。\n    - **RoboVQA**：机器人操作视频的问答数据集，涵盖任务理解。\n    - **ShareRobot**：大规模机器人任务规划与操作知识数据集。\n    - **EgoPlan-Bench**：以自我为中心视角的日常活动规划数据集。\n    - **Video-R1-CoT**：带有思维链标注的视频问答数据集。\n- **评估基准**：\n    - **EgoPlan-Bench2**：评估以自我为中心视角的多步任务规划能力（多选题准确率）。\n    - **RoboVQA**：评估机器人操作场景中的视觉推理能力（BLEU分数）。\n    - **OpenEQA**：评估对多样化真实世界环境的零样本空间与功能理解（LLM评分）。\n    - **RoboFAC**：专门评估**失败识别与恢复**能力。\n\n### 二、 主要评估指标\n1.  **机器人操作任务**：\n    - **核心指标**：**任务成功率**。\n    - **效率指标**：**推理延迟**（毫秒），对比基准模型的加速倍数。\n\n2.  **具身推理任务**：\n    - **EgoPlan-Bench2**：**准确率**。\n    - **RoboVQA**：**BLEU分数**（B-1, B-2, B-3, B-4及平均）。\n    - **OpenEQA & RoboFAC**：使用**LLM进行评分**（与人类偏好对齐）。\n\n### 三、 关键性能提升\nFast-ThinkAct在**保持甚至提升性能**的同时，实现了**显著的效率提升**。\n\n#### 1. 性能提升（效果）\n- **机器人操作**：\n    - 在**LIBERO**基准上，Fast-ThinkAct-3B达到**89.7%** 成功率，优于ThinkAct-3B的83.1%和MolmoAct-7B的86.8%。\n    - 在**SimplerEnv-Google**上达到**68.7%** 成功率，优于ThinkAct-7B的68.3%。\n    - 在**RoboTwin2.0**困难设置的长视野任务上，平均成功率比ThinkAct高**1.7%**，比基础RDT高**3.6%**。\n- **具身推理**：\n    - 在**EgoPlan-Bench2**上，Fast-ThinkAct-3B平均准确率**46.4%**，优于ThinkAct-3B的44.0%。\n    - 在**RoboVQA**上，平均BLEU分数达到**60.8**，大幅优于ThinkAct-3B的55.3。\n    - 在**RoboFAC**真实世界分割上，评分比最佳基线（RoboFAC-3B）高**16.4分**，展示了卓越的失败恢复能力。\n\n#### 2. 效率提升（速度）\n- **核心优势**：实现了**极致的推理加速**。\n    - 相比ThinkAct-7B，推理延迟降低 **89.3%**。\n    - 相比ThinkAct-3B，推理速度快 **7倍**（805ms vs. 5674ms）。\n    - 相比MolmoAct-7B，推理延迟降低 **88.0%**。\n- **关键对比**：Fast-ThinkAct仅使用**6个潜在推理令牌**和**5个空间令牌**进行并行轨迹预测，替代了ThinkAct需要生成的约**250个文本令牌**的冗长思维链，这是效率提升的根本原因。\n\n#### 3. 综合能力提升\n- **长视野规划**：在RoboTwin2.0的长步骤任务上表现优于所有基线。\n- **少样本适应**：仅用10条演示进行微调后，在RoboTwin2.0上显著优于其他VLA模型。\n- **失败恢复**：在RoboFAC基准上展现出强大的错误识别和纠正规划能力。\n\n**总结**：Fast-ThinkAct通过将显式文本推理“压缩”为可言语化的潜在表示，在多个机器人操作和具身推理基准上实现了 **SOTA或接近SOTA的性能**，同时将推理速度提升了一个数量级，成功解决了现有推理VLA模型**延迟高**的核心瓶颈。",
      "timestamp": "2026-01-20T18:02:35.621308",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文的主要局限性有哪些？未来可能的改进方向是什么？",
      "answer": "## 论文主要局限性分析\n\n根据论文内容，Fast-ThinkAct 的主要局限性集中在**可解释性组件（Verbalizer）的可靠性**上：\n\n- **语言模型的固有问题**：论文明确指出，用于将潜在推理解码为可读文本的 `Verbalizer` 是基于预训练的大型语言模型（LLM）构建的。因此，它**不可避免地继承了LLM的常见缺陷**，例如**幻觉**——即生成看似合理但实际不准确或与潜在表示不符的描述。\n- **对核心功能无影响**：值得强调的是，这一局限性**并不影响模型在推理时的动作执行性能**。因为 `Verbalizer` 仅在训练阶段用于指导潜在表示的学习，以及在需要时可提供解释性输出。动作预测完全依赖于经过视觉规划蒸馏得到的、更可靠的**潜在表示**，`Verbalizer` 并非推理流水线的必需部分。\n\n## 未来可能的改进方向\n\n论文针对上述局限性，提出了明确的未来工作方向，并隐含了其他潜在优化点：\n\n1. **提升 Verbalizer 的忠实度**：\n   - **引入 grounding-aware 目标**：在训练 `Verbalizer` 时，可以增加使其输出与视觉观察或动作轨迹更紧密对齐的约束或损失函数。\n   - **采用幻觉抑制技术**：借鉴大语言模型领域的研究，应用专门的技术来减少或检测 `Verbalizer` 输出中的不实信息。\n\n2. **隐含的扩展与优化方向**（基于方法设计）：\n   - **模型架构与效率的进一步探索**：当前方法将推理压缩为6个潜在token，未来可以研究**自适应长度的潜在推理**，或探索更高效的编码架构，在保持性能的同时进一步降低延迟。\n   - **训练策略的增强**：论文使用了偏好蒸馏（DPO风格）和轨迹对齐。未来可以探索**更复杂的奖励设计**或**多任务联合优化**，以更好地平衡推理质量、压缩率和动作性能。\n   - **更广泛的任务与场景验证**：当前工作在多个仿真基准上进行了验证。未来的重要方向是在**真实机器人平台**和**更复杂、动态的真实世界场景**中测试其效率与鲁棒性，这对实际部署至关重要。\n   - **消除对教师模型的依赖**：当前方法依赖于一个经过强化学习训练的教师模型来提供高质量的推理轨迹。未来可以研究**端到端的训练框架**或**自监督方法**，以减少对昂贵教师模型训练的依赖。\n\n**总结**：Fast-ThinkAct 的核心创新——将冗长推理压缩为高效的潜在表示——本身是稳健的。其主要局限在于外围的解释性组件，而这可以通过现有的大语言模型对齐技术进行改进。未来的工作将围绕提升整个系统的忠实度、效率及在更复杂现实场景中的适用性展开。",
      "timestamp": "2026-01-20T18:02:57.293410",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    }
  ],
  "is_hidden": false,
  "is_starred": false,
  "flag": "",
  "published_date": "2026-01-14T18:59:59Z",
  "created_at": "2026-01-20T17:49:51.130239",
  "updated_at": "2026-01-20T17:49:51.130245"
}