{
    "id": "2601.07610v1",
    "title": "Aggregating swarms through morphology handling design contingencies: from the sweet spot to a rich expressivity",
    "authors": [
        "Jeremy Fersula",
        "Nicolas Bredeche",
        "Olivier Dauchot"
    ],
    "abstract": "形态计算——利用机器人的物理设计来简化特定任务的实现——已被证明是群体机器人学中的一个重要概念。本文通过实验与数值模拟证明，此类策略的成功与否在很大程度上取决于机器人所采用的策略类型，以及物理设计的细节。为此，我们研究了一种由嵌入外骨骼的Kilobot机器人组成的群体，其设计可控制机器人与所受外力方向趋于对齐或反向对齐的倾向。实验发现：在一个简单的趋光任务中（机器人被设定在进入光照区域时停止运动），两种形态机器人的任务成功率差异原本并不显著；但当机器人不允许停止、只能减速时，这种差异会变得极为明显。基于对机器人自对齐动力学的精确物理建模，我们通过数值模拟证明：一方面，需要将自对齐强度精确调节至最佳区间才能实现高效的趋光行为；另一方面，探索不同自对齐强度参数可使群体行为呈现出丰富的表达能力。",
    "url": "https://arxiv.org/abs/2601.07610v1",
    "html_url": "https://arxiv.org/html/2601.07610v1",
    "html_content": "Aggregating swarms through morphology handling design contingencies:\nfrom the sweet spot to a rich expressivity\nJeremy Fersula\nInstitut des Systèmes Intelligents et de Robotique, Sorbonne Université, CNRS, ISIR, F-75005 Paris, France\nNicolas Bredeche\nInstitut des Systèmes Intelligents et de Robotique, Sorbonne Université, CNRS, ISIR, F-75005 Paris, France\nLaboratoire Jean Perrin, IBPS, Sorbonne Université, CNRS, F-75005 Paris, France\nOlivier Dauchot\nGulliver UMR CNRS 7083, ESPCI Paris, PSL Research University, 10 rue Vauquelin, 75005 Paris, France\n(January 12, 2026)\nAbstract\nMorphological computing, the use of the physical design of a robot to ease the realization of a given task has been proven to be a relevant concept in the context of swarm robotics. Here we demonstrate both experimentally and numerically, that the success of such a strategy may heavily rely on the type of policy adopted by the robots, as well as on the details of the physical design. To do so, we consider a swarm of robots, composed of Kilobots embedded in an exoskeleton, the design of which controls the propensity of the robots to align or anti-align with the direction of the external force they experience. We find experimentally that the contrast that was observed between the two morphologies in the success rate of a simple phototactic task, where the robots were programmed to stop when entering a light region, becomes dramatic, if the robots are not allowed to stop, and can only slow down. Building on a faithful physical model of the self-aligning dynamics of the robots, we perform numerical simulations and demonstrate on one hand that a precise tuning of the self-aligning strength around a sweet spot is required to achieve an efficient phototactic behavior, on the other hand that exploring a range of self-alignment strength allows for a rich expressivity of collective behaviors.\nI\nIntroduction\nMany different aspects contribute to the design of a robot : its morphology (shape, structure, materials), sensory apparatus, motor system, control architecture, etc.\n[\n35\n,\n16\n]\n. All of these aspects interact and jointly determine the robot’s behavior. By designing the morphology of the robot to obey certain physical properties, one can alleviate the need for computation to achieve a desired behavior as the laws of physics ”work” in favor of succeeding the task\n[\n23\n]\n. This design principle of using morphology to facilitate control has been proven effective in achieving complex tasks for many different robotic systems\n[\n41\n,\n34\n]\n, including swarm robotic ones\n[\n22\n,\n15\n,\n17\n,\n4\n]\n.\nAs this design principle heavily relies on physics, a great source of inspiration lies in the field of active matter - a field for which the systems of interest look more and more alike to swarm robotic systems\n[\n27\n]\n. In both cases, one takes interest in the collective behaviors of large assemblies of mobile units, with a focus on control and tasks realization in the case of swarm robotics\n[\n32\n,\n5\n,\n42\n,\n26\n,\n11\n]\nand a focus on the spontaneous emergence of symmetry broken phases in the context of active matter\n[\n29\n,\n8\n,\n14\n,\n2\n]\n.\nWhile in both cases, collective behaviors emerge from local interactions there are important paradigm differences. In swarm robotics the mobile units are robots usually equipped with sensors and the ability to perform numerical computation to make decisions about their future behavior. Designing proper policies, and collective strategies to control the swarm is a central goal of swarm robotics. In the field of active matter, although many systems of interest are made of living agents performing similar decision making and cognitive processes, the interactions among the agents are described in an effective way at the level of the physical degrees of freedom, and add up to standard physical interactions such as collisions. The latter are typically avoided in the context of swarm robotics\n[\n5\n,\n39\n]\n.\nFigure 1:\nExperimental realization of a phototactic aggregation task for\nN\n=\n64\nN=64\nrobots with morphological actuation through a force re-orientation response.\nA.\nEach robot is programmed to perform a Run-And-Tumble motion, with different speeds based on the local light intensity. The run phases in the dark are clearly visible with a greater speed and persistence length. After some time at the boundary, robots eventually get re-injected in the bulk due to the orientational noise. Note that the typical time spent at the boundary is slightly greater for fronters than aligners due to the morphological response (\n≈\n\\approx\nx1.4).\nB.\nEffective velocity of robots (aligners) in the dark and light region, measured from the mean square displacement.\nC.\nKilobot\n[\n31\n]\nRobots are embedded in exoskeletons replacing their base legs. The contact point asymmetry and uneven mass distribution lead to a re-orientation response when subjected to external forces. The aligner aligns towards external forces while the fronter aligns in the opposite direction. During a collision, morphological actuation plays a role for robot aggregation : the force re-orientation response of the fronter favors aggregation, provided the intensity of said response is low enough to not cause an unending interlock.\nIn the recent years, there has nevertheless been a convergence of interest, with not only more works in active matter dealing with smart agents\n[\n37\n,\n38\n,\n21\n,\n25\n,\n33\n]\n, but also works in swarm robotics demonstrating for instance that swarm aggregation benefits from collisions between robots\n[\n15\n,\n17\n,\n4\n]\n. More specifically it was shown in\n[\n4\n]\nthat a specific re-orientation response to external forces of the robots, the so-called self-alignment\n[\n2\n]\n, can improve or degrade aggregation for a phototactic task. In this task, robots explore their environment to find a light region the size of which is too small to fit the entire swarm, causing frequent collisions and re-orientations. In this set of experiments the robots controller allows for a complete stop. This has two consequences : (i) each robot can individually achieve the task, (ii) when stopping at the boundary of the light region the robots build up a wall preventing the remaining robots to access the light region. The success of the aggregation in the light region precisely depends in the way these remaining robots morphologically respond to this repulsive barrier.\nHere we address a more subtle question, namely the one of a possible collective effect of the morphological design of the robots in achieving the task. To do so we impose the robots to maintain a finite velocity preventing a single robot alone to achieve phototaxis. Experimentally, we consider two populations of robots with opposite self-alignment: the so-called aligners align on the force they experience; the so-called fronters anti-align in the opposite direction. We observe that the contrast in task achievement is even more dramatic : while the aligners achieve no phototaxis at all, the fronters leverage a collective effect called motility-induced phase separation (MIPS)\n[\n8\n]\nin the realm of active matter, to successfully aggregate in the light. We further investigate the role of self-alignment for aggregating in the light using numerical simulations. By tuning continuously the self-alignment, we show that minute change in the design actually drastically alter the performance in achieving phototaxis, as one would expect in light of recent results\n[\n24\n]\n, but also that exploring a wider range of self-alignment strength provides an opportunity for designing highly expressive swarms in terms of accessible collective behavior.\nII\nResults\nII.1\nReal robots experiments\nThe experimental set up has been described elsewhere\n[\n4\n]\nand we only recast here its main features. A swarm of\nN\n=\n64\nN=64\nKilobots\n[\n31\n]\n,\nenhanced by a 3D-printed exoskeleton replacing their native legs, evolve in a circular arena of diameter (\n⌀\n=\n1.5\n​\nm\n\\diameter=1.5m\n) to perform a simple phototactic task: aggregating in a light region located at the center of the arena and covering\nσ\n=\n6\n%\n\\sigma=6\\%\nof the total area. The boundary between the light and dark regions is sharp and no light gradients can guide the robots. The light region is made purposely too small to fit the entirety of the swarm (\nN\nm\n​\na\n​\nx\n≈\n50\nN_{max}\\approx 50\n) in order to favor collisions.\nEach robot continuously monitors the local light intensity. When in the dark area, defined as an intensity below a predefined threshold, the robot executes a run-and-tumble motion with a constant velocity\nv\n∙\nv_{\\bullet}\n. Upon entering the lit region, where the intensity is above threshold, the robot switches to a stop-and-run type of motion, producing an effective velocity\nv\n∘\nv_{\\circ}\n(see METHODS). A typical trajectory of a single robot is illustrated on\nFig 1.A\n. The effective velocity in the dark and light regions are extracted from the tracking of the trajectories and the computation of the mean square displacement\nM\n​\nS\n​\nD\n​\n(\nτ\n)\n=\n⟨\n(\nr\n​\n(\nt\n+\nτ\n)\n−\nr\n​\n(\nt\n)\n)\n2\n⟩\nMSD(\\tau)=\\langle\\left(\\textbf{r}(t+\\tau)-\\textbf{r}(t)\\right)^{2}\\rangle\n, where the brackets denote an average over the running time\nt\nt\n, inside and outside the light region (\nFig 1.B\n). Averaging over many realizations of trajectories, we find a mean effective velocity ratio of one third :\nv\n∘\n/\nv\n∙\n≈\n1\n/\n3\nv_{\\circ}/v_{\\bullet}\\approx 1/3\n.\nFigure 2:\nExperimental results for a phototactic aggregation task of\nN\n=\n64\nN=64\naligners and fronters.\nA.\nSnapshot of real robot experiment over time for the two morphologies : aligners on top and fronters on the bottom. The illuminated area (not visible on the images) is surrounded by a red circle. The positive self-alignment of the aligners prevent them from aggregating in the light region, while the fronters succeed in clustering in and around the illuminated region.\nB.\nFraction of the swarm in the light region as a function of time for 4 independent experiments quantifies the lack of aggregation for the aligners, with no significant evolution in time and a mean\nN\n∘\n/\nN\nt\n​\no\n​\nt\nN_{\\circ}/N_{tot}\naround\n0.16\n0.16\n.\nC.\nConversely, the fronters manage to hold a consistent filling of the light region following and exponential-like convergence to a plateau value around\nN\n∘\n/\nN\nt\n​\no\n​\nt\n=\n0.4\nN_{\\circ}/N_{tot}=0.4\n.\nTwo types of exoskeleton have been designed in order to obtain two opposite self-aligning behavior (\nFig 1.C\n). The asymmetry in the legs positions and mass distribution leads to an asymmetric drag on the contact points with the floor, which in turn induces a re-orienting torque on the robot, when it experiences a force that is not aligned with its propelling direction\n[\n2\n]\n. For the so-called aligner morphology, two flexible legs are placed symmetrically on the back of the robot and a single rigid leg is placed centered at its front, with the mass being distributed toward the front. As a result the aligner re-orients in the direction of the force it experiences. For the fronter morphology, the two flexible legs are placed symmetrically on the front of the robot and the single rigid leg on its rear, with the mass being distributed toward the back. The fronter re-orients against the direction of the force it experiences.\nWhen two robots enter a ”collision event”, they typically experience repeated tapping\n[\n7\n]\nand repeated re-orientation. At an effective level, the collision can be described as follow (\nFig 1.D\n): the two robots feel a force pointing outwards from the collision point. As two aligners collide, they re-orient partially away from the contact point, more-so according to the strength of morphological effects. This produce a tendency to share a common direction after a collision event. On the contrary, as two fronters collide, they re-orient partially toward the contact point, that may in turn trigger another collision. Provided that the strength of morphological effects is high enough, this cycle becomes hard to break and two colliding robots can become stuck until an external event or vibrational noise eventually lead them to escape the collision. Altogether the generic behavior of aligners, respectively fronters, is to disperse, respectively stick together, by the combined effect of activity and morphology.\nAt the beginning of each experiment, robots are placed randomly in the dark region of the arena with varying initial positions and orientations. A time series of image snapshots taken from a typical experiment is shown on\nFig 2.A\n, for respectively the aligners (top) and the fronters (bottom). As robots randomly explore the space of the arena, the local density quickly increases in the light region as compared to the dark one, simply because of the difference of effective velocity in the two regions. After this brief transient, one observes two clearly distinct behaviors. In the case of the fronters the initial increase of density rapidly triggers the formation of a cluster of up to 25 robots. This cluster is subject to evaporation at the boundary, with robots leaving due to orientational or positional noise driving them away from the cluster, but this evaporation is compensated by new robots randomly colliding with the existing cluster, triggering the force re-orientation response which drives the incoming robot towards the crowd.\nIn the case of the aligners nothing of the sort happens. Repeating 4 independent runs for each morphology and monitoring the fraction of robots inside the light region as a function of time confirm the above observation (\nFig 2.B\nand\nFig 2.C\n). In the case of the aligners, the data show no clear evolution in time, but a distribution centered around\nN\n∘\n/\nN\nt\n​\no\n​\nt\n=\n0.16\nN_{\\circ}/N_{tot}=0.16\n, a value close to the expected proportion obtained as if there was no collisions and robots would explore the arena independently (\nσ\n​\nv\n∙\nv\n∘\n=\n0.18\n\\sigma\\frac{v_{\\bullet}}{v\\circ}=0.18\n). There is thus no sign of aggregation for the aligners. The data obtained in the case of the fronters tell a different story. One observes an exponential relaxation to a plateau taking values around\nN\n∘\n/\nN\nt\n​\no\n​\nt\n=\n0.4\nN_{\\circ}/N_{tot}=0.4\n, highlighting the capacity of the fronters to aggregate.\nFigure 3:\nFraction of the swarm in the light region (red) and total alignment (blue), averaged over the last\n100\n​\nτ\n100\\tau\nof a\n1000\n​\nτ\n1000\\tau\nduration experiment, as a function of\nϵ\n/\nτ\nn\n\\epsilon/\\tau_{n}\n, for the simulated phototactic aggregation task. The horizontal dotted line is the fraction expected from a random exploration of space by non interacting agents, slowing down in the light with a velocity ratio\nv\n∘\n/\nv\n∙\n=\n1\n/\n3\nv_{\\circ}/v_{\\bullet}=1/3\n. The insets display simulation snapshots of the final time state of the system at four different values of\nϵ\n/\nτ\nn\n\\epsilon/\\tau_{n}\n, with typical trajectories over the last 10\nτ\n\\tau\n.\nThis effect can only be attributed to the role of morphology: aggregation is made possible through the force re-orientation response granted by the exoskeleton design. When two fronters collide and face each other, their real speed decreases to almost zero, even if their respective motors keep on running. This dramatic decrease of the velocity with the local density is the basic mechanism at the origin of the well known motility-induced phase separation\n[\n8\n]\n:\ndensity increases where velocity slows down; if velocity slows down strongly enough with density, this positive feedback leads to an instability and the associated phase separation between a low density and a high density phases. In other words, the transient increase of the density induced by the ”slowing down in the light” policy, coupled to the fronters’ strong tendency to decrease their effective velocity during collisions, induces the seeding of the phase separation, hence the aggregation in the light region. This cannot take place for the fronters which barely slow down during a collision.\nThe above result demonstrates the possible cross-fertilization between the field of active matter and that of swarm robotics and stresses the importance of the morphological design for the realization of the given task. It also shows that the mechanism by which the morphology helps in the task realization may be strongly dependent on the accessible set of policies. In the case where the robots could stop in the light, the difference of success rate in the phototaxis between the fronters and the aligners results from a steric barrier taking place at the boundary between the light and the dark regions\n[\n4\n]\n. In the present case, where the robots can only slow down, we just saw that it is a nucleation dynamics seeded in the light region that assists the fronters aggregation.\nII.2\nTuning self-alignment in silico\nOptimizing the morphology in view of a given task is in general a very tedious and time consuming task, because of the highly non linearity dependence of the output over many parameters. In the present case, the mechanical rules linking the morphology (friction and mass distribution) to the self-alignment strength is known(see\n[\n2\n]\n-appendix), and we can concentrate on the numerical evaluation of the right amount of self-alignment needed to optimize aggregation.\nThe dynamics of self propelled agents, such as the robots, taking their momentum from an external\n[\n9\n,\n10\n]\nor an internal vibration\n[\n3\n]\nsource and including self-alignment\n[\n2\n]\n, is well described by a set of stochastic equations for the center of mass\nr\n→\n\\vec{r}\nand for the body orientation encoded in a unit vector\nn\n→\n\\vec{n}\n[\n19\n]\n. With the exoskeleton used in the present study, one can safely assumes overdamped dynamics\n[\n12\n]\n, and these equations read for each robot:\nd\n​\nr\n→\nd\n​\nt\n\\displaystyle\\frac{d\\vec{r}}{dt}\n=\nv\na\n​\nn\n→\n+\nF\n→\ne\n​\nx\n​\nt\n\\displaystyle=v_{a}\\vec{n}+\\vec{F}_{ext}\n(1)\nτ\nn\n​\nd\n​\nn\n→\nd\n​\nt\n\\displaystyle\\tau_{n}\\frac{d\\vec{n}}{dt}\n=\nϵ\n​\n(\nn\n→\n×\nv\n→\n)\n×\nn\n→\n+\n2\n​\nD\n​\nξ\n​\nn\n→\n⟂\n\\displaystyle=\\epsilon(\\vec{n}\\times\\vec{v})\\times\\vec{n}+\\sqrt{2D}\\xi\\vec{n}_{\\perp}\n(2)\nwhere\nF\n→\ne\n​\nx\n​\nt\n\\vec{F}_{ext}\ndescribes the collisions with the other robots and\nξ\n​\n(\nt\n)\n\\xi(t)\nis a delta-correlated Gaussian noise. The collisions with the other robots are here implemented via the use of a repulsive hard core Weeks-Chandler-Andersen potential\n[\n1\n]\n. Time and length have been rescaled using the robot diameter\nd\nd\nas unit length and\nτ\n=\nd\n/\nv\na\n\\tau=d/v_{a}\nas the unit time, where\nv\na\nv_{a}\nis the typical active velocity, chosen here as the velocity in the dark\nv\n∙\nv_{\\bullet}\n. As in the real robot experiment, we perform a phototactic aggregation task keeping the same ratio\nσ\n=\n6\n%\n\\sigma=6\\%\nfor the area of the light region to the arena size, which here has periodic boundary conditions. The ratio\nv\n∘\n/\nv\n∙\nv_{\\circ}/v_{\\bullet}\nis chosen to mimic the experimental value of\n1\n/\n3\n1/3\n, we set D=0.01 and we concentrate on varying\nϵ\n/\nτ\nn\n\\epsilon/\\tau_{n}\n, where\nϵ\n\\epsilon\nsets the sign of the self-alignment,\nϵ\n=\n+\n1\n\\epsilon=+1\nfor aligners and\nϵ\n=\n−\n1\n\\epsilon=-1\nfor fronters, and\n1\n/\nτ\nn\n1/\\tau_{n}\nsets the strength of the self-aligning torque. In the limit where\nτ\nn\n→\n+\n∞\n\\tau_{n}\\rightarrow+\\infty\n, the self-aligning torque vanishes and the dynamics is that of standard Active Brownian Particles\n[\n30\n]\n.\nWe run simulations lasting\n1000\n​\nτ\n1000\\tau\n, uniformly varying the parameter\nϵ\n/\nτ\nn\n\\epsilon/\\tau_{n}\nin the range\n[\n−\n5\n,\n5\n]\n[-5,5]\nand record the fraction of the swarm in the light region averaged over the the last 100\nτ\n\\tau\n, as shown in red on Fig.\nFig.3\n. The most salient feature of the result is the presence of a sweet spot of values for the parameter\nϵ\n/\nτ\nn\n\\epsilon/\\tau_{n}\nfor which aggregation in the light takes place.\nIn this regime, the slowing down of the dynamics inside the light region leads to a density increase, which triggers the formation of a cluster in a motility induced phase separation like scenario:\nonce a cluster seed is large enough, the probability of wandering robots to come in contact and aggregate with it exceeds that of a robot at the boundary to leave the cluster, therefore maintaining the growth of the aggregate. This is the same effect as the one observed in our real-robots experiments. And indeed, this sweet spots takes place for negative values of\nϵ\n/\nτ\nn\n\\epsilon/\\tau_{n}\n, that is for a fronter behavior. Also in line with our observations, we find that aligners can never achieve aggregation and the fraction of agents in the light matches that of a random exploration of space, with a the ratio of velocity\nv\n∘\n/\nv\n∙\n=\n1\n/\n3\nv_{\\circ}/v_{\\bullet}=1/3\n.\nEven more surprising is the fact that increasing the magnitude of the negative self-alignment rapidly turns counterproductive. As a matter of fact, we even observe reverse phototaxis: the fraction of agents inside the light is smaller than expected from the random exploration of space. Similarly increasing\nϵ\n/\nτ\nn\n>\n0\n\\epsilon/\\tau_{n}>0\ndoes not improve and even slowly deteriorate the performance.\nThe reasons for these features can be inferred by a closer look at the late-stage state of the system (see insets of\nFig.3\n), and match with the conclusions of a recent numerical work\n[\n24\n]\n, where the stability of the motility induced phase separation with respect to self-alignment is analyzed.\nFor large and positive self-alignment, the collisions together with the self-alignment lead to collective, unidirectional motion\n[\n19\n]\n. This is further evidence by measuring the swarm alignment over the last\n100\n​\nτ\n100\\tau\n<\nΨ\n>\n=\n|\n∑\ni\n=\n0\n64\nn\ni\n→\n|\n<\\Psi>=|\\sum_{i=0}^{64}\\vec{n_{i}}|\n, as shown in blue on\nFig.3\n. For\nϵ\n/\nτ\nn\n>\n0\n\\epsilon/\\tau_{n}>0\n, particles start to align and the value of\n<\nΨ\n>\n<\\Psi>\ngrows up to a plateau for which the alignment is maximal with respect to the orientational noise D and the total density. For large, but negative self-alignment, micro-clusters form everywhere, even in the low density dark region: the robots entering in contact quickly lock in a very stable binary or ternary configuration. These two emergent behaviors act against the aggregation in the light.\nThe results of these simulations are thus two-fold. First, comparing with the real robots experiments, one clearly sees that the morphologically rooted force-reorientation observed in the real robot systems is well-replicated by the self-alignment term, with the parameter\nϵ\n/\nτ\nn\n\\epsilon/\\tau_{n}\ndriving entirely the large scale dynamics and the success in aggregation. Second, increasing the range of this parameter, we observe new large scale collective behaviors, ranging from local clustering to collective motion, suggesting a richer expressivity of the control parameter than initially expected.\nIII\nDiscussion\nThis work demonstrates that morphological design does not merely modulate individual robot responses to environmental cues, but can fundamentally reshape the collective mechanisms through which a swarm achieves a task. By constraining robots to maintain a non-zero velocity, we remove the possibility of single-agent phototaxis and force the swarm to rely on collective effects. In this regime, the two morphologies that previously differed only moderately in performance exhibit radically divergent behaviors: aligners fail to accumulate in the light region, while fronters trigger a phase-separation mechanism reminiscent of motility-induced phase separation, driven by collision-induced velocity reduction. Morphology thus acts not simply as a facilitator of control, but as an enabler of alternative collective pathways to task success.\nImportantly, the mechanism enabling aggregation differs qualitatively from previous observations under stop-and-run control policies where aggregation is limited by steric arching and boundary effects, and morphology modulates how remaining agents negotiate the crowd barrier. This highlights that the benefits of morphological computation depend critically on the space of available behavioral policies, suggesting that morphology cannot be optimized independently of control—and may even compensate for policy limitations.\nOur numerical results further reveal that successful aggregation requires tuning self-alignment within a narrow “sweet spot”: too weak, and collisions are insufficient to seed clustering; too strong, and either velocity alignment or stable micro-clusters outside the light region hinder aggregation. This sharp sensitivity underscores the high-dimensional trade-offs inherent in morphology design: robustness may require morphologies that adapt dynamically rather than static, single-purpose exoskeletal structures.\nMore broadly, these results position morphology as a control parameter enabling a richer design vocabulary for swarm robotics. Exploring a continuous space of self-alignment strengths yields a spectrum of collective behaviors—from global flocking to jamming into localized cluster formation—suggesting that morphological tuning could be leveraged not merely for performance optimization, but for programmable expressivity. This resonates with recent theoretical developments in smart active matter, where physical interactions provide implicit computation and decision-making capacity at the collective level.\nFinally, our findings raise several engineering and scientific perspectives.\n(i) Toward adaptive or reconfigurable morphology: dynamically tuning mass distribution, friction, or contact asymmetry could allow swarms to switch between collective modes in response to context, much as biological collectives modulate adhesion or polarity. (ii) Learning morphology–policy couplings: combining morphological effects with decentralized learning or embodied evolution may enable robots to autonomously discover how to exploit physical interactions rather than treat them as constraints\n[\n13\n,\n6\n,\n28\n]\n. (iii) Bridging active matter theory and swarm design: the observed behaviors provide a real-robot platform for testing predictions from kinetic theories of self-aligning active particles\n[\n20\n,\n18\n]\n.\nIV\nAcknowledgments\nThis work is supported by the MSR and SSR projects funded by the Agence Nationale pour la Recherche under Grant No ANR-18-CE33-0006 and ANR-24-CE33-7791. We thank M.Y. Ben Zion for the design of the exoskeletons, first presented in\n[\n4\n]\n.\nV\nMethods\nV.1\nExperimental setup\nKilobot robot\nThe Kilobot robot is a 33mm wide robot consisting of a circular board mounted on 3 rigid metal legs and supporting a cylindrical battery, making it approximately 34mm tall.\nOn top of the board are placed a light intensity sensor, a RGB led, two vibration motors and the removable 3.7V lithium-ion battery. On the bottom of the circuit board, the robot is equipped with a close range infrared emitter/receiver, used for both the communication inter-Kilobot and computer-Kilobot.\nAligner and Fronter Exoskeletons\nExoskeletons are tripod based design printed using a photopolymer based 3D printer Stratasys Connex3 Objet260.\nEach print comes embedded in a soft material, the support, which has to be removed mechanically. Materials used for both morphologies are ”Support 706B” and ”VeroClear”. Once the support has been removed, exoskeletons are gently washed with water and a black and white detection pattern is glued on top.\nArena\nThe whole arena rests on a thick slab of chipboard wood of 5x200x200cm on which arena floor, walls and overall structure is screwed in. The floor consists of a 2mm thick black PMMA slab, and the walls made of a 0.2mm thick circular aluminum sheet of 1.5 meters in diameter. A main beam structure is fixed along a bearing wall of the experimentation room, two beams are placed on the opposite sides to hold black fabric covering the whole arena. The inside of the arena is lit via LEDs light strips attached to the inner part of the circular wall. About 2 meters higher than the floor, a black and white camera is set to film the entirety of the arena, and a small video projector allows for projection on part of the arena. The projected zones are all set to use only the green channel, as it matches better the Kilobot sensor intensity peak than the color blue. In front of the camera, we placed a red long-pass filter, cutting wavelengths shorter than 645nm. Doing so, the contrast between the lit and unlit regions disappears on the film, the overall light intensity is enough to track the robots and the real contrast in light intensity is maintained high enough to allow for phototaxis.\nV.2\nAlgorithms\nThe algorithm used is an algorithm based on a\nsense-act\ncycle, in which the robot senses its environment (light intensity) and act by driving its motor vibration intensity according to a predefined Run-And-Tumble behavior. After each cycle, an assessment is made to switch from a high speed Run-And-Tumble to a low speed Run-And-Tumble.\nIn the light integration phase (sense), the robot performs batches of light intensity measurements to average out sensor noise over the course of\n≈\n1\n​\ns\n\\approx 1s\n. In the motion phase, the robot decides its velocity for the Run-And-Tumble. A high speed, Run-And-Tumble is performed by setting both motors of the Kilobot to\n130\n/\n255\n130/255\nfor a fixed duration of\n6\n​\ns\n6s\n, and tumbling by applying a less powerful vibration intensity to one motor only drawn at random (\n110\n/\n255\n110/255\n). The tumbling duration is drawn from a long-tail distribution with 6 possibilities, from\n1\n​\ns\n1s\nto\n7\n​\ns\n7s\n. The low speed Run-And-Tumble on the other hand cannot be implemented by reducing motor intensity only, as motor have a starting threshold below which they do not vibrate. Instead, the motion is interrupted quickly, following phases of Run-And-Tumble and complete stop with a 1 to 15 duration. At the end of the sense-act cycle, a flag is updated according to the measured light intensity to switch from one behavior to the other.\nV.3\nNumerical simulations\nSimulations are ran using LAMMPS\n[\n40\n]\n, an open-source software designed for molecular dynamics simulation. This software has been extended with our equations of motion, using code available publicly on Github (\nhttps://github.com/jeremyaqp/AggregatingSwarms2026\n). Collisions are soft and computed with a truncated and shifted Lennard-Jones potential (WCA) cut at 1.122. Initially, particles are placed randomly in the simulation a box. A first phase of Brownian motion with increasing potential cutoff from 0 to the final value is performed to avoid inter-penetration of particles. Only then the true simulation is started. Exact parameters for the simulations are as follow :\n•\nN=64\n•\nSquare L=27.7 pbc, lit region is a circle\n⌀\n=\n3.83\n\\diameter=3.83\n(\nσ\n≈\n6\n%\n\\sigma\\approx 6\\%\n)\n•\ndt = 0.001, 1000\nτ\n\\tau\n•\nτ\nv\n=\n0.001\n\\tau_{v}=0.001\n, D=0.01\n•\nv\n∘\n=\n1\n3\n​\nv\n∙\nv_{\\circ}=\\frac{1}{3}v_{\\bullet}\nThe data is analyzed through python scripts available on the same Github repository. Simulation snapshots are made using Ovito\n[\n36\n]\n.\nReferences\n[1]\nH. C. Andersen, D. Chandler, and J. D. Weeks\n(1972)\nRoles of repulsive and attractive forces in liquids: the optimized random phase approximation\n.\nThe Journal of Chemical Physics\n56\n(\n8\n),\npp. 3812–3823\n.\nCited by:\n§II.2\n.\n[2]\nP. Baconnier, O. Dauchot, V. Démery, G. Düring, S. Henkes, C. Huepe, and A. Shee\n(2025)\nSelf-aligning polar active matter\n.\nReviews of Modern Physics\n97\n(\n1\n),\npp. 015007\n.\nCited by:\n§I\n,\n§I\n,\n§II.1\n,\n§II.2\n,\n§II.2\n.\n[3]\nP. Baconnier, D. Shohat, C. H. López, C. Coulais, V. Démery, G. Düring, and O. Dauchot\n(2022)\nSelective and collective actuation in active solids\n.\nNature Physics\n18\n(\n10\n),\npp. 1234–1239\n.\nCited by:\n§II.2\n.\n[4]\nM. Y. Ben Zion, J. Fersula, N. Bredeche, and O. Dauchot\n(2023)\nMorphological computation and decentralized learning in a swarm of sterically interacting robots\n.\nScience Robotics\n8\n(\n75\n),\npp. eabo6140\n.\nNote:\nPublisher: American Association for the Advancement of Science\nExternal Links:\nDocument\nCited by:\n§I\n,\n§I\n,\n§II.1\n,\n§II.1\n,\n§IV\n.\n[5]\nM. Brambilla, E. Ferrante, M. Birattari, and M. Dorigo\n(2013)\nSwarm robotics: a review from the swarm engineering perspective\n.\nSwarm Intelligence\n7\n,\npp. 1–41\n.\nNote:\nPublisher: Springer\nExternal Links:\nDocument\nCited by:\n§I\n.\n[6]\nN. Bredeche, E. Haasdijk, and A. Prieto\n(2018)\nEmbodied evolution in collective robotics: a review\n.\nFrontiers in Robotics and AI\n5\n,\npp. 12\n.\nNote:\nPublisher: Frontiers Media SA\nExternal Links:\nDocument\nCited by:\n§III\n.\n[7]\nL. Caprini, A. Ldov, R. K. Gupta, H. Ellenberg, R. Wittmann, H. Löwen, and C. Scholz\n(2024-02)\nEmergent memory from tapping collisions in active granular matter\n.\nCommunications Physics\n7\n(\n1\n),\npp. 52\n(\nen\n).\nExternal Links:\nISSN 2399-3650\n,\nLink\n,\nDocument\nCited by:\n§II.1\n.\n[8]\nM. E. Cates and J. Tailleur\n(2015)\nMotility-induced phase separation\n.\nAnnu. Rev. Condens. Matter Phys.\n6\n(\n1\n),\npp. 219–244\n.\nNote:\nPublisher: Annual Reviews\nExternal Links:\nDocument\nCited by:\n§I\n,\n§I\n,\n§II.1\n.\n[9]\nJ. Deseigne, O. Dauchot, and H. Chaté\n(2010)\nCollective motion of vibrated polar disks\n.\nPhysical review letters\n105\n(\n9\n),\npp. 098001\n.\nNote:\nPublisher: APS\nExternal Links:\nDocument\nCited by:\n§II.2\n.\n[10]\nJ. Deseigne, S. Léonard, O. Dauchot, and H. Chaté\n(2012)\nVibrated polar disks: spontaneous motion, binary collisions, and collective dynamics\n.\nSoft Matter\n8\n(\n20\n),\npp. 5629–5639\n.\nNote:\nPublisher: Royal Society of Chemistry\nExternal Links:\nDocument\nCited by:\n§II.2\n.\n[11]\nM. Dorigo, G. Theraulaz, and V. Trianni\n(2021-07)\nSwarm Robotics: Past, Present, and Future [Point of View]\n.\nProceedings of the IEEE\n109\n(\n7\n),\npp. 1152–1165\n.\nExternal Links:\nISSN 1558-2256\n,\nLink\n,\nDocument\nCited by:\n§I\n.\n[12]\nJ. Fersula, N. Bredeche, and O. Dauchot\n(2024-07)\nSelf-aligning active agents with inertia and active torque\n.\nPhysical Review E\n110\n(\n1\n),\npp. 014606\n(\nen\n).\nExternal Links:\nISSN 2470-0045, 2470-0053\n,\nLink\n,\nDocument\nCited by:\n§II.2\n.\n[13]\nZ. Firat, E. Ferrante, N. Cambier, and E. Tuci\n(2018)\nSelf-organised Aggregation in Swarms of Robots with Informed Robots\n.\nIn\nTheory and Practice of Natural Computing\n,\nD. Fagan, C. Martín-Vide, M. O’Neill, and M. A. Vega-Rodríguez (Eds.)\n,\nVol.\n11324\n,\npp. 49–60\n(\nen\n).\nNote:\nSeries Title: Lecture Notes in Computer Science\nExternal Links:\nISBN 978-3-030-04069-7 978-3-030-04070-3\n,\nLink\n,\nDocument\nCited by:\n§III\n.\n[14]\nG. Gompper, R. G. Winkler, T. Speck, A. Solon, C. Nardini, F. Peruani, H. Löwen, R. Golestanian, U. B. Kaupp, L. Alvarez,\net al.\n(2020)\nThe 2020 motile active matter roadmap\n.\nJournal of Physics: Condensed Matter\n32\n(\n19\n),\npp. 193001\n.\nCited by:\n§I\n.\n[15]\nR. Groß, S. Magnenat, and F. Mondada\n(2009-10)\nSegregation in swarms of mobile robots based on the Brazil nut effect\n.\nIn\n2009 IEEE/RSJ International Conference on Intelligent Robots and Systems\n,\npp. 4349–4356\n.\nNote:\nISSN: 2153-0866\nExternal Links:\nLink\n,\nDocument\nCited by:\n§I\n,\n§I\n.\n[16]\nH. Hamann\n(2018)\nSwarm robotics: a formal approach\n.\nVol.\n221\n,\nSpringer\n.\nCited by:\n§I\n.\n[17]\nZ. Hao, S. Mayya, G. Notomista, S. Hutchinson, M. Egerstedt, and A. Ansari\n(2023-02)\nControlling Collision-Induced Aggregations in a Swarm of Micro Bristle Robots\n.\nIEEE Transactions on Robotics\n39\n(\n1\n),\npp. 590–604\n.\nExternal Links:\nISSN 1941-0468\n,\nLink\n,\nDocument\nCited by:\n§I\n,\n§I\n.\n[18]\nG. Jung, M. Ozawa, and E. Bertin\n(2025-06)\nKinetic theory of decentralized learning for smart active matter\n.\nPhysical Review Letters\n134\n(\n24\n),\npp. 248302\n(\nen\n).\nNote:\narXiv:2501.03948 [cond-mat]\nExternal Links:\nISSN 0031-9007, 1079-7114\n,\nLink\n,\nDocument\nCited by:\n§III\n.\n[19]\nK. N. T. Lam, M. Schindler, and O. Dauchot\n(2015)\nSelf-propelled hard disks: implicit alignment and transition to collective motion\n.\nNew Journal of Physics\n17\n(\n11\n),\npp. 113056\n.\nNote:\nPublisher: IOP Publishing\nExternal Links:\nDocument\nCited by:\n§II.2\n,\n§II.2\n.\n[20]\nS. Lévay, A. Katona, H. Löwen, R. C. Hidalgo, and I. Zuriguel\n(2025-08)\nCluster dynamics in macroscopic photoactive particles\n.\nPhysical Review Letters\n135\n(\n9\n),\npp. 098301\n(\nen\n).\nNote:\narXiv:2412.14419 [cond-mat]\nExternal Links:\nISSN 0031-9007, 1079-7114\n,\nLink\n,\nDocument\nCited by:\n§III\n.\n[21]\nS. Li, B. Dutta, S. Cannon, J. J. Daymude, R. Avinery, E. Aydin, A. W. Richa, D. I. Goldman, and D. Randall\n(2021)\nProgramming active cohesive granular matter with mechanically induced phase changes\n.\nScience Advances\n7\n(\n17\n),\npp. eabe8494\n.\nCited by:\n§I\n.\n[22]\nS. Li, R. Batra, D. Brown, H. Chang, N. Ranganathan, C. Hoberman, D. Rus, and H. Lipson\n(2019)\nParticle robotics based on statistical mechanics of loosely coupled components\n.\nNature\n567\n(\n7748\n),\npp. 361–365\n.\nCited by:\n§I\n.\n[23]\nV. C. Müller and M. Hoffmann\n(2017)\nWhat is morphological computation? on how the body contributes to cognition and control\n.\nArtificial life\n23\n(\n1\n),\npp. 1–24\n.\nCited by:\n§I\n.\n[24]\nM. Musacchio, A. P. Antonov, H. Löwen, and L. Caprini\n(2025)\nSelf-alignment and anti-self-alignment suppress motility-induced phase separation in active systems\n.\nThe Journal of Chemical Physics\n162\n(\n24\n).\nCited by:\n§I\n,\n§II.2\n.\n[25]\nL. G. Nava, R. Großmann, and F. Peruani\n(2018)\nMarkovian robots: minimal navigation strategies for active particles\n.\nPhysical Review E\n97\n(\n4\n),\npp. 042604\n.\nCited by:\n§I\n.\n[26]\nN. Nedjah and L. S. Junior\n(2019)\nReview of methodologies and tasks in swarm robotics towards standardization\n.\nSwarm and Evolutionary Computation\n50\n,\npp. 100565\n.\nNote:\nPublisher: Elsevier\nExternal Links:\nDocument\nCited by:\n§I\n.\n[27]\nL. Ning, H. Zhu, J. Yang, Q. Zhang, P. Liu, R. Ni, and N. Zheng\n(2024-07)\nMacroscopic, artificial active matter\n.\nNational Science Open\n3\n(\n4\n),\npp. 20240005\n(\nen\n).\nNote:\nPublisher: China Science Publishing & Media Ltd. and EDP Sciences\nExternal Links:\nISSN 2097-1168, 2097-1400\n,\nLink\n,\nDocument\nCited by:\n§I\n.\n[28]\nD. Paul, N. Milosevic, N. Scherf, and F. Cichos\n(2025-08)\nPhysical Embodiment Enables Information Processing Beyond Explicit Sensing in Active Matter\n.\narXiv\n.\nNote:\narXiv:2508.17921 [cond-mat]\nExternal Links:\nLink\n,\nDocument\nCited by:\n§III\n.\n[29]\nS. Ramaswamy\n(2010)\nThe mechanics and statistics of active matter\n.\nAnnu. Rev. Condens. Matter Phys.\n1\n(\n1\n),\npp. 323–345\n.\nCited by:\n§I\n.\n[30]\nP. Romanczuk, M. Bär, W. Ebeling, B. Lindner, and L. Schimansky-Geier\n(2012)\nActive Brownian particles: From individual to collective stochastic dynamics\n.\nThe European Physical Journal Special Topics\n202\n,\npp. 1–162\n.\nNote:\nPublisher: Springer\nExternal Links:\nDocument\nCited by:\n§II.2\n.\n[31]\nM. Rubenstein, C. Ahler, and R. Nagpal\n(2012-05)\nKilobot: A low cost scalable robot system for collective behaviors\n.\nIn\n2012 IEEE International Conference on Robotics and Automation\n,\npp. 3293–3298\n.\nNote:\nISSN: 1050-4729\nExternal Links:\nLink\n,\nDocument\nCited by:\nFigure 1\n,\n§II.1\n.\n[32]\nE. Şahin\n(2004)\nSwarm robotics: from sources of inspiration to domains of application\n.\nIn\nInternational workshop on swarm robotics\n,\npp. 10–20\n.\nCited by:\n§I\n.\n[33]\nW. Savoie, T. A. Berrueta, Z. Jackson, A. Pervan, R. Warkentin, S. Li, T. D. Murphey, K. Wiesenfeld, and D. I. Goldman\n(2019)\nA robot made of robots: emergent transport and control of a smarticle ensemble\n.\nScience robotics\n4\n(\n34\n),\npp. eaax4316\n.\nCited by:\n§I\n.\n[34]\nD. S. Shah, J. W. Booth, R. L. Baines, K. Wang, M. Vespignani, K. Bekris, and R. Kramer-Bottiglio\n(2022)\nTensegrity robotics\n.\nSoft robotics\n9\n(\n4\n),\npp. 639–656\n.\nCited by:\n§I\n.\n[35]\nB. Siciliano, O. Khatib, and T. Kröger\n(2008)\nSpringer handbook of robotics\n.\nVol.\n200\n,\nSpringer\n.\nCited by:\n§I\n.\n[36]\nA. Stukowski\n(2010-JAN)\nVisualization and analysis of atomistic simulation data with OVITO-the Open Visualization Tool\n.\nMODELLING AND SIMULATION IN MATERIALS SCIENCE AND ENGINEERING\n18\n(\n1\n).\nExternal Links:\nDocument\n,\nISSN 0965-0393\nCited by:\n§V.3\n.\n[37]\nK. Sugawara and M. Sano\n(1997)\nCooperative acceleration of task performance: foraging behavior of interacting multi-robots system\n.\nPhysica D: Nonlinear Phenomena\n100\n(\n3-4\n),\npp. 343–354\n.\nCited by:\n§I\n.\n[38]\nK. Sugawara, H. Tanigawa, K. Kosuge, Y. Hayakawa, T. Mizuguchi, and M. Sano\n(2006)\nCollective motion and formation of simple interacting robots\n.\nIn\n2006 IEEE/RSJ International Conference on Intelligent Robots and Systems\n,\npp. 1062–1067\n.\nCited by:\n§I\n.\n[39]\nD. Tarapore, R. Groß, and K. Zauner\n(2020)\nSparse robot swarms: moving swarms to real-world applications\n.\nFrontiers in Robotics and AI\n7\n,\npp. 83\n.\nCited by:\n§I\n.\n[40]\nA. P. Thompson, H. M. Aktulga, R. Berger, D. S. Bolintineanu, W. M. Brown, P. S. Crozier, P. J. i. ’. Veld, A. Kohlmeyer, S. G. Moore, T. D. Nguyen, R. Shan, M. J. Stevens, J. Tranchida, C. Trott, and S. J. Plimpton\n(2022)\nLAMMPS - a flexible simulation tool for particle-based materials modeling at the atomic, meso, and continuum scales\n.\nComp. Phys. Comm.\n271\n,\npp. 108171\n.\nExternal Links:\nDocument\nCited by:\n§V.3\n.\n[41]\nJ. Wang and A. Chortos\n(2022)\nControl strategies for soft robot systems\n.\nAdvanced Intelligent Systems\n4\n(\n5\n),\npp. 2100165\n.\nCited by:\n§I\n.\n[42]\nG. Yang, J. Bellingham, P. E. Dupont, P. Fischer, L. Floridi, R. Full, N. Jacobstein, V. Kumar, M. McNutt, R. Merrifield,\net al.\n(2018)\nThe grand challenges of science robotics\n.\nScience robotics\n3\n(\n14\n),\npp. eaar7650\n.\nNote:\nPublisher: American Association for the Advancement of Science\nExternal Links:\nDocument\nCited by:\n§I\n.",
    "preview_text": "Morphological computing, the use of the physical design of a robot to ease the realization of a given task has been proven to be a relevant concept in the context of swarm robotics. Here we demonstrate both experimentally and numerically, that the success of such a strategy may heavily rely on the type of policy adopted by the robots, as well as on the details of the physical design. To do so, we consider a swarm of robots, composed of Kilobots embedded in an exoskeleton, the design of which controls the propensity of the robots to align or anti-align with the direction of the external force they experience. We find experimentally that the contrast that was observed between the two morphologies in the success rate of a simple phototactic task, where the robots were programmed to stop when entering a light region, becomes dramatic, if the robots are not allowed to stop, and can only slow down. Building on a faithful physical model of the self-aligning dynamics of the robots, we perform numerical simulations and demonstrate on one hand that a precise tuning of the self-aligning strength around a sweet spot is required to achieve an efficient phototactic behavior, on the other hand that exploring a range of self-alignment strength allows for a rich expressivity of collective behaviors.\n\nAggregating swarms through morphology handling design contingencies:\nfrom the sweet spot to a rich expressivity\nJeremy Fersula\nInstitut des Systèmes Intelligents et de Robotique, Sorbonne Université, CNRS, ISIR, F-75005 Paris, France\nNicolas Bredeche\nInstitut des Systèmes Intelligents et de Robotique, Sorbonne Université, CNRS, ISIR, F-75005 Paris, France\nLaboratoire Jean Perrin, IBPS, Sorbonne Université, CNRS, F-75005 Paris, France\nOlivier Dauchot\nGulliver UMR CNRS 7083, ESPCI Paris, PSL Research University, 10 rue Vauquelin, 75005 Paris, France\n(January 12, 2026)\nAbstract\nMorphological computing, the use of the physical design of a robot to ease the realization of a given task has be",
    "is_relevant": false,
    "relevance_score": 1.0,
    "extracted_keywords": [
        "morphological computing",
        "swarm robotics",
        "phototactic task",
        "self-aligning dynamics",
        "collective behaviors"
    ],
    "one_line_summary": "该论文探讨了通过机器人形态设计（如外骨骼）和策略调整来影响群体机器人（如Kilobots）在光趋性任务中的集体行为表现，强调形态计算在群体机器人学中的应用。",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-12T14:58:47Z",
    "created_at": "2026-01-21T12:09:11.092927",
    "updated_at": "2026-01-21T12:09:11.092934"
}