{
    "id": "2601.22689v1",
    "title": "Assistive Robots and Reasonable Work Assignment Reduce Perceived Stigma toward Persons with Disabilities",
    "authors": [
        "Stina Klein",
        "Birgit Prodinger",
        "Elisabeth André",
        "Lars Mikelsons",
        "Nils Mandischer"
    ],
    "abstract": "机器人在辅助残障人士方面正变得日益重要。尽管人们普遍认同机器人能够帮助减轻身体障碍，但其在促进社会包容方面的作用仍不明确。事实上，辅助工作者的暴露状态同样可能导致其他工作者感知到的污名化程度降低或增加。我们开展了一项小插曲研究，探讨工作场所中对残障人士的认知与行为污名感知。我们设计了四种实验情境，描绘了工作场景中一位存在功能障碍的同事：工作负荷过重、工作适配、仅该同事获得机器人辅助，以及为所有人提供机器人辅助工作。研究结果显示，当工作任务根据个人能力进行调整或通过辅助机器人增强时，认知污名显著降低。此外，以通用设计理念为所有人提供机器人辅助工作，能进一步降低感知到的认知污名。因此我们得出结论：辅助机器人能够降低认知污名感知，这支持了在涉及残障人士的工作场景中使用协作机器人。",
    "url": "https://arxiv.org/abs/2601.22689v1",
    "html_url": "https://arxiv.org/html/2601.22689v1",
    "html_content": "\\setcctype\nby\nAssistive Robots and Reasonable Work Assignment Reduce Perceived Stigma toward Persons with Disabilities\nStina Klein\nstina.klein@uni-a.de\n0000-0003-4998-6811\nHCAI, University of Augsburg\nAugsburg\nGermany\n,\nBirgit Prodinger\nbirgit.prodinger@uni-a.de\n0000-0002-0404-3548\nIAM, University of Augsburg\nAugsburg\nGermany\n,\nElisabeth André\nelisabeth.andre@uni-a.de\n0000-0002-2367-162X\nHCAI, University of Augsburg\nAugsburg\nGermany\n,\nLars Mikelsons\nlars.mikelsons@uni-a.de\n0009-0005-9006-9726\nAuxMe, University of Augsburg\nAugsburg\nGermany\nand\nNils Mandischer\nnils.mandischer@uni-a.de\n0000-0003-1926-4359\nAuxMe, University of Augsburg\nAugsburg\nGermany\n(2026)\nAbstract.\nRobots are becoming more prominent in assisting persons with disabilities (PwD). Whilst there is broad consensus that robots can assist in mitigating physical impairments, the extent to which they can facilitate social inclusion remains equivocal. In fact, the exposed status of assisted workers could likewise lead to reduced or increased perceived stigma by other workers. We present a vignette study on the perceived cognitive and behavioral stigma toward PwD in the workplace. We designed four experimental conditions depicting a coworker with an impairment in work scenarios: overburdened work, suitable work, and robot-assisted work only for the coworker, and an offer of robot-assisted work for everyone. Our results show that cognitive stigma is significantly reduced when the work task is adapted to the person’s abilities or augmented by an assistive robot. In addition, offering robot-assisted work for everyone, in the sense of universal design, further reduces perceived cognitive stigma. Thus, we conclude that assistive robots reduce perceived cognitive stigma, thereby supporting the use of collaborative robots in work scenarios involving PwDs.\nAssistive Robots, Stigma, Human-Robot Interaction, Work, Persons with Disabilities, Inclusion, ICF\n†\n†\njournalyear:\n2026\n†\n†\ncopyright:\ncc\n†\n†\nconference:\nCompanion Proceedings of the 21st ACM/IEEE International Conference on Human-Robot Interaction; March 16–19, 2026; Edinburgh, Scotland, UK\n†\n†\nbooktitle:\nCompanion Proceedings of the 21st ACM/IEEE International Conference on Human-Robot Interaction (HRI Companion ’26), March 16–19, 2026, Edinburgh, Scotland, UK\n†\n†\ndoi:\n10.1145/3776734.3794358\n†\n†\nisbn:\n979-8-4007-2321-6/2026/03\n†\n†\nccs:\nHuman-centered computing User studies\n†\n†\nccs:\nHuman-centered computing Accessibility technologies\n†\n†\nccs:\nHuman-centered computing Collaborative interaction\n†\n†\nccs:\nSocial and professional topics People with disabilities\nFigure 1.\nDepictions for different conditions featuring\nI\n2\nI_{2}\n. From left: (\nT\n1\nT_{1}\n) overburdened work condition where the coworker has to heavily rely on his arm, (\nT\n2\nT_{2}\n) suitable work condition with a lighter task, (\nT\n3\nT_{3}\n&\nT\n4\nT_{4}\n) the coworker works with robot assistance.\n1.\nIntroduction\nRobots assisting persons with disabilities (PwD) have already been shown to enable participation in work\n(Weidemann\net al.\n,\n2022\n; Drolshagen\net al.\n,\n2020\n; Arboleda\net al.\n,\n2020\n; Graser\net al.\n,\n2013\n)\n. To move from participation to full inclusion, it is important not only to enhance individual functioning, but also to ensure that the social context, such as coworkers, facilitates and supports the team of PwD and the robot. The question of whether assistive robots are perceived by coworkers as a distinguishing feature, and thus whether they increase or decrease the level of stigmatization, remains to be resolved. In this study, we present results aimed at finding possible stigmatization in human-robot interaction with PwDs in work scenarios. We aim to answer the following hypothesis:\nUsing assistive robots lowers perceived stigma toward PwD at the workplace.\nThe study’s results confirm the hypothesis and provide promising guidelines for implementing assistive robots in the workplace.\n2.\nRelated Work\nThe social model of disability posits that disability is socially constructed\n(Swain\net al.\n,\n2014\n)\nrather than being caused by the person’s impairments as is the case in the medical model of disability\n(Bury,\n2001\n)\n. The critique of both of these models over the last few decades\n(Shakespeare and Watson,\n2001\n)\nemphasizes the significance of models that integrate multiple perspectives on disability. The WHO’s International Classification of Functioning, Disability, and Health (ICF)\n(Ustün\net al.\n,\n2003\n)\nconsiders disability to arise from an interplay of body functions, activities, participation, and contextual factors, including the environment and personal factors. The ICF considers a person’s intrinsic capacity, as well as what a person can do within a given context (performance). This distinction highlights the dynamic interaction between individuals’ capacities and the social or environmental context in which they are exercised.\nHow others perceive disability is relevant in the context of inclusion, ultimately influencing a PwD’s self-perception and the external perception of their disability, which can lead to stigmatization\n(LoBianco and Sheppard–Jones,\n2007\n)\n.\nA stigma is an aggregation of societal factors. It is commonly understood as a social construct in which a person has a distinguishing feature that is connotated with the devaluation of certain aspects of the person’s life\n(Arboleda-Flórez,\n2002\n)\n.\n2.1.\nPerception of Disability\nThe perception of disability is often connected with disability stigma\n(Susman,\n1994\n)\n. It is not a constant fact but ever-evolving and shaped by societal factors. According to\nBrittain (\n2004\n)\n, the way in which people interact with PwDs is determined by the perception of disability, ultimately resulting in the disability becoming the dominant feature in the PwD’s societal role. He advocates that the connotation of disability must change to benefit the self-perception of PwDs. While simply increasing coverage in broadcast (e. g., sports events) is insufficient, such representation must be accompanied by a deliberate effort to foster positive re-connotation. Subsequently, the UN adopted the Convention on the Rights of Persons with Disabilities (UN-CRPD) which has since been ratified by 193 states\n(\nUnited Nations Department of Economic and Social Affairs,\n)\n. Shifts in media outreach and mainstreaming of disability contributed to changing perceptions of disability, however, stigma remains pervasive. Research highlights that perceptions are influenced by multiple factors:\nLoBianco and Sheppard–Jones (\n2007\n)\nemphasize the influence of medical, social, and vocational factors on how PwDs assume they are viewed.\nChaves\net al.\n(\n2004\n)\nidentified wheelchairs as the most limiting factor for participation for persons with spinal cord injury.\nBabik and Gardner (\n2021\n)\ndemonstrate how developmental, behavioral, cognitive, and affective components shape stigma in children.\nCollectively, these studies underscore the persistence of stigma, a finding reinforced by\nDixon\net al.\n(\n2018\n)\n, who reported in 2018 that a significant proportion of the UK population continues to associate disability with reduced productivity and increased dependency.\n2.2.\nPerceived Stigma Through Robots\nAkiyama\net al.\n(\n2024\n)\nsummarize literature on stigma, service robots, and assistive robots. They observe that stigma associated with assistive technologies\n1\n1\n1\nAssistive technologies\nare technological devices or software that improve the participation of PwD, e. g., text-to-speech, talkers, or white canes.\nhas been observed in multiple studies. Note, however, that despite the title, most of the listed studies do not feature robots but general assistive devices. They outline universal design\n2\n2\n2\nUniversal design\naims to enable all people to participate in a technical system.\nas a promising approach to overcome stigma.\nGlende\net al.\n(\n2016\n)\nstudy factors promoting acceptance of assistive robots through marketing by applying a participatory approach. Raising acceptance in a company’s decision makers could be interpreted as reducing stigma toward the team of PwD and robot.\nShore\net al.\n(\n2018\n)\ndeveloped a model for acceptance of exoskeletons in older adults. They outline that introspective acceptance is influenced i. a. by stigmas associated with dependency and aging.\nWu\net al.\n(\n2014\n)\nobserve reluctance in the adoption of social robots by older adults in living spaces, due to fear of stigma, and ethical and societal issues related to robot use.\nDosso\net al.\n(\n2022\n)\nobserve the same challenges in the acceptance of robots by older adults with dementia.\nIn conclusion, research focuses on older adults and acceptance, in which stigma plays a partial role. There is a distinct lack of literature focusing on stigma related to assistive robots in the working population of PwDs.\nTherefore, we can infer that there is insufficient knowledge about the impact of assistive robots on the perceived stigma toward PwDs. In this work, we investigate this stigma through a vignette study of a PwD in different work scenarios.\nTable 1.\nOverview of the task and performance variation. The plugging process is with reduced strain.\nego work-\nplace\nego task\nPwD’s task\nego\nperf.\nPwD’s\nperf.\ntask align-\nment\nthird part of description / description of PwD’s task\nT\n1\nT_{1}\nregular\nscrewing\nscrewing\n100%\n50%\nover-\nburdened\n“Mr. M. also tightens screws with a torque wrench.\nMr. M. manages to tighten 30 screws per hour.”\nT\n2\nT_{2}\nregular\nscrewing\nplugging\n100%\n100%\nsuitable\n“Mr. M. works in a different process stage than you. He inserts the screws. He does not tighten the screws. Mr. M. manages to insert 60 screws per hour.”\nT\n3\nT_{3}\nregular\nscrewing\nscrewing\n100%\n100%\nrobot-assisted\n“Mr. M. also tightens screws using a torque wrench. A robot helps him tighten the screws. Mr. M. manages to tighten 60 screws per hour.”\nT\n4\nT_{4}\nrobot-assisted\nscrewing\nscrewing\n100%\n100%\nrobot-assisted\n“Mr. M. also tightens screws with a torque wrench. A robot helps him tighten the screws. Mr. M. manages to tighten 60 screws per hour. You also have a robot at your disposal that you can use if you need assistance.”\nperf.: performance.\n3.\nMethodology\nParticipants\nParticipants were recruited via Prolific and had to fulfill the inclusion criteria of their primary language being German, being located in Germany, and being employed in low-level industry jobs with high level of manual work, e. g., manufacturing, construction, or hotel and food services. We specifically excluded management positions and focused on skilled and trained personnel and support staff.\nIn total, 80 participants took part in this study.\nWe removed participants who answered too fast (\n≤\n\\leq\n20 sec per condition) or whose reply on inverted and non-inverted items differed greatly (¿ 2.5 marks on a 5-point Likert scale). We ended up with 75 participants with an average age of\n32.00\n32.00\nyears (\nS\n​\nD\n=\n9.56\nSD=9.56\n), of whom 52 identified as male, 22 as female, and 1 as diverse.\n6.7\n%\n6.7\\%\nof the participants reported that they have a disability.\nFigure 2.\nDepiction of condition\nI\n1\nI_{1}\n+\nT\n4\nT_{4}\n. The robot can support the ego task. Left: ego workplace. Right: Mr. M.’s workplace.\nVariation of Task and Performance\nIn the sense of the ICF\n(Ustün\net al.\n,\n2003\n)\n, performance is the capacity of a person conditioned by the context. Therefore, in the study, it is important to design scenarios with similar required performance or consciously design for harder tasks, i. e. overburdened regarding the required effort. In addition, establishing differences in the workplace assistance may enlarge stigmas due to feelings of unfair treatment. Hence, the ego task may play a particular role in perceived stigmas. Note that we refer to the perspective of the participant as “ego”. Based on these considerations, we defined four different combinations of the ego task and PwD’s task, listed in Table\n1\n.\nIn tasks\nT\n2\nT_{2}\nto\nT\n4\nT_{4}\n, the performance of the PwD is equal in relation to the work process: The task in\nT\n2\nT_{2}\nis simplified. The tasks in\nT\n3\nT_{3}\nand\nT\n4\nT_{4}\nare assisted by a robot, which serves as an enabling context for the PwD’s abilities. Hence, performance-wise, there is no distinguishing factor between these three tasks. However,\nT\n1\nT_{1}\nshows a significantly lower performance of the PwD. We varied the ego workplace either as a\nregular\nworkplace in\nT\n1\nT_{1}\nto\nT\n3\nT_{3}\nor, in the sense of universal design,\nrobot-assisted\nin\nT\n4\nT_{4}\n.\nT\nT\nwas varied within subjects.\nVariation of Disability\nBuilding upon disability occurring at the interaction of impairments with the environment, we considered different impairments in the study to gain insights into whether the perceived impairment influences stigmatization. The PwD was depicted with an orthosis and either standing or in a wheelchair, assuming that the latter is intuitively linked to disability by most people.\nBarbareschi\net al.\n(\n2021\n)\nobserve that visible assistive technologies are a “mark” of disability. Further, a wheelchair is prominently featured as the International Symbol of Access\n(ISO 7001:2023,\n2023\n)\n, e. g., marking reserved parking for PwDs.\nThe wheelchair has no impact on the PwD’s performance, as it does not limit the hand-arm system. This allows us to isolate the effects of the depiction of impairment from the PwD’s performance.\nFrom now on, we will refer to the impairment as\nD\nwith its two variations\nI\n1\nI_{1}\n(\northosis\n) and\nI\n2\nI_{2}\n(\northosis and wheelchair\n), respectively.\nI\nI\nwas varied between subjects.\nMaterial\nWe prepared vignettes for each condition, consisting of a description of the ego and the PwD’s task and a depiction of the workplace (cf.\n2\n). All drawings used in the study are available at Zenodo\n(Mandischer and Klein,\n2025\n)\n. The description comprised three parts:\n(1)\nbasic description\n, which remained the same for all vignettes (\n“Imagine working at an assembly station. Your job is to tighten screws with a torque wrench. The screws must be tightened. This requires a lot of strength. An average worker manages to tighten 60 screws per hour. Mr. M. works at the workstation next to you.”\n),\n(2)\ndifferent impairments\n, varied based on the between-subject assignment to any of the two impairments; read either\n“He has muscle weakness in his right forearm. For this reason, Mr. M. wears an orthosis on his arm while working.”\nor\n“He has muscle weakness in his arms and legs. For this reason, Mr. M. is in a wheelchair and wears an orthosis on his right forearm.”\n,\n(3)\nPwD’s task\nbased on the above-described task and performance variation.\nThe different descriptions of the PwD’s task are given in Table\n1\n. For example, the respective written description to Figure\n2\nreads\n“Mr. M. also tightens screws with a torque wrench. A robot helps him tighten the screws. Mr. M. manages to tighten 60 screws per hour. You also have a robot at your disposal that you can use if you need assistance.”\n.\nProcedure\nParticipants were randomly assigned to either variation of disability (\nI\nI\n).\nFirst, they filled out demographic data (age, gender). Then, they were introduced to the task. The procedure followed the same structure:\nT\n1\nT_{1}\nwas always displayed first. The order of\nT\n2\nT_{2}\nto\nT\n4\nT_{4}\nwas randomized for each participant. After each condition, participants were required to complete questionnaires measuring behavioral and cognitive aspects of stigma.\nEvaluation Metrics and Analysis\nWe assessed stigma using the two subscales\nCognitions\nand\nBehaviors\nof the Workplace Mental Illness Stigma Scale (WMISS)\n(Matousian and Otto,\n2023\n)\nin its validated German version. The WMISS measures stigma toward coworkers with mental illnesses. Although we do not equate mental illness with disability, we chose the WMISS as it specifically captures stigma in workplace contexts and offers a validated instrument rather than relying on self-developed items.\nWhile other scales like MAS\n(Findler\net al.\n,\n2007\n)\n, from which WMISS draws items, focus more on physical disability, they lack relevance to work scenarios and performance, making several items unsuited for our study. Further, the\nAffects\nsubscale of the WMISS was omitted as it captures the affective state of the coworker, which we deemed irrelevant for answering our hypothesis.\nBoth scales,\nCognitions\nand\nBehaviors\n, are rated on a 5-point Likert scale. The\nCognitions\nscale consists of ten items measuring stigma regarding the performance, adaptivity, and social skills of PwDs. The\nBehaviors\nscale consists of five items measuring stigma regarding the social distance to PwDs. Because of the 2x4 study design, we conducted a mixed-design ANOVA with\nI\nI\nas the between-subjects factor (2 levels) and\nT\nT\nas the within-subjects factor (4 levels). The ANOVA was conducted separately for each subscale. In cases of significant results, we conducted post hoc tests with Holm adjustment. Note that we inverted the values of the\nBehaviors\nscale opposed to the original WMISS to enhance understandability: Now, both scales map higher values to higher stigma.\n4.\nResults\n34 participants were shown the conditions with\nI\n1\nI_{1}\nand 41 with\nI\n2\nI_{2}\n. Table\n2\nlists an overview of the descriptive results.\nIn general, there is a monotonic decrease in the\nCognitions\nvalues for\nT\n1\nT_{1}\nto\nT\n4\nT_{4}\n. For the\nBehaviors\nscale, the results are less clear, which is also reflected in the inferential statistical results.\nANOVA of Cognitions Scale.\nThe between-subjects factor\nI\nI\ndid not show a reliable main effect,\nF\n​\n(\n1\n,\n73\n)\n=\n3.30\nF(1,\\,73)=3.30\n,\np\n=\n.074\np=.074\n,\nη\np\n2\n=\n.043\n\\eta^{2}_{\\mathrm{p}}=.043\n.\nThere was a main effect of the factor\nT\nT\n,\nF\n​\n(\n3\n,\n219\n)\n=\n45.31\nF(3,\\,219)=45.31\n,\np\n<\n.001\np<.001\n,\nη\np\n2\n=\n.383\n\\eta^{2}_{\\mathrm{p}}=.383\n.\nPost hoc tests showed that all pairwise comparisons were significant:\nT\n1\nT_{1}\n>\n>\nT\n2\nT_{2}\n(\nt\n​\n(\n74\n)\n=\n5.19\nt(74)=5.19\n,\np\nH\n​\no\n​\nl\n​\nm\n<\n.001\np_{Holm}<.001\n,\nd\n=\n.600\nd=.600\n),\nT\n1\nT_{1}\n>\n>\nT\n3\nT_{3}\n(\nt\n​\n(\n74\n)\n=\n9.00\nt(74)=9.00\n,\np\nH\n​\no\n​\nl\n​\nm\n<\n.001\np_{Holm}<.001\n,\nd\n=\n1.039\nd=1.039\n),\nT\n1\nT_{1}\n>\n>\nT\n4\nT_{4}\n(\nt\n​\n(\n74\n)\n=\n11.53\nt(74)=11.53\n,\np\nH\n​\no\n​\nl\n​\nm\n<\n.001\np_{Holm}<.001\n,\nd\n=\n1.331\nd=1.331\n),\nT\n2\nT_{2}\n>\n>\nT\n3\nT_{3}\n(\nt\n​\n(\n74\n)\n=\n2.27\nt(74)=2.27\n,\np\nH\n​\no\n​\nl\n​\nm\n=\n.026\np_{Holm}=.026\n,\nd\n=\n0.262\nd=0.262\n),\nT\n2\nT_{2}\n>\n>\nT\n4\nT_{4}\n(\nt\n​\n(\n74\n)\n=\n4.55\nt(74)=4.55\n,\np\nH\n​\no\n​\nl\n​\nm\n<\n.001\np_{Holm}<.001\n,\nd\n=\n0.525\nd=0.525\n), and\nT\n3\nT_{3}\n>\n>\nT\n4\nT_{4}\n(\nt\n​\n(\n74\n)\n=\n2.95\nt(74)=2.95\n,\np\nH\n​\no\n​\nl\n​\nm\n=\n.008\np_{Holm}=.008\n,\nd\n=\n0.341\nd=0.341\n).\nANOVA of Behaviors Scale\nThe between-subjects factor\nI\nI\ndid not yield a significant main effect,\nF\n​\n(\n1\n,\n73\n)\n=\n1.54\nF(1,\\,73)=1.54\n,\np\n=\n.219\np=.219\n,\nη\np\n2\n=\n.021\n\\eta^{2}_{\\mathrm{p}}=.021\n.\nThere was a significant main effect of factor\nT\nT\n,\nF\n​\n(\n3\n,\n219\n)\n=\n8.38\nF(3,\\,219)=8.38\n,\np\n<\n.001\np<.001\n,\nη\np\n2\n=\n.103\n\\eta^{2}_{\\mathrm{p}}=.103\n.\nPost hoc tests showed that\nT\n1\nT_{1}\n>\n>\nT\n4\nT_{4}\n(\nt\n​\n(\n74\n)\n=\n−\n4.31\nt(74)=-4.31\n,\np\nH\n​\no\n​\nl\n​\nm\n<\n.001\np_{Holm}<.001\n,\nd\n=\n−\n0.497\nd=-0.497\n),\nT\n2\nT_{2}\n>\n>\nT\n3\nT_{3}\n, (\nt\n​\n(\n74\n)\n=\n−\n2.70\nt(74)=-2.70\n,\np\nH\n​\no\n​\nl\n​\nm\n=\n.034\np_{Holm}=.034\n,\nd\n=\n−\n0.312\nd=-0.312\n), and\nT\n2\nT_{2}\n>\n>\nT\n4\nT_{4}\n(\nt\n​\n(\n74\n)\n=\n−\n4\n,\n35\nt(74)=-4,35\n,\np\nH\n​\no\n​\nl\n​\nm\n<\n.001\np_{Holm}<.001\n,\nd\n=\n−\n0.502\nd=-0.502\n). The remaining pairwise comparisons were not significant\n(\np\nH\n​\no\n​\nl\n​\nm\n>\n.05\np_{Holm}>.05\n)\n.\n5.\nDiscussion and Conclusion\nIn this work, we investigated the perceived stigma toward PwDs within different working conditions, depending on the latters’ impairment. We got insights into cognitive and behavioral aspects of stigma.\nWhile the descriptive results show higher values across all conditions and both subscales for\nI\n2\nI_{2}\ncompared to\nI\n1\nI_{1}\n, we did not find any significant differences. Further, the perceived stigma does not differ between the variations of impairment. However, we are cautious with this interpretation, as we tested for differences rather than for equality. In addition, post hoc analysis showed insufficient power (\n1\n−\nβ\n=\n.44\n1-\\beta=.44\n). Thus, we cannot infer any meaningful interpretations for now.\nTable 2.\nDescriptive Results of the\nCognitions\n(\nC\nC\n) and\nBehaviors\n(\nB\nB\n) scale split for each task\nT\n1\nT_{1}\nto\nT\n4\nT_{4}\n.\nI\n1\n+\n2\nI_{1+2}\ndenotes the combined results of\nI\n1\nI_{1}\nand\nI\n2\nI_{2}\n. Each cell contains the\nM\n​\n(\nS\n​\nD\n)\nM(SD)\n.\nC\nT\n1\n{}_{T_{1}}\nC\nT\n2\n{}_{T_{2}}\nC\nT\n3\n{}_{T_{3}}\nC\nT\n4\n{}_{T_{4}}\nI\n1\n+\n2\nI_{1+2}\n2.64 (0.58)\n2.30 (0.80)\n2.16 (0.69)\n2.03 (0.71)\nI\n1\nI_{1}\n2.59 (0.52)\n2.14 (0.83)\n2.02 (0.62)\n1.82 (0.63)\nI\n2\nI_{2}\n2.69 (0.62)\n2.43 (0.77)\n2.27 (0.74)\n2.21 (0.73)\nB\nT\n1\n{}_{T_{1}}\nB\nT\n2\n{}_{T_{2}}\nB\nT\n3\n{}_{T_{3}}\nB\nT\n4\n{}_{T_{4}}\nI\n1\n+\n2\nI_{1+2}\n2.26 (0.76)\n2.31 (0.90)\n2.19 (0.86)\n2.12 (0.84)\nI\n1\nI_{1}\n2.16 (0.74)\n2.18 (0.99)\n2.03 (0.83)\n2.01 (0.89)\nI\n2\nI_{2}\n2.35 (0.76)\n2.42 (0.82)\n2.33 (0.87)\n2.21 (0.80)\nFor the variations of the task, we see clear results. Both subscales show significant main effects.\nThe post hoc analysis of the\nCognitions\nscale reveals that applying an assistive robot reduces the perceived cognitive stigma (\nT\n1\nT_{1}\n>\n>\nT\n3\nT_{3}\n∧\n\\wedge\nT\n1\nT_{1}\n>\n>\nT\n4\nT_{4}\n) independent of the variations of impairment. It is also apparent that the performance of the PwD plays an integral role. In line with the ICF, the level of performance leads to a decrease in cognitive stigma in the first place. The introduction of an assistive robot reduces the stigma even further (\nT\n2\nT_{2}\n>\n>\nT\n3\nT_{3}\n∧\n\\wedge\nT\n2\nT_{2}\n>\n>\nT\n4\nT_{4}\n). In both cases (\nT\n2\nT_{2}\nand\nT\n3\n/\n4\nT_{3/4}\n), the workplace adapts to the needs of the PwD, a core principle of the UN-CRPD\n(Chavez Penillas\net al.\n,\n2018\n)\n. When the ego task also benefits from the assistive robot, cognitive stigma is reduced even further (\nT\n2\nT_{2}\n>\n>\nT\n4\nT_{4}\n∧\n\\wedge\nT\n3\nT_{3}\n>\n>\nT\n4\nT_{4}\n). This aligns with the principles of universal design, as the assistive robot supports PwDs and other colleagues. This is partially mirrored in the results for the perceived behavioral stigma, with the lowest values for\nT\n4\nT_{4}\nand significant results\nT\n1\nT_{1}\n>\n>\nT\n4\nT_{4}\n∧\n\\wedge\nT\n2\nT_{2}\n>\n>\nT\n4\nT_{4}\n.\nThus, the results confirm the hypothesis with respect to the cognitive aspects of stigma.\nThe study is subject to limitations. First, we did not test assistive robots against other assistive devices. Second, we did not quantify the level of stigma; rather, we conducted a comparative study. Although our results show that universally designed assistive robots reduce stigma, it is unclear whether the reduction in the level of stigma marks a meaningful difference for PwDs. Third, the study currently focuses only on German culture.\nJansen-van Vuuren and Aldersey (\n2020\n)\noutline that the focus on independence and productivity in Western cultures perpetuates the stigma in PwDs, which also aligns with the findings of\nDixon\net al.\n(\n2018\n)\n. Our results support\n(Jansen-van Vuuren and Aldersey,\n2020\n)\nto some degree, as assistive devices could contribute to achieving inclusion of PwD, which is reflected in the reduced cognitive stigma. However, these thoughts are not supported by the study design.\nTo conclude, we presented the results of a vignette study examining the impact of assistive robots and work task design on perceived stigma toward PwDs. Our results support the hypothesis that assistive robots reduce perceived stigma toward PwDs with respect to cognitive aspects: (1) adjusting the task to better incorporate the PwD’s abilities lowers perceived stigma, (2) when the PwD is assisted by a robot without adjusting the task lowers stigma even more, and (3) allowing robots to also assist the ego task in the sense of universal design leads to the lowest perceived stigma. In future work, the study shall be extended to more cultures and assistive devices.\nAcknowledgments\nThis work was funded by the Bavarian Research Foundation within FORSocialRobots (AZ-1594-23), the Bavarian Hightech-Agenda as part of Augsburg AI Production Network, and the BMFTR within REGINA (16SV9492).\nReferences\nT. Akiyama, C. Y. Wong, and A. Moon (2024)\nStigma and service robots\n.\nIn\nACM/IEEE International Conference on Human-Robot Interaction - Workshop on Assistive Applications, Accessibility, and Disability Ethics\n,\nExternal Links:\nLink\nCited by:\n§2.2\n.\nS. A. Arboleda, M. Pascher, Y. Lakhnati, and J. Gerken (2020)\nUnderstanding human-robot collaboration for people with mobility impairments at the workplace, a thematic analysis\n.\nIn\n29th IEEE International Conference on Robot and Human Interactive Communication (RO-MAN)\n,\npp. 561–566\n.\nExternal Links:\nDocument\nCited by:\n§1\n.\nJ. Arboleda-Flórez (2002)\nWhat causes stigma?\n.\nWorld psychiatry : official journal of the World Psychiatric Association (WPA)\n1\n(\n1\n),\npp. 25–26\n.\nExternal Links:\nISSN 1723-8617\nCited by:\n§2\n.\nI. Babik and E. S. Gardner (2021)\nFactors affecting the perception of disability: a developmental perspective\n.\nFrontiers in Psychology\n12\n,\npp. 702166\n.\nExternal Links:\nISSN 1664-1078\n,\nDocument\nCited by:\n§2.1\n.\nG. Barbareschi, M. T. Carew, E. A. Johnson, N. Kopi, and C. Holloway (2021)\n\"when they see a wheelchair, they’ve not even seen me\"-factors shaping the experience of disability stigma and discrimination in kenya\n.\nInternational journal of environmental research and public health\n18\n(\n8\n).\nExternal Links:\nDocument\nCited by:\n§3\n.\nI. Brittain (2004)\nPerceptions of disability and their impact upon involvement in sport for people with disabilities at all levels\n.\nJournal of Sport and Social Issues\n28\n(\n4\n),\npp. 429–452\n.\nExternal Links:\nISSN 0193-7235\n,\nDocument\nCited by:\n§2.1\n.\nM. Bury (2001)\nIllness narratives: fact or fiction?\n.\nSociology of Health & Illness\n23\n(\n3\n),\npp. 263–285\n.\nExternal Links:\nDocument\n,\nLink\n,\nhttps://onlinelibrary.wiley.com/doi/pdf/10.1111/1467-9566.00252\nCited by:\n§2\n.\nE. S. Chaves, M. L. Boninger, R. Cooper, S. G. Fitzgerald, D. B. Gray, and R. A. Cooper (2004)\nAssessing the influence of wheelchair technology on perception of participation in spinal cord injury\n.\nArchives of physical medicine and rehabilitation\n85\n(\n11\n),\npp. 1854–1858\n.\nExternal Links:\nISSN 0003-9993\n,\nDocument\nCited by:\n§2.1\n.\nF. Chavez Penillas, K. Tylor, S. Von Stapelmohr, and I. Misaki (2018)\nUN human rights reasonable accomodation policy\n.\nOHCHR\n.\nExternal Links:\nLink\nCited by:\n§5\n.\nS. Dixon, C. Smith, and A. Touchet (2018)\nThe disability perception gap: policy report\n.\nSCOPE\n.\nExternal Links:\nLink\nCited by:\n§2.1\n,\n§5\n.\nJ. A. Dosso, J. N. Kailley, G. K. Guerra, and J. M. Robillard (2022)\nOlder adult perspectives on emotion and stigma in social robots\n.\nFrontiers in psychiatry\n13\n,\npp. 1051750\n.\nExternal Links:\nISSN 1664-0640\n,\nDocument\nCited by:\n§2.2\n.\nS. Drolshagen, M. Pfingsthorn, P. Gliesche, and A. Hein (2020)\nAcceptance of industrial collaborative robots by people with disabilities in sheltered workshops\n.\nFrontiers in Robotics and AI\n7\n,\npp. 541741\n.\nExternal Links:\nDocument\nCited by:\n§1\n.\nL. Findler, N. Vilchinsky, and S. Werner (2007)\nThe multidimensional attitudes scale toward persons with disabilities (mas): construction and validation\n.\nRehabilitation Counseling Bulletin\n50\n(\n3\n),\npp. 166–176\n.\nExternal Links:\nDocument\nCited by:\n§3\n.\nS. Glende, I. Conrad, L. Krezdorn, S. Klemcke, and C. Krätzel (2016)\nIncreasing the acceptance of assistive robots for older people through marketing strategies based on stakeholder needs\n.\nInternational Journal of Social Robotics\n8\n(\n3\n),\npp. 355–369\n.\nExternal Links:\nISSN 1875-4791\n,\nDocument\nCited by:\n§2.2\n.\nA. Graser, T. Heyer, L. Fotoohi, U. Lange, H. Kampe, B. Enjarini, S. Heyer, C. Fragkopoulos, and D. Ristic-Durrant (2013)\nA supportive friend at work: robotic workplace assistance for the disabled\n.\nIEEE Robotics & Automation Magazine\n20\n(\n4\n),\npp. 148–159\n.\nExternal Links:\nISSN 1070-9932\n,\nDocument\nCited by:\n§1\n.\nISO 7001:2023 (2023)\nGraphical symbols — Registered public information symbols\n.\nStandard\nInternational Organization for Standardization\n,\nGeneva, CH\n.\nCited by:\n§3\n.\nJ. Jansen-van Vuuren and H. M. Aldersey (2020)\nStigma, acceptance and belonging for people with idd across cultures\n.\nCurr Dev Disord Rep\n7\n,\npp. 163–172\n.\nExternal Links:\nDocument\nCited by:\n§5\n.\nA. F. LoBianco and K. Sheppard–Jones (2007)\nPerceptions of disability as related to medical and social factors\n.\nJournal of Applied Social Psychology\n37\n(\n1\n),\npp. 1–13\n.\nExternal Links:\nISSN 0021-9029\n,\nDocument\nCited by:\n§2.1\n,\n§2\n.\nN. Mandischer and S. Klein (2025)\nDepictions of diverse people in work scenarios with assistive robots\n.\nZenodo\n.\nExternal Links:\nDocument\n,\nLink\nCited by:\n§3\n.\nN. Matousian and K. Otto (2023)\nHow to measure mental illness stigma at work: development and validation of the workplace mental illness stigma scale\n.\nFrontiers in Psychiatry\n14\n.\nExternal Links:\nDocument\nCited by:\n§3\n.\nT. Shakespeare and N. Watson (2001)\nThe social model of disability: an outdated ideology?\n.\nIn\nExploring Theories and Expanding Methodologies: Where we are and where we need to go\n,\nResearch in Social Science and Disability\n, Vol.\n2\n,\npp. 9–28\n.\nExternal Links:\nISBN 0-7623-0773-0\n,\nDocument\nCited by:\n§2\n.\nL. Shore, V. Power, A. de Eyto, and L. O’Sullivan (2018)\nTechnology acceptance and user-centred design of assistive exoskeletons for older adults: a commentary\n.\nRobotics\n7\n(\n1\n),\npp. 3\n.\nExternal Links:\nISSN 2218-6581\n,\nDocument\nCited by:\n§2.2\n.\nJ. Susman (1994)\nDisability, stigma and deviance\n.\nSocial science & medicine (1982)\n38\n(\n1\n),\npp. 15–22\n.\nExternal Links:\nISSN 0277-9536\n,\nDocument\nCited by:\n§2.1\n.\nJ. Swain, S. French, C. I. Barnes, and C. Thomas (Eds.) (2014)\nDisabling barriers - enabling environments\n.\nThird edition edition\n,\nSage\n,\nLos Angeles and London and New Delhi and Singapore and Washington DC\n.\nExternal Links:\nISBN 9781446258996\nCited by:\n§2\n.\n[25]\nUnited Nations Department of Economic and Social Affairs\nConvention on the rights of persons with disabilities (crpd)\n(Website)\nExternal Links:\nLink\nCited by:\n§2.1\n.\nT. B. Ustün, S. Chatterji, J. Bickenbach, N. Kostanjsek, and M. Schneider (2003)\nThe international classification of functioning, disability and health: a new tool for understanding disability and health\n.\nDisability and rehabilitation\n25\n(\n11-12\n),\npp. 565–571\n.\nExternal Links:\nISSN 0963-8288\n,\nDocument\nCited by:\n§2\n,\n§3\n.\nC. Weidemann, E. Hüsing, Y. Freischlad, N. Mandischer, B. Corves, and M. Hüsing (2022)\nRAMB: validation of a software tool for determining robotic assistance for people with disabilities in first labor market manufacturing applications\n.\nIn\n2022 IEEE International Conference on Systems, Man, and Cybernetics (SMC)\n,\nPrague, Czech Republic\n,\npp. 2269–2274\n.\nExternal Links:\nDocument\nCited by:\n§1\n.\nY. Wu, J. Wrobel, M. Cornuet, H. Kerhervé, S. Damnée, and A. Rigaud (2014)\nAcceptance of an assistive robot in older adults: a mixed-method study of human-robot interaction over a 1-month period in the living lab setting\n.\nClinical interventions in aging\n9\n,\npp. 801–811\n.\nExternal Links:\nDocument\nCited by:\n§2.2\n.",
    "preview_text": "Robots are becoming more prominent in assisting persons with disabilities (PwD). Whilst there is broad consensus that robots can assist in mitigating physical impairments, the extent to which they can facilitate social inclusion remains equivocal. In fact, the exposed status of assisted workers could likewise lead to reduced or increased perceived stigma by other workers. We present a vignette study on the perceived cognitive and behavioral stigma toward PwD in the workplace. We designed four experimental conditions depicting a coworker with an impairment in work scenarios: overburdened work, suitable work, and robot-assisted work only for the coworker, and an offer of robot-assisted work for everyone. Our results show that cognitive stigma is significantly reduced when the work task is adapted to the person's abilities or augmented by an assistive robot. In addition, offering robot-assisted work for everyone, in the sense of universal design, further reduces perceived cognitive stigma. Thus, we conclude that assistive robots reduce perceived cognitive stigma, thereby supporting the use of collaborative robots in work scenarios involving PwDs.\n\n\\setcctype\nby\nAssistive Robots and Reasonable Work Assignment Reduce Perceived Stigma toward Persons with Disabilities\nStina Klein\nstina.klein@uni-a.de\n0000-0003-4998-6811\nHCAI, University of Augsburg\nAugsburg\nGermany\n,\nBirgit Prodinger\nbirgit.prodinger@uni-a.de\n0000-0002-0404-3548\nIAM, University of Augsburg\nAugsburg\nGermany\n,\nElisabeth André\nelisabeth.andre@uni-a.de\n0000-0002-2367-162X\nHCAI, University of Augsburg\nAugsburg\nGermany\n,\nLars Mikelsons\nlars.mikelsons@uni-a.de\n0009-0005-9006-9726\nAuxMe, University of Augsburg\nAugsburg\nGermany\nand\nNils Mandischer\nnils.mandischer@uni-a.de\n0000-0003-1926-4359\nAuxMe, University of Augsburg\nAugsburg\nGermany\n(2026)\nAbstract.\nRobots are becoming more prominent in assisting persons with disabilities (PwD). Whilst there is broad consensus that robots can assist in mitigating physical impa",
    "is_relevant": false,
    "relevance_score": 0.0,
    "extracted_keywords": [
        "assistive robots",
        "perceived stigma",
        "persons with disabilities",
        "work assignment",
        "social inclusion"
    ],
    "one_line_summary": "该论文研究辅助机器人如何通过合理工作分配减少对残疾人的认知污名，属于社会心理学和机器人应用领域，与提供的技术关键词无关。",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-30T08:08:38Z",
    "created_at": "2026-02-03T15:53:06.437724",
    "updated_at": "2026-02-03T15:53:06.437734"
}