{
    "id": "2601.15282v1",
    "title": "Rethinking Video Generation Model for the Embodied World",
    "authors": [
        "Yufan Deng",
        "Zilin Pan",
        "Hongyu Zhang",
        "Xiaojie Li",
        "Ruoqing Hu",
        "Yufei Ding",
        "Yiming Zou",
        "Yan Zeng",
        "Daquan Zhou"
    ],
    "abstract": "视频生成模型显著推动了具身智能的发展，为生成涵盖物理世界感知、推理与行动的多样化机器人数据开辟了新可能。然而，合成能准确反映真实机器人交互的高质量视频仍具挑战性，且缺乏标准化基准限制了公平比较与研究进展。为填补这一空白，我们推出了综合性机器人基准RBench，旨在通过五个任务领域和四种不同具身形态评估面向机器人的视频生成能力。该基准通过可复现的子指标（包括结构一致性、物理合理性与动作完整性）同时评估任务级准确性与视觉保真度。对25个代表性模型的评估揭示了当前模型在生成物理真实机器人行为方面的显著不足。此外，该基准与人类评估的斯皮尔曼相关系数达0.96，验证了其有效性。尽管RBench为识别这些缺陷提供了必要视角，但实现物理真实性需要超越评估层面，解决高质量训练数据严重短缺的核心问题。基于此洞见，我们提出精炼的四阶段数据流程，构建出RoVid-X——目前最大的开源机器人视频生成数据集，包含400万个标注视频片段，覆盖数千种任务，并配有全面的物理属性标注。这一评估与数据协同的生态系统，为视频模型的严谨评估与规模化训练奠定了坚实基础，将加速具身人工智能向通用智能的演进。",
    "url": "https://arxiv.org/abs/2601.15282v1",
    "html_url": "https://arxiv.org/html/2601.15282v1",
    "html_content": "1]Peking University\n2]ByteDance Seed\nRethinking Video Generation Model for the Embodied World\nYufan Deng\n1,2∗\nZilin Pan\n1∗\nHongyu Zhang\n1∗\nXiaojie Li\n2\nRuoqing Hu\n2\nYufei Ding\n1\nYiming Zou\n1\nYan Zeng\n2\nDaquan Zhou\n1\n[\n[\nAbstract\nVideo generation models have significantly advanced embodied intelligence, unlocking new possibilities for generating diverse robot data that capture perception, reasoning, and action in the physical world.\nHowever, synthesizing high-quality videos that accurately reflect real-world robotic interactions remains challenging, and the lack of a standardized benchmark limits fair comparisons and progress.\nTo address this gap, we introduce a comprehensive robotics benchmark,\nRBench\n, designed to evaluate robot-oriented video generation across five task domains and four distinct embodiments.\nIt assesses both task-level correctness and visual fidelity through reproducible sub-metrics, including structural consistency, physical plausibility, and action completeness.\nEvaluation of 25 representative models highlights significant deficiencies in generating physically realistic robot behaviors. Furthermore, the benchmark achieves a Spearman correlation coefficient of 0.96 with human evaluations, validating its effectiveness.\nWhile RBench provides the necessary lens to identify these deficiencies, achieving physical realism requires moving beyond evaluation to address the critical shortage of high-quality training data. Driven by these insights, we introduce a refined four-stage data pipeline, resulting in\nRoVid-X\n, the largest open-source robotic dataset for video generation with 4 million annotated video clips, covering thousands of tasks and enriched with comprehensive physical property annotations.\nCollectively, this synergistic ecosystem of evaluation and data establishes a robust foundation for rigorous assessment and scalable training of video models, accelerating the evolution of embodied AI toward general intelligence.\n\\checkdata\n[\nProject Page]\nhttps://dagroup-pku.github.io/ReVidgen.github.io/\n\\checkdata\n[\nGitHub Repo]\nhttps://github.com/DAGroup-PKU/ReVidgen/\n\\checkdata\n[\nHuggingFace Dataset]\nhttps://huggingface.co/datasets/DAGroup-PKU/RoVid-X/\nFigure 1\n:\nOverview of the comprehensive robotics benchmark and dataset for video generation.\nTop:\nWe present\nRBench\nthat includes the embodiment-based evaluation set and automated evaluation metrics. Our evaluation results on 25 video models show a high level of agreement with subjective human assessments.\nBottom:\nWe introduce a large-scale high-quality robotic dataset (\nRoVid-X\n) specifically designed for training video generation models, with data sourced from internet videos and open-source embodied videos.\n1\nIntroduction\nRecent advancements in diffusion models\n[\n44\n,\n84\n,\n79\n]\nand video generation\n[\n83\n,\n80\n,\n35\n,\n98\n,\n92\n]\nhave led to significant breakthroughs, enabling applications like video editing, multi-subject generation, and motion control\n[\n51\n,\n53\n,\n20\n,\n21\n,\n96\n]\n. These models have been extended to areas such as 3D scenes\n[\n57\n,\n82\n]\n, autonomous driving\n[\n28\n,\n104\n]\n, and world modeling\n[\n54\n,\n5\n]\n, showing strong generalization across tasks. A recent study\n[\n97\n]\nsuggests that, similar to LLMs in natural language processing, video models are evolving into unified foundation models for machine vision. Additionally, video models are being increasingly used in robot learning and action prediction\n[\n37\n,\n113\n,\n45\n,\n111\n,\n38\n,\n61\n]\n, as well as controllable simulators for synthesizing robotic video trajectories, addressing the lack of large-scale human teleoperation data\n[\n47\n,\n8\n,\n86\n]\n. These advancements highlight the growing potential of video models in the perception-reasoning-action loop of embodied agents, paving the way for more generalizable intelligent systems in the physical world.\nDespite these strides, systematic evaluation for robotic video generation remains underdeveloped. Current practices rely mostly on perceptual metrics, focusing on visual quality\n[\n46\n,\n66\n,\n42\n]\n, while existing physics-based benchmarks often lack task-specific datasets and criteria\n[\n72\n,\n36\n]\n.\nConsequently, evaluations frequently overlook critical aspects such as task completion, action-goal alignment, and physical feasibility. This leads to overly optimistic conclusions, where high scores are assigned even to videos containing unnatural movements or incomplete tasks.\nThe core challenge lies in rigorously assessing whether generated videos faithfully reproduce robotic behaviors.\nThis necessitates evaluation protocols that transcend perceptual metrics, incorporating both the physical plausibility of actions and their alignment with instructions to ensure discriminative and reproducible assessments.\nTo address this challenge, we propose\nRBench\n, a benchmark designed to evaluate the fidelity and utility of video-based world models in robotic video generation. To the best of our knowledge, it is the first comprehensive benchmark with fine-grained metrics for robotic video generation, consisting of 650 image–text pairs across five task categories and four robot types. Evaluations are based on two dimensions:\ntask completion\nand\nvisual quality\n, incorporating sub-metrics like structural consistency, physical plausibility, and execution completeness.\nBased on RBench, we conduct qualitative and quantitative assessments of 25 representative models. The results highlight that general video foundation models still have significant room for improvement in physical robot video generation, revealing a persistent gap between these models and the requirements of embodied robotic tasks. This underscores the need for systematic advancements in both robotic video data and training methodologies.\nAdvancing general robotic video generation with human-like capabilities and adaptability requires diverse, scalable, and comprehensive training data\n[\n78\n,\n12\n]\n. However, unlike computer vision and natural language processing, which can leverage vast web-scale datasets, robotic interaction data has long been constrained by both scale and diversity\n[\n10\n,\n110\n,\n26\n]\n. Even the largest existing collections are smaller and less varied than those for vision or language. More critically, many datasets have narrow distributions along key axes such as environment, object set, task spectrum, and robot morphology\n[\n105\n,\n95\n]\n, often confined to specific robot types, low-resolution recordings, or limited task ranges, which hampers the generalization of video foundation models. To address these gaps, we integrate over 20 open-source datasets and multi-source video platforms, creating a four-stage end-to-end data pipeline. The stages include robot video collection, video quality filtering, task segmentation and captioning, and physical property annotation, resulting in\nRoVid-X\n, a large-scale, high-quality embodied robotic video dataset (see Table\n1\n). To our knowledge, RoVid-X is currently the largest dataset specifically designed for embodied video generation models, covering a broad range of robot morphologies and task types. It aims to enhance video foundation models with physical interaction priors and task semantic diversity, driving further advancements in the field. Overall, the main contributions are summarized as follows:\n•\nA systematic benchmark tailored for robotic video generation. We propose RBench, which comprehensively evaluates the performance of video foundation models across five robotic tasks and four robot types with 650 meticulously curated evaluation samples, while introducing reproducible automated evaluation metrics.\n•\nKey insights into robotic video generation for embodied research. We conduct a systematic evaluation of 25 representative video models, including open-source, commercial, and robotics-specific ones, revealing the limitations of current video foundation models and potential directions for improvement, offering new perspectives for researchers exploring the embodied domain using video world models.\n•\nA large-scale, high-quality robotic video dataset. We construct RoVid-X, a dataset containing approximately 4 million curated robotic videos with standardized task descriptions and physical property annotations, providing essential support for the training and evaluation of embodied video models.\n2\nRelated Work\n2.1\nVideo World Modeling for Robotics\nThe latest breakthroughs in video generation technology have led to the development of powerful models capable of generating high-quality videos from text or image prompts\n[\n83\n,\n80\n,\n75\n,\n59\n,\n92\n]\n. With the advancement of these technologies, an increasing number of studies have begun applying them to the field of embodied intelligence\n[\n25\n,\n91\n,\n2\n,\n11\n]\n. Video provides a rich source of information for robot training\n[\n14\n]\n. On one hand, video generation models can be used to synthesize robot trajectories\n[\n47\n,\n8\n,\n7\n]\n, serving as an alternative to the time-consuming and labor-intensive process of human teleoperation data. And executable actions can be extracted through inverse dynamics models (IDM)\n[\n89\n,\n4\n,\n22\n,\n112\n]\nor latent action models\n[\n88\n,\n107\n]\n. On the other hand, recent studies have explored using video to simulate task dynamics and predict future states, thereby assisting in policy learning. Specifically, video generation models are used to initialize robot policies for training\n[\n63\n,\n50\n,\n100\n]\nor to simultaneously train policies and inverse dynamics models, enabling co-training with robot data\n[\n37\n,\n113\n,\n60\n]\n. These efforts demonstrate the significant potential of video generation models in the field of embodied robotics, highlighting their important value in improving training efficiency and task performance.\n2.2\nDatasets for Robot Learning\nA core challenge in robot learning is the lack of large-scale, diverse datasets that facilitate the training of general-purpose robots with physical interaction capabilities\n[\n78\n,\n8\n]\n. Currently, datasets used in the embodied intelligence community for robot learning can be broadly classified into three categories: real-world robot data\n[\n10\n,\n78\n,\n110\n,\n26\n,\n71\n]\n, human video data\n[\n18\n,\n31\n,\n32\n]\n, and synthetic robot data\n[\n105\n,\n95\n,\n74\n,\n70\n,\n52\n,\n90\n]\n. As a key element in training physical AI models, most existing real-world robot datasets are collected through robotic teleoperation\n[\n102\n,\n27\n,\n1\n]\nor by teams of human operators\n[\n12\n,\n68\n,\n9\n]\n, which leads to high collection costs and limited data scale. Furthermore, these datasets predominantly focus on similar types of robots, resulting in issues of limited diversity and restricted environments\n[\n23\n,\n56\n]\n. Additionally, inconsistent data collection and storage methods across different datasets make it difficult to enable effective cross-dataset co-training. Our focus is on collecting robot data for video generation that spans various robot morphologies and entities, and providing a unified set of physical attributes for all data sources, thereby advancing cross-entity research in robot learning.\nFigure 2\n:\nQualitative illustration of failure modes captured by RBench.\nUnlike conventional metrics that focus primarily on pixel-level fidelity, RBench provides a granular evaluation across multiple dimensions, including physical plausibility and task-level consistency. These results highlight persistent challenges in robotic video generation, such as structural distortion, floating components, and key action omission, which are accurately identified by our proposed sub-metrics. More cases are shown in the Appendix\nB\n.\n2.3\nBenchmarks for Video Generation\nEstablishing robust evaluation frameworks is essential for measuring the progress of video generation models. Currently, evaluation methodologies can be categorized into three primary streams: visual fidelity and semantics, which assess basic clarity and text-video alignment\n[\n67\n,\n85\n,\n108\n]\n; temporal dynamics, focusing on motion consistency and long-range narrative coherence\n[\n48\n,\n62\n,\n13\n]\n; and physical plausibility, which examines adherence to fundamental laws such as inertia and collision dynamics\n[\n72\n,\n6\n,\n73\n,\n93\n]\n. While these benchmarks provide valuable insights into general video quality, they are largely decoupled from the specific requirements of embodied AI. Specifically, existing frameworks often rely on isolated physical constraints or local visual metrics, failing to capture the complex interplay between robotic actions and environmental responses. Furthermore, there is a distinct lack of systematic evaluation for task-level correctness and spatial constraints in multi-embodiment scenarios. To bridge this gap, we propose a comprehensive benchmark specifically tailored for robotic video generation, introducing reproducible metrics that unify physical realism with task-oriented action completeness.\n3\nRBench\nFigure 3\n:\nStatistics in RBench.\nThe benchmark covers diverse tasks, object categories, and environments, demonstrating the high quality and comprehensiveness of the evaluation set, highlighting its high applicability to a wide range of robotic video generation scenarios.\nExisting video generation benchmarks primarily focus on evaluating model performance in general scenes\n[\n46\n,\n42\n]\n, while other benchmarks specifically designed for physical scenarios mainly assess models’ capabilities in physical reasoning\n[\n72\n,\n36\n]\n. In this paper, we design a benchmark tailored for robotic physical scenarios, aimed at comprehensively evaluating the performance of video generation models in robotic tasks. This benchmark differs from existing general scene benchmarks by focusing on evaluating video generation models’ capabilities in robotic physical environments. As shown in Figure\n2\n, our benchmark highlights common failure modes in robotic video generation, including issues such as robot shape distortion, object attribute drift, non-contact attachment, and others. Section\n3.1\noutlines the process of benchmark construction, while Section\n3.2\ndiscusses the automatic metrics used for evaluation.\n3.1\nBenchmark Construction\nTo comprehensively evaluate the capabilities of video generation models in robotic scenarios, the designed evaluation dimensions must cover a wide range of task scenarios and embodiment types, ensuring that these scenarios reflect realistic robotic action semantics. To this end, we design a diversified benchmark from two aspects: task categories and embodiment types, containing a total of 650 evaluation cases. The task-oriented categories include five representative tasks:\nCommon Manipulation\n,\nLong-horizon Planning\n,\nMulti-entity Collaboration\n,\nSpatial Relationship\n, and\nVisual Reasoning\n, with a total of 250 image-text pairs, 50 samples for each task. The embodiment-specific categories cover four mainstream embodiment types:\nDual-arm robots\n,\nHumanoid robots\n,\nSingle-arm robots\n, and\nQuadruped robots\n, with a total of 400 image-text pairs, 100 samples for each embodiment type.\nThe benchmark includes a variety of text prompts and high-quality robot reference images. Each sample image is a keyframe extracted from high-quality videos sourced from public datasets or online sources, and each image is manually verified to ensure its accuracy.\nTo avoid overlap with the training data, we ensure that the selected videos in the evaluation set do not appear in the subsequent training database, and we redesign new task prompts for each reference image, effectively avoiding the risk of content overlap. All samples are verified and filtered by human annotators to ensure that the generated task prompts align with realistic logic. Figure\n3\nillustrates the high aesthetic quality of the reference images (a), the broad range of testing scenarios including various objects, tasks, and action skills (b, c), and the diversity of environments in our evaluation set (d). Additionally, we record the metadata for each sample, such as the manipulated object, embodiment type, and camera viewpoint (first-person/third-person), to support more detailed analysis. See more details in the Appendix\nA\n.\n3.2\nAutomatic Metrics\nExisting video generation evaluation protocols, such as the representative VBench\n[\n46\n]\n, primarily focus on perceptual quality, assessing aspects like frame clarity, texture fidelity, and motion smoothness. However, they lack task-specific criteria tailored to robotic scenarios. Recently, several studies\n[\n85\n,\n33\n,\n94\n]\nhave utilized multimodal large language models (MLLMs) as zero-shot evaluators for generated videos. Building upon this, we extend this approach to the domain of robotic video evaluation and propose a set of automatic evaluation metrics, incorporating manually designed indicators to assess both the visual realism and task-level validity of generated robotic videos. Following previous practices, we select the open-source Qwen3-VL\n[\n3\n]\nand the closed-source GPT-5\n[\n76\n]\nas our MLLM evaluation models. In the following sections, we introduce the evaluation methods for task completion and visual quality, respectively. Further details on metrics design and mathematical definitions are provided in the Appendix\nB\n.\n3.2.1\nTask Completion\nPhysical-Semantic Plausibility.\nThis metric targets everyday physical and semantic plausibility violations that standard perception scores often miss. As shown in Figure\n1\n, we evaluate temporal grids of uniformly sampled frames with a VQA-style protocol using MLLM. Beyond assessing physical-semantic plausibility, we place special emphasis on the following frequent failure modes:\n(i)\nFloating/Penetration\n: parts of the robot or objects are not grounded or interpenetrate with solid objects;\n(ii)\nSpontaneous emergence\n: entities appear/disappear without causal motion;\n(iii)\nNon-contact attachment/Incorrect grasp\n: objects move with the robot without visible contact or with improper gripper closure.\nTask-Adherence Consistency.\nThis metric evaluates whether the video aligns with the intent and sequence defined by the prompt. Typical deviations include missing actions (e.g., approach without grasping or placing), incorrect order (e.g., placing before grasping), semantic drift (e.g., \"wiping\" becomes \"touching\"), and non-responsiveness. We construct temporal grids and apply an MLLM-based VQA checklist, which covers:\n(i)\nTask responsiveness\n, ensuring the goal state is reached without premature interruption;\n(ii)\nKey actions\n, verifying that required actions (e.g., grasp, place, open/close) occur and align with the prompt.\n3.2.2\nVisual Quality\nMotion Amplitude\nThis metric measures the motion amplitude of the robotic subject while discounting apparent movement caused by camera motion, thereby penalizing videos that appear smooth but lack meaningful subject activity.\nFollowing VMBench\n[\n64\n]\n, active subjects are localized with GroundingDINO\n[\n65\n]\n, temporally stable masks are produced by GroundedSAM\n[\n81\n]\n, and salient points are tracked via CoTracker\n[\n55\n]\n. Let\nD\n¯\nt\n\\bar{D}_{t}\nbe the mean displacement of tracked points on the subject at frame\nt\nt\n. The Motion Amplitude Score (MAS) is\nMAS\n=\n1\nT\n​\n∑\nt\n=\n1\nT\nmin\n⁡\n(\nD\n¯\nt\n,\n1\n)\n,\n\\mathrm{MAS}\\,=\\,\\frac{1}{T}\\sum_{t=1}^{T}\\min\\!\\bigl(\\bar{D}_{t},\\,1\\bigr),\n(1)\nwhere a lower MAS indicates insufficient subject motion and complements smoothness by revealing smooth-but-inactive failure modes.\nRobot-Subject Stability.\nThis metric assesses the stability of robot morphology and target object attributes over time. Typical failures include gripper/hand shape drifting into non-mechanical forms, extra/missing manipulators, link-length/topology changes, joint inversion, object misidentification or attribute drift (class, color, position), and impossible deformation of rigid items. We adopt a contrastive VQA setup based on MLLM, which compares a reference frame and a generated frame and assigns a consistency score targeting the above failures.\nMotion Smoothness\nThis metric quantifies temporal continuity and natural dynamics, targeting artifacts from low-level aliasing to high-level jitter/blur. Following VMBench\n[\n64\n]\n, we measure frame-to-frame quality stability with the Q-Align aesthetic score\n[\n99\n]\n. For frames\n{\nf\nt\n}\nt\n=\n1\nT\n\\{f_{t}\\}_{t=1}^{T}\nand per-frame score\nQ\n​\n(\nf\nt\n)\nQ(f_{t})\n, define:\nΔ\n​\nQ\nt\n=\nQ\n​\n(\nf\nt\n−\n1\n)\n−\nQ\n​\n(\nf\nt\n)\n.\n\\Delta Q_{t}\\,=\\,Q(f_{t-1})-Q(f_{t}).\n(2)\nA temporal anomaly is flagged when\nΔ\n​\nQ\nt\n\\Delta Q_{t}\nexceeds an adaptive threshold\nτ\ns\n​\n(\nt\n)\n\\tau_{s}(t)\ndetermined by the robotic subject’s motion. The Motion Smoothness Score (MSS) is\nMSS\n=\n1\n−\n1\nT\n​\n∑\nt\n=\n2\nT\n𝕀\n​\n(\nΔ\n​\nQ\nt\n>\nτ\ns\n​\n(\nt\n)\n)\n,\n\\mathrm{MSS}\\,=\\,1-\\frac{1}{T}\\sum_{t=2}^{T}\\mathbb{I}\\!\\bigl(\\Delta Q_{t}>\\tau_{s}(t)\\bigr),\n(3)\nwhere\n𝕀\n​\n(\n⋅\n)\n\\mathbb{I}(\\cdot)\nis the indicator function. A higher MSS indicates smoother motion.\nFigure 4\n:\nOverview of RoVid-X Construction and Descriptive Statistics.\n(a) shows the four-stage pipeline for constructing the RoVid-X. (b) presents descriptive statistics, covering frame intervals, skill distribution, and common objects, highlighting the dataset’s diversity and suitability for robotic task training and video generation.\n4\nRoVid-X\nIn this section, we introduce the construction of a high-quality robotic video dataset, resulting in RoVid-X. The dataset is developed through a refined four-stage pipeline, as shown in Figure\n4\n(a). The dataset primarily comes from internet-sourced robotic videos that are public domain or non-copyrighted, as well as open-source embodied video datasets, all of which are licensed for use. We then introduce the construction process of the dataset and provide statistical information.\n4.1\nDataset Construction\nOur data processing workflow consists of four distinct stages, each designed to ensure the quality, diversity, and relevance of the collected data. These stages are outlined as follows:\nRobot Video Collection.\nIn the first stage, we collect raw robotic videos from large-scale internet video platforms and over 20 open-source embodied video datasets. These datasets cover a variety of robot types and task scenarios, ensuring the breadth and diversity of the data. To improve dataset relevance and quality, we employ the GPT-5 model\n[\n76\n]\nto automatically filter the content of each video and remove low-quality or irrelevant video clips that do not align with the research objectives. During the filtering process, GPT-5 identifies videos related to robotic tasks and actions based on visual content and subtitles, ensuring that all collected videos effectively support the training and evaluation of robotic tasks. After this filtering process, we identify approximately 3 million raw robotic video clips, covering different actions, tasks, and robot types.\nVideo Quality Filtering.\nIn this stage, we perform a rigorous filtering procedure on the collected videos to remove low-quality and irrelevant video clips that do not align with the research objectives. First, we apply scene segmentation detection to remove all video data unrelated to robots. Then, we use a video quality scoring system to assess the videos from multiple dimensions, including clarity, dynamic effects, aesthetic performance, and optical character recognition (OCR), among other metrics. Each video clip is assigned a quality score based on these criteria, ensuring that the videos retained in the final dataset meet high-quality standards.\nTable 1\n:\nComparison of representative robotic video datasets.\nDataset\nYear\n#Videos\n#Skills\nResolution\nOptical Flow\nDiverse Robotic Forms\nDiverse Captions\nRoboTurk\n[\n69\n]\n2018\n2.1k\n2\n480P\n✗\n✗\n✗\nRoboNet\n[\n19\n]\n2019\n162k\nN/A\n240P\n✗\n✗\n✗\nBridgeData\n[\n23\n]\n2021\n7.2k\n4\n480P\n✗\n✗\n✗\nRH20T\n[\n24\n]\n2023\n13k\n33\n720P\n✗\n✗\n✗\nDROID\n[\n56\n]\n2024\n76k\n86\n720P\n✗\n✗\n✗\nOpen X-Embodiment\n[\n78\n]\n2024\n1.4M\n217\n64P—720P\n✗\n✓\n✗\nRoboMIND\n[\n101\n]\n2024\n107k\n38\n480P\n✗\n✗\n✗\nRoboCOIN\n[\n103\n]\n2025\n180k\n36\n480P\n✗\n✗\n✗\nGalaxea\n[\n49\n]\n2025\n100k\n58\n720P\n✗\n✗\n✗\nInternData-A1\n[\n90\n]\n2025\n630k\n18\n480P\n✗\n✗\n✗\nFourier ActionNet\n[\n26\n]\n2025\n13k\n16\n800P\n✗\n✗\n✗\nHumanoid Everyday\n[\n110\n]\n2025\n10.3k\n221\n320P—720P\n✗\n✗\n✗\nAgibot World\n[\n12\n]\n2025\n1M\n87\n480P\n✗\n✗\n✗\nRoVid-X (Ours)\n2026\n4M\n1300+\n720P\n✓\n✓\n✓\nTask Segmentation and Captioning.\nIn this stage, we use a video understanding model\n[\n34\n]\nand a specially designed prompt template to automatically analyze the robot actions within the videos. The system segments the videos into different task segments based on timestamps, generating short subtitles for each task segment that accurately describe the robot’s actions and operational details in that task.\nThe action recognition and description process for each task segment follows these steps: First, the system identifies all dynamic actions within the video and excludes static scenes or irrelevant actions (e.g., waiting or remaining still). The time range for each action (start and end times) is precisely labeled to ensure accuracy. Next, using the MLLM model\n[\n34\n]\n, textual descriptions of each action are automatically generated, including the action subject (e.g., \"right arm\" or \"left gripper\"), the object being manipulated (e.g., \"nameplate\" or \"box\"), and the specific operation details (e.g., \"grasp and move\" or \"remove from the table\"). Finally, the subtitles for each task segment are output in a standardized format, ensuring that the action descriptions for each video clip are clear, concise, and aligned with the task requirements.\nPhysical Property Annotation.\nTo ensure consistency and realism of robot actions within physical space, we apply physical attribute enhancement to the videos. Specifically, we use FlashVSR\n[\n114\n]\nto improve the video resolution, making the images clearer and enhancing the details of the actions. Then, using the AllTracker tool\n[\n43\n]\n, we annotate a unified optical flow for the subjects in the videos, ensuring consistency in tracking and recording robot actions across different scenes. Additionally, using Video Depth Anything\n[\n16\n]\n, we generate relative depth maps to accurately describe the spatial relationships and depth information of objects in the scene. The goal of these physical attribute annotations is to provide researchers with more precise reference data, aiding in the training and evaluation of robot video generation models and offering richer physical data support for future research.\nTable 2\n:\nRBench quantitative results.\nEvaluations across task-oriented and embodiment-specific dimensions for 25 models from open-source, commercial, and robotics-specific families. The \"Avg.\" column shows the mean score across nine indicators, with task performance in the left block and embodiment performance in the right block. In the table, a \"#\" next to the Sora2 model in the top right corner indicates review limitations from the official Sora API, where approximately 50 out of 650 videos could not be generated. The scores derived from sub-metrics are reported in the Appendix\nG\n.\nModels\nRank\nAvg.\nTasks\nEmbodiments\nManipulation\nSpatial\nMulti-entity\nLong-horizon\nReasoning\nSingle arm\nDual arm\nQuadruped\nHumanoid\nOpen-source\nWan2.2_A14B\n[\n92\n]\n8\n0.507\n0.381\n0.454\n0.373\n0.501\n0.330\n0.608\n0.582\n0.690\n0.648\nHunyuanVideo 1.5\n[\n98\n]\n10\n0.460\n0.442\n0.316\n0.312\n0.438\n0.364\n0.513\n0.526\n0.634\n0.595\nLongCat-Video\n[\n87\n]\n11\n0.437\n0.372\n0.310\n0.220\n0.384\n0.186\n0.586\n0.576\n0.681\n0.621\nWan2.1_14B\n[\n92\n]\n14\n0.399\n0.344\n0.268\n0.282\n0.335\n0.205\n0.464\n0.497\n0.595\n0.599\nLTX-2\n[\n40\n]\n15\n0.381\n0.284\n0.304\n0.233\n0.386\n0.164\n0.453\n0.424\n0.622\n0.555\nWan2.2_5B\n[\n92\n]\n16\n0.380\n0.331\n0.313\n0.142\n0.318\n0.234\n0.436\n0.448\n0.590\n0.607\nSkyReels\n[\n15\n]\n18\n0.361\n0.203\n0.276\n0.203\n0.254\n0.234\n0.507\n0.477\n0.586\n0.509\nLTX-Video\n[\n39\n]\n19\n0.344\n0.302\n0.176\n0.210\n0.280\n0.241\n0.440\n0.456\n0.526\n0.464\nFramePack\n[\n109\n]\n20\n0.339\n0.206\n0.258\n0.173\n0.169\n0.170\n0.440\n0.464\n0.626\n0.548\nHunyuanVideo\n[\n59\n]\n21\n0.303\n0.177\n0.180\n0.108\n0.147\n0.035\n0.454\n0.480\n0.625\n0.524\nCogVideoX_5B\n[\n106\n]\n23\n0.256\n0.116\n0.112\n0.098\n0.212\n0.079\n0.338\n0.385\n0.465\n0.496\nCommercial\nWan 2.6\n[\n92\n]\n1\n0.607\n0.546\n0.656\n0.479\n0.514\n0.531\n0.666\n0.681\n0.723\n0.667\nSeedance 1.5 pro\n[\n17\n]\n2\n0.584\n0.577\n0.495\n0.484\n0.570\n0.470\n0.648\n0.641\n0.680\n0.692\nWan 2.5\n[\n92\n]\n3\n0.570\n0.527\n0.576\n0.402\n0.496\n0.437\n0.680\n0.634\n0.726\n0.654\nHailuo v2\n[\n41\n]\n4\n0.565\n0.560\n0.637\n0.386\n0.545\n0.474\n0.594\n0.611\n0.640\n0.635\nVeo 3\n[\n30\n]\n5\n0.563\n0.521\n0.508\n0.430\n0.530\n0.504\n0.634\n0.610\n0.689\n0.637\nSeedance 1.0\n[\n29\n]\n6\n0.551\n0.542\n0.425\n0.448\n0.454\n0.442\n0.622\n0.641\n0.698\n0.686\nKling 2.6 pro\n[\n58\n]\n7\n0.534\n0.529\n0.598\n0.364\n0.530\n0.358\n0.570\n0.605\n0.637\n0.613\nSora v2 Pro\n#\n[\n77\n]\n17\n0.362\n0.208\n0.268\n0.186\n0.255\n0.115\n0.476\n0.513\n0.664\n0.561\nSora v1\n[\n75\n]\n22\n0.266\n0.151\n0.223\n0.111\n0.166\n0.139\n0.314\n0.324\n0.544\n0.419\nRobotics-specific\nCosmos 2.5\n[\n2\n]\n9\n0.464\n0.358\n0.338\n0.201\n0.496\n0.399\n0.544\n0.560\n0.658\n0.626\nDreamGen(gr1)\n[\n47\n]\n12\n0.420\n0.312\n0.372\n0.297\n0.334\n0.215\n0.564\n0.532\n0.579\n0.575\nDreamGen(droid)\n[\n47\n]\n13\n0.405\n0.358\n0.348\n0.214\n0.316\n0.339\n0.499\n0.476\n0.542\n0.556\nVidar\n[\n25\n]\n24\n0.206\n0.073\n0.106\n0.050\n0.054\n0.050\n0.382\n0.410\n0.374\n0.357\nUnifoLM-WMA-0\n[\n91\n]\n25\n0.123\n0.036\n0.040\n0.018\n0.062\n0.000\n0.268\n0.194\n0.293\n0.200\n4.2\nDataset Analysis\nRoVid-X is the first open-source large-scale robotic video dataset specifically designed for training video generation models, containing 4 million robotic video clips. This dataset is designed to address the physical challenges that video generation models face when generating robotic videos, providing high-quality data for both training and evaluation. RoVid-X aims to bridge the gap between traditional video generation tasks and the unique demands of embodied robot learning, where physical interaction, spatial relationships, and real-world dynamics play a crucial role.\nThe dataset includes a diverse range of robotic actions, tasks, and robot types, ensuring its applicability across different robotic domains. By incorporating videos from various robot types and scenarios, RoVid-X provides comprehensive coverage of the physical properties and task requirements needed for robot training. As shown in Figure\n4\n(b), detailed statistics of the dataset are provided, illustrating the variety in terms of action skills, task types, and interaction objects. The wide-ranging data distribution of RoVid-X is critical for supporting the development of robust video generation models that can simulate realistic robot behaviors in dynamic environments.\n5\nExperiment\nFigure 5\n:\nQualitative comparison across representative tasks.\nWe visualize the generated results for three representative tasks:\nVisual Reasoning\n,\nLong-horizon Planning\n, and\nSpatial Relationship\n, across six models. Each row displays temporally sampled frames from the same generated video, with captions below indicating the corresponding task instruction. More cases are shown in the Appendix.\n5.1\nEvaluation Setups\nEvaluation Models.\nWe evaluate 25 state-of-the-art video generation models, grouped into three types. Specifically, the closed-source models include Hailuo\n[\n41\n]\n, Wan\n[\n92\n]\n, Veo 3\n[\n30\n]\n, Sora\n[\n75\n,\n77\n]\n, Kling\n[\n58\n]\n, Seedance\n[\n29\n,\n17\n]\n, and others, while the open-source models include several representative models such as HunyuanVideo\n[\n59\n,\n98\n]\n, LTX\n[\n40\n,\n39\n]\nand CogVideoX\n[\n106\n]\n. Additionally, we assess models specifically designed for robotic tasks, such as DreamGen\n[\n47\n]\n, Vidar\n[\n25\n]\n, and Cosmos 2.5\n[\n2\n]\n. The evaluations of these models cover various types of embodiments and multiple tasks, providing a comprehensive perspective on model performance.\nImplementation Details.\nTo ensure a fair comparison, all open-source models generate videos using their official default configurations to ensure consistency with the model’s preset settings. For closed-source video models, we use their official APIs, strictly following the methods recommended by the developers for invoking and using the models. In the benchmark testing, we generate the videos for each image-text pair. To minimize errors, we generate three videos for each model sample and take the average as the final score for that sample.\nThese generated videos are evaluated using the automated evaluation metrics that we propose, which are designed to comprehensively assess multiple aspects of the generated videos, including task completion, action consistency, physical plausibility, and more. Further details on the model setup and configuration parameters are provided in the Appendix\nC\n.\nTable 3:\nComparison between human preference scores and RBench scores.\nThis table demonstrates a high correlation between the two sets of scores, as reflected in the similar ranking orders.\nModel\nHuman\nRBench\nr\nh\nr_{h}\nr\nb\nr_{b}\nΔ\n​\nr\n\\Delta r\nWan 2.5\n0.573\n0.570\n1\n1\n0\nVeo 3\n0.540\n0.563\n2\n3\n1\nHailuo v2\n0.513\n0.565\n3\n2\n-1\nSeedance 1.0\n0.505\n0.551\n4\n4\n0\nCosmos 2.5\n0.500\n0.464\n5\n5\n0\nDreamGen\n0.482\n0.420\n6\n7\n1\nLongCat-Video\n0.480\n0.437\n7\n6\n-1\nWan2.1-14B\n0.378\n0.399\n8\n8\n0\nCogVideoX-5B\n0.333\n0.256\n9\n10\n1\nLTX-Video\n0.246\n0.344\n10\n9\n-1\nTable 4:\nRoVid-X effectiveness validation experiment.\nThe experimental results using different models for finetuning show stable improvements across various dimensions, validating the effectiveness of the dataset.\nModel\nManip.\nLong.\nMulti.\nSpatial.\nReason.\nWan2.1_14B\n0.344\n0.335\n0.282\n0.268\n0.205\nWan2.1_14B+Ours\n0.376\n0.389\n0.295\n0.314\n0.298\nWan2.2_5B\n0.331\n0.318\n0.142\n0.313\n0.234\nWan2.2_5B+Ours\n0.373\n0.387\n0.221\n0.403\n0.284\nModel\nSingle\nDual\nQuad.\nHumanoid\nTotal\nWan2.1_14B\n0.464\n0.497\n0.595\n0.599\n0.399\nWan2.1_14B + Ours\n0.526\n0.546\n0.639\n0.628\n0.446\nWan2.2_5B\n0.436\n0.448\n0.590\n0.607\n0.380\nWan2.2_5B + Ours\n0.514\n0.503\n0.628\n0.641\n0.439\n5.2\nMain Analysis\n5.2.1\nQuantitative Results\nTable\n2\npresents a comprehensive quantitative evaluation across varying model architectures, tasks, and embodiments. Beyond standard performance metrics, the results reveal a pivotal paradigm shift in the video generation landscape.\nFrom Visual Fidelity to Physical Intelligence.\nThe most significant trend observed is the transition of video generation models from pursuing high-fidelity visualization to addressing the complex dynamics of the physical world. While traditional metrics prioritize pixel-level quality, our benchmark highlights that top-tier commercial models (e.g., Wan 2.6, Seedance 1.5 Pro) are beginning to emerge as effective\nWorld Simulators\n.\" This indicates that the field is moving towards a new stage:\nPhysical AI\n, where models must understand and simulate interaction-rich, physically challenging real-world scenarios rather than merely generating aesthetically pleasing videos.\nIterative Scaling Unlocks Physical Capabilities.\nAnalyzing model evolution reveals a strong correlation between model iteration and physical reasoning capabilities. For instance, the\nWan\nseries exhibits a dramatic performance leap: from Wan 2.1 (Rank 14, 0.399) to Wan 2.6 (Rank 1, 0.607). Similarly, Seedance evolves from 1.0 to 1.5 Pro, climbing from Rank 6 to Rank 2. These substantial gains suggest that scaling laws and iterative optimization are not just improving visual quality but are actively refining the model’s understanding of physics, distinct motion patterns, and control logic.\nThe \"Media-Simulation\" Gap in Consumer Models.\nSurprisingly, widely recognized consumer-oriented models like the Sora series perform sub-optimally on this benchmark (Sora v2 Pro at Rank 17, Avg 0.362). This counter-intuitive result highlights a critical \"domain gap\": models optimized for media consumption prioritize visual smoothness and cinematic transitions, often at the expense of physical fidelity and precise motion control. This discrepancy suggests that proficiency in creative video generation does not naturally transfer to Embodied AI tasks, underlining the necessity for physically-grounded training data.\nClosed-source Models Lead in Performance.\nCommercial closed-source models occupy the top 7 positions in our benchmark, demonstrating a clear and consistent advantage over open-source counterparts. The significant performance margin between the state-of-the-art commercial model (Wan 2.6) and the leading open-source model (Wan 2.2) highlights a substantial capability gap. This disparity underscores a critical urgency for the open-source community: to democratize high-capability foundation models, more concerted efforts are needed in scaling physical training data and optimizing architectures for embodied video tasks.\nThe Dilemma of Specialization: Domain Data vs. World Knowledge.\nWhile General Foundation Models lead the leaderboard, the robotics-specific model Cosmos 2.5 demonstrates remarkable resilience. Despite trailing top-tier commercial models, it outperforms significantly larger open-source video models, confirming that training with physical data yields stable gains in robotic tasks. Conversely, models fine-tuned on specific robot entities (e.g., Vidar, UnifoLM) struggle significantly, ranking at the bottom of the benchmark. This contrast highlights a critical trade-off: while domain-specific data is valuable for control precision, it cannot fully compensate for the deficit in \"World Knowledge\" provided by large-scale pretraining. Balancing proprietary robot data with generalizable representations remains a pivotal challenge for future research.\nCognitive and Fine-grained Control Bottlenecks.\nA consistent trend across all model families is that tasks requiring high-level logic or precise interaction represent the most significant performance bottlenecks.\nFirst, regarding cognitive capabilities, we observe a substantial \"Cognitive Gap\": while top-tier models like Wan 2.6 excel in execution-oriented tasks, their performance drops sharply in\nVisual Reasoning\n(0.531). Furthermore, analyzing specific embodiments reveals a \"Manipulation Gap\": models consistently score higher on coarse-grained locomotion tasks (Quadruped, Humanoid) than on fine-grained manipulation. This implies that for current video generators, mastering the fine-grained contact dynamics required for object interaction is physically more challenging than generating the rhythmic patterns of legged locomotion.\n5.2.2\nQualitative Results\nWe conduct a qualitative analysis of representative tasks, and the partial results are shown in Figure\n5\n. For the visual reasoning task, Seedance 1.0\n[\n29\n]\nand Hailuo\n[\n41\n]\ncorrectly identify the blue clothing and the hollow basket, while Wan 2.5\n[\n92\n]\nmistakenly identifies the woven basket as the hollow basket. In the long-horizon planning task, Wan 2.5 successfully completes all actions in the correct sequence, while Hailuo lacks the \"turn-on\" action, leading to a violation of physical logic. In the spatial relationship task, Hailuo correctly places the bok choy to the left of the pan, whereas other models mistakenly place it inside the pan. Notably, LongCat-Video introduces an unrealistic human arm intervention, disrupting physical plausibility. More detailed analysis and qualitative results can be found in the Appendix\nF\n.\nThese models each have their strengths, but there is still significant room for improvement in their overall performance. This further highlights the necessity of designing such a benchmark to advance video generation models in robotic tasks.\n5.3\nHuman Preference Study\nWe conduct a human preference study to assess how well automatic metrics align with human perception. Thirty participants are invited to participate. For each comparison, two model outputs for the same prompt and video instance are presented side-by-side, and annotators choose from three options: “A is better,” “B is better,” or “Tie”. Votes are aggregated into per-model scores: a win contributes\n5\n5\n, a loss contributes\n1\n1\n, and a tie contributes\n3\n3\nto both models.\nWe then compare these model-level human scores with the corresponding RBench benchmark scores. On the ten-model subset used in the study, the Spearman rank correlation between human scores and RBench scores is\nρ\n=\n0.96\n\\rho=0.96\n(two-sided\np\n<\n10\n−\n3\np<10^{-3}\n).\nTable\n4\npresents the human scores, RBench scores, and ranks for the ten selected models, where the\nΔ\n​\nr\n\\Delta r\ncolumn denotes the rank difference\n(\nr\nb\n−\nr\nh\n)\n(r_{b}-r_{h})\n.\nOverall, models that rank highest under the benchmark largely match human judgments, while the remaining small discrepancies highlight opportunities to further refine the metric for improved human alignment. The high degree of consistency further demonstrates the validity and effectiveness of our automated metrics in evaluating video generation models, indicating that the metrics accurately reflect human perception and thus provide a reliable evaluation standard for robotic video generation tasks. Please refer to the Appendix\nD\nfor more details.\n5.4\nValidation of RoVid-X\nTo assess the effectiveness and robustness of RoVid-X, we finetune models initialized with Wan2.1 14B and Wan2.2 5B weights, using MSE loss exclusively. Due to computational constraints, we randomly sample 200k instances from the original RoVid-X dataset. The results, shown in Table\n4\n, highlight that our dataset significantly enhances performance across five task domains and four distinct embodiments. These improvements validate both the proposed dataset and our data collection pipeline.\n6\nConclusion\nIn this work, we rethink video generation models for the embodied world and introduce RBench, a new benchmark designed to fill a critical gap in evaluating robot-oriented video generation models. Unlike previous methods that primarily rely on perceptual metrics, RBench incorporates both task-level accuracy and visual fidelity, using a comprehensive evaluation suite with detailed sub-metrics such as structural consistency and physical plausibility. The evaluation of 25 models highlights that current video generation models still require significant improvements to generate physically realistic robot behaviors. The strong correlation between RBench scores and human evaluations further validates the benchmark’s effectiveness. Additionally, RoVid-X overcomes the limitations of existing robotic datasets by offering a large-scale and diverse resource for video generation tasks. Together, RBench and RoVid-X provide a robust foundation for advancing video generation models in robotics. Our findings highlight the shortcomings of current video foundation models and suggest possible avenues for improvement, providing researchers with fresh perspectives for exploring the embodied domain through video world models.\nFuture Work\n. We aim to bridge the gap between video generation and actionable robot policy. We plan to employ Inverse Dynamics Models (IDM) to recover executable actions from generated videos, enabling closed-loop control experiments in both simulation environments and on real-world hardware. Furthermore, we intend to develop more automated and physically grounded evaluation metrics to rigorously assess the kinematic and dynamic feasibility of generated behaviors. Additionally, we will focus on training video generation models with improved physical capabilities, enabling the generation of robot videos that perform high-fidelity actions. Ultimately, these efforts will accelerate the development of a comprehensive solution for video-driven embodied intelligence.\nReferences\nAldaco et al. [2024]\nJorge Aldaco, Travis Armstrong, Robert Baruch, Jeff Bingham, Sanky Chan, Kenneth Draper, Debidatta Dwibedi, Chelsea Finn, Pete Florence, Spencer Goodrich, et al.\nAloha 2: An enhanced low-cost hardware for bimanual teleoperation.\narXiv preprint arXiv:2405.02292\n, 2024.\nAli et al. [2025]\nArslan Ali, Junjie Bai, Maciej Bala, Yogesh Balaji, Aaron Blakeman, Tiffany Cai, Jiaxin Cao, Tianshi Cao, Elizabeth Cha, Yu-Wei Chao, et al.\nWorld simulation with video foundation models for physical ai.\narXiv preprint arXiv:2511.00062\n, 2025.\nBai et al. [2025]\nShuai Bai, Keqin Chen, Xuejing Liu, Jialin Wang, Wenbin Ge, Sibo Song, Kai Dang, Peng Wang, Shijie Wang, and Tang.\nQwen3-vl technical report.\narXiv preprint arXiv\n, 2025.\nBaker et al. [2022]\nBowen Baker, Ilge Akkaya, Peter Zhokov, Joost Huizinga, Jie Tang, Adrien Ecoffet, Brandon Houghton, Raul Sampedro, and Jeff Clune.\nVideo pretraining (vpt): Learning to act by watching unlabeled online videos.\nAdvances in Neural Information Processing Systems\n, 35:24639–24654, 2022.\nBall et al. [2025]\nPhilip J. Ball, Jakob Bauer, Frank Belletti, Bethanie Brownfield, Ariel Ephrat, Shlomi Fruchter, Agrim Gupta, Kristian Holsheimer, Aleksander Holynski, Jiri Hron, Christos Kaplanis, Marjorie Limont, Matt McGill, Yanko Oliveira, Jack Parker-Holder, and Frank Perbet.\nGenie 3: A new frontier for world models.\narXiv preprint arXiv\n, 2025.\nBansal et al. [2024]\nHritik Bansal, Zongyu Lin, Tianyi Xie, Zeshun Zong, Michal Yarom, Yonatan Bitton, Chenfanfu Jiang, Yizhou Sun, Kai-Wei Chang, and Aditya Grover.\nVideophy: Evaluating physical commonsense for video generation.\narXiv preprint arXiv:2406.03520\n, 2024.\nBharadhwaj et al. [2024]\nHomanga Bharadhwaj, Debidatta Dwibedi, Abhinav Gupta, Shubham Tulsiani, Carl Doersch, Ted Xiao, Dhruv Shah, Fei Xia, Dorsa Sadigh, and Sean Kirmani.\nGen2act: Human video generation in novel scenarios enables generalizable robot manipulation.\narXiv preprint arXiv:2409.16283\n, 2024.\nBjorck et al. [2025]\nJohan Bjorck, Fernando Castañeda, Nikita Cherniadev, Xingye Da, Runyu Ding, Linxi Fan, Yu Fang, Dieter Fox, Fengyuan Hu, Spencer Huang, et al.\nGr00t n1: An open foundation model for generalist humanoid robots.\narXiv preprint arXiv:2503.14734\n, 2025.\nBlack et al. [2024]\nKevin Black, Noah Brown, Danny Driess, Adnan Esmail, Michael Equi, Chelsea Finn, Niccolo Fusai, Lachy Groom, Karol Hausman, Brian Ichter, et al.\nπ\n\\pi\n: A vision-language-action flow model for general robot control.\nCoRR\n, 2024.\nBrohan et al. [2022]\nAnthony Brohan, Noah Brown, Justice Carbajal, Yevgen Chebotar, Joseph Dabis, Chelsea Finn, Keerthana Gopalakrishnan, Karol Hausman, Alex Herzog, Jasmine Hsu, et al.\nRt-1: Robotics transformer for real-world control at scale.\narXiv preprint arXiv:2212.06817\n, 2022.\nBruce et al. [2024]\nJake Bruce, Michael D Dennis, Ashley Edwards, Jack Parker-Holder, Yuge Shi, Edward Hughes, Matthew Lai, Aditi Mavalankar, Richie Steigerwald, Chris Apps, et al.\nGenie: Generative interactive environments.\nIn\nForty-first International Conference on Machine Learning\n, 2024.\nBu et al. [2025]\nQingwen Bu, Jisong Cai, Li Chen, Xiuqi Cui, Yan Ding, Siyuan Feng, Shenyuan Gao, Xindong He, Xuan Hu, Xu Huang, et al.\nAgibot world colosseo: A large-scale manipulation platform for scalable and intelligent embodied systems.\narXiv preprint arXiv:2503.06669\n, 2025.\nBugliarello et al. [2023]\nEmanuele Bugliarello, H Hernan Moraldo, Ruben Villegas, Mohammad Babaeizadeh, Mohammad Taghi Saffar, Han Zhang, Dumitru Erhan, Vittorio Ferrari, Pieter-Jan Kindermans, and Paul Voigtlaender.\nStorybench: A multifaceted benchmark for continuous story visualization.\nAdvances in Neural Information Processing Systems\n, 36:78095–78125, 2023.\nCheang et al. [2024]\nChi-Lam Cheang, Guangzeng Chen, Ya Jing, Tao Kong, Hang Li, Yifeng Li, Yuxiao Liu, Hongtao Wu, Jiafeng Xu, Yichu Yang, et al.\nGr-2: A generative video-language-action model with web-scale knowledge for robot manipulation.\narXiv preprint arXiv:2410.06158\n, 2024.\nChen et al. [2025a]\nGuibin Chen, Dixuan Lin, Jiangping Yang, Chunze Lin, Junchen Zhu, Mingyuan Fan, Hao Zhang, Sheng Chen, Zheng Chen, Chengcheng Ma, Weiming Xiong, Wei Wang, Nuo Pang, Kang Kang, Zhiheng Xu, Yuzhe Jin, Yupeng Liang, Yubing Song, Peng Zhao, Boyuan Xu, Di Qiu, Debang Li, Zhengcong Fei, Yang Li, and Yahui Zhou.\nSkyreels-v2: Infinite-length film generative model, 2025a.\nURL\nhttps://arxiv.org/abs/2504.13074\n.\nChen et al. [2025b]\nSili Chen, Hengkai Guo, Shengnan Zhu, Feihu Zhang, Zilong Huang, Jiashi Feng, and Bingyi Kang.\nVideo depth anything: Consistent depth estimation for super-long videos.\narXiv:2501.12375\n, 2025b.\nChen et al. [2025c]\nSiyan Chen, Yanfei Chen, Ying Chen, Zhuo Chen, Feng Cheng, Xuyan Chi, Jian Cong, Qinpeng Cui, Qide Dong, Junliang Fan, et al.\nSeedance 1.5 pro: A native audio-visual joint generation foundation model.\narXiv preprint arXiv:2512.13507\n, 2025c.\nDamen et al. [2018]\nDima Damen, Hazel Doughty, Giovanni Maria Farinella, Sanja Fidler, Antonino Furnari, Evangelos Kazakos, Davide Moltisanti, Jonathan Munro, Toby Perrett, Will Price, et al.\nScaling egocentric vision: The epic-kitchens dataset.\nIn\nProceedings of the European conference on computer vision (ECCV)\n, pages 720–736, 2018.\nDasari et al. [2019]\nSudeep Dasari, Frederik Ebert, Stephen Tian, Suraj Nair, Bernadette Bucher, Karl Schmeckpeper, Siddharth Singh, Sergey Levine, and Chelsea Finn.\nRobonet: Large-scale multi-robot learning.\narXiv preprint arXiv:1910.11215\n, 2019.\nDeng et al. [2025a]\nYufan Deng, Xun Guo, Yizhi Wang, Jacob Zhiyuan Fang, Angtian Wang, Shenghai Yuan, Yiding Yang, Bo Liu, Haibin Huang, and Chongyang Ma.\nCinema: Coherent multi-subject video generation via mllm-based guidance.\narXiv preprint arXiv:2503.10391\n, 2025a.\nDeng et al. [2025b]\nYufan Deng, Xun Guo, Yuanyang Yin, Jacob Zhiyuan Fang, Yiding Yang, Yizhi Wang, Shenghai Yuan, Angtian Wang, Bo Liu, Haibin Huang, et al.\nMagref: Masked guidance for any-reference video generation.\narXiv preprint arXiv:2505.23742\n, 2025b.\nDu et al. [2023]\nYilun Du, Sherry Yang, Bo Dai, Hanjun Dai, Ofir Nachum, Josh Tenenbaum, Dale Schuurmans, and Pieter Abbeel.\nLearning universal policies via text-guided video generation.\nAdvances in neural information processing systems\n, 36:9156–9172, 2023.\nEbert et al. [2021]\nFrederik Ebert, Yanlai Yang, Karl Schmeckpeper, Bernadette Bucher, Georgios Georgakis, Kostas Daniilidis, Chelsea Finn, and Sergey Levine.\nBridge data: Boosting generalization of robotic skills with cross-domain datasets.\narXiv preprint arXiv:2109.13396\n, 2021.\nFang et al. [2023]\nHao-Shu Fang, Hongjie Fang, Zhenyu Tang, Jirong Liu, Chenxi Wang, Junbo Wang, Haoyi Zhu, and Cewu Lu.\nRh20t: A comprehensive robotic dataset for learning diverse skills in one-shot.\narXiv preprint arXiv:2307.00595\n, 2023.\nFeng et al. [2025]\nYao Feng, Hengkai Tan, Xinyi Mao, Chendong Xiang, Guodong Liu, Shuhe Huang, Hang Su, and Jun Zhu.\nVidar: Embodied video diffusion model for generalist manipulation.\narXiv preprint arXiv:2507.12898\n, 2025.\nFourier ActionNet Team [2025]\nYao Mu Fourier ActionNet Team.\nActionnet: A dataset for dexterous bimanual manipulation.\narXiv preprint arXiv\n, 2025.\nFu et al. [2024]\nZipeng Fu, Tony Z Zhao, and Chelsea Finn.\nMobile aloha: Learning bimanual mobile manipulation with low-cost whole-body teleoperation.\narXiv preprint arXiv:2401.02117\n, 2024.\nGao et al. [2025a]\nRuiyuan Gao, Kai Chen, Bo Xiao, Lanqing Hong, Zhenguo Li, and Qiang Xu.\nMagicdrive-v2: High-resolution long video generation for autonomous driving with adaptive control.\nIn\nProceedings of the IEEE/CVF International Conference on Computer Vision\n, pages 28135–28144, 2025a.\nGao et al. [2025b]\nYu Gao, Haoyuan Guo, Tuyen Hoang, Weilin Huang, Lu Jiang, Fangyuan Kong, Huixia Li, Jiashi Li, Liang Li, Xiaojie Li, et al.\nSeedance 1.0: Exploring the boundaries of video generation models.\narXiv preprint arXiv:2506.09113\n, 2025b.\nGoogle DeepMind [2025]\nGoogle DeepMind.\nVeo-3 technical report.\nTechnical report, Google DeepMind, May 2025.\nURL\nhttps://storage.googleapis.com/deepmind-media/veo/Veo-3-Tech-Report.pdf\n.\nGoyal et al. [2017]\nRaghav Goyal, Samira Ebrahimi Kahou, Vincent Michalski, Joanna Materzynska, Susanne Westphal, Heuna Kim, Valentin Haenel, Ingo Fruend, Peter Yianilos, Moritz Mueller-Freitag, et al.\nThe\" something something\" video database for learning and evaluating visual common sense.\nIn\nProceedings of the IEEE international conference on computer vision\n, pages 5842–5850, 2017.\nGrauman et al. [2022]\nKristen Grauman, Andrew Westbury, Eugene Byrne, Zachary Chavis, Antonino Furnari, Rohit Girdhar, Jackson Hamburger, Hao Jiang, Miao Liu, Xingyu Liu, et al.\nEgo4d: Around the world in 3,000 hours of egocentric video.\nIn\nProceedings of the IEEE/CVF conference on computer vision and pattern recognition\n, pages 18995–19012, 2022.\nGu et al. [2025]\nJing Gu, Xian Liu, Yu Zeng, Ashwin Nagarajan, Fangrui Zhu, Daniel Hong, Yue Fan, Qianqi Yan, Kaiwen Zhou, Ming-Yu Liu, et al.\n\" phyworldbench\": A comprehensive evaluation of physical realism in text-to-video models.\narXiv preprint arXiv:2507.13428\n, 2025.\nGuo et al. [2025a]\nDong Guo, Faming Wu, Feida Zhu, Fuxing Leng, Guang Shi, Haobin Chen, Haoqi Fan, Jian Wang, Jianyu Jiang, Jiawei Wang, et al.\nSeed1. 5-vl technical report.\narXiv preprint arXiv:2505.07062\n, 2025a.\nGuo et al. [2024a]\nXun Guo, Mingwu Zheng, Liang Hou, Yuan Gao, Yufan Deng, Pengfei Wan, Di Zhang, Yufan Liu, Weiming Hu, Zhengjun Zha, Haibin Huang, and Chongyang Ma.\nI2V-adapter: A general image-to-video adapter for diffusion models.\nIn\nACM SIGGRAPH 2024 Conference Papers\n, pages 1–12, 2024a.\nGuo et al. [2025b]\nXuyang Guo, Jiayan Huo, Zhenmei Shi, Zhao Song, Jiahao Zhang, and Jiale Zhao.\nT2vphysbench: A first-principles benchmark for physical consistency in text-to-video generation.\narXiv preprint arXiv:2505.00337\n, 2025b.\nGuo et al. [2024b]\nYanjiang Guo, Yucheng Hu, Jianke Zhang, Yen-Jen Wang, Xiaoyu Chen, Chaochao Lu, and Jianyu Chen.\nPrediction with action: Visual policy learning via joint denoising process.\nAdvances in Neural Information Processing Systems\n, 37:112386–112410, 2024b.\nGuo et al. [2025c]\nYanjiang Guo, Lucy Xiaoyang Shi, Jianyu Chen, and Chelsea Finn.\nCtrl-world: A controllable generative world model for robot manipulation.\narXiv preprint arXiv:2510.10125\n, 2025c.\nHaCohen et al. [2024]\nYoav HaCohen, Nisan Chiprut, Benny Brazowski, Daniel Shalem, Dudu Moshe, Eitan Richardson, Eran Levin, Guy Shiran, Nir Zabari, Ori Gordon, Poriya Panet, Sapir Weissbuch, Victor Kulikov, Yaki Bitterman, Zeev Melumian, and Ofir Bibi.\nLtx-video: Realtime video latent diffusion.\narXiv preprint arXiv:2501.00103\n, 2024.\nHaCohen et al. [2026]\nYoav HaCohen, Benny Brazowski, Nisan Chiprut, Yaki Bitterman, Andrew Kvochko, Avishai Berkowitz, Daniel Shalem, Daphna Lifschitz, Dudu Moshe, Eitan Porat, et al.\nLtx-2: Efficient joint audio-visual foundation model.\narXiv preprint arXiv:2601.03233\n, 2026.\nHailuo [2025]\nHailuo.\nHailuo.\nHailuo Lab\n, 2025.\nURL\nhttps://hailuoai.video/\n.\nHan et al. [2025]\nHui Han, Siyuan Li, Jiaqi Chen, Yiwen Yuan, Yuling Wu, Yufan Deng, Chak Tou Leong, Hanwen Du, Junchen Fu, Youhua Li, et al.\nVideo-bench: Human-aligned video generation benchmark.\nIn\nProceedings of the Computer Vision and Pattern Recognition Conference\n, pages 18858–18868, 2025.\nHarley et al. [2025]\nAdam W. Harley, Yang You, Xinglong Sun, Yang Zheng, Nikhil Raghuraman, Yunqi Gu, Sheldon Liang, Wen-Hsuan Chu, Achal Dave, Pavel Tokmakov, Suya You, Rares Ambrus, Katerina Fragkiadaki, and Leonidas J. Guibas.\nAllTracker: Efficient dense point tracking at high resolution.\nIn\nProceedings of the IEEE/CVF International Conference on Computer Vision\n, 2025.\nHo et al. [2020]\nJonathan Ho, Ajay Jain, and Pieter Abbeel.\nDenoising diffusion probabilistic models.\nAdvances in neural information processing systems\n, 33:6840–6851, 2020.\nHu et al. [2024]\nYucheng Hu, Yanjiang Guo, Pengchao Wang, Xiaoyu Chen, Yen-Jen Wang, Jianke Zhang, Koushil Sreenath, Chaochao Lu, and Jianyu Chen.\nVideo prediction policy: A generalist robot policy with predictive visual representations.\narXiv preprint arXiv:2412.14803\n, 2024.\nHuang et al. [2024]\nZiqi Huang, Yinan He, Jiashuo Yu, Fan Zhang, Chenyang Si, Yuming Jiang, Yuanhan Zhang, Tianxing Wu, Qingyang Jin, Nattapol Chanpaisit, et al.\nVbench: Comprehensive benchmark suite for video generative models.\nIn\nProceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition\n, pages 21807–21818, 2024.\nJang et al. [2025]\nJoel Jang, Seonghyeon Ye, Zongyu Lin, Jiannan Xiang, Johan Bjorck, Yu Fang, Fengyuan Hu, Spencer Huang, Kaushil Kundalia, Yen-Chen Lin, et al.\nDreamgen: Unlocking generalization in robot learning through video world models.\narXiv preprint arXiv:2505.12705\n, 2025.\nJi et al. [2024]\nPengliang Ji, Chuyang Xiao, Huilin Tai, and Mingxiao Huo.\nT2vbench: Benchmarking temporal dynamics for text-to-video generation.\nIn\nProceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR) Workshops\n, pages 5325–5335, June 2024.\nJiang et al. [2025a]\nTao Jiang, Tianyuan Yuan, Yicheng Liu, Chenhao Lu, Jianning Cui, Xiao Liu, Shuiqi Cheng, Jiyang Gao, Huazhe Xu, and Hang Zhao.\nGalaxea open-world dataset and g0 dual-system vla model.\narXiv preprint arXiv:2509.00576\n, 2025a.\nJiang et al. [2025b]\nYuming Jiang, Siteng Huang, Shengke Xue, Yaxi Zhao, Jun Cen, Sicong Leng, Kehan Li, Jiayan Guo, Kexiang Wang, Mingxiu Chen, et al.\nRynnvla-001: Using human demonstrations to improve robot manipulation.\narXiv preprint arXiv:2509.15212\n, 2025b.\nJiang et al. [2025c]\nZeyinzi Jiang, Zhen Han, Chaojie Mao, Jingfeng Zhang, Yulin Pan, and Yu Liu.\nVace: All-in-one video creation and editing.\narXiv preprint arXiv:2503.07598\n, 2025c.\nJiang et al. [2025d]\nZhenyu Jiang, Yuqi Xie, Kevin Lin, Zhenjia Xu, Weikang Wan, Ajay Mandlekar, Linxi Jim Fan, and Yuke Zhu.\nDexmimicgen: Automated data generation for bimanual dexterous manipulation via imitation learning.\nIn\n2025 IEEE International Conference on Robotics and Automation (ICRA)\n, pages 16923–16930. IEEE, 2025d.\nJu et al. [2025]\nXuan Ju, Tianyu Wang, Yuqian Zhou, He Zhang, Qing Liu, Nanxuan Zhao, Zhifei Zhang, Yijun Li, Yuanhao Cai, Shaoteng Liu, et al.\nEditverse: Unifying image and video editing and generation with in-context learning.\narXiv preprint arXiv:2509.20360\n, 2025.\nKang et al. [2024]\nBingyi Kang, Yang Yue, Rui Lu, Zhijie Lin, Yang Zhao, Kaixin Wang, Gao Huang, and Jiashi Feng.\nHow far is video generation from world model: A physical law perspective.\narXiv preprint arXiv:2411.02385\n, 2024.\nKaraev et al. [2024]\nNikita Karaev, Iurii Makarov, Jianyuan Wang, Natalia Neverova, Andrea Vedaldi, and Christian Rupprecht.\nCotracker3: Simpler and better point tracking by pseudo-labelling real videos.\nIn\nProc. arXiv:2410.11831\n, 2024.\nKhazatsky et al. [2024]\nAlexander Khazatsky, Karl Pertsch, Suraj Nair, Ashwin Balakrishna, Sudeep Dasari, Siddharth Karamcheti, Soroush Nasiriany, Mohan Kumar Srirama, Lawrence Yunliang Chen, Kirsty Ellis, et al.\nDroid: A large-scale in-the-wild robot manipulation dataset.\narXiv preprint arXiv:2403.12945\n, 2024.\nKim et al. [2025]\nGeonung Kim, Janghyeok Han, and Sunghyun Cho.\nVideofrom3d: 3d scene video generation via complementary image and video diffusion models.\narXiv preprint arXiv:2509.17985\n, 2025.\nKling [2025]\nKling.\nImage to video elements feature, 2025.\nURL\nhttps://klingai.com/global/\n.\nKong et al. [2024]\nWeijie Kong, Qi Tian, Zijian Zhang, Rox Min, Zuozhuo Dai, Jin Zhou, Jiangfeng Xiong, Xin Li, Bo Wu, Jianwei Zhang, et al.\nHunyuanvideo: A systematic framework for large video generative models.\narXiv preprint arXiv:2412.03603\n, 2024.\nLi et al. [2025]\nShuang Li, Yihuai Gao, Dorsa Sadigh, and Shuran Song.\nUnified video action model.\narXiv preprint arXiv:2503.00200\n, 2025.\nLiang et al. [2025]\nJunbang Liang, Pavel Tokmakov, Ruoshi Liu, Sruthi Sudhakar, Paarth Shah, Rares Ambrus, and Carl Vondrick.\nVideo generators are robot policies.\narXiv preprint arXiv:2508.00795\n, 2025.\nLiao et al. [2024]\nMingxiang Liao, Qixiang Ye, Wangmeng Zuo, Fang Wan, Tianyu Wang, Yuzhong Zhao, Jingdong Wang, Xinyu Zhang, et al.\nEvaluation of text-to-video generation models: A dynamics perspective.\nAdvances in Neural Information Processing Systems\n, 37:109790–109816, 2024.\nLiao et al. [2025]\nYue Liao, Pengfei Zhou, Siyuan Huang, Donglin Yang, Shengcong Chen, Yuxin Jiang, Yue Hu, Jingbin Cai, Si Liu, Jianlan Luo, et al.\nGenie envisioner: A unified world foundation platform for robotic manipulation.\narXiv preprint arXiv:2508.05635\n, 2025.\nLing et al. [2025]\nXinran Ling, Chen Zhu, Meiqi Wu, Hangyu Li, Xiaokun Feng, Cundian Yang, Aiming Hao, Jiashu Zhu, Jiahong Wu, and Xiangxiang Chu.\nVmbench: A benchmark for perception-aligned video motion generation.\nIn\nProceedings of the IEEE/CVF International Conference on Computer Vision\n, pages 13087–13098, 2025.\nLiu et al. [2023a]\nShilong Liu, Zhaoyang Zeng, Tianhe Ren, Feng Li, Hao Zhang, Jie Yang, Chunyuan Li, Jianwei Yang, Hang Su, Jun Zhu, et al.\nGrounding dino: Marrying dino with grounded pre-training for open-set object detection.\narXiv preprint arXiv:2303.05499\n, 2023a.\nLiu et al. [2024]\nYaofang Liu, Xiaodong Cun, Xuebo Liu, Xintao Wang, Yong Zhang, Haoxin Chen, Yang Liu, Tieyong Zeng, Raymond Chan, and Ying Shan.\nEvalcrafter: Benchmarking and evaluating large video generation models.\nIn\nProceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition\n, pages 22139–22149, 2024.\nLiu et al. [2023b]\nYuanxin Liu, Lei Li, Shuhuai Ren, Rundong Gao, Shicheng Li, Sishuo Chen, Xu Sun, and Lu Hou.\nFetv: A benchmark for fine-grained evaluation of open-domain text-to-video generation.\nAdvances in Neural Information Processing Systems\n, 36:62352–62387, 2023b.\nLynch et al. [2023]\nCorey Lynch, Ayzaan Wahid, Jonathan Tompson, Tianli Ding, James Betker, Robert Baruch, Travis Armstrong, and Pete Florence.\nInteractive language: Talking to robots in real time.\nIEEE Robotics and Automation Letters\n, 2023.\nMandlekar et al. [2018]\nAjay Mandlekar, Yuke Zhu, Animesh Garg, Jonathan Booher, Max Spero, Albert Tung, Julian Gao, John Emmons, Anchit Gupta, Emre Orbay, et al.\nRoboturk: A crowdsourcing platform for robotic skill learning through imitation.\nIn\nConference on Robot Learning\n, pages 879–893. PMLR, 2018.\nMandlekar et al. [2023]\nAjay Mandlekar, Soroush Nasiriany, Bowen Wen, Iretiayo Akinola, Yashraj Narang, Linxi Fan, Yuke Zhu, and Dieter Fox.\nMimicgen: A data generation system for scalable robot learning using human demonstrations.\narXiv preprint arXiv:2310.17596\n, 2023.\nMao et al. [2024]\nJiageng Mao, Siheng Zhao, Siqi Song, Tianheng Shi, Junjie Ye, Mingtong Zhang, Haoran Geng, Jitendra Malik, Vitor Guizilini, and Yue Wang.\nLearning from massive human videos for universal humanoid pose control.\narXiv preprint arXiv:2412.14172\n, 2024.\nMeng et al. [2024a]\nFanqing Meng, Jiaqi Liao, Xinyu Tan, Wenqi Shao, Quanfeng Lu, Kaipeng Zhang, Yu Cheng, Dianqi Li, Yu Qiao, and Ping Luo.\nTowards world simulator: Crafting physical commonsense-based benchmark for video generation.\narXiv preprint arXiv:2410.05363\n, 2024a.\nMeng et al. [2024b]\nFanqing Meng, Wenqi Shao, Lixin Luo, Yahong Wang, Yiran Chen, Quanfeng Lu, Yue Yang, Tianshuo Yang, Kaipeng Zhang, Yu Qiao, et al.\nPhybench: A physical commonsense benchmark for evaluating text-to-image models.\narXiv preprint arXiv:2406.11802\n, 2024b.\nNasiriany et al. [2024]\nSoroush Nasiriany, Abhiram Maddukuri, Lance Zhang, Adeet Parikh, Aaron Lo, Abhishek Joshi, Ajay Mandlekar, and Yuke Zhu.\nRobocasa: Large-scale simulation of everyday tasks for generalist robots.\narXiv preprint arXiv:2406.02523\n, 2024.\nOpenAI [2024]\nOpenAI.\nSora, 2024.\nURL\nhttps://openai.com/sora/\n.\nAccessed: 2025-02-26.\nOpenAI [2025a]\nOpenAI.\nIntroducing gpt‑5.\nhttps://openai.com/index/introducing-gpt-5/\n, 2025a.\nOpenAI [2025b]\nOpenAI.\nSora2, 2025b.\nURL\nhttps://openai.com/zh-Hans-CN/index/sora-2/\n.\nO’Neill et al. [2024]\nAbby O’Neill, Abdul Rehman, Abhiram Maddukuri, Abhishek Gupta, Abhishek Padalkar, Abraham Lee, Acorn Pooley, Agrim Gupta, Ajay Mandlekar, Ajinkya Jain, et al.\nOpen x-embodiment: Robotic learning datasets and rt-x models: Open x-embodiment collaboration 0.\nIn\n2024 IEEE International Conference on Robotics and Automation (ICRA)\n, pages 6892–6903. IEEE, 2024.\nPeebles and Xie [2023]\nWilliam Peebles and Saining Xie.\nScalable diffusion models with transformers.\nIn\nProceedings of the IEEE/CVF International Conference on Computer Vision\n, pages 4195–4205, 2023.\nPika [2025]\nPika.\nPika art 2.0’s scene ingredients: Redefining personalized video creation, 2025.\nURL\nhttps://pikartai.com/scene-ingredients/\n.\nAccessed: 2025-02-26.\nRen et al. [2024]\nTianhe Ren, Shilong Liu, Ailing Zeng, Jing Lin, Kunchang Li, He Cao, Jiayu Chen, Xinyu Huang, Yukang Chen, Feng Yan, Zhaoyang Zeng, Hao Zhang, Feng Li, Jie Yang, Hongyang Li, Qing Jiang, and Lei Zhang.\nGrounded sam: Assembling open-world models for diverse visual tasks, 2024.\nRen et al. [2025]\nXuanchi Ren, Tianchang Shen, Jiahui Huang, Huan Ling, Yifan Lu, Merlin Nimier-David, Thomas Müller, Alexander Keller, Sanja Fidler, and Jun Gao.\nGen3c: 3d-informed world-consistent video generation with precise camera control.\nIn\nProceedings of the Computer Vision and Pattern Recognition Conference\n, pages 6121–6132, 2025.\nRunway [2025]\nRunway.\nRunway, 2025.\nURL\nhttps://runwayml.com/\n.\nAccessed: 2025-02-26.\nSong et al. [2020]\nYang Song, Jascha Sohl-Dickstein, Diederik P Kingma, Abhishek Kumar, Stefano Ermon, and Ben Poole.\nScore-based generative modeling through stochastic differential equations.\narXiv preprint arXiv:2011.13456\n, 2020.\nSun et al. [2025]\nKaiyue Sun, Kaiyi Huang, Xian Liu, Yue Wu, Zihan Xu, Zhenguo Li, and Xihui Liu.\nT2v-compbench: A comprehensive benchmark for compositional text-to-video generation.\nIn\nProceedings of the Computer Vision and Pattern Recognition Conference\n, pages 8406–8416, 2025.\nTeam et al. [2025a]\nGigaBrain Team, Angen Ye, Boyuan Wang, Chaojun Ni, Guan Huang, Guosheng Zhao, Haoyun Li, Jie Li, Jiagang Zhu, Lv Feng, et al.\nGigabrain-0: A world model-powered vision-language-action model.\narXiv preprint arXiv:2510.19430\n, 2025a.\nTeam et al. [2025b]\nMeituan LongCat Team, Xunliang Cai, Qilong Huang, Zhuoliang Kang, Hongyu Li, Shijun Liang, Liya Ma, Siyu Ren, Xiaoming Wei, Rixu Xie, and Tong Zhang.\nLongcat-video technical report, 2025b.\nURL\nhttps://arxiv.org/abs/2510.22200\n.\nTharwat et al. [2025]\nBahey Tharwat, Yara Nasser, Ali Abouzeid, and Ian Reid.\nLatent action pretraining through world modeling.\narXiv preprint arXiv:2509.18428\n, 2025.\nTian et al. [2024]\nYang Tian, Sizhe Yang, Jia Zeng, Ping Wang, Dahua Lin, Hao Dong, and Jiangmiao Pang.\nPredictive inverse dynamics models are scalable learners for robotic manipulation.\nIn\nThe Thirteenth International Conference on Learning Representations\n, 2024.\nTian et al. [2025]\nYang Tian, Yuyin Yang, Yiman Xie, Zetao Cai, Xu Shi, Ning Gao, Hangxu Liu, Xuekun Jiang, Zherui Qiu, Feng Yuan, et al.\nInterndata-a1: Pioneering high-fidelity synthetic data for pre-training generalist policy.\narXiv preprint arXiv:2511.16651\n, 2025.\nUnitree [2025]\nUnitree.\nUnifolm-wma-0: A world-model-action (wma) framework under unifolm family, 2025.\nWan et al. [2025]\nTeam Wan, Ang Wang, Baole Ai, Bin Wen, Chaojie Mao, Chen-Wei Xie, Di Chen, Feiwu Yu, Haiming Zhao, Jianxiao Yang, et al.\nWan: Open and advanced large-scale video generative models.\narXiv preprint arXiv:2503.20314\n, 2025.\nWang et al. [2025a]\nJing Wang, Ao Ma, Ke Cao, Jun Zheng, Zhanjie Zhang, Jiasong Feng, Shanyuan Liu, Yuhang Ma, Bo Cheng, Dawei Leng, et al.\nWisa: World simulator assistant for physics-aware text-to-video generation.\narXiv preprint arXiv:2503.08153\n, 2025a.\nWang et al. [2025b]\nYiping Wang, Xuehai He, Kuan Wang, Luyao Ma, Jianwei Yang, Shuohang Wang, Simon Shaolei Du, and Yelong Shen.\nIs your world simulator a good story presenter? a consecutive events-based benchmark for future long video generation.\nIn\nProceedings of the Computer Vision and Pattern Recognition Conference\n, pages 13629–13638, 2025b.\nWang et al. [2023]\nYufei Wang, Zhou Xian, Feng Chen, Tsun-Hsuan Wang, Yian Wang, Katerina Fragkiadaki, Zackory Erickson, David Held, and Chuang Gan.\nRobogen: Towards unleashing infinite data for automated robot learning via generative simulation.\narXiv preprint arXiv:2311.01455\n, 2023.\nWang et al. [2024]\nZhouxia Wang, Ziyang Yuan, Xintao Wang, Yaowei Li, Tianshui Chen, Menghan Xia, Ping Luo, and Ying Shan.\nMotionctrl: A unified and flexible motion controller for video generation.\nIn\nACM SIGGRAPH 2024 Conference Papers\n, pages 1–11, 2024.\nWiedemer et al. [2025]\nThaddäus Wiedemer, Yuxuan Li, Paul Vicol, Shixiang Shane Gu, Nick Matarese, Kevin Swersky, Been Kim, Priyank Jaini, and Robert Geirhos.\nVideo models are zero-shot learners and reasoners.\narXiv preprint arXiv:2509.20328\n, 2025.\nWu et al. [2025a]\nBing Wu, Chang Zou, Changlin Li, Duojun Huang, Fang Yang, Hao Tan, Jack Peng, Jianbing Wu, Jiangfeng Xiong, Jie Jiang, et al.\nHunyuanvideo 1.5 technical report.\narXiv preprint arXiv:2511.18870\n, 2025a.\nWu et al. [2023]\nHaoning Wu, Zicheng Zhang, Weixia Zhang, Chaofeng Chen, Chunyi Li, Liang Liao, Annan Wang, Erli Zhang, Wenxiu Sun, Qiong Yan, Xiongkuo Min, Guangtai Zhai, and Weisi Lin.\nQ-align: Teaching lmms for visual scoring via discrete text-defined levels.\narXiv preprint arXiv:2312.17090\n, 2023.\nEqual Contribution by Wu, Haoning and Zhang, Zicheng. Project Lead by Wu, Haoning. Corresponding Authors: Zhai, Guangtai and Lin, Weisi.\nWu et al. [2025b]\nHongtao Wu, Ya Jing, Chilam Cheang, Guangzeng Chen, Jiafeng Xu, Xinghang Li, Minghuan Liu, Hang Li, and Tao Kong.\nUnleashing large-scale video generative pre-training for visual robot manipulation.\nIn\nThe Twelfth International Conference on Learning Representations\n, 2025b.\nWu et al. [2024a]\nKun Wu, Chengkai Hou, Jiaming Liu, Zhengping Che, Xiaozhu Ju, Zhuqin Yang, Meng Li, Yinuo Zhao, Zhiyuan Xu, Guang Yang, et al.\nRobomind: Benchmark on multi-embodiment intelligence normative data for robot manipulation.\narXiv preprint arXiv:2412.13877\n, 2024a.\nWu et al. [2024b]\nPhilipp Wu, Yide Shentu, Zhongke Yi, Xingyu Lin, and Pieter Abbeel.\nGello: A general, low-cost, and intuitive teleoperation framework for robot manipulators.\nIn\n2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)\n, pages 12156–12163. IEEE, 2024b.\nWu et al. [2025c]\nShihan Wu, Xuecheng Liu, Shaoxuan Xie, Pengwei Wang, Xinghang Li, Bowen Yang, Zhe Li, Kai Zhu, Hongyu Wu, Yiheng Liu, et al.\nRobocoin: An open-sourced bimanual robotic data collection for integrated manipulation.\narXiv preprint arXiv:2511.17441\n, 2025c.\nYan et al. [2025]\nTianyi Yan, Wencheng Han, Xia Zhou, Xueyang Zhang, Kun Zhan, Cheng-zhong Xu, and Jianbing Shen.\nRlgf: Reinforcement learning with geometric feedback for autonomous driving video generation.\narXiv preprint arXiv:2509.16500\n, 2025.\nYang et al. [2025]\nLujie Yang, HJ Suh, Tong Zhao, Bernhard Paus Graesdal, Tarik Kelestemur, Jiuguang Wang, Tao Pang, and Russ Tedrake.\nPhysics-driven data generation for contact-rich manipulation via trajectory optimization.\narXiv preprint arXiv:2502.20382\n, 2025.\nYang et al. [2024]\nZhuoyi Yang, Jiayan Teng, Wendi Zheng, Ming Ding, Shiyu Huang, Jiazheng Xu, Yuanming Yang, Wenyi Hong, Xiaohan Zhang, Guanyu Feng, et al.\nCogvideox: Text-to-video diffusion models with an expert transformer.\narXiv preprint arXiv:2408.06072\n, 2024.\nYe et al. [2025]\nSeonghyeon Ye, Joel Jang, Byeongguk Jeon, Se June Joo, Jianwei Yang, Baolin Peng, Ajay Mandlekar, Reuben Tan, Yu-Wei Chao, Bill Yuchen Lin, et al.\nLatent action pretraining from videos.\nIn\nThe Thirteenth International Conference on Learning Representations\n, 2025.\nYuan et al. [2025]\nShenghai Yuan, Xianyi He, Yufan Deng, Yang Ye, Jinfa Huang, Bin Lin, Jiebo Luo, and Li Yuan.\nOpens2v-nexus: A detailed benchmark and million-scale dataset for subject-to-video generation.\narXiv preprint arXiv:2505.20292\n, 2025.\nZhang and Agrawala [2025]\nLvmin Zhang and Maneesh Agrawala.\nPacking input frame contexts in next-frame prediction models for video generation.\nArxiv\n, 2025.\nZhao et al. [2025]\nZhenyu Zhao, Hongyi Jing, Xiawei Liu, Jiageng Mao, Abha Jha, Hanwen Yang, Rong Xue, Sergey Zakharor, Vitor Guizilini, and Yue Wang.\nHumanoid everyday: A comprehensive robotic dataset for open-world humanoid manipulation.\narXiv preprint arXiv:2510.08807\n, 2025.\nZhen et al. [2025]\nHaoyu Zhen, Qiao Sun, Hongxin Zhang, Junyan Li, Siyuan Zhou, Yilun Du, and Chuang Gan.\nTesseract: learning 4d embodied world models.\narXiv preprint arXiv:2504.20995\n, 2025.\nZhou et al. [2024]\nSiyuan Zhou, Yilun Du, Jiaben Chen, Yandong Li, Dit-Yan Yeung, and Chuang Gan.\nRobodreamer: Learning compositional world models for robot imagination.\narXiv preprint arXiv:2404.12377\n, 2024.\nZhu et al. [2025]\nChuning Zhu, Raymond Yu, Siyuan Feng, Benjamin Burchfiel, Paarth Shah, and Abhishek Gupta.\nUnified world models: Coupling video and action diffusion for pretraining on large robotic datasets.\narXiv preprint arXiv:2504.02792\n, 2025.\nZhuang et al. [2025]\nJunhao Zhuang, Shi Guo, Xin Cai, Xiaohui Li, Yihao Liu, Chun Yuan, and Tianfan Xue.\nFlashvsr: Towards real-time diffusion-based streaming video super-resolution, 2025.\nURL\nhttps://arxiv.org/abs/2510.12747\n.\nRethinking Video Generation Model for the Embodied World\nAppendix\nAppendix A\nEvaluation Set Details\nA.1\nTask-Oriented Evaluation Set\nTo systematically evaluate the multi-dimensional task execution capabilities of video generation models in robotic scenarios, RBench constructs a task-oriented evaluation set with five core task dimensions:\nCommon Manipulation\n,\nLong-Horizon Planning\n,\nMulti-Entity Collaboration\n,\nSpatial Relationship\n, and\nVisual Reasoning\n. For each task, we collect 50 images as initial frames from open-source datasets or public web sources. Human annotators then create and verify corresponding text prompts to ensure both correctness and diversity of language descriptions. Together, these image-text pairs define a diverse evaluation corpus that covers a wide range of everyday manipulation, complex planning, multi-entity interaction, spatial reasoning, and visual-semantic reasoning scenarios.\nA.1.1\nCommon Manipulation\nThis task evaluates the ability of video generation models to produce diverse manipulation behaviors in basic object interaction scenarios. The scenes cover single-arm, dual-arm, and humanoid robots performing typical manipulation actions such as grasping, placing, pushing, rotating, and pressing. The dataset focuses on whether the model can generate physically plausible, temporally coherent, and natural manipulation behaviors that achieve the specified goals for everyday object handling.\nA.1.2\nLong-Horizon Planning\nThis task evaluates the capability of video generation models to understand and generate long-horizon robotic behaviors that involve multi-stage action planning. Each instance in the evaluation set is composed of multiple sequential sub-actions, including:\n•\nObject Manipulation Sequences:\ne.g., The robot opens the refrigerator door, takes the green box out of the refrigerator, and then closes the refrigerator door,” which requires clearly delineated action stages and physically reasonable transitions.\n•\nMulti-Step Spatial Planning:\ne.g., The humanoid robot picks up the bag, turns around, climbs up the stairs, and walks across the wooden plank,” emphasizing continuous spatial transitions and modeling of multi-step action chaining.\n•\nPhysical Motion and Body Coordination:\ne.g., “The quadruped robot performs a front flip, lands steadily, then leans forward and balances upside down on its front legs,” which assesses temporal coherence and physical plausibility in complex motion and body control.\nOverall, the dataset spans a broad range of tasks from everyday interactions to dynamic control, focusing on a model’s capability in action decomposition, stage transitions, and cross-time reasoning for comprehensive long-horizon planning.\nA.1.3\nMulti-Entity Collaboration\nThis task focuses on evaluating the capability of video generation models to depict collaborative and interactive behaviors in multi-entity robotic scenarios. Each scene contains a\nPrimary Entity\nand a\nSecondary Entity\n. The Primary Entity can be a single-arm robot, a dual-arm robot, a humanoid robot, or a quadruped robot, while the Secondary Entity can be a human, an animal, or another robot. The task covers diverse interaction types such as object handover and usage, dressing assistance, collaborative task completion, following, and guidance. The dataset is designed to assess whether the model can generate natural, temporally coherent, and task-consistent multi-entity collaboration behaviors at semantic, temporal, and physical levels.\nA.1.4\nSpatial Relationship\nThis task evaluates the ability of video generation models to understand and express spatial relationships in generated videos. We construct scenes where humanoid robots, single-arm robots, and quadruped robots interact with clearly defined objects while satisfying various spatial relations, such as above/below, left/right, and front/behind. The dataset requires models to correctly present relative positions, orientations, and motion trajectories between entities, revealing their competence in spatial understanding and geometric reasoning. Consistent spatial layouts and motion patterns across time are essential to correctly reflect the described spatial relations.\nA.1.5\nVisual Reasoning\nThis task aims to evaluate the visual-semantic reasoning capabilities of video generation models in complex scenes. The evaluation set includes a wide range of visual concepts and multi-level semantic logic, such as:\n•\nColor recognition (e.g., pick up the sky-blue book);\n•\nNumerical and ordering reasoning (e.g., the robot places the apple, water bottle, and Rubik’s cube into the bag in that order);\n•\nAttribute and category matching (e.g., the robot gripper places the white bottle of baby powder onto the shelf, aligning it with other identical bottles in the same column);\n•\nGeometric and object-property understanding (e.g., the robot picks up the tallest orange object and places it into the basket);\n•\nText and semantic understanding (e.g., the left manipulator places the cup under the white dispenser labeled ‘Jasmine Tea,’ and the right manipulator opens the dispenser to pour jasmine tea into the cup);\n•\nVisual feature understanding (e.g., the robot grasps the book with a portrait of a person on its cover).\nThis dataset is designed to emphasize fine-grained visual grounding, logical consistency, and the ability to align robot actions with high-level visual-semantic reasoning requirements.\nA.2\nEmbodiment-Specific Evaluation Set\nDifferent types of robots exhibit substantial variations in morphology, degrees of freedom, control modes, and task objectives. These factors directly influence the modeling complexity and generalization challenges faced by video generation models in robotics contexts. To more systematically analyze model performance across heterogeneous robot embodiments, RBench constructs embodiment-specific evaluation subsets that encompass four representative robot categories: dual-arm robots, humanoid robots, single-arm robots, and quadruped robots. For each embodiment, 100 initial-frame images are sourced from open-access or publicly available datasets, and human annotators create and verify the corresponding prompts for accuracy and linguistic diversity.\nEach subset includes a diverse range of robot models, action types, manipulated objects, scene environments, and both first-person and third-person perspectives. This design introduces embodiment-specific challenges: dual-arm robots emphasize coordinated bimanual manipulation, humanoid robots prioritize tool use and natural full-body postures, single-arm robots focus on precise object interactions, and quadruped robots predominantly test terrain adaptation and motion continuity. Along with the task-oriented splits, these embodiment-specific subsets provide a comprehensive and structured dataset for benchmarking video generation models in the embodied world.\nEvaluating models across these four robot categories further uncovers the current biases and capability preferences of image-to-video generation models. For instance, due to extensive pre-training on large-scale human activity datasets, many models tend to exhibit higher task completion rates and better visual quality in humanoid-robot scenarios, while they often struggle with fine-grained single-arm manipulation. By systematically comparing performance across different embodiments, RBench makes such imbalances explicit and offers a principled framework to identify where current models excel or fail.\nMore broadly, embodiment-aware datasets like RBench are pivotal for advancing video foundation models in robotics. They promote the development of architectures and training strategies capable of generalizing beyond human-centric motion priors, enabling models to learn and adapt to a broader distribution of robot-specific motion patterns, rather than relying solely on human demonstrations. Furthermore, they facilitate fair and transparent comparisons between models, allowing evaluation results to clearly identify which models perform best for specific robot embodiments. Finally, such datasets help bridge the gap between generic video generation and physically grounded embodied intelligence, fostering the transition from visually appealing but brittle outputs toward robust, controllable, and deployment-ready generative models for real-world robotic systems.\nAppendix B\nAutomatic Metrics Details\nTo quantitatively assess the core capabilities of different models in robot video generation, we design five fine-grained metrics:\nPhysical-Semantic Plausibility\n,\nTask-Adherence Consistency\n,\nMotion Amplitude\n,\nRobot-Subject Stability\n, and\nMotion Smoothness\n. These metrics are evaluated using an MLLM-based, VQA-style protocol applied to grid images composed of key frames sampled from each generated video. Additionally, the evaluation is supplemented by low-level, non-MLLM computational indicators that capture pixel-level motion statistics and temporal dynamics. Together, these two layers of evaluation provide a comprehensive assessment of both task completion and visual quality in robotic video generation.\nB.1\nPhysical-Semantic Plausibility\nFigure 6\n:\nVisualization of robot and subject floating.\nIn robotics video generation, models often produce physically implausible or commonsense-violating artifacts, such as grippers passing through objects, floating objects, or the sudden appearance of irrelevant entities. These errors are typically undetectable by standard visual perception metrics, yet they directly highlight limitations in a model’s understanding of physical laws and semantic causality.\nFigure 7\n:\nVisualization of robot interpenetration.\nFigure 8\n:\nVisualization of robot/subject sudden appearance, disappearance, or duplication.\nTo capture these issues, we introduce the\nPhysical-Semantic Plausibility\nmetric, implemented via a VQA-style evaluation pipeline. The MLLM receives a grid image composed of key frames from the generated video and is prompted to detect the following types of violations:\n•\nFloating and unsupported entities.\nAs illustrated in Figure\n6\n, the metallic spoon and the single-arm robot’s manipulator are suspended in mid-air without any physically plausible support.\n•\nInterpenetration.\nAs shown in Figure\n7\n, the humanoid robot hand unrealistically penetrates the box, indicating a severe violation of rigid-body constraints.\n•\nSudden appearance, disappearance, or duplication.\nAs demonstrated in Figure\n8\n, (a) the robotic arm suddenly disappears in later frames, (b) human hands and a new notebook suddenly appear, and (c) the number of instant noodle packs is spuriously duplicated.\n•\nNon-contact attachment and incorrect grasping.\nFor example, in Figure\n6\n(a), the metallic spoon moves rigidly with the gripper even though there is no clear contact or gripper closure, resulting in an unrealistic “sticking” effect.\nThese anomalies are treated as severe physical violations that significantly reduce the credibility of the generated video. Beyond local error detection, the evaluator is also required to assess whether the overall action sequence and causal progression are reasonable, thereby characterizing the extent to which the model produces videos that are consistent with basic physical laws and human common sense.\nB.2\nTask-Adherence Consistency\nFigure 9\n:\nVisualization of task responsiveness and key actions completeness.\nRobotics video generation models often exhibit task-level deviations, such as ignoring the specified objective or omitting critical action stages. To measure this behavior, we design the\nTask-Adherence Consistency\nmetric, using a VQA-style evaluation protocol. The MLLM inspects the grid of key frames and assesses the following:\n•\nTask responsiveness.\nAs shown in Figure\n9\n(a), the failure case illustrates a robot gripper that does not respond to the instruction to grasp the mouse; the gripper remains static, and the intended task is never initiated or completed.\n•\nKey action completeness.\nAs illustrated in Figure\n9\n(b), the failure case omits crucial actions such as\nturn on\nand\nfill\n: the faucet is never visibly operated, yet water still flows from the tap, disrupting the causal chain between actions and outcomes.\nThese phenomena reflect shortcomings in semantic understanding, action planning, and execution consistency with respect to the prompt. Importantly, they are also difficult to capture with conventional low-level perception metrics, highlighting the necessity of explicit task-adherence evaluation in robotics contexts.\nConcretely, Task-Adherence Consistency is instantiated with task-specific criteria for the five task families introduced in Section\nA.1\n, with a focus on the following:\n•\nCommon Manipulation.\nTask adherence is primarily assessed through: (i)\nTask Completion\n, which checks whether the robot successfully accomplishes the manipulation objective described in the prompt while exhibiting reasonable intermediate phases (e.g., approach\n→\n\\rightarrow\ngrasp\n→\n\\rightarrow\nmove\n→\n\\rightarrow\nplace); and (ii)\nAction Effectiveness\n, which evaluates the physical plausibility and dynamic coherence of the manipulation, including natural gripper closure, appropriate contact locations, and smooth trajectories. Attempts with obviously discontinuous, incomplete, or physically implausible actions are regarded as failures.\n•\nMulti-Entity Collaboration.\nFor collaborative scenes involving a Primary and a Secondary Entity, task adherence is assessed through two aspects: (i)\nTask Completion\n, requiring that both entities execute their respective roles and complete all required interaction steps in a temporally coherent and logically consistent manner; and (ii)\nAction Effectiveness\n, which measures the completeness and coordination of interaction behaviors. For contact-based interactions, a full sequence of “approach\n→\n\\rightarrow\ncontact\n→\n\\rightarrow\nrelease/transfer” is expected; for non-contact interactions (e.g., following, joint motion), a coherent process of “initiation\n→\n\\rightarrow\nalignment\n→\n\\rightarrow\nsustained coordination” is required. Missing stages, asynchronous responses, or logically inconsistent behaviors are treated as unsuccessful.\n•\nSpatial Relationship.\nIn spatial reasoning scenarios, task adherence is assessed through: (i)\nSpatial Relation Accuracy\n, which checks whether the spatial relations between entities (e.g., above/below, left/right, front/behind) match the textual description with consistent orientation, scale, and viewpoint; and (ii)\nManipulation Feasibility\n, which examines whether the direction, trajectory, and intent of the robot’s motion are compatible with the described spatial relations (e.g., moving leftward when instructed to move “to the left of”). Trajectories that contradict the described direction or result in physically unreasonable motions are considered incorrect.\n•\nVisual Reasoning.\nIn visually and semantically complex scenes, task adherence is assessed through two aspects: (i)\nVisual Reasoning Accuracy\n, evaluated via an automatic Question Chain mechanism: given the prompt, MLLM first generates a set of stepwise verification questions covering the trigger-feedback-outcome logic. The same MLLM then answers these questions based on the generated video, and a score is computed as follows:\nScore\n=\n5\n×\ncompleted questions\ntotal questions\n,\n\\text{Score}=5\\times\\frac{\\text{completed questions}}{\\text{total questions}},\n(4)\nwhere missing or incorrect events are treated as unfulfilled steps.\nThis encourages the video to satisfy both the visual and logical requirements of the task. Additionally, (ii)\nAction Effectiveness\nmeasures the physical plausibility and dynamic coherence of the robot’s motions, penalizing clearly discontinuous, incomplete, or physically implausible actions even if some high-level reasoning appears correct.\n•\nLong-Horizon Planning.\nFor long-horizon tasks composed of multiple ordered sub-events, task adherence is assessed through: (i)\nEvent Completion Rate\n. For each sample, an event list is defined as an ordered set of events. This list is reformulated into a numbered sequence, e.g.,\n1. open the refrigerator door; 2. take out the green box; 3. close the door\n, and the final score is computed as follows:\nScore\n=\n5\n×\ncompleted events\ntotal events\n,\n\\text{Score}=5\\times\\frac{\\text{completed events}}{\\text{total events}},\n(5)\nthis measures how completely the required event sequence is executed. Complementarily, (ii)\nAction Effectiveness\nagain assesses the physical plausibility and temporal coherence of the underlying motions (e.g., natural body coordination, stable landing, and smooth transitions between stages), ensuring that partially correct high-level event ordering without valid execution is not over-rewarded.\nB.3\nRobot-Subject Stability\nFigure 10\n:\nVisualization of robot structural stability.\nFigure 11\n:\nVisualization of subject appearance stability.\nIn robotics video generation, maintaining stable structure and appearance for both the robot and the manipulated objects is essential for assessing generation quality. In practice, models often exhibit abnormal changes in robot morphology or severe distortions of subject attributes. To systematically evaluate these issues, we propose the\nRobot-Subject Stability\nmetric, which separately measures the visual and semantic consistency of the robot and the target subject throughout the generation process.\nWe adopt a comparative VQA mechanism: the system simultaneously observes two frames, with the left frame as a reference image and the right frame as a generated frame, and focuses on a specified entity (e.g., the\nrobotic gripper\nor the\ntarget subject\n). The MLLM is prompted to judge how well the entity’s appearance, structure, and semantics are preserved between the two frames. Specifically, the evaluator identifies:\n•\nRobot structural stability.\nAs shown in Figure\n10\n, (a) a humanoid robot degenerates into a single-arm robot, (b) a quadruped robot morphs into a small humanoid robot, (c) a single-arm robot transforms into a humanoid robot, and (d) a parallel gripper deforms into a dexterous robotic hand. These cases reveal structural drift and inconsistency in robot embodiment over time.\n•\nSubject appearance stability.\nAs illustrated in Figure\n11\n, (a) a rectangular knitted sleeve transforms into a long-sleeve sweater, and (b) a green plastic cup on the table becomes a round yellow mug, indicating a loss of identity-preserving appearance.\nBeyond these explicit examples, we also observe a range of additional anomalies: changes in the number of robot links or arms during task execution, the spontaneous generation of extra manipulators, and unnatural variations in arm length, connectivity, or joint bending direction over time. Target objects may also undergo unrealistic material changes, such as a rigid object bending like a deformable one. The Robot-Subject Stability metric is designed to capture such inconsistencies, providing a focused measure of whether the model can preserve both robot morphology and object identity across the video sequence.\nB.4\nMotion Amplitude\nFigure 12\n:\nVisualization of robot motion amplitude.\nMotivation.\nA common failure mode in robotic video generation is that the robot remains nearly static while the generated frames appear visually smooth, as illustrated in Figure\n12\n(a)(b).\nThis makes pure smoothness-based metrics insufficient.\nFollowing the perceptual motion estimation idea introduced in VMBench\n[\n64\n]\n, a\nMotion Amplitude Score (MAS)\nis used to measure the perceptible dynamic behavior of the robot while explicitly compensating for camera motion.\nRobot Localization and Tracking.\nThe robot is first localized using GroundingDINO, and temporally stable segmentation masks are obtained via SAM2. CoTracker is then used to track a dense grid of keypoints inside the robot mask, ensuring that the estimated motion truly reflects robot articulation rather than background drift or mask leakage.\nFrame-Level Motion.\nLet\n𝐩\nt\n,\nk\n\\mathbf{p}_{t,k}\ndenote the 2D location of the\nk\nk\n-th tracked point at frame\nt\nt\n.\nThe raw frame-to-frame displacement is computed as:\nD\n¯\nt\n=\n1\nK\n​\n∑\nk\n=\n1\nK\n‖\n𝐩\nt\n,\nk\n−\n𝐩\nt\n−\n1\n,\nk\n‖\n2\n.\n\\bar{D}_{t}=\\frac{1}{K}\\sum_{k=1}^{K}\\bigl\\lVert\\mathbf{p}_{t,k}-\\mathbf{p}_{t-1,k}\\bigr\\rVert_{2}.\n(6)\nTo ensure consistency across resolutions, the motion is normalized by the video diagonal:\nD\n~\nt\n=\nD\n¯\nt\nW\n2\n+\nH\n2\n.\n\\tilde{D}_{t}=\\frac{\\bar{D}_{t}}{\\sqrt{W^{2}+H^{2}}}.\n(7)\nCamera-Motion Compensation.\nTo estimate camera-induced movement, the robot mask is inverted and the same tracking procedure is applied to the background region.\nLet\nD\n~\nt\nbg\n\\tilde{D}^{\\mathrm{bg}}_{t}\ndenote the normalized background motion.\nA\nsoft-zero\nstrategy is adopted: if the robot motion does not exceed the background motion, the small residual value is retained:\nD\n^\nt\n=\n{\nD\n~\nt\n−\nD\n~\nt\nbg\n,\nD\n~\nt\n>\nD\n~\nt\nbg\n,\nD\n~\nt\n,\nD\n~\nt\n≤\nD\n~\nt\nbg\n.\n\\hat{D}_{t}=\\begin{cases}\\tilde{D}_{t}-\\tilde{D}^{\\mathrm{bg}}_{t},&\\tilde{D}_{t}>\\tilde{D}^{\\mathrm{bg}}_{t},\\\\[4.0pt]\n\\tilde{D}_{t},&\\tilde{D}_{t}\\leq\\tilde{D}^{\\mathrm{bg}}_{t}.\\end{cases}\n(8)\nThis behavior matches our implementation and improves robustness against tracking noise or partial occlusion, while effectively treating the robot as “static”.\nFinal Score.\nFinally, following VMBench, the compensated displacement is clipped to stabilize extreme values:\nMAS\n=\n1\nT\n​\n∑\nt\n=\n1\nT\nmin\n⁡\n(\nD\n^\nt\n,\n1\n)\n.\n\\mathrm{MAS}=\\frac{1}{T}\\sum_{t=1}^{T}\\min\\bigl(\\hat{D}_{t},\\,1\\bigr).\n(9)\nDiscussion.\nMAS captures whether the robot exhibits meaningful articulation rather than merely inheriting background or camera movement.\nBy incorporating localization, mask-based tracking, background compensation, and a soft-zero strategy, MAS remains stable across scenes, tracking configurations, and robotic embodiments.\nB.5\nMotion Smoothness\nFigure 13\n:\nVisualization of robot motion smoothness.\nThis metric evaluates the temporal continuity and naturalness of motion, aiming to detect frame-level discontinuities such as low-level temporal artifacts and high-level motion blur. As illustrated in Figure\n13\n, various robot embodiments, including quadruped robots, humanoids, and single-arm manipulators, exhibit different degrees of motion-induced distortion that substantially degrade perceived video quality.\nThe assessment is based on the motion-smoothness principle introduced in VMBench\n[\n64\n]\n, with temporal consistency estimated using Q-Align aesthetic quality scores. For each video, frames are processed with a sliding window of size\nw\nw\n(default\nw\n=\n3\nw=3\n). Each window is fed into Q-Align to obtain a per-frame quality score sequence\n{\nQ\nt\n}\nt\n=\n1\nT\n\\{Q_{t}\\}_{t=1}^{T}\n. Temporal quality fluctuation is then measured by the magnitude of adjacent-frame differences:\nΔ\n​\nQ\nt\n=\n|\nQ\nt\n−\nQ\nt\n−\n1\n|\n,\nt\n=\n2\n,\n…\n,\nT\n.\n\\Delta Q_{t}=\\lvert Q_{t}-Q_{t-1}\\rvert,\\qquad t=2,\\dots,T.\n(10)\nTo ensure comparability across videos with different motion intensities, the threshold for detecting abnormal temporal variations is determined by the\nMotion Amplitude\nvalue\nm\nm\ndefined in Section\nB.4\n. A piecewise adaptive threshold function is used:\nτ\ns\n​\n(\nm\n)\n=\n{\n0.01\n,\nm\n<\n0.1\n,\n0.015\n,\n0.1\n≤\nm\n<\n0.3\n,\n0.025\n,\n0.3\n≤\nm\n<\n0.5\n,\n0.03\n,\nm\n≥\n0.5\n.\n\\tau_{s}(m)=\\begin{cases}0.01,&m<0.1,\\\\[2.0pt]\n0.015,&0.1\\leq m<0.3,\\\\[2.0pt]\n0.025,&0.3\\leq m<0.5,\\\\[2.0pt]\n0.03,&m\\geq 0.5.\\end{cases}\n(11)\nLower-motion videos therefore adopt a stricter threshold for detecting subtle temporal inconsistencies, while higher-motion videos receive a relaxed threshold to avoid penalizing naturally rapid movements. The function is determined through grid search on a validation split to ensure reproducibility.\nA frame\nt\nt\nis marked as temporally abnormal if its score fluctuation exceeds the adaptive threshold:\nI\nt\n=\n𝕀\n​\n[\nΔ\n​\nQ\nt\n>\nτ\ns\n​\n(\nm\n)\n]\n,\nI_{t}=\\mathbb{I}[\\Delta Q_{t}>\\tau_{s}(m)],\n(12)\nwhere\n𝕀\n​\n[\n⋅\n]\n\\mathbb{I}[\\cdot]\ndenotes the indicator function. To robustly capture abrupt artifacts such as frame drops or transient distortions, adjacent frames of each abnormal index are also flagged.\nThe final Motion Smoothness Score (MSS) is computed as the proportion of “normal” frames in the entire sequence:\nMSS\n=\n1\n−\n1\nT\n​\n∑\nt\n=\n2\nT\nI\nt\n.\n\\mathrm{MSS}=1-\\frac{1}{T}\\sum_{t=2}^{T}I_{t}.\n(13)\nA higher MSS indicates smoother and more temporally coherent motion, whereas videos with frequent jitter, abrupt discontinuities, or artifact-heavy transitions yield lower MSS values.\nB.6\nScore Aggregation\nWe consolidate five fine-grained evaluation signals into two final indicators,\nTask Completion\nand\nVisual Quality\n.\nNotation.\nWe denote the normalized values of the five fine-grained metrics as follows:\n(1)\nPSS\n: Physical-Semantic Plausibility,\n(2)\nTAC\n: Task-Adherence Consistency,\n(3)\nRSS\n: Robot-Subject Stability,\n(4)\nMS\n: Motion Smoothness,\n(5)\nMA\n: Motion Amplitude.\nNormalization.\nGiven a raw metric value\ns\ns\ndefined over range\n[\ns\nmin\n,\ns\nmax\n]\n[s_{\\min},s_{\\max}]\n, its normalized value is\ns\n←\nclip\n[\n0\n,\n1\n]\n​\n(\ns\n−\ns\nmin\ns\nmax\n−\ns\nmin\n)\n.\ns\\leftarrow\\mathrm{clip}_{[0,1]}\\!\\left(\\frac{s-s_{\\min}}{s_{\\max}-s_{\\min}}\\right).\n(14)\nPenalty terms.\nTwo penalty terms are used to down-weight videos with insufficient subject motion or unstable visual composition.\nMotion-amplitude penalty. Let MA denote the normalized motion amplitude. A soft penalty is applied when MA falls below the threshold\nt\nt\n:\nP\nMA\n​\n(\nMA\n)\n=\n{\n(\nt\n−\nMA\n)\n+\nδ\n,\nMA\n<\nt\nlow\n,\nt\n−\nMA\n,\nt\nlow\n≤\nMA\n<\nt\n,\n0\n,\nMA\n≥\nt\n,\nP_{\\mathrm{MA}}(\\mathrm{MA})=\\begin{cases}(t-\\mathrm{MA})+\\delta,&\\mathrm{MA}<t_{\\mathrm{low}},\\\\[3.0pt]\nt-\\mathrm{MA},&t_{\\mathrm{low}}\\leq\\mathrm{MA}<t,\\\\[3.0pt]\n0,&\\mathrm{MA}\\geq t,\\end{cases}\n(15)\nwith\nt\n=\n0.1\nt=0.1\n,\nt\nlow\n=\n0.05\nt_{\\mathrm{low}}=0.05\n, and\nδ\n=\n0.1\n\\delta=0.1\n.\nStability-consistency penalty. Robot and object level stability grades are mapped to penalty magnitudes:\np\n​\n(\ng\n)\n∈\n{\n0.2\n,\n0.4\n,\n0.6\n,\n0.8\n}\nfor grades\n​\ng\n∈\n{\nB\n,\nC\n,\nD\n,\nE\n}\n,\np(g)\\in\\{0.2,0.4,0.6,0.8\\}\\quad\\text{for grades }g\\in\\{B,C,D,E\\},\n(16)\nwhile grade A incurs zero penalty.\nLet\ng\nr\ng_{r}\nand\ng\no\ng_{o}\ndenote robot- and object-related stability grades:\nP\nRSS\n=\n{\np\n​\n(\ng\nr\n)\n+\np\n​\n(\ng\no\n)\n2\n,\nif both exist\n,\np\n​\n(\ng\nr\n)\n,\nif only\n​\ng\nr\n​\nexists\n,\n0\n,\notherwise\n.\nP_{\\mathrm{RSS}}=\\begin{cases}\\dfrac{p(g_{r})+p(g_{o})}{2},&\\text{if both exist},\\\\[6.0pt]\np(g_{r}),&\\text{if only }g_{r}\\text{ exists},\\\\[4.0pt]\n0,&\\text{otherwise}.\\end{cases}\n(17)\nFinal indicators.\nTask Completion (TC). Task correctness is computed from Physical-Semantic Plausibility (PSS) and Task-Adherence Consistency (TAC):\nTC\n=\nPSS\n+\nTAC\n2\n.\n\\mathrm{TC}=\\frac{\\mathrm{PSS}+\\mathrm{TAC}}{2}.\n(18)\nVisual Quality (VQ). Visual realism and temporal coherence are expressed as a weighted combination of RSS and MS, penalized by low motion amplitude and visual instability:\nVQ\n=\nmax\n⁡\n(\n0\n,\n0.8\n⋅\nRSS\n+\n0.2\n⋅\nMS\n−\nP\nMA\n​\n(\nMA\n)\n−\nP\nRSS\n)\n.\n\\mathrm{VQ}=\\max\\!\\Bigl(0,\\;0.8\\cdot\\mathrm{RSS}+0.2\\cdot\\mathrm{MS}-P_{\\mathrm{MA}}(\\mathrm{MA})-P_{\\mathrm{RSS}}\\Bigr).\n(19)\nModel-level aggregation.\nFor each model, TC and VQ are computed for all evaluation samples.\nThe final model score corresponds to the mean values of TC and VQ across samples,\nwhich are used for quantitative comparison and ranking in our benchmark.\nAppendix C\nModel Descriptions and Implementation Setups\nC.1\nCommercial Models\nWan 2.6.\nWan is a comprehensive family of open-source foundational video generative models built on the Diffusion Transformer architecture. It supports multiple downstream tasks including T2V, I2V, editing, inpainting, and video-to-audio. We use the official API to generate 5-second 720P videos at 30 fps.\nWan 2.5.\nWan is a comprehensive family of open-source foundational video generative models built on the Diffusion Transformer architecture. It supports multiple downstream tasks including T2V, I2V, editing, inpainting, and video-to-audio. We use the official API to generate 5-second 720P videos at 24 fps.\nHailuo.\nHailuo provides multimodal models for T2V, I2V, and T2A tasks, supporting resolutions up to 1080p and long-duration outputs with high temporal coherence. We generate 6 second videos at 1364 × 768 and 24 fps using the official Hailuo API.\nVeo3.\nVeo 3 is Google’s latest foundational video generation model supporting high-resolution (1080p), long-duration (up to 60 seconds), and audio-integrated video synthesis using a large-scale Diffusion Transformer. We use the official Veo 3 API to generate videos up to 720p, 8 seconds, and 24 fps.\nKling 2.6 pro.\nWe use the official Kling 2.6 pro model with default parameters to generate a 5-second video at 1920 × 1080 resolution and 24 fps.\nSeedance 1.0.\nSeedance 1.0 is a large-scale video generation model from ByteDance, supporting text-to-video and image-to-video generation with high aesthetic quality and temporal stability. It integrates a 3D causal VAE with a 4×16×16 compression ratio. We use the Seedance 1.0 model to generate 5-second videos at 1280 × 720 resolution and 24 fps.\nSeedance 1.5.\nSeedance 1.5 is a large-scale video generation model from ByteDance, supporting text-to-video and image-to-video generation with high aesthetic quality and temporal stability. We use the Seedance 1.5 model to generate 5-second videos at 1280 × 720 resolution and 24 fps.\nSora v1.\nWe use the official Sora v1 model with default parameters to generate a 5-second video at 1280 × 720 resolution and 30 fps.\nSora v2 Pro.\nWe use the official Sora v2 Pro model with default parameters to generate a 4-second video at 1280 × 720 resolution and 30 fps.\nC.2\nOpen-source Models\nWan2.2_A14B.\nWan2.2_A14B is an open-source large-scale video generation model that incorporates a Mixture-of-Experts (MoE) architecture. This architecture dynamically allocates specialized expert networks to enhance the model’s capacity and temporal understanding. It supports multimodal inputs (text and images) for generating open-domain videos at 1280 × 720 resolution (720P), with a typical duration of 5 seconds (120 frames) at 24 fps. Compared to its predecessors, Wan2.2_A14B demonstrates superior performance in generalizing across diverse scenes, modeling complex motions, and achieving fine-grained aesthetic control. The technical report and model weights are publicly available. We utilize the official Wan2.2_A14B model with its default parameters to generate a 5-second video (81 frames) at a spatial resolution of 1280 × 720 and a frame rate of 16 fps. The model supports both text and image inputs.\nLongCat-Video.\nLongCat-Video is an open-source foundational video generation model with 13.6B parameters, developed by the Meituan LongCat Team. It unifies text-to-video (T2V), image-to-video (I2V), and video continuation (VC) tasks within a single Diffusion Transformer (DiT) architecture, supporting efficient minute-long video generation without quality degradation. The model employs multi-reward RLHF optimization (Group Relative Policy Optimization) to enhance visual quality, motion coherence, and text alignment. We employ the official LongCat-Video model with default configurations, generating 1280 × 704 resolution videos at 15 fps using a coarse-to-fine generation strategy.\nWan2.2_5B.\nWan2.2_5B is a medium-scale model in the Wan2.2 series with 5 billion parameters, utilizing a Transformer backbone architecture. It supports multi-modal video generation from text and images, generating 5-second (121 frames) open-domain videos at 1280 × 720 and 24 fps. Model weights and documentation are fully open-sourced. We use the official Wan2.2_5B model with default settings to generate a 5-second video (120 frames) at a resolution of 1248 × 704 and 24 fps.\nWan2.1_14B.\nWan2.1_14B is an early large-parameter video generation model in the Wan series with 14 billion parameters, based on a multi-modal diffusion architecture. It generates 5-second (120-frame) open-domain videos at 1280 × 720 and 24 fps, emphasizing complex scene modeling and object motion understanding. We use the official Wan2.1_14B model with default parameters to generate a 5-second video (81 frames) at 832 × 480 resolution and 16 fps.\nHunyuanVideo.\nWe use the official HunyuanVideo model with default parameters to generate a 5-second video at 1248 × 704 resolution and 24 fps.\nHunyuanVideo 1.5.\nWe use the official HunyuanVideo 1.5 model with default parameters to generate a 5-second video at 848 × 480 resolution and 24 fps.\nSkyReels-V2.\nSkyReels-V2 is an open-source infinite-length film generative model developed by Skywork AI. It supports text-to-video, image-to-video, and video continuation tasks, with modules including SkyCaptioner-V1, multi-stage pretraining, RL for motion quality, and a diffusion forcing framework for long video synthesis. We use the official SkyReels-V2 model with default settings to generate 960 × 544 resolution videos at 24 fps for approximately 4 seconds.\nLTX-Video.\nLTX-Video is an open-source transformer-based latent diffusion model developed by Lightricks. It integrates a Video-VAE and denoising transformer with a 1:192 compression ratio using spatiotemporal downscaling, enabling efficient latent-space processing. It supports both text-to-video and image-to-video generation. We use the official LTX-Video model with default parameters to generate a 5-second video at 832 × 480 resolution and 16 fps.\nLTX-2.\nLTX-2 is an open-source transformer-based latent diffusion model. We use the official LTX-2 model with default parameters to generate a 5-second video at 1536 × 1024 resolution and 24 fps.\nFramePack.\nFramePack is a neural structure for next-frame prediction designed to avoid forgetting and drifting in video generation. It compresses input frames by importance to maintain a fixed transformer context, enabling long video synthesis with low computational cost. It supports T2V and I2V and can be integrated with models such as HunyuanVideo or Wan. We employ FramePack with a base model to generate 5-second videos at 832 × 480 resolution.\nCogVideoX.\nCogVideoX is an open-source text-to-video generation model employing a diffusion transformer and a 3D VAE. It introduces expert-adaptive LayerNorm and multi-resolution frame packing to enhance motion consistency. It produces up to 10-second videos at 720 × 1280 and 16 fps.\nWe use the official CogVideoX weights and inference scripts with default settings to generate 6-second videos (160 frames) at 720 × 480 and 8 fps.\nC.3\nRobotics-specific Models\nCosmos 2.5.\nCosmos-Predict2.5 and Cosmos-Transfer2.5 are NVIDIA’s world simulation foundation models for physical AI, supporting Text2World, Image2World, and Video2World simulations with flow-based architectures.\nWe generate videos at 1280 × 720 resolution and 16 fps using official NVIDIA codebase.\nDreamGen (GR).\nGRL is DreamGen’s generalizable robot learner model integrating synthetic neural trajectories and real teleoperation data for policy learning. We generate all trajectory videos at 768 × 432 resolution and 16 fps.\nDreamGen (DROID).\nDROID is a dynamics-aware imitation learning model using video diffusion with inverse dynamics modeling for realistic physical trajectories.\nWe generate all videos at up to 768 × 432 resolution and 16 fps.\nUnifoLM-WMA-0.\nUnifoLM-WMA-0 integrates video world modeling and action policy learning for generalizable robotic reasoning and control.\nWe generate videos up to 320 × 512 resolution, 30 fps.\nVidar.\nVidar is an embodied video diffusion model designed for robotic manipulation, integrating a strong video diffusion prior and a Masked Inverse Dynamics Model (MIDM).\nVidar generates 4-second multi-view interactive videos at 704 × 480 resolution and 15 fps with automatically annotated action trajectories.\nAppendix D\nHuman Preference Study Details\nFigure 14\n:\nVisualization of the Questionnaire for User Study\nTo complement the main paper’s human preference analysis, this section provides additional statistical examinations that further characterize the agreement between human judgments and our automatic benchmark. The questionnaire used in our human preference study is shown in Figure\n14\n. As described in the main paper, thirty participants compared pairs of generated videos for the same prompt and selected the better one (or \"Tie\"). These votes were converted into per-model human scores using the\n5\n/\n3\n/\n1\n5/3/1\nwin-tie-loss scheme, and the resulting model-level ranking exhibited a strong correlation with RBench (\nρ\n=\n0.96\n\\rho=0.96\n).\nWhile rank correlation quantifies the consistency of\nordering\n, it does not measure whether the two scoring methods agree in an\nabsolute\nsense (i.e., whether they assign comparable magnitudes). To assess this complementary notion of agreement, we conduct a Bland-Altman analysis between human scores and benchmark scores. Because the two score scales may differ by a systematic offset or slope, we additionally apply a leave-one-out (LOO) linear calibration to correct for potential scale mismatch without overfitting. The following subsections detail the calibration procedure, Bland-Altman computation, accompanying figures, and per-model statistics.\nFigure 15\n:\nBland–Altman plot after linear leave-one-out calibration (\nH\n∗\nH^{\\ast}\n).\nPoints are models; x-axis\nm\ni\n=\nB\ni\n+\nH\ni\n∗\n2\nm_{i}=\\tfrac{B_{i}+H_{i}^{\\ast}}{2}\n, y-axis\nd\ni\n=\nB\ni\n−\nH\ni\n∗\nd_{i}=B_{i}-H_{i}^{\\ast}\n.\nThe solid line indicates the bias (\nd\n¯\n\\bar{d}\n); dashed lines show the 95% limits of agreement (LoA).\nIn our study the legend reports\nBias\n=\n0.002\n\\text{Bias}=0.002\nand\nLoA\n=\n[\n−\n0.108\n,\n0.112\n]\n\\text{LoA}=[-0.108,\\,0.112]\n.\nBland–Altman basics.\nBland–Altman analysis assesses\nagreement\nbetween two measurement methods by plotting, for each item\ni\ni\n, the difference\nd\ni\n=\nB\ni\n−\nH\ni\nd_{i}=B_{i}-H_{i}\nagainst the mean\nm\ni\n=\nB\ni\n+\nH\ni\n2\nm_{i}=\\tfrac{B_{i}+H_{i}}{2}\n, where\nH\nH\nand\nB\nB\ndenote human and automatic scores, respectively.\nAs shown in Fig.\n15\n, the horizontal solid line represents the\nbias\nd\n¯\n=\n1\nn\n​\n∑\ni\nd\ni\n\\bar{d}=\\tfrac{1}{n}\\sum_{i}d_{i}\n(average difference).\nThe dashed lines denote the\n95% limits of agreement (LoA)\n:\nd\n¯\n±\n1.96\n​\ns\nd\n\\bar{d}\\pm 1.96\\,s_{d}\n, where\ns\nd\ns_{d}\nis the standard deviation of the differences.\nNarrower LoA and small bias indicate stronger agreement beyond mere correlation.\nLinear LOO calibration.\nHuman and automatic scores can exhibit\nscale\nmismatch.\nTo mitigate such systematic differences, we apply a\nleave-one-out (LOO) linear calibration\nto the benchmark.\nMathematical formulation.\nLet\n{\n(\nB\ni\n,\nH\ni\n)\n}\ni\n=\n1\nn\n\\{(B_{i},H_{i})\\}_{i=1}^{n}\nbe the automatic benchmark and human scores for\nn\nn\nmodels.\nFor each\ni\n∈\n{\n1\n,\n…\n,\nn\n}\ni\\in\\{1,\\dots,n\\}\n, define the training index set\nS\n−\ni\n=\n{\nj\n:\nj\n≠\ni\n}\nS_{-i}=\\{j:\\,j\\neq i\\}\nand estimate the OLS (Ordinary Least Squares) calibration parameters by\n(\nα\n^\n−\ni\n,\nβ\n^\n−\ni\n)\n=\narg\n⁡\nmin\nα\n,\nβ\n​\n∑\nj\n∈\nS\n−\ni\n(\nB\nj\n−\nα\n−\nβ\n​\nH\nj\n)\n2\n.\n(\\hat{\\alpha}_{-i},\\hat{\\beta}_{-i})\\penalty 10000\\ =\\penalty 10000\\ \\arg\\min_{\\alpha,\\beta}\\sum_{j\\in S_{-i}}\\bigl(B_{j}-\\alpha-\\beta H_{j}\\bigr)^{2}.\n(20)\nThe calibrated (benchmark-aligned) score for model\ni\ni\nis\nH\ni\n∗\n=\nα\n^\n−\ni\n+\nβ\n^\n−\ni\n​\nB\ni\n.\nH_{i}^{\\ast}\\;=\\;\\hat{\\alpha}_{-i}+\\hat{\\beta}_{-i}\\,B_{i}.\n(21)\nBland–Altman with calibrated scores.\nWe then perform Bland–Altman analysis on\n(\nB\n,\nH\n∗\n)\n(B,H^{\\ast})\nby computing, for each\ni\ni\n,\nd\ni\n=\nB\ni\n−\nH\ni\n∗\n,\nm\ni\n=\nB\ni\n+\nH\ni\n∗\n2\n.\nd_{i}\\;=\\;B_{i}-H_{i}^{\\ast},\\qquad m_{i}\\;=\\;\\tfrac{B_{i}+H_{i}^{\\ast}}{2}.\n(22)\nThe bias\nd\n¯\n\\bar{d}\nand the 95% LoA\nd\n¯\n±\n1.96\n​\ns\nd\n\\bar{d}\\pm 1.96\\,s_{d}\nare computed from\n{\nd\ni\n}\ni\n=\n1\nn\n\\{d_{i}\\}_{i=1}^{n}\nas in the basics above.\nFigure\n15\nshows the Bland-Altman plot after linear LOO calibration, with the bias and LoA reported in the legend.\nTable\n5\nlists, for each model, the mean\nm\ni\nm_{i}\n, the difference\nd\ni\nd_{i}\n, and the corresponding LOO calibration parameters\nα\n^\n−\ni\n\\hat{\\alpha}_{-i}\nand\nβ\n^\n−\ni\n\\hat{\\beta}_{-i}\nused to obtain\nH\ni\n∗\nH_{i}^{\\ast}\n.\nAs a complement to the correlation analysis (Spearman\nρ\n=\n0.96\n\\rho=0.96\nbetween human scores and the automatic benchmark), the Bland-Altman view quantifies absolute agreement: the small bias and tight LoA indicate that the calibrated benchmark scores are in close agreement with human judgments.\nModel\nmean\n​\n(\nB\n,\nH\n∗\n)\n\\mathrm{mean}(B,H^{\\ast})\ndiff\n​\n(\nB\n−\nH\n∗\n)\n\\mathrm{diff}(B-H^{\\ast})\nα\nLOO\n\\alpha_{\\mathrm{LOO}}\nβ\nLOO\n\\beta_{\\mathrm{LOO}}\nLTX-Video\n0.295\n0.098\n0.141\n0.613\nHailuo\n0.539\n0.052\n0.205\n0.496\nSeedance 1.0\n0.528\n0.046\n0.203\n0.500\nVeo 3\n0.551\n0.024\n0.204\n0.503\nWan2.1 14b\n0.388\n0.021\n0.193\n0.524\nWan2.5\n0.571\n-0.003\n0.199\n0.517\nCosmos2.5\n0.482\n-0.036\n0.200\n0.523\nLongCat-Video\n0.458\n-0.043\n0.202\n0.520\nDreamgen\n0.451\n-0.062\n0.203\n0.522\nCogvideox-5B\n0.295\n-0.077\n0.242\n0.446\nTable 5\n:\nBland–Altman statistics after linear LOO calibration.\nm\ni\n=\nB\ni\n+\nH\ni\n∗\n2\nm_{i}=\\tfrac{B_{i}+H_{i}^{\\ast}}{2}\n,\nd\ni\n=\nB\ni\n−\nH\ni\n∗\nd_{i}=B_{i}-H_{i}^{\\ast}\n.\nα\nLOO\n\\alpha_{\\mathrm{LOO}}\nand\nβ\nLOO\n\\beta_{\\mathrm{LOO}}\nare the intercept and slope learned from all\nother\nmodels when calibrating\nH\ni\n∗\nH_{i}^{\\ast}\n.\nAll values are rounded to three decimals.\nAppendix E\nPrompt Template\nThis section introduces the prompt design used for the Visual Reasoning task in our MLLM-based evaluation pipeline. Among all tasks, Visual Reasoning involves the most structured form of reasoning and thus provides a representative example for illustrating our prompt design. We provide the MLLM with essential contextual information recorded during dataset construction, including the video viewpoint, a high-level content description, and the identities of the robotic manipulator and manipulated object. This background knowledge serves as the foundation for the model’s subsequent reasoning and scoring process.\nUnlike other tasks, Visual Reasoning requires explicit verification of logical dependencies between robot actions. Therefore, it adopts a two-part structure consisting of a question-chain constructor and a video assessment prompt. The full templates are shown below.\nFigure 16\n:\nQuestion-chain construction for Visual Reasoning.\nThis component analyzes the original instruction and transforms it into a sequence of binary verification questions that define causal and temporal dependencies in the robot’s intended actions.\nQuestion-chain construction.\nThe first component converts the original text instruction into a sequence of binary verification questions (Figure\n16\n).\nThe model analyzes the semantics of the instruction and generates a short chain of stepwise questions that reflect the intended causal and temporal structure of the robot’s behavior.\nThis question chain acts as an explicit reasoning scaffold and is subsequently fed into the main evaluation prompt.\nFigure 17\n:\nVisual Reasoning evaluation prompt (Part I).\nThe first part of the evaluation prompt integrates the structured reasoning chain with contextual information extracted during dataset construction.\nFigure 18\n:\nVisual Reasoning evaluation prompt (Part II).\nThe second part specifies the structured scoring protocol and the JSON output format used to ensure consistent and interpretable evaluation results.\nVideo assessment prompt.\nThe second component integrates the generated question chain with a 3×2 grid of chronologically ordered frames extracted from the video (Figures\n17\nand\n18\n).\nIt also incorporates the contextual background information provided at the beginning—namely, the view perspective, video content summary, robotic manipulator type, and manipulated object identity.\nWith these inputs, the prompt instructs the model to determine whether each reasoning step has been successfully completed and to evaluate the stability, consistency, and physical plausibility of the robot and objects throughout the sequence.\nA strict scoring protocol and a structured JSON output format ensure reproducible and interpretable evaluation across models.\nAppendix F\nAdditional Qualitative Comparisons\nThis section provides supplementary qualitative results that extend the \"Qualitative Comparison Across Representative Tasks\" analysis presented in the main paper. For each of the five task categories in RBench, namely Common Manipulation, Long-Horizon Planning, Multi-Entity Collaboration, Spatial Relationship, and Visual Reasoning, we select two representative cases and visualize the generated videos from ten state-of-the-art image-to-video (I2V) models. As shown in Figures\n19\n,\n20\n,\n21\n,\n22\n,\n23\n, these examples offer a more detailed inspection of model behaviors under diverse embodied scenarios, complementing the quantitative results discussed in the main text.\nFigure 19\n:\nVisualization of Common Manipulation.\nThe first row contains the reference image, and the accompanying text shows the input prompt.\nFigure 20\n:\nVisualization of Long-Horizon Planning.\nThe first row contains the reference image, and the accompanying text shows the input prompt.\nFigure 21\n:\nVisualization of Multi-Entity Collaboration.\nThe first row contains the reference image, and the accompanying text shows the input prompt.\nFigure 22\n:\nVisualization of Spatial Relationship.\nThe first row contains the reference image, and the accompanying text shows the input prompt.\nFigure 23\n:\nVisualization of Visual Reasoning.\nThe first row contains the reference image, and the accompanying text shows the input prompt.\nAppendix G\nComprehensive Quantitative Results\nThis section presents the complete quantitative evaluation results obtained from both GPT-based and Qwen-based evaluators. We report detailed per-model scores across all five tasks (Common Manipulation, Long-Horizon Planning, Multi-Entity Collaboration, Spatial Relationship, and Visual Reasoning) and four robot embodiments (Dual Arm, Humanoid, Single Arm, and Quadruped).\nTo ensure clarity and readability, we summarize below the abbreviations used in all tables. For task-level metrics, each abbreviation corresponds to a specific VQA-style prompt used in our MLLM-based evaluation; the construction of these prompts and the computation of the total score (\nTS\n) are illustrated with representative example in Section\nE\n. The robot-level metrics are defined in Section\nB\n.\nTask-level Metrics (per-task evaluation):\n•\nAES\n: Action Execution Score\n•\nTCS\n: Task Completion Score\n•\nOCS\n: Object Consistency Score\n•\nRCS\n: Robot Consistency Score\n•\nPSS\n: Physical Semantic Score\n•\nECR\n: Event Completion Ratio\n•\nECS\n: Entity Consistency Score\n•\nACS\n: Action Coordination Score\n•\nSRS\n: Spatial Relation Score\n•\nMFS\n: Manipulation Feasibility Score\n•\nVRS\n: Visual Reasoning Score\n•\nTS\n: Total Score\nRobot-level Metrics (per-robot embodiment evaluation):\n•\nPSS\n: Physical Semantic Score\n•\nTAC\n: Task-Adherence Consistency\n•\nRSS\n: Robot–Subject Stability\n•\nMSS\n: Motion Smoothness Score\n•\nMAS\n: Motion Amplitude Score\n•\nTC\n: Task Completion\n•\nVQ\n: Visual Quality\n•\nTS\n: Total Score\nThe following tables report the complete results for all models evaluated using both GPT and Qwen.\nAs shown in Table\n7\n, Table\n7\n,\nTable\n9\n, Table\n9\n, and\nTable\n11\n, the GPT-based evaluator provides assessments across\nfive tasks.\nSimilarly, the Qwen-based results are presented in\nTable\n15\n, Table\n17\n,\nTable\n17\n, Table\n19\n, and\nTable\n19\n.\nFor completeness, we also provide per-embodiment results. The detailed evaluation tables for\ndual-arm, humanoid, single-arm, and quadruped robots under GPT are shown in\nTable\n11\n, Table\n13\n,\nTable\n13\n, and Table\n15\n.\nThe corresponding Qwen-based tables are provided in\nTable\n21\n, Table\n21\n,\nTable\n23\n, and Table\n23\n.\nTable 6\n:\nResults on Common Manipulation with GPT\nModel\nAES\nTCS\nOCS\nRCS\nPSS\nTS\nOpen-source\nWan2.2_A14B\n0.479\n0.410\n0.635\n0.765\n0.520\n0.381\nHunyuanVideo 1.5\n0.505\n0.480\n0.575\n0.695\n0.490\n0.442\nLongCat-Video\n0.469\n0.408\n0.591\n0.739\n0.510\n0.371\nWan2.1_14B\n0.446\n0.375\n0.552\n0.692\n0.510\n0.344\nLTX-2\n0.340\n0.330\n0.515\n0.620\n0.380\n0.284\nWan2.2_5B\n0.416\n0.395\n0.540\n0.670\n0.495\n0.331\nSkyreels\n0.348\n0.230\n0.545\n0.740\n0.465\n0.202\nLTX-Video\n0.414\n0.307\n0.552\n0.718\n0.484\n0.302\nFramePack\n0.346\n0.188\n0.637\n0.739\n0.556\n0.205\nHunyuanVideo\n0.307\n0.190\n0.660\n0.755\n0.545\n0.177\nCogVideoX-5B\n0.245\n0.140\n0.490\n0.635\n0.335\n0.115\nClosed-source\nWan 2.6\n0.581\n0.596\n0.637\n0.750\n0.668\n0.545\nSeedance 1.5 pro\n0.654\n0.642\n0.591\n0.750\n0.556\n0.576\nWan 2.5\n0.565\n0.600\n0.635\n0.770\n0.605\n0.527\nHailuo v2\n0.576\n0.625\n0.625\n0.745\n0.595\n0.559\nVeo 3\n0.572\n0.602\n0.607\n0.729\n0.540\n0.520\nSeedance 1.0\n0.591\n0.590\n0.640\n0.730\n0.620\n0.542\nKling 2.6 pro\n0.561\n0.565\n0.610\n0.760\n0.590\n0.528\nSora v2 Pro\n0.354\n0.229\n0.637\n0.719\n0.561\n0.207\nSora v1\n0.280\n0.170\n0.445\n0.605\n0.360\n0.151\nRobotics-specific\nCosmos 2.5\n0.495\n0.370\n0.585\n0.705\n0.505\n0.358\nDreamGen(gr1)\n0.420\n0.341\n0.566\n0.683\n0.469\n0.311\nDreamGen(droid)\n0.420\n0.369\n0.604\n0.640\n0.421\n0.358\nVidar\n0.180\n0.090\n0.430\n0.470\n0.310\n0.073\nUnifoLM-WMA-0\n0.105\n0.045\n0.400\n0.300\n0.220\n0.036\nMean\n0.427\n0.371\n0.572\n0.685\n0.492\n0.338\nTable 7\n:\nResults on Long-Horizon Planning with GPT\nModel\nAES\nECR\nOCS\nRCS\nPSS\nTS\nOpen-source\nWan2.2_A14B\n0.569\n0.626\n0.715\n0.722\n0.590\n0.500\nHunyuanVideo 1.5\n0.537\n0.527\n0.606\n0.725\n0.537\n0.437\nLongCat-Video\n0.507\n0.485\n0.598\n0.742\n0.598\n0.384\nWan2.1_14B\n0.482\n0.404\n0.589\n0.687\n0.553\n0.335\nLTX-2\n0.485\n0.446\n0.566\n0.676\n0.529\n0.386\nWan2.2_5B\n0.444\n0.517\n0.601\n0.666\n0.425\n0.317\nSkyreels\n0.394\n0.311\n0.673\n0.740\n0.500\n0.253\nLTX-Video\n0.433\n0.347\n0.566\n0.633\n0.458\n0.279\nFramePack\n0.301\n0.145\n0.655\n0.732\n0.560\n0.168\nHunyuanVideo\n0.241\n0.101\n0.651\n0.714\n0.553\n0.147\nCogVideoX-5B\n0.301\n0.223\n0.543\n0.629\n0.448\n0.212\nClosed-source\nWan 2.6\n0.640\n0.545\n0.701\n0.743\n0.634\n0.514\nSeedance 1.5 pro\n0.638\n0.710\n0.677\n0.763\n0.625\n0.569\nWan 2.5\n0.603\n0.519\n0.743\n0.737\n0.615\n0.495\nHailuo v2\n0.600\n0.677\n0.725\n0.706\n0.637\n0.544\nVeo 3\n0.608\n0.681\n0.709\n0.729\n0.641\n0.530\nSeedance 1.0\n0.606\n0.603\n0.712\n0.727\n0.628\n0.454\nKling 2.6 pro\n0.618\n0.685\n0.710\n0.750\n0.697\n0.530\nSora v2 Pro\n0.422\n0.296\n0.646\n0.715\n0.603\n0.255\nSora v1\n0.250\n0.133\n0.629\n0.689\n0.543\n0.166\nRobotics-specific\nCosmos 2.5\n0.568\n0.556\n0.706\n0.656\n0.593\n0.495\nDreamGen(gr1)\n0.444\n0.284\n0.750\n0.731\n0.611\n0.333\nDreamGen(droid)\n0.491\n0.505\n0.655\n0.637\n0.517\n0.316\nVidar\n0.108\n-0.023\n0.550\n0.491\n0.375\n0.054\nUnifoLM-WMA-0\n0.037\n0.026\n0.398\n0.175\n0.120\n0.061\nMean\n0.453\n0.413\n0.643\n0.677\n0.544\n0.349\nTable 8\n:\nResults on Multi-Entity Collaboration with GPT\nModel\nACS\nTCS\nECS\nOCS\nPSS\nTS\nOpen-source\nWan2.2_A14B\n0.351\n0.441\n0.712\n0.632\n0.654\n0.373\nHunyuanVideo 1.5\n0.301\n0.375\n0.687\n0.625\n0.585\n0.311\nLongCat-Video\n0.190\n0.244\n0.696\n0.642\n0.654\n0.220\nWan2.1_14B\n0.261\n0.318\n0.693\n0.545\n0.551\n0.282\nLTX-2\n0.243\n0.289\n0.651\n0.572\n0.578\n0.233\nWan2.2_5B\n0.125\n0.181\n0.687\n0.568\n0.537\n0.141\nSkyreels\n0.189\n0.195\n0.695\n0.664\n0.621\n0.203\nLTX-Video\n0.207\n0.255\n0.686\n0.574\n0.563\n0.209\nFramePack\n0.186\n0.186\n0.709\n0.598\n0.529\n0.173\nHunyuanVideo\n0.100\n0.100\n0.672\n0.683\n0.650\n0.107\nCogVideoX-5B\n0.128\n0.113\n0.630\n0.482\n0.440\n0.098\nClosed-source\nWan 2.6\n0.443\n0.541\n0.738\n0.708\n0.654\n0.478\nSeedance 1.5 pro\n0.456\n0.591\n0.743\n0.689\n0.689\n0.483\nWan 2.5\n0.392\n0.453\n0.750\n0.633\n0.662\n0.401\nHailuo v2\n0.378\n0.422\n0.744\n0.678\n0.619\n0.385\nVeo 3\n0.450\n0.432\n0.731\n0.737\n0.621\n0.430\nSeedance 1.0\n0.422\n0.488\n0.750\n0.702\n0.696\n0.447\nKling 2.6 pro\n0.357\n0.392\n0.738\n0.698\n0.676\n0.364\nSora v2 Pro\n0.155\n0.191\n0.733\n0.558\n0.591\n0.186\nSora v1\n0.128\n0.107\n0.595\n0.494\n0.523\n0.111\nRobotics-specific\nCosmos 2.5\n0.203\n0.244\n0.727\n0.659\n0.670\n0.201\nDreamGen(gr1)\n0.262\n0.347\n0.707\n0.664\n0.628\n0.296\nDreamGen(droid)\n0.211\n0.260\n0.657\n0.548\n0.548\n0.214\nVidar\n0.056\n0.062\n0.454\n0.431\n0.329\n0.049\nUnifoLM-WMA-0\n0.017\n0.034\n0.392\n0.301\n0.295\n0.018\nMean\n0.248\n0.290\n0.679\n0.603\n0.583\n0.256\nTable 9\n:\nResults on Spatial Relationship with GPT\nModel\nSRS\nMFS\nOCS\nRCS\nPSS\nTS\nOpen-source\nWan2.2_A14B\n0.604\n0.596\n0.709\n0.758\n0.669\n0.454\nHunyuanVideo 1.5\n0.370\n0.344\n0.629\n0.750\n0.534\n0.315\nLongCat-Video\n0.390\n0.375\n0.679\n0.734\n0.648\n0.310\nWan2.1_14B\n0.316\n0.338\n0.669\n0.713\n0.610\n0.267\nLTX-2\n0.401\n0.383\n0.616\n0.687\n0.562\n0.304\nWan2.2_5B\n0.441\n0.389\n0.602\n0.705\n0.485\n0.312\nSkyreels\n0.388\n0.416\n0.601\n0.685\n0.574\n0.276\nLTX-Video\n0.224\n0.215\n0.612\n0.681\n0.491\n0.176\nFramePack\n0.364\n0.321\n0.628\n0.742\n0.557\n0.257\nHunyuanVideo\n0.163\n0.192\n0.605\n0.740\n0.586\n0.179\nCogVideoX-5B\n0.193\n0.241\n0.451\n0.653\n0.370\n0.111\nClosed-source\nWan 2.6\n0.787\n0.704\n0.719\n0.734\n0.734\n0.655\nSeedance 1.5 pro\n0.675\n0.608\n0.700\n0.716\n0.666\n0.494\nWan 2.5\n0.750\n0.598\n0.757\n0.750\n0.674\n0.576\nHailuo v2\n0.764\n0.654\n0.742\n0.750\n0.720\n0.636\nVeo 3\n0.601\n0.553\n0.726\n0.767\n0.684\n0.508\nSeedance 1.0\n0.484\n0.445\n0.710\n0.742\n0.679\n0.425\nKling 2.6 pro\n0.757\n0.681\n0.727\n0.757\n0.696\n0.598\nSora v2 Pro\n0.392\n0.392\n0.654\n0.714\n0.571\n0.267\nSora v1\n0.351\n0.305\n0.546\n0.583\n0.481\n0.223\nRobotics-specific\nCosmos 2.5\n0.419\n0.395\n0.661\n0.693\n0.620\n0.338\nDreamGen(gr1)\n0.467\n0.411\n0.677\n0.725\n0.677\n0.371\nDreamGen(droid)\n0.400\n0.433\n0.625\n0.691\n0.591\n0.348\nVidar\n0.163\n0.250\n0.517\n0.500\n0.405\n0.105\nUnifoLM-WMA-0\n0.065\n0.141\n0.445\n0.532\n0.315\n0.040\nMean\n0.437\n0.415\n0.640\n0.700\n0.584\n0.342\nTable 10\n:\nResults on Visual Reasoning with GPT\nModel\nAES\nVRS\nOCS\nRCS\nPSS\nTS\nOpen-source\nWan2.2_A14B\n0.424\n0.401\n0.651\n0.709\n0.552\n0.330\nHunyuanVideo 1.5\n0.453\n0.456\n0.604\n0.709\n0.447\n0.364\nLongCat-Video\n0.271\n0.211\n0.559\n0.722\n0.516\n0.186\nWan2.1_14B\n0.250\n0.263\n0.565\n0.646\n0.429\n0.204\nLTX-2\n0.267\n0.224\n0.500\n0.610\n0.360\n0.163\nWan2.2_5B\n0.283\n0.304\n0.583\n0.700\n0.438\n0.233\nSkyreels\n0.290\n0.267\n0.587\n0.668\n0.447\n0.233\nLTX-Video\n0.283\n0.287\n0.644\n0.688\n0.516\n0.241\nFramePack\n0.243\n0.203\n0.570\n0.743\n0.397\n0.169\nHunyuanVideo\n0.096\n0.058\n0.647\n0.744\n0.522\n0.035\nCogVideoX-5B\n0.136\n0.120\n0.428\n0.577\n0.261\n0.079\nClosed-source\nWan 2.6\n0.544\n0.622\n0.700\n0.733\n0.605\n0.530\nSeedance 1.5 pro\n0.494\n0.570\n0.635\n0.701\n0.570\n0.470\nWan 2.5\n0.482\n0.488\n0.693\n0.732\n0.539\n0.437\nHailuo v2\n0.511\n0.541\n0.666\n0.727\n0.566\n0.473\nVeo 3\n0.511\n0.610\n0.633\n0.711\n0.577\n0.504\nSeedance 1.0\n0.505\n0.505\n0.705\n0.733\n0.644\n0.441\nKling 2.6 pro\n0.477\n0.410\n0.627\n0.733\n0.555\n0.357\nSora v2 Pro\n0.193\n0.159\n0.642\n0.738\n0.556\n0.115\nSora v1\n0.219\n0.158\n0.475\n0.646\n0.250\n0.139\nRobotics-specific\nCosmos 2.5\n0.482\n0.493\n0.664\n0.744\n0.590\n0.399\nDreamGen(gr1)\n0.317\n0.262\n0.652\n0.743\n0.585\n0.215\nDreamGen(droid)\n0.412\n0.401\n0.616\n0.738\n0.529\n0.338\nVidar\n0.090\n0.050\n0.556\n0.659\n0.431\n0.050\nUnifoLM-WMA-0\n0.017\n-0.056\n0.062\n0.306\n0.176\n0.000\nMean\n0.330\n0.320\n0.587\n0.686\n0.482\n0.268\nTable 11\n:\nResults on Dual Arm with GPT\nModel\nPSS\nTAC\nRSS\nMS\nMA\nTC\nVQ\nTS\nOpen-source\nWan2.2_A14B\n0.638\n0.570\n0.764\n0.915\n0.204\n0.604\n0.561\n0.582\nHunyuanVideo 1.5\n0.612\n0.622\n0.649\n0.951\n0.370\n0.618\n0.434\n0.526\nLongCat-Video\n0.620\n0.540\n0.771\n0.937\n0.244\n0.580\n0.572\n0.576\nWan2.1_14B\n0.600\n0.540\n0.650\n0.850\n0.261\n0.570\n0.424\n0.497\nLTX-2\n0.488\n0.415\n0.637\n0.848\n0.378\n0.451\n0.396\n0.423\nWan2.2_5B\n0.575\n0.498\n0.606\n0.940\n0.269\n0.536\n0.360\n0.448\nSkyreels\n0.598\n0.498\n0.658\n0.884\n0.252\n0.548\n0.406\n0.477\nLTX-Video\n0.530\n0.442\n0.698\n0.812\n0.143\n0.486\n0.425\n0.455\nFramePack\n0.550\n0.395\n0.712\n0.885\n0.103\n0.472\n0.457\n0.464\nHunyuanVideo\n0.510\n0.280\n0.794\n0.959\n0.107\n0.395\n0.564\n0.479\nCogVideoX-5B\n0.480\n0.358\n0.638\n0.752\n0.143\n0.419\n0.352\n0.385\nClosed-source\nWan 2.6\n0.655\n0.708\n0.819\n0.984\n0.333\n0.681\n0.680\n0.680\nSeedance 1.5 pro\n0.668\n0.800\n0.721\n0.960\n0.399\n0.734\n0.547\n0.640\nWan 2.5\n0.670\n0.740\n0.758\n0.970\n0.347\n0.705\n0.563\n0.633\nHailuo v2\n0.658\n0.720\n0.751\n0.983\n0.312\n0.689\n0.534\n0.611\nVeo 3\n0.665\n0.682\n0.711\n0.973\n0.262\n0.674\n0.546\n0.610\nSeedance 1.0\n0.668\n0.648\n0.801\n0.972\n0.294\n0.658\n0.623\n0.640\nKling 2.6 pro\n0.672\n0.615\n0.770\n0.965\n0.210\n0.644\n0.567\n0.605\nSora v2 Pro\n0.565\n0.364\n0.776\n0.950\n0.272\n0.465\n0.560\n0.512\nSora v1\n0.422\n0.312\n0.531\n0.880\n0.210\n0.368\n0.279\n0.323\nRobotics-specific\nCosmos 2.5\n0.665\n0.575\n0.746\n0.930\n0.127\n0.620\n0.500\n0.560\nDreamGen(gr1)\n0.630\n0.492\n0.779\n0.939\n0.123\n0.561\n0.503\n0.532\nDreamGen(droid)\n0.610\n0.542\n0.668\n0.863\n0.201\n0.576\n0.375\n0.475\nVidar\n0.450\n0.238\n0.781\n0.933\n0.025\n0.344\n0.475\n0.409\nUnifoLM-WMA-0\n0.348\n0.252\n0.348\n0.497\n0.120\n0.300\n0.089\n0.194\nMean\n0.581\n0.513\n0.701\n0.901\n0.228\n0.547\n0.471\n0.509\nTable 12\n:\nResults on Humanoid with GPT\nModel\nPSS\nTAC\nRSS\nMS\nMA\nTC\nVQ\nTS\nOpen-source\nWan2.2_A14B\n0.678\n0.748\n0.787\n0.966\n0.105\n0.712\n0.584\n0.647\nHunyuanVideo 1.5\n0.660\n0.800\n0.703\n0.922\n0.206\n0.730\n0.460\n0.595\nLongCat-Video\n0.652\n0.668\n0.801\n0.969\n0.089\n0.660\n0.583\n0.621\nWan2.1_14B\n0.635\n0.660\n0.765\n0.938\n0.167\n0.648\n0.550\n0.599\nLTX-2\n0.622\n0.608\n0.736\n0.880\n0.231\n0.615\n0.495\n0.554\nWan2.2_5B\n0.668\n0.695\n0.755\n0.963\n0.152\n0.681\n0.533\n0.607\nSkyreels\n0.610\n0.598\n0.725\n0.808\n0.086\n0.604\n0.414\n0.509\nLTX-Video\n0.602\n0.630\n0.671\n0.628\n0.050\n0.616\n0.312\n0.463\nFramePack\n0.598\n0.572\n0.776\n0.864\n0.069\n0.585\n0.511\n0.548\nHunyuanVideo\n0.595\n0.465\n0.763\n0.933\n0.096\n0.530\n0.517\n0.523\nCogVideoX-5B\n0.570\n0.565\n0.698\n0.647\n0.127\n0.568\n0.424\n0.496\nClosed-source\nWan 2.6\n0.665\n0.818\n0.794\n0.980\n0.132\n0.741\n0.593\n0.667\nSeedance 1.5 pro\n0.682\n0.838\n0.793\n0.955\n0.158\n0.760\n0.623\n0.691\nWan 2.5\n0.698\n0.782\n0.779\n0.981\n0.122\n0.740\n0.568\n0.653\nHailuo v2\n0.682\n0.815\n0.741\n0.970\n0.133\n0.749\n0.521\n0.635\nVeo 3\n0.655\n0.785\n0.776\n0.968\n0.132\n0.720\n0.554\n0.637\nSeedance 1.0\n0.675\n0.752\n0.833\n0.964\n0.166\n0.714\n0.658\n0.686\nKling 2.6 pro\n0.672\n0.762\n0.750\n0.959\n0.113\n0.718\n0.508\n0.613\nSora v2 Pro\n0.638\n0.565\n0.774\n0.936\n0.085\n0.602\n0.520\n0.561\nSora v1\n0.542\n0.450\n0.597\n0.900\n0.216\n0.496\n0.342\n0.419\nRobotics-specific\nCosmos 2.5\n0.650\n0.720\n0.797\n0.925\n0.071\n0.685\n0.566\n0.625\nDreamGen(gr1)\n0.652\n0.595\n0.781\n0.885\n0.079\n0.624\n0.526\n0.575\nDreamGen(droid)\n0.620\n0.700\n0.704\n0.843\n0.137\n0.660\n0.453\n0.556\nVidar\n0.445\n0.298\n0.694\n0.855\n0.025\n0.371\n0.343\n0.357\nUnifoLM-WMA-0\n0.270\n0.282\n0.386\n0.512\n0.112\n0.276\n0.125\n0.200\nMean\n0.617\n0.646\n0.735\n0.886\n0.122\n0.632\n0.491\n0.561\nTable 13\n:\nResults on Single Arm with GPT\nModel\nPSS\nTAC\nRSS\nMS\nMA\nTC\nVQ\nTS\nOpen-source\nWan2.2_A14B\n0.638\n0.582\n0.783\n0.942\n0.263\n0.610\n0.607\n0.608\nHunyuanVideo 1.5\n0.510\n0.622\n0.651\n0.949\n0.355\n0.566\n0.460\n0.513\nLongCat-Video\n0.562\n0.530\n0.807\n0.945\n0.298\n0.546\n0.625\n0.585\nWan2.1_14B\n0.542\n0.472\n0.677\n0.849\n0.282\n0.507\n0.422\n0.464\nLTX-2\n0.490\n0.410\n0.681\n0.919\n0.464\n0.450\n0.456\n0.453\nWan2.2_5B\n0.518\n0.480\n0.619\n0.943\n0.313\n0.499\n0.372\n0.435\nSkyreels\n0.525\n0.495\n0.712\n0.911\n0.286\n0.510\n0.504\n0.507\nLTX-Video\n0.492\n0.408\n0.686\n0.804\n0.158\n0.450\n0.431\n0.440\nFramePack\n0.445\n0.318\n0.760\n0.888\n0.104\n0.381\n0.498\n0.439\nHunyuanVideo\n0.445\n0.265\n0.809\n0.963\n0.118\n0.355\n0.552\n0.453\nCogVideoX-5B\n0.405\n0.335\n0.582\n0.815\n0.256\n0.370\n0.307\n0.338\nClosed-source\nWan 2.6\n0.652\n0.710\n0.796\n0.983\n0.392\n0.681\n0.651\n0.666\nSeedance 1.5 pro\n0.635\n0.832\n0.752\n0.960\n0.419\n0.734\n0.561\n0.647\nWan 2.5\n0.668\n0.802\n0.787\n0.969\n0.412\n0.735\n0.624\n0.679\nHailuo v2\n0.665\n0.752\n0.680\n0.989\n0.396\n0.709\n0.479\n0.594\nVeo 3\n0.642\n0.755\n0.750\n0.977\n0.362\n0.699\n0.568\n0.633\nSeedance 1.0\n0.658\n0.655\n0.769\n0.967\n0.306\n0.656\n0.589\n0.622\nKling 2.6 pro\n0.622\n0.640\n0.714\n0.958\n0.305\n0.631\n0.508\n0.569\nSora v2 Pro\n0.490\n0.310\n0.784\n0.962\n0.324\n0.400\n0.552\n0.476\nSora v1\n0.350\n0.320\n0.532\n0.884\n0.247\n0.335\n0.293\n0.314\nRobotics-specific\nCosmos 2.5\n0.632\n0.592\n0.737\n0.888\n0.206\n0.612\n0.475\n0.543\nDreamGen(gr1)\n0.618\n0.620\n0.716\n0.932\n0.263\n0.619\n0.508\n0.563\nDreamGen(droid)\n0.568\n0.568\n0.691\n0.930\n0.214\n0.568\n0.430\n0.499\nVidar\n0.415\n0.272\n0.726\n0.929\n0.068\n0.344\n0.420\n0.382\nUnifoLM-WMA-0\n0.428\n0.315\n0.437\n0.709\n0.389\n0.371\n0.164\n0.267\nMean\n0.544\n0.522\n0.705\n0.918\n0.288\n0.533\n0.482\n0.507\nTable 14\n:\nResults on Quadruped Robot with GPT\nModel\nPSS\nTAC\nRSS\nMS\nMA\nTC\nVQ\nTS\nOpen-source\nWan2.2_A14B\n0.760\n0.712\n0.800\n0.888\n0.196\n0.736\n0.643\n0.689\nHunyuanVideo 1.5\n0.715\n0.738\n0.713\n0.940\n0.403\n0.726\n0.542\n0.634\nLongCat-Video\n0.742\n0.628\n0.827\n0.923\n0.179\n0.685\n0.676\n0.680\nWan2.1_14B\n0.722\n0.670\n0.706\n0.850\n0.303\n0.696\n0.495\n0.595\nLTX-2\n0.715\n0.670\n0.758\n0.845\n0.287\n0.692\n0.552\n0.622\nWan2.2_5B\n0.712\n0.678\n0.688\n0.921\n0.273\n0.695\n0.486\n0.590\nSkyreels\n0.732\n0.605\n0.722\n0.853\n0.163\n0.669\n0.503\n0.586\nLTX-Video\n0.698\n0.678\n0.668\n0.676\n0.122\n0.688\n0.364\n0.526\nFramePack\n0.720\n0.575\n0.827\n0.876\n0.069\n0.648\n0.605\n0.626\nHunyuanVideo\n0.730\n0.602\n0.788\n0.953\n0.127\n0.666\n0.584\n0.625\nCogVideoX-5B\n0.655\n0.560\n0.624\n0.618\n0.220\n0.608\n0.322\n0.464\nClosed-source\nWan 2.6\n0.755\n0.792\n0.813\n0.970\n0.316\n0.774\n0.672\n0.723\nSeedance 1.5 pro\n0.748\n0.820\n0.746\n0.884\n0.407\n0.784\n0.577\n0.680\nWan 2.5\n0.785\n0.792\n0.809\n0.948\n0.322\n0.789\n0.664\n0.726\nHailuo v2\n0.748\n0.738\n0.711\n0.961\n0.354\n0.742\n0.538\n0.640\nVeo 3\n0.745\n0.695\n0.798\n0.961\n0.214\n0.720\n0.658\n0.689\nSeedance 1.0\n0.768\n0.735\n0.791\n0.945\n0.334\n0.751\n0.645\n0.698\nKling 2.6 pro\n0.740\n0.738\n0.736\n0.861\n0.258\n0.739\n0.535\n0.637\nSora v2 Pro\n0.731\n0.670\n0.789\n0.922\n0.239\n0.701\n0.626\n0.663\nSora v1\n0.700\n0.672\n0.620\n0.863\n0.282\n0.686\n0.401\n0.543\nRobotics-specific\nCosmos 2.5\n0.752\n0.622\n0.808\n0.892\n0.137\n0.688\n0.629\n0.658\nDreamGen(gr1)\n0.712\n0.655\n0.706\n0.788\n0.164\n0.684\n0.474\n0.579\nDreamGen(droid)\n0.705\n0.568\n0.687\n0.854\n0.160\n0.636\n0.448\n0.542\nVidar\n0.528\n0.472\n0.552\n0.749\n0.074\n0.500\n0.247\n0.373\nUnifoLM-WMA-0\n0.475\n0.390\n0.410\n0.497\n0.132\n0.432\n0.154\n0.293\nMean\n0.711\n0.659\n0.723\n0.857\n0.229\n0.685\n0.521\n0.603\nTable 15\n:\nResults on Common Manipulation with Qwen\nModel\nAES\nTCS\nOCS\nRCS\nPSS\nTS\nOpen-source\nWan2.2_A14B\n0.804\n0.815\n0.934\n0.913\n0.923\n0.708\nLongCat-Video\n0.681\n0.704\n0.840\n0.920\n0.897\n0.677\nWan2.2_5B\n0.620\n0.630\n0.940\n0.890\n0.860\n0.597\nWan2.1_14B\n0.663\n0.653\n0.903\n0.932\n0.807\n0.687\nSkyreels\n0.547\n0.559\n0.928\n0.916\n0.952\n0.546\nLTX-Video\n0.630\n0.666\n0.845\n0.904\n0.880\n0.450\nFramePack\n0.336\n0.347\n0.913\n0.956\n0.934\n0.455\nCogVideoX-5B\n0.352\n0.340\n0.625\n0.704\n0.647\n0.289\nClosed-source\nWan 2.5\n0.928\n0.946\n0.946\n0.964\n0.973\n0.887\nHailuo v2\n0.916\n0.952\n0.940\n0.940\n0.976\n0.843\nVeo 3\n0.953\n0.962\n0.962\n0.981\n0.990\n0.896\nSeedance 1.0\n0.946\n0.928\n0.955\n0.946\n0.964\n0.856\nRobotics-specific\nCosmos 2.5\n0.687\n0.708\n0.895\n0.916\n0.864\n0.687\nDreamGen(gr1)\n0.625\n0.656\n0.906\n0.937\n0.906\n0.507\nDreamGen(droid)\n0.630\n0.690\n0.785\n0.845\n0.773\n0.465\nUnifoLM-WMA-0\n0.043\n0.043\n0.532\n0.478\n0.369\n0.028\nVidar\n0.142\n0.166\n0.833\n0.833\n0.761\n0.117\nMean\n0.597\n0.611\n0.867\n0.858\n0.835\n0.559\nTable 16\n:\nResults on Long-Horizon Planning with Qwen\nModel\nAES\nECS\nOCS\nRCS\nPSS\nTS\nOpen-source\nWan2.2_A14B\n0.836\n0.883\n0.942\n0.971\n0.951\n0.680\nLongCat-Video\n0.650\n0.706\n0.925\n0.950\n0.912\n0.489\nWan2.2_5B\n0.520\n0.594\n0.947\n0.937\n0.895\n0.449\nWan2.1_14B\n0.681\n0.669\n0.931\n0.931\n0.875\n0.465\nSkyreels\n0.416\n0.511\n0.944\n0.958\n0.861\n0.324\nLTX-Video\n0.352\n0.414\n0.779\n0.808\n0.705\n0.357\nFramePack\n0.212\n0.252\n0.862\n0.987\n0.937\n0.196\nCogVideoX-5B\n0.276\n0.292\n0.855\n0.763\n0.684\n0.096\nClosed-source\nWan 2.5\n0.714\n0.836\n0.964\n0.964\n0.955\n0.719\nHailuo v2\n0.808\n0.903\n0.950\n0.991\n0.908\n0.705\nVeo 3\n0.812\n0.903\n0.984\n0.968\n0.945\n0.854\nSeedance 1.0\n0.824\n0.889\n0.990\n0.990\n0.925\n0.715\nRobotics-specific\nCosmos 2.5\n0.731\n0.810\n0.953\n0.981\n0.935\n0.596\nDreamGen(gr1)\n0.475\n0.587\n0.950\n0.937\n0.887\n0.353\nDreamGen(droid)\n0.602\n0.717\n0.882\n0.882\n0.852\n0.301\nUnifoLM-WMA-0\n0.000\n-0.041\n0.645\n0.500\n0.500\n0.000\nVidar\n0.050\n0.058\n0.800\n0.866\n0.666\n0.019\nMean\n0.505\n0.565\n0.893\n0.886\n0.833\n0.417\nTable 17\n:\nResults on Multi-Entity Collaboration with Qwen\nModel\nACS\nTCS\nECS\nOCS\nPSS\nTS\nOpen-source\nWan2.2_A14B\n0.941\n0.941\n0.985\n0.992\n1.000\n0.920\nLongCat-Video\n0.887\n0.912\n0.968\n0.962\n0.968\n0.814\nWan2.2_5B\n0.763\n0.796\n0.993\n0.960\n0.967\n0.721\nWan2.1_14B\n0.750\n0.786\n0.975\n0.945\n0.957\n0.702\nSkyreels\n0.743\n0.736\n1.000\n1.000\n0.993\n0.686\nLTX-Video\n0.806\n0.806\n0.975\n0.975\n0.993\n0.734\nFramePack\n0.710\n0.703\n0.980\n0.993\n0.947\n0.630\nCogVideoX-5B\n0.522\n0.536\n0.933\n0.882\n0.889\n0.426\nClosed-source\nWan 2.5\n0.896\n0.908\n0.987\n0.975\n1.000\n0.915\nHailuo v2\n0.986\n0.993\n0.952\n0.972\n0.986\n0.892\nVeo 3\n0.914\n0.914\n0.993\n0.987\n1.000\n0.924\nSeedance 1.0\n0.960\n0.967\n0.973\n0.960\n1.000\n0.898\nRobotics-specific\nCosmos 2.5\n0.864\n0.878\n0.993\n1.000\n0.972\n0.768\nDreamGen(gr1)\n0.878\n0.878\n0.957\n0.963\n0.969\n0.848\nDreamGen(droid)\n0.763\n0.819\n0.958\n0.951\n0.930\n0.591\nUnifoLM-WMA-0\n0.044\n0.044\n0.507\n0.477\n0.301\n0.025\nVidar\n0.083\n0.097\n0.743\n0.736\n0.583\n0.082\nMean\n0.714\n0.724\n0.933\n0.928\n0.910\n0.657\nTable 18\n:\nResults on Spatial Relationship with Qwen\nModel\nSRS\nMFS\nOCS\nRCS\nPSS\nTS\nOpen-source\nWan2.2_A14B\n0.833\n0.833\n1.000\n1.000\n1.000\n0.660\nLongCat-Video\n0.636\n0.636\n1.000\n1.000\n1.000\n0.465\nWan2.2_5B\n0.600\n0.625\n1.000\n0.900\n0.900\n0.402\nWan2.1_14B\n0.636\n0.636\n1.000\n1.000\n1.000\n0.400\nSkyreels\n0.750\n0.750\n1.000\n0.875\n0.875\n0.400\nLTX-Video\n0.750\n0.750\n1.000\n1.000\n1.000\n0.382\nFramePack\n0.400\n0.400\n1.000\n1.000\n1.000\n0.240\nCogVideoX-5B\n0.500\n0.535\n1.000\n0.857\n0.714\n0.240\nClosed-source\nWan 2.5\n0.916\n0.916\n1.000\n0.979\n1.000\n0.825\nHailuo v2\n1.000\n1.000\n1.000\n1.000\n1.000\n0.840\nVeo 3\n0.933\n0.933\n1.000\n1.000\n1.000\n0.740\nSeedance 1.0\n0.666\n0.666\n1.000\n1.000\n1.000\n0.665\nRobotics-specific\nCosmos 2.5\n0.875\n0.875\n1.000\n1.000\n1.000\n0.512\nDreamGen(gr1)\n0.642\n0.642\n1.000\n1.000\n1.000\n0.500\nDreamGen(droid)\n0.545\n0.545\n1.000\n1.000\n1.000\n0.505\nUnifoLM-WMA-0\n0.200\n0.250\n0.625\n0.575\n0.500\n0.065\nVidar\n0.367\n0.382\n0.691\n0.647\n0.573\n0.140\nMean\n0.666\n0.674\n0.962\n0.935\n0.920\n0.464\nTable 19\n:\nResults on Visual Reasoning with Qwen\nModel\nAES\nVRS\nOCS\nRCS\nPSS\nTS\nOpen-source\nWan2.2_A14B\n0.727\n0.701\n1.000\n1.000\n1.000\n0.550\nLongCat-Video\n0.361\n0.358\n0.944\n0.958\n0.847\n0.354\nWan2.2_5B\n0.291\n0.218\n0.906\n0.906\n0.906\n0.420\nWan2.1_14B\n0.397\n0.401\n0.886\n0.897\n0.784\n0.269\nSkyreels\n0.420\n0.401\n0.960\n0.930\n0.830\n0.357\nLTX-Video\n0.390\n0.410\n0.859\n0.937\n0.859\n0.285\nFramePack\n0.350\n0.343\n0.980\n0.990\n0.950\n0.345\nCogVideoX-5B\n0.073\n0.044\n0.779\n0.632\n0.544\n0.030\nClosed-source\nWan 2.5\n0.809\n0.770\n0.988\n1.000\n0.952\n0.737\nHailuo v2\n0.790\n0.882\n1.000\n1.000\n0.900\n0.820\nVeo 3\n0.847\n0.853\n0.945\n1.000\n0.989\n0.750\nSeedance 1.0\n0.927\n0.945\n0.979\n0.989\n1.000\n0.789\nRobotics-specific\nCosmos 2.5\n0.593\n0.632\n0.984\n1.000\n1.000\n0.506\nDreamGen(gr1)\n0.437\n0.425\n0.937\n0.958\n0.822\n0.404\nDreamGen(droid)\n0.600\n0.575\n0.800\n0.825\n0.787\n0.386\nUnifoLM-WMA-0\n0.000\n-0.098\n0.177\n0.348\n0.289\n0.000\nVidar\n0.000\n-0.062\n0.947\n0.937\n0.906\n0.029\nMean\n0.452\n0.438\n0.890\n0.882\n0.825\n0.395\nTable 20\n:\nResults on Dual Arm Robot with Qwen\nModel\nPSS\nTAC\nRSS\nMS\nMA\nTC\nVQ\nTS\nOpen-source\nWan2.2_A14B\n0.852\n0.760\n0.767\n0.915\n0.204\n0.806\n0.550\n0.678\nLongCat-Video\n0.738\n0.638\n0.741\n0.937\n0.244\n0.688\n0.517\n0.602\nWan2.2_5B\n0.688\n0.645\n0.658\n0.940\n0.269\n0.666\n0.402\n0.534\nWan2.1_14B\n0.790\n0.730\n0.639\n0.850\n0.261\n0.760\n0.364\n0.562\nSkyreels\n0.755\n0.700\n0.675\n0.884\n0.252\n0.728\n0.419\n0.573\nLTX-Video\n0.615\n0.535\n0.692\n0.812\n0.143\n0.575\n0.399\n0.487\nFramePack\n0.612\n0.495\n0.719\n0.885\n0.103\n0.554\n0.445\n0.499\nCogVideoX-5B\n0.505\n0.540\n0.613\n0.752\n0.143\n0.522\n0.323\n0.422\nClosed-source\nWan 2.5\n0.920\n0.880\n0.761\n0.970\n0.347\n0.900\n0.588\n0.744\nHailuo v2\n0.908\n0.848\n0.744\n0.983\n0.312\n0.878\n0.534\n0.706\nVeo 3\n0.870\n0.802\n0.777\n0.973\n0.262\n0.836\n0.581\n0.708\nSeedance 1.0\n0.895\n0.810\n0.801\n0.972\n0.294\n0.852\n0.608\n0.730\nRobotics-specific\nCosmos 2.5\n0.792\n0.708\n0.791\n0.930\n0.127\n0.750\n0.543\n0.646\nDreamGen(gr1)\n0.780\n0.638\n0.801\n0.939\n0.123\n0.709\n0.555\n0.632\nDreamGen(droid)\n0.722\n0.678\n0.711\n0.863\n0.201\n0.700\n0.441\n0.570\nUnifoLM-WMA-0\n0.110\n0.222\n0.266\n0.497\n0.120\n0.166\n0.046\n0.106\nVidar\n0.295\n0.240\n0.804\n0.933\n0.025\n0.268\n0.511\n0.389\nMean\n0.685\n0.622\n0.694\n0.880\n0.205\n0.651\n0.449\n0.550\nTable 21\n:\nResults on Humanoid Robot with Qwen\nModel\nPSS\nTAC\nRSS\nMS\nMA\nTC\nVQ\nTS\nOpen-source\nWan2.2_A14B\n0.935\n0.800\n0.806\n0.966\n0.105\n0.898\n0.557\n0.727\nLongCat-Video\n0.918\n0.765\n0.826\n0.969\n0.089\n0.841\n0.579\n0.710\nWan2.2_5B\n0.880\n0.758\n0.791\n0.963\n0.152\n0.819\n0.544\n0.681\nWan2.1_14B\n0.895\n0.712\n0.785\n0.938\n0.167\n0.804\n0.524\n0.664\nSkyreels\n0.842\n0.670\n0.803\n0.808\n0.086\n0.756\n0.500\n0.628\nLTX-Video\n0.852\n0.670\n0.808\n0.628\n0.050\n0.761\n0.445\n0.603\nFramePack\n0.815\n0.622\n0.838\n0.864\n0.069\n0.719\n0.550\n0.634\nCogVideoX-5B\n0.712\n0.602\n0.710\n0.647\n0.127\n0.658\n0.390\n0.524\nClosed-source\nWan 2.5\n0.935\n0.835\n0.826\n0.981\n0.122\n0.885\n0.600\n0.742\nHailuo v2\n0.952\n0.848\n0.796\n0.970\n0.133\n0.891\n0.548\n0.719\nVeo 3\n0.955\n0.802\n0.831\n0.968\n0.132\n0.829\n0.604\n0.716\nSeedance 1.0\n0.936\n0.814\n0.829\n0.964\n0.166\n0.904\n0.614\n0.759\nRobotics-specific\nCosmos 2.5\n0.868\n0.730\n0.841\n0.925\n0.071\n0.799\n0.578\n0.688\nDreamGen(gr1)\n0.858\n0.682\n0.823\n0.885\n0.079\n0.770\n0.542\n0.656\nDreamGen(droid)\n0.842\n0.736\n0.739\n0.843\n0.137\n0.788\n0.478\n0.633\nUnifoLM-WMA-0\n0.168\n0.285\n0.349\n0.512\n0.112\n0.226\n0.115\n0.170\nVidar\n0.440\n0.305\n0.700\n0.855\n0.025\n0.372\n0.357\n0.364\nMean\n0.806\n0.674\n0.770\n0.862\n0.113\n0.740\n0.501\n0.620\nTable 22\n:\nResults on Single Arm Robot with Qwen\nModel\nPSS\nTAC\nRSS\nMS\nMA\nTC\nVQ\nTS\nOpen-source\nWan2.2_A14B\n0.815\n0.802\n0.755\n0.942\n0.263\n0.809\n0.568\n0.688\nLongCat-Video\n0.750\n0.712\n0.812\n0.945\n0.298\n0.736\n0.660\n0.698\nWan2.2_5B\n0.605\n0.650\n0.626\n0.943\n0.313\n0.628\n0.394\n0.511\nWan2.1_14B\n0.700\n0.616\n0.638\n0.849\n0.282\n0.659\n0.379\n0.519\nSkyreels\n0.760\n0.699\n0.731\n0.911\n0.286\n0.732\n0.492\n0.612\nLTX-Video\n0.535\n0.525\n0.710\n0.804\n0.158\n0.530\n0.443\n0.486\nFramePack\n0.400\n0.500\n0.674\n0.888\n0.104\n0.394\n0.413\n0.403\nCogVideoX-5B\n0.460\n0.460\n0.553\n0.815\n0.256\n0.460\n0.288\n0.374\nClosed-source\nWan 2.5\n0.895\n0.918\n0.747\n0.969\n0.412\n0.895\n0.589\n0.742\nHailuo v2\n0.910\n0.906\n0.705\n0.989\n0.396\n0.902\n0.489\n0.695\nVeo 3\n0.898\n0.891\n0.756\n0.977\n0.362\n0.890\n0.594\n0.742\nSeedance 1.0\n0.852\n0.818\n0.747\n0.967\n0.306\n0.835\n0.580\n0.707\nRobotics-specific\nCosmos 2.5\n0.795\n0.765\n0.751\n0.888\n0.206\n0.776\n0.516\n0.646\nDreamGen(gr1)\n0.812\n0.728\n0.782\n0.932\n0.263\n0.770\n0.550\n0.660\nDreamGen(droid)\n0.745\n0.675\n0.721\n0.930\n0.214\n0.710\n0.468\n0.589\nUnifoLM-WMA-0\n0.382\n0.495\n0.391\n0.709\n0.389\n0.439\n0.140\n0.289\nVidar\n0.220\n0.200\n0.736\n0.929\n0.068\n0.210\n0.479\n0.344\nMean\n0.658\n0.648\n0.679\n0.898\n0.263\n0.649\n0.454\n0.551\nTable 23\n:\nResults on Quadruped Robot with Qwen\nModel\nPSS\nTAC\nRSS\nMS\nMA\nTC\nVQ\nTS\nOpen-source\nWan2.2_A14B\n0.860\n0.698\n0.746\n0.888\n0.196\n0.779\n0.561\n0.670\nLongCat-Video\n0.870\n0.685\n0.747\n0.923\n0.179\n0.778\n0.554\n0.666\nWan2.2_5B\n0.858\n0.635\n0.721\n0.921\n0.273\n0.746\n0.529\n0.637\nWan2.1_14B\n0.845\n0.665\n0.674\n0.850\n0.303\n0.755\n0.453\n0.604\nSkyreels\n0.862\n0.652\n0.749\n0.853\n0.163\n0.758\n0.550\n0.654\nLTX-Video\n0.818\n0.690\n0.709\n0.676\n0.122\n0.754\n0.423\n0.588\nFramePack\n0.765\n0.540\n0.881\n0.876\n0.069\n0.652\n0.687\n0.669\nCogVideoX-5B\n0.705\n0.575\n0.639\n0.618\n0.220\n0.640\n0.349\n0.494\nClosed-source\nWan 2.5\n0.902\n0.740\n0.769\n0.948\n0.322\n0.821\n0.601\n0.711\nHailuo v2\n0.888\n0.722\n0.654\n0.961\n0.354\n0.805\n0.458\n0.631\nVeo 3\n0.880\n0.722\n0.793\n0.961\n0.214\n0.801\n0.652\n0.726\nSeedance 1.0\n0.865\n0.710\n0.728\n0.945\n0.334\n0.788\n0.560\n0.674\nRobotics-specific\nCosmos 2.5\n0.850\n0.612\n0.755\n0.892\n0.137\n0.731\n0.547\n0.639\nDreamGen(gr1)\n0.852\n0.672\n0.701\n0.788\n0.164\n0.762\n0.460\n0.611\nDreamGen(droid)\n0.745\n0.592\n0.724\n0.854\n0.160\n0.669\n0.500\n0.584\nUnifoLM-WMA-0\n0.310\n0.300\n0.399\n0.497\n0.132\n0.305\n0.197\n0.251\nVidar\n0.495\n0.445\n0.575\n0.749\n0.074\n0.470\n0.290\n0.380\nMean\n0.782\n0.612\n0.705\n0.825\n0.198\n0.701\n0.494\n0.597",
    "preview_text": "Video generation models have significantly advanced embodied intelligence, unlocking new possibilities for generating diverse robot data that capture perception, reasoning, and action in the physical world. However, synthesizing high-quality videos that accurately reflect real-world robotic interactions remains challenging, and the lack of a standardized benchmark limits fair comparisons and progress. To address this gap, we introduce a comprehensive robotics benchmark, RBench, designed to evaluate robot-oriented video generation across five task domains and four distinct embodiments. It assesses both task-level correctness and visual fidelity through reproducible sub-metrics, including structural consistency, physical plausibility, and action completeness. Evaluation of 25 representative models highlights significant deficiencies in generating physically realistic robot behaviors. Furthermore, the benchmark achieves a Spearman correlation coefficient of 0.96 with human evaluations, validating its effectiveness. While RBench provides the necessary lens to identify these deficiencies, achieving physical realism requires moving beyond evaluation to address the critical shortage of high-quality training data. Driven by these insights, we introduce a refined four-stage data pipeline, resulting in RoVid-X, the largest open-source robotic dataset for video generation with 4 million annotated video clips, covering thousands of tasks and enriched with comprehensive physical property annotations. Collectively, this synergistic ecosystem of evaluation and data establishes a robust foundation for rigorous assessment and scalable training of video models, accelerating the evolution of embodied AI toward general intelligence.\n\n1]Peking University\n2]ByteDance Seed\nRethinking Video Generation Model for the Embodied World\nYufan Deng\n1,2∗\nZilin Pan\n1∗\nHongyu Zhang\n1∗\nXiaojie Li\n2\nRuoqing Hu\n2\nYufei Ding\n1\nYiming Zou\n1\nYan Zeng\n2\nDaquan Zhou\n1\n[\n[\nAbstract\nVideo generation models hav",
    "is_relevant": true,
    "relevance_score": 6.0,
    "extracted_keywords": [
        "VLA",
        "locomotion",
        "whole body control"
    ],
    "one_line_summary": "该论文提出机器人视频生成基准RBench和数据集RoVid-X，以评估和提升具身AI中视频生成模型的物理真实性和任务正确性。",
    "detailed_summary": "## 论文摘要：《为具身世界重新思考视频生成模型》\n\n### 1. 研究背景和动机\n视频生成模型在推动具身智能（Embodied AI）发展方面展现出巨大潜力，能够为机器人学习生成包含感知、推理和行动的多样化数据。然而，当前模型在生成**物理真实、任务准确**的机器人交互视频方面仍面临挑战，且缺乏一个**标准化、可复现的评估基准**来公平衡量模型性能并推动领域进步。现有评估多关注视觉保真度，而忽视了任务完成度、动作物理合理性等对机器人应用至关重要的维度。\n\n### 2. 核心方法和技术创新\n本文提出了一个协同的评估与数据生态系统：\n*   **评估基准 RBench**：首个面向机器人视频生成的综合性基准。它包含**650个**精心设计的评估样本，覆盖**5类任务**（如常见操作、长程规划、视觉推理）和**4种机器人形态**（如双臂、人形、四足）。RBench提出了**可自动计算的细粒度指标**，从**任务完成度**（物理语义合理性、任务一致性）和**视觉质量**（运动幅度、机器人主体稳定性、运动平滑度）两个维度进行评估。\n*   **大规模数据集 RoVid-X**：针对高质量训练数据匮乏的问题，作者构建了目前最大的开源机器人视频数据集。通过一个**四阶段数据流水线**（视频收集、质量过滤、任务分割与描述、物理属性标注），整合了超过20个开源数据集和网络视频源，最终形成了包含**约400万**个标注视频片段的数据集，涵盖了数千种任务和丰富的物理属性注释。\n\n### 3. 主要实验结果\n*   对**25个**代表性视频生成模型（开源、商业、机器人专用）在RBench上进行了系统评估。\n*   结果显示，即使是顶尖的商业模型（如Wan 2.6），在生成需要**精细物理交互和高级认知推理**的任务视频时，性能仍有显著下降，揭示了当前视频基础模型与具身任务要求之间的**“物理智能鸿沟”**。\n*   令人意外的是，面向消费级媒体的知名模型（如Sora系列）在该基准上表现不佳，凸显了**“媒体-仿真”领域差距**。\n*   RBench的自动评分与人工偏好评估结果高度一致（**斯皮尔曼相关系数达0.96**），验证了其有效性。\n*   使用RoVid-X微调模型能稳定提升其在各项任务和机器人形态上的性能，证明了数据集的价值。\n\n### 4. 研究意义和价值\n本研究为机器人视频生成领域建立了**严谨评估和规模化训练**的坚实基础。\n*   **RBench** 像一面“镜子”，精准揭示了当前模型在物理真实性和任务逻辑性上的缺陷，为模型改进指明了方向。\n*   **RoVid-X** 则提供了“燃料”，通过大规模、高质量、多样化的数据，有望赋能下一代视频模型学习更强大的物理交互先验。\n*   二者共同构成了一个**协同生态系统**，将加速视频生成模型从追求视觉逼真到理解并模拟物理世界的演进，推动具身AI向通用智能发展。",
    "qa_pairs": [
        {
            "question": "这篇论文的核心创新点是什么，他想解决什么问题，怎么解决的？",
            "answer": "## 论文核心分析：《Rethinking Video Generation Model for the Embodied World》\n\n这篇论文旨在解决**具身智能（Embodied AI）领域中，视频生成模型缺乏有效评估标准和高质量训练数据**的核心瓶颈。其核心思想是，当前通用视频生成模型在生成符合物理规律、任务逻辑的机器人行为视频方面存在显著缺陷，而这一缺陷阻碍了视频世界模型在机器人学习、仿真和策略生成中的应用。\n\n### 一、 核心问题\n论文明确指出并试图解决以下两个关键问题：\n1.  **评估标准缺失**：现有视频生成评估基准（如VBench）主要关注**视觉保真度**（清晰度、美观度），严重缺乏对**物理合理性**、**任务完成度**和**动作逻辑一致性**的评估。这导致模型生成的视频可能“看起来很美”，但机器人行为违反物理常识或无法完成任务。\n2.  **训练数据匮乏**：与计算机视觉和自然语言处理领域拥有海量网络数据不同，机器人交互视频数据在**规模**、**多样性**（机器人形态、任务类型、环境）和**质量**（分辨率、标注）上存在严重不足，限制了视频生成模型学习物理交互先验知识的能力。\n\n### 二、 核心创新点与解决方案\n论文通过构建一个“评估-数据”协同生态系统，系统性地解决了上述问题。\n\n#### 创新点一：提出首个面向机器人视频生成的综合评估基准 **RBench**\n- **设计思路**：超越像素级评估，聚焦**任务正确性**和**视觉质量**两个维度。\n- **关键构成**：\n    - **多样化评估集**：包含650个精心设计的图像-文本对，覆盖**5类任务**（常见操作、长时程规划、多实体协作、空间关系、视觉推理）和**4种机器人形态**（单臂、双臂、人形、四足）。\n    - **自动化、可复现的细粒度指标**：利用多模态大语言模型作为零样本评估器，提出一系列子指标：\n        - **任务完成度**：评估**物理语义合理性**（如漂浮、穿透、非接触附着）和**任务依从一致性**（关键动作是否齐全、顺序是否正确）。\n        - **视觉质量**：评估**运动幅度**（惩罚静态机器人）、**机器人-主体稳定性**（形态、属性是否漂移）、**运动平滑度**。\n- **验证有效性**：在25个代表性模型上的评估结果与人类偏好评分高度相关（斯皮尔曼相关系数达 **0.96**），证明了其评估的有效性。\n\n#### 创新点二：构建目前最大规模的开源机器人视频数据集 **RoVid-X**\n- **设计思路**：为解决训练数据瓶颈，构建一个大规模、高质量、标注丰富的机器人视频数据集。\n- **四阶段数据流水线**：\n    1.  **机器人视频收集**：从互联网视频平台和20多个开源数据集中收集原始视频。\n    2.  **视频质量过滤**：基于清晰度、动态效果等多维度进行自动打分过滤。\n    3.  **任务分割与描述**：使用视频理解模型自动分割任务片段并生成标准化动作描述。\n    4.  **物理属性标注**：统一标注**光流**（动作一致性）和**深度图**（空间关系），为模型提供丰富的物理先验。\n- **数据集规模与特点**：包含约 **400万** 个精选视频片段，覆盖 **1300+** 种技能，分辨率达720P，是首个专为视频生成模型设计的大规模机器人数据集。\n\n### 三、 主要实验发现与洞见\n通过对25个模型（开源、商业、机器人专用）的评估，论文揭示了重要趋势：\n- **从“视觉保真”到“物理智能”的范式转变**：顶级商业模型（如Wan 2.6）开始展现出作为**世界模拟器**的潜力，而不仅限于生成美观视频。\n- **迭代缩放解锁物理能力**：模型迭代与物理推理能力提升强相关（如Wan系列从2.1到2.6的显著飞跃）。\n- **“媒体-仿真”鸿沟**：面向消费级媒体生成的知名模型（如Sora系列）在该基准上表现不佳，说明**创意视频生成能力不能自然迁移到具身AI任务**。\n- **闭源模型领先**：商业闭源模型在排行榜上占据绝对优势，突显了开源社区在物理数据规模和架构优化上的紧迫需求。\n- **专业化困境**：专用机器人模型（如Cosmos 2.5）虽落后于顶级通用模型，但优于大型开源视频模型，表明**物理数据训练能带来稳定收益**。然而，过度专注于特定机器人的模型（如Vidar）表现很差，说明**领域数据无法完全弥补大规模预训练提供的“世界知识”**。\n- **认知与精细控制瓶颈**：所有模型在需要**高级逻辑推理**（视觉推理任务）和**精细操作**（单臂/双臂机器人任务）上表现最差，揭示了当前模型的物理理解极限。\n\n### 四、 实际价值与意义\n1.  **为领域设立标准**：**RBench** 提供了首个系统、可复现的评估工具，使不同视频生成模型在机器人场景下的性能可以进行公平、全面的比较，将推动研究向物理真实性和任务实用性方向发展。\n2.  **提供关键训练资源**：**RoVid-X** 数据集极大缓解了机器人视频生成领域的数据荒，为训练下一代具备物理常识的视频世界模型奠定了数据基础。\n3.  **指明研究方向**：论文的评估结果清晰地指出了当前模型的短板（如物理合理性、长时程规划），并暗示了改进方向：**需要融合大规模通用预训练与高质量领域特定数据**，并设计能更好理解物理和因果关系的模型架构。\n\n**总结**：该论文通过**首创的评估基准RBench**和**大规模高质量数据集RoVid-X**，系统性地诊断并着手解决了机器人视频生成模型在评估和训练方面的核心挑战。它不仅揭示了当前最先进模型的局限性，更为整个领域未来的发展提供了坚实的评估框架和数据基础，加速了视频生成模型向真正可用的“物理世界模拟器”的演进。",
            "timestamp": "2026-01-27T16:02:02.903245",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "基于他的前作，梳理这个方向的整个发展脉络，每一步相比于之前的工作都改进了什么，着重于几个不同的发展方向。",
            "answer": "## 论文《Rethinking Video Generation Model for the Embodied World》发展脉络梳理\n\n本文是视频生成模型在具身智能（Embodied AI）领域应用的一次系统性总结与推进。其核心贡献在于**填补了“评估”与“数据”两大关键空白**，为领域发展建立了新的基准和基础设施。要理解其定位，需梳理该方向从通用视频生成到具身世界建模的演进脉络。\n\n### 发展脉络与关键改进\n\n该领域的发展可以概括为从**通用视觉生成**到**物理世界模拟**，再到**具身任务专用**的演进过程，每一步都针对前作的局限性进行了关键改进。\n\n#### 1. 第一阶段：通用视频生成模型的兴起与局限\n*   **前作代表**：Sora、Veo、Wan、HunyuanVideo等大规模扩散模型。\n*   **核心能力**：实现了从文本/图像生成高保真、长序列、富有创意视频的突破，关注**视觉逼真度**（清晰度、纹理、运动平滑度）和**文本-视频对齐**。\n*   **主要局限（本文指出）**：\n    *   **评估脱节**：现有评测基准（如VBench）主要面向媒体消费场景，缺乏对**物理合理性**、**任务完成度**和**机器人行为特异性**的评估。\n    *   **数据偏差**：训练数据以人类中心、影视化内容为主，缺乏大规模、高质量的机器人交互视频，导致模型对机器人形态、物体交互物理、任务逻辑的理解不足。\n    *   **“媒体-模拟”鸿沟**：为视觉美感优化的模型，其生成结果在物理上常常不合理（如物体漂浮、穿透、动作逻辑错误）。\n\n#### 2. 第二阶段：面向物理世界的视频生成基准初探\n*   **前作代表**：VideoPhy、PhyBench、T2VPhysBench等。\n*   **核心改进**：开始关注生成视频的**物理常识**，评估模型对基础物理定律（如重力、碰撞、惯性）的遵守情况。\n*   **主要局限（本文指出）**：\n    *   **评估维度单一**：多集中于孤立的物理约束违反检测，**未能与具体的机器人任务和动作语义相结合**。\n    *   **缺乏任务导向**：没有系统评估**任务级正确性**（如操作步骤是否完整、顺序是否正确）和**多形态机器人**（Embodiment）下的空间约束。\n    *   **数据集缺失**：缺乏一个覆盖多样机器人形态和复杂任务的标准化评测集。\n\n#### 3. 第三阶段：机器人学习专用数据集的积累\n*   **前作代表**：Open X-Embodiment、BridgeData、DROID、Humanoid Everyday等大规模机器人数据集。\n*   **核心改进**：收集了真实世界或仿真的机器人操作数据，用于训练机器人策略模型，推动了机器人学习的泛化能力。\n*   **主要局限（本文指出）**：\n    *   **目的不同**：这些数据集主要为**策略学习**设计，而非为**视频生成模型**的训练和评估优化。\n    *   **质量与标注不足**：视频分辨率低、多样性有限（特定机器人、狭窄任务分布），且缺乏对物理属性（如光流、深度）和细粒度任务描述的标准化标注。\n    *   **格式不统一**：不同数据集采集和存储方式各异，难以直接用于训练统一的视频生成基础模型。\n\n#### 4. 第四阶段：本文工作——构建评估与数据的协同生态系统\n本文的核心创新在于，**首次系统性地将视频生成模型的评估和训练，与具身智能的独特需求对齐**，解决了前述所有阶段的遗留问题。\n\n*   **改进1：提出首个面向机器人视频生成的综合评测基准 `RBench`**\n    *   **相比于通用评测**：从“视觉质量”转向 **“物理智能”** ，评估维度包括**任务完成度**（物理语义合理性、任务依从一致性）和**视觉质量**（机器人主体稳定性、运动幅度与平滑度）。\n    *   **相比于物理常识评测**：将物理评估**具象化到机器人操作场景**，设计了五大任务类别（常见操作、长时程规划等）和四种机器人形态，评测更具针对性和实用性。\n    *   **价值**：提供了可复现的自动化评测指标（基于MLLM），并验证了与人类评价的高相关性（Spearman ρ=0.96），揭示了当前顶尖模型（如Sora）在具身任务上的显著缺陷。\n\n*   **改进2：构建目前最大、最优质的机器人视频生成数据集 `RoVid-X`**\n    *   **相比于机器人学习数据集**：**专为视频生成模型训练设计**。通过四阶段流水线（收集、质量过滤、任务分割与描述、物理属性标注），提供了400万条高质量、标注丰富的视频片段。\n    *   **关键增强**：包含了**标准化任务描述**、**光流**和**深度图**等物理属性注释，这是以往数据集所不具备的，能为模型注入更强的物理交互先验。\n    *   **价值**：解决了训练数据在规模、多样性、质量上的瓶颈，实验证明其能稳定提升不同视频模型在`RBench`上的性能。\n\n*   **改进3：通过大规模评测揭示关键领域洞见**\n    *   **范式转变**：指出领先的商业模型（如Wan 2.6）正从“视觉生成器”演变为 **“世界模拟器”** ，标志着视频生成进入 **“物理AI”** 新阶段。\n    *   **性能鸿沟**：揭示了**闭源模型显著领先于开源模型**，以及**通用基础模型优于专用机器人模型**的现状，强调了**世界知识**与**规模化物理数据**的重要性。\n    *   **瓶颈诊断**：明确了**需要高层逻辑的视觉推理任务**和**需要精细接触动力学**的操作任务，是当前所有模型的最大短板。\n\n### 着重发展的几个不同方向\n\n基于本文的梳理，该领域未来将沿以下几个关键方向深化：\n\n1.  **评测体系的精细化与自动化**：发展更多**基于物理定律**（运动学、动力学）的自动化评测指标，减少对MLLM的依赖，使评估更客观、可解释。\n2.  **视频生成与机器人策略的闭环**：核心方向是**从生成的视频中反演出可执行的动作**（通过逆动力学模型IDM），并用于**闭环控制**，真正打通“视频世界模型”到“机器人行动”的链路。\n3.  **物理增强的视频模型训练**：利用`RoVid-X`这类富含物理标注的数据，设计新的模型架构或训练目标，**显式地让模型学习物理交互规律**，而不仅仅是视觉模式。\n4.  **跨形态泛化与组合性**：探索如何让视频生成模型更好地理解并生成不同形态机器人（双足、四足、机械臂）的行为，并处理涉及多实体协作、长链条逻辑的复杂任务。\n5.  **仿真与真实世界的桥梁**：利用高质量生成的机器人视频作为**低成本、可扩展的仿真器**，为机器人策略训练提供无限数据，加速其在真实世界的部署。\n\n**总结**：本文标志着视频生成模型在具身智能领域的研究，从**分散的、侧重于视觉或孤立物理属性的尝试**，进入了**建立系统化评估标准与数据基础设施**的新阶段。它不仅是现有问题的“诊断书”，更是未来发展的“路线图”，通过`RBench`和`RoVid-X`的协同，为训练真正理解并模拟物理交互的“世界模型”奠定了坚实基础。",
            "timestamp": "2026-01-27T16:03:04.168582",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他的前作有哪些？使用表格仔细讲讲他的每篇前作，他和前作的区别是什么，主要改善是什么？着重于具体相比于之前文章的改动",
            "answer": "## 论文前作分析\n\n根据提供的论文内容，作者团队（主要来自北京大学和字节跳动Seed）在视频生成与具身智能交叉领域有持续的研究积累。以下是其代表性前作及其与本篇论文（Rethinking Video Generation Model for the Embodied World）的详细对比分析。\n\n### 前作概览表\n\n| 论文标题 | 发表年份/状态 | 核心贡献 | 与本篇论文（RBench & RoVid-X）的主要区别 | 本篇论文的主要改善与创新点 |\n| :--- | :--- | :--- | :--- | :--- |\n| **Cinema: Coherent Multi-Subject Video Generation via MLLM-Based Guidance** (Deng et al., 2025a) | 2025 (arXiv) | 提出**Cinema框架**，利用多模态大语言模型（MLLM）引导，解决**多主体视频生成**中的一致性问题。 | **研究焦点不同**：前作聚焦于**通用视频生成**中的多主体一致性问题（如人物、物体），旨在提升视觉连贯性和叙事逻辑。 | **1. 研究领域转向**：从通用视频生成**转向**具身机器人领域的专用视频生成与评估。<br>**2. 问题深化**：从关注“视觉一致性”深化为关注**物理合理性、任务完成度、机器人形态稳定性**等具身核心挑战。<br>**3. 方法论升级**：从前作的MLLM引导**生成**，扩展到利用MLLM进行**自动化、细粒度评估**（RBench），并构建大规模训练数据集（RoVid-X）。 |\n| **MagRef: Masked Guidance for Any-Reference Video Generation** (Deng et al., 2025b) | 2025 (arXiv) | 提出**MagRef方法**，通过掩码引导实现**任意参考**条件下的视频生成，增强对参考图像（如风格、布局）的控制能力。 | **任务与场景不同**：前作致力于提升生成模型对**任意给定参考图像**的适应和可控性，属于通用可控生成范畴。 | **1. 基准与数据首创**：本篇首次系统性地提出了面向机器人视频生成的**基准测试RBench**和**最大规模开源数据集RoVid-X**，填补了领域空白。前作无此贡献。<br>**2. 评估维度专业化**：引入了针对机器人场景的专属评估指标（如物理语义合理性、任务遵从一致性、机器人主体稳定性），远超前作关注的通用视觉质量。<br>**3. 系统性分析**：对25个代表性模型进行了跨任务、跨具身的系统性评估，揭示了“媒体-仿真”鸿沟、认知瓶颈等深刻洞见，这是前作未涉及的。 |\n| **OpenS2V-Nexus: A Detailed Benchmark and Million-Scale Dataset for Subject-to-Video Generation** (Yuan et al., 2025) | 2025 (arXiv) | 构建了面向**主体驱动视频生成**的大规模基准与数据集，专注于评估模型在保持特定主体身份和属性一致性方面的能力。 | **主体与场景差异**：前作关注**通用主体**（如特定人物、动物）在视频中的一致性，场景是开放域的。 | **1. 领域特异性**：本篇完全专注于**机器人主体**及其在**物理交互场景**中的生成与评估，对物理规律和任务逻辑的要求远高于通用主体的一致性。<br>**2. 评估复杂性**：RBench的评估不仅要求主体（机器人）外观稳定，更要求其**运动学结构稳定**（如关节数不变、连杆长度恒定），并评估其**动作的物理可行性和任务目标完成度**，评估维度更复杂、更贴近真实机器人应用需求。<br>**3. 数据规模与标注**：RoVid-X（400万视频片段）在机器人视频领域规模最大，且提供了**物理属性标注**（如光流、深度图），直接服务于提升模型的物理世界理解，而前作数据集无此类标注。 |\n\n### 核心区别与主要改善总结\n\n1.  **研究范式的根本转变**：\n    *   **前作**：属于**通用视频生成**范畴的改进研究，旨在提升生成视频的视觉质量、多主体一致性或参考控制能力。\n    *   **本篇**：实现了向**具身智能（Embodied AI）** 领域的战略聚焦。核心目标是推动视频生成模型成为合格的“**世界模拟器**”，能够生成**物理合理、任务可行**的机器人行为视频，以服务于机器人学习、仿真等下游应用。\n\n2.  **从“生成改进”到“评估与数据基建”**：\n    *   **前作**：主要贡献在于提出新的**生成模型或生成引导方法**（如Cinema, MagRef）。\n    *   **本篇**：主要贡献在于构建领域**基础设施**：\n        *   **RBench（评估基准）**：首个针对机器人视频生成的综合性、细粒度评估基准。它**超越了传统感知指标**，通过多维度指标（物理语义、任务遵从、运动平滑度等）系统性地衡量模型的“物理智能”水平。\n        *   **RoVid-X（训练数据集）**：通过四阶段流水线构建的、迄今最大规模的机器人视频数据集。它不仅规模大，而且**质量高、多样性好**（覆盖5大任务、4类机器人、1300+技能），并包含**物理属性增强标注**，旨在从根本上解决训练数据稀缺和质量问题。\n\n3.  **技术贡献的深度与广度**：\n    *   **前作**：技术贡献相对**聚焦**，解决视频生成中的某个特定问题（一致性、可控性）。\n    *   **本篇**：技术贡献是**系统性和生态化**的。它包含了：\n        *   **严谨的评估体系**：设计了可复现的自动化评估流程，并与人类评估高度相关（Spearman系数0.96）。\n        *   **深度的模型分析**：对25个模型的大规模评估揭示了当前SOTA模型（包括Sora系列）在物理机器人任务上的严重不足，以及闭源与开源模型间的显著差距等重要发现。\n        *   **大规模数据工程**：展示了从数据收集、过滤、标注到增强的完整数据流水线。\n        *   **有效性验证**：通过微调实验证明了RoVid-X数据集能稳定提升模型在各项机器人任务上的性能。\n\n**结论**：本篇论文标志着作者团队的研究主线从“提升通用视频生成质量”转向了“为具身智能构建视频世界模型的基础设施”。其核心改善在于**识别并着手解决具身视频生成领域的根本性瓶颈——缺乏可靠的评估标准和高质量的训练数据**。通过创建RBench和RoVid-X这一“评估-数据”协同生态系统，本文为该领域的客观比较、模型迭代和未来发展奠定了坚实基础，其贡献更具基础性和长远影响力。",
            "timestamp": "2026-01-27T16:03:59.920022",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文提出了哪些关键技术方法，请列表格具体详细说明技术细节，需要包含具体的数学原理推导，以及具体参数。",
            "answer": "好的，作为一名专业的学术论文分析助手，我将为您深入分析这篇题为《Rethinking Video Generation Model for the Embodied World》的论文，并详细阐述其提出的关键技术方法。\n\n## 论文核心技术创新与价值分析\n\n本文的核心贡献在于**系统性地解决了面向具身智能（Embodied AI）的视频生成模型在评估与训练数据方面的两大瓶颈**。其技术创新并非提出一个全新的生成模型架构，而是构建了一个**评估-数据协同生态系统**，旨在引导和加速视频生成模型向“物理AI”或“世界模拟器”的范式演进。\n\n**实际价值**：\n1.  **标准化评估**：为机器人视频生成领域提供了首个全面、可复现的基准测试（RBench），改变了以往依赖主观感知指标、忽视物理逻辑和任务完成度的评估现状。\n2.  **数据驱动进步**：构建了目前最大规模、高质量、多形态的机器人视频数据集（RoVid-X），为训练具备物理常识的视频生成模型提供了关键燃料。\n3.  **揭示性能差距**：通过对25个代表性模型的系统评估，清晰揭示了当前通用视频大模型在生成符合物理规律的机器人行为方面存在显著缺陷，尤其是商业模型与开源模型、媒体消费模型与物理仿真模型之间的“领域鸿沟”。\n\n---\n\n## 关键技术方法详述\n\n论文的关键技术方法主要围绕**基准测试构建（RBench）** 和**数据集构建（RoVid-X）** 两条主线展开。以下是具体技术细节的表格化说明：\n\n### 1. 机器人视频生成基准测试 RBench\n\n#### 1.1 基准构建方法论\n\n| 方法组成部分 | 技术细节与目的 | 具体参数/设计 |\n| :--- | :--- | :--- |\n| **双重评估维度** | 从**任务完成度**和**视觉质量**两个核心维度评估生成视频，超越传统仅关注像素保真度的做法。 | - **任务完成度**：关注物理语义合理性和任务依从一致性。<br>- **视觉质量**：关注运动幅度、机器人主体稳定性和运动平滑度。 |\n| **任务导向评估集** | 涵盖机器人常见的五类任务，确保评估的全面性。 | 共250个图像-文本对（每类任务50个）：<br>1. **常见操作**：抓取、放置等基础动作。<br>2. **长程规划**：多步骤顺序任务（如开门->取物->关门）。<br>3. **多实体协作**：机器人与人类、其他机器人的交互。<br>4. **空间关系**：理解并执行“左/右”、“上/下”等空间指令。<br>5. **视觉推理**：涉及颜色、数量、属性等高级语义理解的任务。 |\n| **具身形态评估集** | 覆盖四种主流机器人形态，评估模型的泛化能力。 | 共400个图像-文本对（每种形态100个）：<br>- 单臂机器人、双臂机器人、人形机器人、四足机器人。 |\n| **自动化评估指标** | 利用多模态大语言模型作为零样本评估器，结合传统计算机视觉算法，设计可复现的量化指标。 | 使用 **Qwen3-VL** 和 **GPT-5** 作为MLLM评估器。评估基于从生成视频中均匀采样的关键帧网格（如3x2）。 |\n\n#### 1.2 核心评估指标的数学原理与推导\n\n以下五个细粒度指标通过加权聚合，最终得到“任务完成”和“视觉质量”两个总分。\n\n| 指标名称 | 评估目标 | 数学原理/计算细节 | 关键参数 |\n| :--- | :--- | :--- | :--- |\n| **物理语义合理性** | 检测违反物理常识和语义逻辑的异常（如漂浮、穿透、突然出现）。 | **MLLM VQA协议**：向MLLM输入帧网格和精心设计的提示词，让其判断是否存在特定类型的违规。无显式数学公式，依赖于MLLM的推理能力。 | 提示词工程是关键，明确列举失败模式：`Floating/Penetration`, `Spontaneous emergence`, `Non-contact attachment`。 |\n| **任务依从一致性** | 评估视频是否完整、按顺序执行了提示词要求的动作。 | **MLLM VQA清单**：针对不同任务类型设计检查清单。例如，对长程规划任务，计算**事件完成率**：<br>`Score = 5 * (completed_events / total_events)` | 对于视觉推理任务，采用**问题链**机制：MLLM先根据指令生成一系列验证问题，再根据视频回答，计算正确率。 |\n| **运动幅度** | 量化机器人主体的真实运动，排除相机运动干扰，惩罚“平滑但静止”的视频。 | 1. **主体定位与跟踪**：使用GroundingDINO检测，GroundedSAM生成掩码，CoTracker跟踪掩码内密集点。<br>2. **运动计算**：第t帧归一化后的平均点位移 `D̃_t`。<br>3. **相机运动补偿**：计算背景区域运动 `D̃_t^bg`，补偿后位移：<br>   `D̂_t = { D̃_t - D̃_t^bg, if D̃_t > D̃_t^bg; D̃_t, otherwise }`<br>4. **得分计算**：<br>   `MAS = (1/T) * Σ_{t=1}^T min(D̂_t, 1)` | `T`：总帧数。`min(·, 1)`用于裁剪极值，稳定得分。 |\n| **机器人主体稳定性** | 评估机器人和目标物体的形态、外观在时间上的稳定性。 | **对比式MLLM VQA**：输入参考帧（首帧）和生成帧，要求MLLM比较指定实体（如机械爪）的外观、结构一致性，并给出评分。 | 关注**机器人结构稳定性**（如关节数突变、形状畸变）和**主体外观稳定性**（如物体颜色、类别漂移）。 |\n| **运动平滑度** | 检测时间上的不连续、抖动和模糊等伪影。 | 1. **质量波动检测**：使用Q-Align模型获取每帧美学质量分数 `Q(f_t)`，计算相邻帧差异：<br>   `ΔQ_t = Q(f_{t-1}) - Q(f_t)`<br>2. **自适应阈值**：根据**运动幅度(MAS)** `m` 设定阈值 `τ_s(m)`，允许高运动视频有更大波动。<br>3. **得分计算**：标记异常帧 `I_t = 𝕀(ΔQ_t > τ_s(m))`，则：<br>   `MSS = 1 - (1/T) * Σ_{t=2}^T I_t` | 自适应阈值函数（分段线性）：<br>`τ_s(m) = {0.01 if m<0.1; 0.015 if 0.1≤m<0.3; 0.025 if 0.3≤m<0.5; 0.03 if m≥0.5}` |\n\n#### 1.3 分数聚合方法\n最终得分由上述细粒度指标归一化后，经过惩罚项调整，加权聚合而成。\n- **任务完成分**：`TC = (PSS + TAC) / 2`\n- **视觉质量分**：`VQ = max(0, 0.8*RSS + 0.2*MS - P_MA(MA) - P_RSS)`\n    - `P_MA(MA)` 是运动幅度过低惩罚。\n    - `P_RSS` 是主体稳定性差的惩罚。\n\n### 2. 大规模机器人视频数据集 RoVid-X\n\n#### 2.1 四阶段数据构建流水线\n\n| 阶段 | 技术细节与目的 | 使用的工具/模型 | 产出与规模 |\n| :--- | :--- | :--- | :--- |\n| **1. 机器人视频收集** | 从互联网视频平台和20+个开源数据集中收集原始视频。 | **GPT-5**：用于自动过滤内容，保留与机器人任务相关的视频。 | 约300万个原始视频片段。 |\n| **2. 视频质量过滤** | 剔除低质量、与机器人无关的视频。 | - **场景分割检测**：过滤非机器人场景。<br>- **视频质量评分系统**：从清晰度、动态效果、美学、OCR等多维度打分。 | 高质量视频子集。 |\n| **3. 任务分割与描述** | 将长视频分割成独立的任务片段，并生成精准的文字描述。 | **视频理解模型**：自动识别动作时间边界。<br>**MLLM**：根据设计好的提示模板，生成结构化描述（主体、对象、操作）。 | 约400万个带标注的视频片段。描述格式标准化。 |\n| **4. 物理属性标注** | 为视频添加丰富的物理属性注释，增强数据的物理信息。 | - **FlashVSR**：视频超分辨率，提升清晰度。<br>- **AllTracker**：生成**统一的光流标注**，用于动作一致性分析。<br>- **Video Depth Anything**：",
            "timestamp": "2026-01-27T16:05:11.495801",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他使用了哪些评价指标与数据集，列表格具体讲讲他的评价指标的细节与数据集的细节",
            "answer": "## 论文分析：Rethinking Video Generation Model for the Embodied World\n\n本文针对具身智能（Embodied AI）领域的视频生成模型，提出了一个**系统性评估基准（RBench）**和一个**大规模高质量数据集（RoVid-X）**，旨在解决当前模型在生成物理真实、任务导向的机器人视频方面的不足。\n\n### 一、 核心贡献概述\n\n1.  **RBench（评估基准）**：首个为机器人视频生成设计的综合性基准，包含**650个评估样本**，覆盖**5种任务类型**和**4种机器人形态**，并提出了超越传统视觉保真度的、可复现的自动化评估指标。\n2.  **RoVid-X（数据集）**：目前最大的开源机器人视频生成数据集，包含**约400万个标注视频片段**，涵盖数千种任务，并附有丰富的物理属性标注。\n\n### 二、 评价指标（RBench）详解\n\nRBench的评估体系分为两大维度：**任务完成度**和**视觉质量**。每个维度下包含多个细粒度指标，主要利用**多模态大语言模型**进行自动化评估。\n\n| 评估维度 | 指标名称 | 核心关注点 | 评估方法/细节 |\n| :--- | :--- | :--- | :--- |\n| **任务完成度** | **物理语义合理性** | 视频是否违反基本物理定律和常识。 | 使用MLLM（如GPT-5, Qwen3-VL）分析关键帧网格，检测特定失败模式：<br>- **漂浮/穿透**：物体或机器人部件悬空或相互穿透。<br>- **自发出现/消失**：实体无因果地出现或消失。<br>- **非接触附着/错误抓取**：物体在没有可见接触或抓取器未闭合的情况下随机器人移动。 |\n| | **任务依从一致性** | 生成视频的动作序列是否与文本指令的意图和顺序一致。 | 使用MLLM基于VQA检查清单进行评估：<br>- **任务响应性**：机器人是否启动并完成了目标状态。<br>- **关键动作完整性**：指令要求的关键动作（如抓取、放置）是否发生且顺序正确。 |\n| **视觉质量** | **运动幅度** | 机器人主体的有效运动幅度，排除相机运动干扰。 | 1. 使用**GroundingDINO**定位机器人主体。<br>2. 使用**GroundedSAM**生成稳定掩码。<br>3. 使用**CoTracker**跟踪掩码内的密集关键点。<br>4. 计算补偿背景运动后的平均位移，得分越低表示主体运动越不足。 |\n| | **机器人-主体稳定性** | 机器人形态和目标物体属性在时间上的稳定性。 | 采用**对比式VQA**：MLLM比较参考帧和生成帧，评估一致性。关注：<br>- **机器人结构漂移**：如机械臂数量、关节拓扑、夹爪形状发生不合理变化。<br>- **主体外观漂移**：如物体类别、颜色、形状发生不合理变化。 |\n| | **运动平滑度** | 时间连续性和动态自然度，检测帧间抖动、模糊等伪影。 | 1. 使用**Q-Align**模型计算每帧的美学质量分数。<br>2. 计算相邻帧的质量分数波动。<br>3. 根据**运动幅度**设定自适应阈值，波动超过阈值则标记为异常。<br>4. 得分越高表示运动越平滑。 |\n\n**指标聚合**：最终模型得分由**任务完成**和**视觉质量**两个综合分数平均得到，其中视觉质量分数会因运动幅度不足和稳定性差而受到惩罚。\n\n### 三、 数据集（RoVid-X）详解\n\nRoVid-X旨在为训练具备物理交互先验的视频生成模型提供大规模、高质量、多样化的数据。其构建通过一个**四阶段流水线**完成。\n\n| 阶段 | 名称 | 核心操作与目标 | 产出细节 |\n| :--- | :--- | :--- | :--- |\n| **1** | **机器人视频收集** | 从互联网视频平台和**20多个**开源具身数据集中收集原始视频。使用**GPT-5**进行内容过滤，保留与机器人任务相关的视频。 | 初步筛选出约300万个原始视频片段。 |\n| **2** | **视频质量过滤** | 进行严格的质量筛选：<br>1. 场景分割检测，移除非机器人视频。<br>2. 多维度质量评分系统（清晰度、动态效果、美学、OCR等）。 | 确保最终数据集的视频在视觉上清晰、内容相关且质量高。 |\n| **3** | **任务分割与字幕生成** | 使用视频理解模型自动分析机器人动作：<br>1. 基于时间戳将视频分割为独立的任务片段。<br>2. 为每个片段生成描述性字幕，准确描述机器人动作、操作对象和细节。 | 字幕格式标准化，清晰描述每个视频片段的动作语义。 |\n| **4** | **物理属性标注** | 为视频添加统一的物理属性注释，增强模型的物理空间一致性理解：<br>- **FlashVSR**：视频超分辨率，提升清晰度。<br>- **AllTracker**：标注**统一的光流**，确保跨场景动作跟踪一致性。<br>- **Video Depth Anything**：生成**相对深度图**，描述空间关系。 | 提供丰富的光流和深度信息，为模型学习物理交互和三维结构提供关键数据支持。 |\n\n**数据集关键统计与特点**：\n- **规模**：约 **4百万** 个视频片段。\n- **多样性**：覆盖 **1300+** 种动作技能，**4种主流机器人形态**（单臂、双臂、人形、四足），以及丰富的任务类型和交互物体。\n- **质量**：分辨率主要为 **720P**，附带**光流**和**深度**标注。\n- **独特性**：与现有机器人数据集（如Open X-Embodiment, DROID等）相比，**RoVid-X** 是首个**专为视频生成模型设计**、**规模最大**、且提供**统一物理属性标注**的开源数据集。\n\n### 四、 技术创新与实际价值\n\n1.  **评估范式的转变**：从追求“视觉逼真”转向评估“物理智能”。**RBench** 首次系统性地将物理合理性、任务逻辑和机器人形态稳定性纳入视频生成模型的评估体系，揭示了当前SOTA模型（如Sora系列）在具身任务上存在的显著“领域鸿沟”。\n2.  **数据驱动的解决方案**：明确指出高质量训练数据的匮乏是瓶颈。**RoVid-X** 不仅提供了数据量，更重要的是通过**端到端的处理流水线**和**物理属性增强**，创造了适用于学习物理交互先验的结构化数据。\n3.  **协同生态系统**：论文构建了 **“评估-数据”协同的生态系统**。RBench诊断模型缺陷，RoVid-X提供治疗“药方”。实验表明，使用RoVid-X微调现有模型，能稳定提升其在RBench各项指标上的表现。\n4.  **对领域的深刻洞察**：通过对25个代表性模型的评估，得出关键结论：商业闭源模型领先；模型迭代显著提升物理推理能力；**精细操作和高级逻辑推理是当前模型的共同瓶颈**；专用于特定机器人的模型无法弥补“世界知识”的缺失。\n\n**总结**：本工作为具身AI领域的视频生成研究奠定了坚实的评估和数据基础。它推动该领域从生成“好看的视频”向构建能够模拟真实物理交互的“世界模拟器”迈进，对于发展通用具身智能具有重要的理论和实践价值。",
            "timestamp": "2026-01-27T16:06:12.565893",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文在哪些数据集上进行了实验？主要的评估指标和性能提升是多少？",
            "answer": "## 论文实验数据集、评估指标与性能提升分析\n\n### 一、 实验数据集\n论文的实验主要围绕其提出的两个核心贡献展开：**评估基准 RBench** 和**训练数据集 RoVid-X**。\n\n1.  **评估基准：RBench**\n    *   **性质**：一个专门为机器人视频生成任务设计的综合性评估集。\n    *   **规模**：包含 **650** 个精心策划的评估样本（图像-文本对）。\n    *   **构成**：\n        *   **任务导向**：涵盖5个代表性机器人任务领域，各50个样本。\n            *   常见操作\n            *   长时程规划\n            *   多实体协作\n            *   空间关系\n            *   视觉推理\n        *   **具身导向**：涵盖4种主流机器人形态，各100个样本。\n            *   双臂机器人\n            *   人形机器人\n            *   单臂机器人\n            *   四足机器人\n    *   **来源**：样本图像来自开源数据集或网络公开的高质量机器人视频关键帧，并经过人工验证和重新设计文本提示，以避免与训练数据重叠。\n\n2.  **训练数据集：RoVid-X**\n    *   **性质**：一个大规模、高质量、专为具身视频生成模型训练设计的开源机器人视频数据集。\n    *   **规模**：包含约 **400万** 个经过筛选和标注的机器人视频片段。\n    *   **来源与构建**：通过一个四阶段流水线整合了超过20个开源数据集和网络视频平台。\n        1.  机器人视频收集\n        2.  视频质量过滤\n        3.  任务分割与描述生成\n        4.  物理属性标注（如光流、深度图）\n    *   **特点**：覆盖广泛的机器人形态和任务类型，提供标准化的任务描述和丰富的物理属性注释。\n\n### 二、 主要评估指标\n论文提出了一套超越传统视觉保真度、专注于机器人任务完成度和物理真实性的自动化评估指标。这些指标通过多模态大语言模型（MLLM）和底层视觉计算相结合的方式进行评估。\n\n**核心指标分为两大维度：**\n\n1.  **任务完成度**\n    *   **物理语义合理性**：评估视频是否违反基本物理定律和常识（如物体漂浮、穿透、非接触附着、实体无故出现/消失）。\n    *   **任务遵循一致性**：评估生成视频的动作序列是否与文本指令的意图和顺序一致（如关键动作是否完整、顺序是否正确）。\n\n2.  **视觉质量**\n    *   **运动幅度**：量化机器人主体的有效运动幅度，排除相机运动的影响，惩罚“平滑但静止”的失败案例。\n    *   **机器人-主体稳定性**：评估机器人的形态结构以及目标物体的属性（如类别、颜色、形状）在时间上的稳定性。\n    *   **运动平滑度**：评估视频在时间上的连续性和动态自然度，检测帧间抖动、模糊等伪影。\n\n**指标聚合**：最终，上述五个细粒度指标被聚合成两个总分：**任务完成总分** 和 **视觉质量总分**，用于模型间的综合比较。\n\n### 三、 主要性能提升与关键发现\n论文通过在 **RBench** 上评估 **25个** 代表性视频生成模型（包括开源、商业和机器人专用模型），并利用 **RoVid-X** 进行微调实验，得出了以下核心性能分析和提升验证：\n\n1.  **基准评估揭示的模型能力差距**\n    *   **商业模型领先**：排名前7的均为商业闭源模型（如Wan 2.6, Seedance 1.5 Pro），其**平均得分（~0.58）**显著高于最好的开源模型（Wan2.2_A14B，得分0.507）。\n    *   **“媒体-模拟”鸿沟**：面向消费级媒体的知名模型（如Sora系列）在该基准上表现不佳（Sora v2 Pro排名第17，得分0.362），表明**视觉流畅性不等于物理真实性**。\n    *   **认知与精细控制是瓶颈**：所有模型在需要**高级逻辑推理**的任务上表现最差。在机器人形态上，模型在**精细操作**上的得分普遍低于**粗粒度运动**。\n    *   **领域数据 vs. 世界知识**：机器人专用模型（如Cosmos 2.5）表现稳健，但纯机器人数据训练的模型（如Vidar）排名靠后，说明**大规模通用预训练提供的“世界知识”不可或缺**。\n\n2.  **RoVid-X数据集的有效性验证**\n    *   **实验设置**：使用RoVid-X的子集（20万实例）对两个开源基础模型（Wan2.1_14B 和 Wan2.2_5B）进行微调。\n    *   **性能提升**：微调后，模型在**所有五个任务领域和四种机器人形态**上的评估得分均获得稳定提升。\n    *   **具体数据示例**：\n        *   **Wan2.1_14B模型**：\n            *   **任务维度**：在“长时程规划”任务上，得分从 **0.335** 提升至 **0.389**；在“视觉推理”任务上，从 **0.205** 大幅提升至 **0.298**。\n            *   **形态维度**：在“单臂机器人”上，得分从 **0.464** 提升至 **0.526**；在“四足机器人”上，从 **0.595** 提升至 **0.639**。\n            *   **总体平均分**：从 **0.399** 提升至 **0.446**。\n        *   **Wan2.2_5B模型**也显示出类似的全面提升趋势。\n\n3.  **评估指标与人类偏好高度一致**\n    *   通过人工偏好研究，论文计算了RBench自动评分与人类评分之间的**斯皮尔曼等级相关系数**，达到了 **0.96**，证明了其提出的自动化评估指标能够有效反映人类的主观判断。\n\n### 总结\n论文通过构建**RBench评估基准**和**RoVid-X训练数据集**，建立了一个从评估到训练的完整生态系统。实验表明：\n*   **当前最先进的视频生成模型在生成物理真实的机器人行为方面仍有显著不足**，特别是在需要复杂推理和精细操作的任务上。\n*   **使用高质量、多样化的机器人视频数据（RoVid-X）进行微调，可以稳定提升模型在各项机器人任务上的性能**。\n*   论文提出的**评估指标体系**不仅自动化程度高，而且与人类评价高度一致，为机器人视频生成领域的模型发展和比较提供了可靠、可复现的衡量标准。",
            "timestamp": "2026-01-27T16:07:05.585809",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文的主要局限性有哪些？未来可能的改进方向是什么？",
            "answer": "## 论文主要局限性分析\n\n基于对论文内容的分析，其提出的**RBench**基准和**RoVid-X**数据集虽然为具身智能领域的视频生成模型评估与训练提供了重要基础，但研究本身仍存在一些局限性，主要集中在以下几个方面：\n\n### 1. 评估基准的局限性\n- **自动化评估的依赖与偏差**：RBench的核心评估指标严重依赖多模态大语言模型（如GPT-5、Qwen3-VL）作为“零样本评估器”。虽然论文报告了与人类评估的高相关性（Spearman ρ=0.96），但MLLM自身的偏见、对物理常识理解的局限性，以及提示词工程（Prompt Engineering）的敏感性，都可能引入系统性误差。评估结果可能无法完全捕捉人类在判断物理合理性和任务完成度时的细微差别。\n- **评估范围的有限性**：RBench包含了5类任务和4种机器人形态，共计650个评估样本。尽管具有多样性，但对于涵盖无限可能的真实机器人交互世界而言，其规模和场景覆盖度仍然有限。它可能无法充分评估模型在更复杂、更罕见或涉及多模态反馈（如力觉、触觉）场景下的表现。\n- **缺乏对生成动作“可执行性”的评估**：当前评估主要关注视频的“观看”质量（视觉保真度、物理合理性、任务一致性），但未直接评估生成的动作序列是否能够被真实的机器人硬件安全、稳定地执行。这忽略了从“视频模拟”到“可执行策略”的关键转化步骤。\n\n### 2. 数据集的局限性\n- **数据来源与质量的不均性**：RoVid-X整合了超过20个开源数据集和网络视频，虽然通过四阶段流水线进行了过滤和标注，但原始数据在分辨率、拍摄视角、任务规范性和噪声水平上存在差异。这种异质性可能对模型训练产生不可预测的影响，并难以保证所有数据片段都达到同等的高物理保真度标准。\n- **标注的自动化与精度瓶颈**：物理属性标注（如光流、深度图）依赖于FlashVSR、AllTracker、Video Depth Anything等自动化工具。这些工具在复杂动态场景、遮挡或快速运动下可能产生错误或噪声，从而限制了标注数据的绝对精度和可靠性。\n- **“仿真-现实”鸿沟的遗留**：尽管RoVid-X旨在提供物理交互先验，但它本质上仍是观察性视频数据的集合，而非在具有精确物理引擎的仿真环境中生成的、附带完整状态和动作数据的数据。因此，模型从中学到的物理规律可能是不完整或近似的，难以泛化到全新的物理配置或极端交互中。\n\n### 3. 模型评估结论的局限性\n- **静态快照评估**：论文对25个模型的评估是一个“静态”比较，反映了特定时间点模型的性能排名。视频生成模型领域发展迅速，模型的迭代和更新可能很快改变这一格局。此外，评估未深入探究不同模型架构（如Diffusion Transformer, MoE）与性能差异之间的因果关系。\n- **对失败模式根源分析不足**：论文指出了模型在视觉推理、精细操作等方面的瓶颈，但对其根本原因（如训练数据偏差、模型容量限制、损失函数设计缺陷）的分析相对表面，更多是现象描述而非机理探究。\n\n---\n\n## 未来可能的改进方向\n\n论文在结论和未来工作部分已提出一些方向，结合其局限性，可归纳出以下更具体的改进路径：\n\n### 1. 评估体系的深化与拓展\n- **开发更鲁棒、更物理化的自动评估指标**：减少对黑盒MLLM的依赖，探索结合**物理引擎仿真验证**的评估方法。例如，将生成的视频轨迹解析为机器人关节状态序列，在仿真中重放并检查其动力学可行性、碰撞情况以及最终是否达成任务目标。\n- **构建分层、可扩展的基准**：建立涵盖从简单物理规则（物体坠落、碰撞）到复杂长程任务规划的**分层评估体系**。同时，设计基准的**可扩展机制**，允许社区持续贡献新的、更具挑战性的测试案例。\n- **引入“策略可执行性”评估维度**：与逆动力学模型（IDM）或技能提取模型结合，评估从生成视频中提取出的动作指令在仿真或真实机器人上的执行成功率和效率，真正连接生成与执行。\n\n### 2. 数据与训练方法的革新\n- **仿真与真实数据融合**：构建**混合数据流水线**，将高保真物理仿真生成的结构化数据（精确状态、动作、奖励）与RoVid-X等真实世界视频数据相结合。仿真数据可以提供无噪声、全覆盖的物理交互范例，而真实数据则提供外观多样性和现实噪声，二者互补。\n- **发展物理引导的视频生成模型**：在模型架构或训练目标中显式地引入**物理约束**。例如，在扩散过程中加入基于物理定律的引导项，或训练一个辅助的物理合理性判别器来协同训练生成模型。\n- **探索更高效的数据表示与利用方式**：研究如何更好地利用RoVid-X中的多模态标注（光流、深度）。例如，设计模型同时学习生成RGB视频和对应的深度或光流场，以内部强化其几何与运动理解。\n\n### 3. 迈向闭环与具身智能\n- **实现“视频生成-策略提取-闭环控制”的完整链路**：这是论文明确指出的核心未来方向。需要深入研究如何从生成的视频中**稳健地提取可执行的动作表示**（通过改进的IDM或潜在动作模型），并将此流程与机器人策略学习框架（如强化学习、模仿学习）闭环集成，在仿真和现实中进行端到端验证。\n- **开发面向控制的视频世界模型**：将视频生成模型扩展为**可交互的世界模型**，不仅能够根据指令生成视频，还能模拟机器人执行特定动作后的未来状态，用于基于模型的规划与策略学习。\n- **关注泛化与适应能力**：研究如何使模型能够快速适应新的机器人形态、新的物体或新的环境。这可能涉及元学习、基于提示的调整或更灵活的多模态编码器设计。\n\n### 4. 开放科学与生态建设\n- **持续维护与更新基准与数据集**：建立机制，使RBench和RoVid-X能够随着领域发展而迭代更新，纳入新的挑战任务和更高质量的数据，保持其相关性和前沿性。\n- **深入的开源与分析**：除了发布基准和数据集，进一步开源详细的模型评估日志、失败案例分析和消融实验代码，帮助社区更深入地理解模型行为的决定因素，推动根本性创新。\n\n**总结而言，该论文的局限性主要在于评估方法的依赖性与数据集的固有边界，而其最大的价值在于清晰地揭示了当前视频生成模型与具身智能需求之间的“物理鸿沟”。未来的改进将围绕构建更严谨的评估体系、创造融合仿真与真实的高质量数据、在模型中嵌入物理先验，并最终打通从视频生成到机器人动作执行的完整闭环，这是实现通用物理AI的关键路径。**",
            "timestamp": "2026-01-27T16:08:05.393198",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        }
    ],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-21T18:59:18Z",
    "created_at": "2026-01-27T15:53:25.143637",
    "updated_at": "2026-01-27T15:53:25.143644"
}