{
  "id": "2601.09031v1",
  "title": "Generalizable Geometric Prior and Recurrent Spiking Feature Learning for Humanoid Robot Manipulation",
  "authors": [
    "Xuetao Li",
    "Wenke Huang",
    "Mang Ye",
    "Jifeng Xuan",
    "Bo Du",
    "Sheng Liu",
    "Miao Li"
  ],
  "abstract": "Humanoid robot manipulation is a crucial research area for executing diverse human-level tasks, involving high-level semantic reasoning and low-level action generation. However, precise scene understanding and sample-efficient learning from human demonstrations remain critical challenges, severely hindering the applicability and generalizability of existing frameworks. This paper presents a novel RGMP-S, Recurrent Geometric-prior Multimodal Policy with Spiking features, facilitating both high-level skill reasoning and data-efficient motion synthesis. To ground high-level reasoning in physical reality, we leverage lightweight 2D geometric inductive biases to enable precise 3D scene understanding within the vision-language model. Specifically, we construct a Long-horizon Geometric Prior Skill Selector that effectively aligns the semantic instructions with spatial constraints, ultimately achieving robust generalization in unseen environments. For the data efficiency issue in robotic action generation, we introduce a Recursive Adaptive Spiking Network. We parameterize robot-object interactions via recursive spiking for spatiotemporal consistency, fully distilling long-horizon dynamic features while mitigating the overfitting issue in sparse demonstration scenarios. Extensive experiments are conducted across the Maniskill simulation benchmark and three heterogeneous real-world robotic systems, encompassing a custom-developed humanoid, a desktop manipulator, and a commercial robotic platform. Empirical results substantiate the superiority of our method over state-of-the-art baselines and validate the efficacy of the proposed modules in diverse generalization scenarios. To facilitate reproducibility, the source code and video demonstrations are publicly available at https://github.com/xtli12/RGMP-S.git.",
  "url": "https://arxiv.org/abs/2601.09031v1",
  "html_url": "https://arxiv.org/html/2601.09031v1",
  "html_content": "Generalizable Geometric Prior and Recurrent Spiking Feature Learning for Humanoid Robot Manipulation\nXuetao Li\nİD\n, Wenke Huang\nİD\n, Mang Ye\nİD\n, , Jifeng Xuan\nİD\n,\nBo Du\nİD\n, , Sheng Liu\nİD\n, , and Miao Li\nİD\nThe authors are with the School of Computer Science, School of Robotics, Institute of Technological Sciences, Wuhan University, Wuhan, China 430072. E-mail:{xtli312, wenkehuang, yemang, jxuan, dubo, shengliu, miao.li}@whu.edu.cn, (Xuetao Li and Wenke Huang contributed equally, Jifeng Xuan and Miao Li are corresponding authors).\nA preliminary version of this work has appeared in Proceedings of the AAAI Conference on Artificial Intelligence (AAAI 2026)\n[\n1\n]\n.\nAbstract\nHumanoid robot manipulation is a crucial research area for executing diverse human-level tasks, involving high-level semantic reasoning and low-level action generation. However, precise scene understanding and sample-efficient learning from human demonstrations remain critical challenges, severely hindering the applicability and generalizability of existing frameworks.\nThis paper presents a novel RGMP-S, Recurrent Geometric-prior Multimodal Policy with Spiking features, facilitating both high-level skill reasoning and data-efficient motion synthesis.\nTo ground high-level reasoning in physical reality, we leverage lightweight 2D geometric inductive biases to enable precise 3D scene understanding within the vision-language model. Specifically, we construct a Long-horizon Geometric Prior Skill Selector that effectively aligns the semantic instructions with spatial constraints, ultimately achieving robust generalization in unseen environments.\nFor the data efficiency issue in robotic action generation, we introduce a Recursive Adaptive Spiking Network. We parameterize robot-object interactions via recursive spiking for spatiotemporal consistency, fully distilling long-horizon dynamic features while mitigating the overfitting issue in sparse demonstration scenarios.\nExtensive experiments are conducted across the Maniskill simulation benchmark and three heterogeneous real-world robotic systems, encompassing a custom-developed humanoid, a desktop manipulator, and a commercial robotic platform. Empirical results substantiate the superiority of our method over state-of-the-art baselines and validate the efficacy of the proposed modules in diverse generalization scenarios. To facilitate reproducibility, the source code and video demonstrations are publicly available at\nhttps://github.com/xtli12/RGMP-S.git\n.\nIndex Terms:\nHumanoid Robot Manipulation, Geometric Prior, Recurrent\nSpiking Feature Learning.\n1\nIntroduction\nHumanoid robots represent a pivotal frontier in embodied intelligence, capable of merging high-level cognition with dexterous physical interaction\n[\n53\n,\n29\n]\n, largely propelled by the emergence of foundation models trained on massive-scale datasets\n[\n63\n]\n. However, in real-world deployment, robotic agents face inherently unstructured environments governed by complex physical laws, which differ significantly from the static internet data distributions used in pre-training\n[\n25\n,\n23\n]\n. Due to the infinite variability of 3D scenes and the exorbitant cost of collecting high-fidelity interaction data, the prevailing ”brute-force” scaling paradigm, which relies on exhaustive statistical memorization, becomes prohibitive and sample-inefficient for mastering dynamic manipulation tasks\n[\n2\n]\n. Driven by such real-world challenges, augmenting architectures with explicit geometric reasoning and spatial awareness has been increasingly explored, as it equips agents with structural inductive biases to decipher physical constraints effectively\n[\n48\n]\n.\nFigure 1:\nOverview of our framework.\nBy integrating geometric commonsense with spatiotemporal features, our RGMP-S encodes the robot-target spatial relationships for manipulation tasks. RGMP-S achieves a 19% performance improvement and exhibits\n5\n×\n5\\times\ngreater data efficiency compared to the Diffusion Policy (DP) baseline.\nVision-Language Models (VLMs), exemplified by PaLM-E and InstructBLIP, excel at parsing spatial semantic information from multimodal inputs to generate logical robotic task plans\n[\n13\n,\n12\n,\n31\n]\n. However, a critical gap remains in the execution phase: current architectures struggle to translate abstract instructions into contextually appropriate robotic skills\n[\n52\n]\n. The fundamental bottleneck lies in the 3D geometric grounding process, where VLMs, despite their proficiency in object identification, often fail to infer the physical interaction affordances dictated by specific geometries\n[\n3\n]\n. Specifically, regarding skill selection in open-world environments, this disconnect leads to a breakdown in differentiating manipulation primitives. Standard VLMs often confuse geometrically sensitive actions, such as grasping versus pinching, when encountering diverse object shapes\n[\n45\n,\n51\n]\n. For instance, a model trained to grasp standard Coke cans typically targets the cylindrical sidewall. When presented with a crushed Coke can, the VLM retains semantic recognition but fails to perceive the structural deformation. Consequently, the robot attempts to execute the original side-grasping primitive, which is no longer physically feasible for the flattened geometry, resulting in task failure, as illustrated in\nFig.\n1\n. In fact, the flattened profile necessitates a pinching motion rather than the conventional side grasp. Such failures stem from a lack of explicit\ngeometric reasoning\n. Existing approaches usually combine spatial indicators such as bounding boxes or contact points with high-level task descriptions\n[\n36\n,\n11\n]\n. However, these methods predominantly rely on coarse semantic embeddings. In dynamic settings, such dependence results in plans that maintain semantic validity yet remain physically inexecutable\n[\n43\n]\n. This deficiency emphasizes the critical necessity for systems capable of verifying skill feasibility through rigorous geometric analysis. This leads to a core research question:\nI)\nHow can robots effectively exploit geometric reasoning to reliably select feasible manipulation skills?\nDespite the remarkable progress in robotic manipulation driven by generative models, deploying these policies in dynamic environments remains a formidable challenge. A predominant paradigm, Diffusion Policies, has demonstrated exceptional capability in modeling action space by leveraging Gaussian noise to represent robotic behaviors\n[\n10\n]\n. By learning the gradient of the data distribution, these methods can generate high-fidelity trajectories that capture human-like dexterity\n[\n38\n]\n. However, this expressiveness comes at a steep computational cost. The inherent mechanism of diffusion models relies on an iterative reverse denoising process. As highlighted in recent analyses\n[\n63\n,\n49\n]\n, this sequential computation introduces prohibitive inference latency, rendering standard diffusion approaches ill-suited for high-frequency, responsive manipulation tasks where real-time feedback loops are critical. To circumvent the latency bottleneck of iterative solvers, recent advances in Vision-Language-Action (VLA) models and Transformer-based architectures advocate for direct, end-to-end action generation\n[\n7\n,\n63\n,\n52\n]\n. These methods typically tokenize visual observations and directly predict actions in a feed-forward manner, ensuring rapid inference. However, achieving robust generalization with these architectures has historically demanded a brute-force strategy: scaling model parameters to billions and training on massive, diverse datasets. While effective at scale, this approach is data-inefficient and computationally heavy. Crucially, these methods often treat visual inputs as flattened sequences of semantic tokens, ignoring the intrinsic spatiotemporal mechanisms of manipulation. They lack explicit inductive biases to capture the fine-grained\nspatial relationships\nbetween the robotic end-effector and the target object, and often fail to distinguish task-relevant features from the dense, noisy visual context\n[\n46\n,\n30\n]\n. Consequently, without massive data covering every variation, these black-box mappings are prone to latching onto spurious background correlations, leading to poor performance under domain shifts or in cluttered scenes\n[\n24\n]\n. Thus, a critical research gap exists between the need for expressive, real-time control and the requirement for data-efficient generalization. The challenge lies in moving beyond simple parameter scaling or inefficient iterative denoising. Instead, we must explore how to construct an architecture that naturally embeds the spatiotemporal structure of manipulation tasks. This leads to the other core research question:\nII)\nHow can robots effectively learn robust data-efficient policies from limited demonstrations?\nTo surmount the deficiency in spatial-geometric reasoning outlined in\nI)\n, inspired by the efficiency of human cognitive processes in synthesizing vision and logic, a preliminary version of this work published in AAAI 2026\n[\n1\n]\nexplores geometric priors via a lightweight commonsense tuning strategy. In particular, we aim to bridge the gap between 3D geometric perception and semantic task planning through implicit geometric information decoding from 2D inputs. Traditional explicit 3D reconstruction provides detailed spatial information, but it exhibits high computational latency and sensitivity to noise\n[\n47\n]\n, and lacks of adaptability for real-time robotic interaction. This motivates us to bypass costly reconstruction in favor of capturing implicit geometric structures directly from RGB inputs. We propose the\nLong-horizon Geometric-prior Skill Selector\n(LGSS) to encode spatial affordances into the latent space of the policy, effectively aligning 3D spatial indicators with robotic action spaces and commonsense reasoning. Specifically, we integrate geometric inductive biases into a VLM with minimal fine-tuning, requiring only a concise set of rule-based constraints. This approach offers a practical solution to realize robust decision-making in unseen environments. Furthermore, we believe that LGSS is essential because it introduces a decision-making process analogous to human cognition\n[\n5\n]\n, which mirrors the human ability to synthesize an action plan for the long-horizon manipulation task.\nTo this end, we develop the LGSS framework to enable the manipulation of diverse objects via rigorous geometric consistency checks, proving its effectiveness and robustness in real-world humanoid deployment.\n8\n14\n12\nFigure 2:\nPipeline of RGMP-S\n. Upon receiving a speech command, the robot utilizes LGSS (see\n§\n3.1\nfor details) to identify and localize the target object. By integrating object coordinates, shape cues (extracted via Yolov8n-seg\n[\n58\n]\nmodel\nϕ\n\\phi\n), and geometric-prior knowledge, the robot selects an appropriate skill from the library, where each primitive is associated with a pretrained RASNet model (see\n§\n3.2\nfor details). The selected RASNet model subsequently executes the task precisely through adaptive recursive feature extraction and GMM-based refinement.\nTo surmount the overfitting risks inherent to limited data (\nII\n), we deviate from data-hungry scaling and instead embed explicit spatiotemporal inductive biases via recursive spiking dynamics, enabling the efficient distillation of robust skills from sparse demonstrations. In our conference version\n[\n1\n]\n, we employed recurrent computation to construct spatial relationships between the robotic end-effector and the target object, offering a foundational policy for action generation. However, standard recursive models are prone to vanishing gradients during global modeling\n[\n37\n]\nand often struggle to distinguish task-salient features from complex backgrounds\n[\n6\n]\n. We posit that effective spatial memory requires dynamic regulation to prevent the loss of key historical cues while suppressing noise. Purely spatial processing lacks the temporal reasoning necessary to filter redundant information from dense visual features\n[\n44\n]\n. This motivates us to introduce an adaptive mechanism that integrates spiking information to refine feature retention. In this journal version, we propose the\nRecursive Adaptive Spiking Network\n(RASNet), which incorporates Spiking Dense Feature Extraction (SDFE) to embed temporal reasoning into spatial feature understanding. We utilize Rotary Position Embeddings (RoPE) and recursive computation to form a global spatial memory, while simultaneously deploying an Adaptive Decay Mechanism and Adaptive Spike Neurons (ASN) to dynamically control memory retention and amplify task-critical features. Finally, we apply Gaussian Mixture Models (GMM) to approximate the joint motions. Compared with our conference version, SDFE not only effectively suppresses redundancy within dense information but also significantly enhances the generalization ability in unseen scenarios featuring complex backgrounds.\nOur primary contribution is to present RGMP-S, a unified framework that bridges the semantic-geometric gap to achieve robust, data-efficient, and generalizable robotic manipulation. To successfully facilitate high-level skill reasoning and low-level motion synthesis, we present the following technical contributions:\n•\nLong-horizon Geometric-prior Skill Selector (LGSS).\nWe introduce a lightweight geometric tuning strategy that fuses vision-language models with low-rank geometric adapters. By injecting shape-level commonsense biases, LGSS aligns semantic instructions with latent geometric constraints, enabling the precise selection of parameterized skills from a pretrained library without requiring task-specific fine-tuning.\n•\nRecursive Adaptive Spiking Network (RASNet).\nWe formulate a novel policy architecture to investigate intrinsic spatiotemporal mechanisms in robotic manipulation. By modulating latent representations through Adaptive Spike Neurons (ASN) and recursive computation, this network captures directional spatial dependencies within a spatiotemporally consistent latent space. This design effectively distills task-critical features from dense visual observations while mitigating optimization conflicts in sparse data regimes.\n•\nData-Efficient Generalization.\nWe conduct a rigorous validation of the RGMP-S framework across the ManiSkill benchmark and three diverse physical robotic platforms. Extensive real-world experiments demonstrate that our framework ensures robustness against dynamic disturbances, significantly outperforming the Diffusion Policy baseline with an 89% generalization success rate and 5\n×\n\\times\nsuperior data efficiency.\nThis manuscript represents a substantial extension of our preliminary version published in AAAI 2026\n[\n1\n]\n. We augment the original work in the following aspects:\n•\nAlgorithmic Advancement in Reasoning.\nWe advance the preliminary skill selector to the LGSS via a hierarchical Chain-of-Thought (CoT) mechanism. This enhancement enables the structured decomposition of intricate goals into multi-stage sequences, significantly boosting performance on long-horizon manipulation tasks (e.g., towel folding and water pouring).\n•\nArchitectural Evolution for Robustness.\nWe evolve the previous visuomotor module with Spiking Dense Feature Extraction (SDFE) and Adaptive Spike Neurons (ASN) to dynamically filter redundant visual noise in cluttered scenes (as shown in\nFig.\n2\n). This addresses the limitations of the original model regarding feature redundancy and lack of temporal logic, ensuring robust action synthesis in unstructured environments.\n•\nExpanded Real-World Evaluation.\nWe broaden the experimental scope by incorporating a commercial Aloha robot\n[\n15\n]\nand introducing three additional challenging long-horizon manipulation tasks: towel folding, water pouring, and bin picking, as detailed in\n§\n4.1\n.\n2\nRelated Work\n2.1\nVision-Language Models for Robotic Manipulation\nSemantic Planning and Grounding\n. A pioneering line of work leverages the semantic reasoning capabilities of Large Language Models (LLMs) and Vision-Language Models (VLMs) to decompose high-level instructions into a sequence of robotic primitives\n[\n3\n,\n13\n,\n12\n]\n. While these foundation models excel at high-level task planning, they often treat the physical world as a semantic abstraction. Consequently, they suffer from a\nsemantic-geometric gap\n, where the generated plans are logically sound but physically inexecutable due to a lack of low-level spatial awareness. Subsequently, a large body of methods\n[\n60\n,\n50\n,\n32\n,\n33\n]\nbegan to incorporate explicit 3D representations, such as voxels or neural radiance fields, to ground semantic queries into physical space. For instance, recent research has explored establishing dense correspondence between visual observations and linguistic concepts to enhance manipulation precision\n[\n40\n]\n. These methods mainly focus on explicit 3D reconstruction or external trajectory solvers to bridge the gap. However, when robots operate in unstructured open-world environments, explicit reconstruction exhibits high computational latency and sensitivity to perception noise\n[\n47\n]\n. Meanwhile, relying on external motion planners separates semantic reasoning from control, which is a suboptimal setting for dynamic interaction. In this paper, we focus on learning implicit geometric priors directly from 2D RGB inputs. By fusing geometric adapters with VLMs, our LGSS avoids costly reconstruction while maintaining robust spatial reasoning.\nGeometric Reasoning in Manipulation\n.\nWith the demand for precise object interaction, geometric-aware manipulation has been an active research field. One direction is introducing object-centric representations\n[\n59\n,\n35\n]\nthat predict keypoints or 6-DoF poses. However, these techniques struggle with category-agnostic objects or deformable materials where defining canonical poses is difficult. Recently, a specific line of research\n[\n51\n,\n45\n,\n14\n]\nleverages affordance maps or contact primitives to guide grasping. Therefore, these approaches heavily rely on the quality of pre-defined primitives and often fail to distinguish fine-grained manipulation modes (e.g., grasping versus pinching) under structural deformation. Recent works\n[\n26\n,\n61\n,\n36\n]\nhave proven the feasibility of combining bounding boxes with language. However, these methods reach only coarse spatial alignment, which is not suitable for learning a generalizable policy for diverse geometries and thus lead to task failure in unseen scenarios. In this paper, based on the Geometric Prior Skill Selector, we inject shape-level commonsense biases to enforce rigorous geometric consistency checks, thereby effectively mitigating uncertainties and handling dynamic constraints to ensure robust reasoning in tasks.\n2.2\nGenerative Robotic Policy Learning\nImitation learning\n[\n39\n,\n42\n]\nhas been an essential paradigm in robotics, with the goal of acquiring robust policies from expert demonstrations\n[\n41\n]\n. Existing works can be broadly divided into two branches: Transformer-based methods\n[\n62\n,\n7\n,\n9\n,\n22\n]\nand Diffusion-based methods\n[\n10\n,\n27\n]\n. Transformer architectures, such as the Decision Transformer\n[\n8\n]\n, treat control as a sequence modeling problem. Specifically, self-attention mechanisms in Transformers have been shown to effectively capture global dependencies\n[\n19\n]\n. However, achieving generalization with Transformers has historically demanded a brute-force scaling strategy involving billions of parameters and massive datasets\n[\n63\n]\n. In contrast, Diffusion Policies, they model the action distribution using iterative denoising processes. Despite their expressiveness in capturing multimodal distributions, the sequential denoising computation introduces prohibitive inference latency. Unlike standard diffusion approaches, we focus on a feed-forward recursive architecture that ensures high-frequency real-time responsiveness without the heavy computational strain typically associated with iterative solvers.\n2.3\nSpatiotemporal Representation\nLearning effective spatiotemporal representations is critical for mastering dynamic tasks. Traditional approaches utilize Recurrent Neural Networks (RNNs) or LSTMs\n[\n21\n]\nto model temporal dependencies. However, standard recursive models are prone to vanishing gradients and often struggle to filter redundant information from dense visual streams. Recently, Spiking Neural Networks (SNNs) have emerged as a powerful method for processing temporal information with high energy efficiency and sparse computation\n[\n18\n,\n56\n,\n57\n]\n. Related methods have explored SNNs for event-based vision and motion estimation\n[\n56\n,\n16\n]\n. The key difference between our RASNet and the aforementioned efforts is that ours is designed for dense visual feature extraction rather than purely neuromorphic processing. Inspired by the efficiency of spiking neurons, we construct the Adaptive Spike Neuron (ASN) to modulate feature retention. Furthermore, we investigate how to better maintain global spatial dependencies and develop the Recursive Adaptive Spiking Network, which captures intrinsic spatiotemporal mechanisms and ensures data efficiency under limited demonstrations.\n3\nMethodology\nTABLE I:\nNotations\ntable.\nDescription\nDescription\n𝒫\n\\mathcal{P}\nGenerated action plan\nℐ\n\\mathcal{I}\nCurrent user instruction\n𝒪\n\\mathcal{O}\nCurrent visual observation\n𝒞\n\\mathcal{C}\nPredefined contextual set\n𝒫\ni\n\\mathcal{P}_{i}\nAction sequence (\nEq.\n1\n)\n𝒲\n\\mathcal{W}\nAdaptive decay factors (\nEq.\n3\n)\nF\n0\nF_{0}\nInitial feature map (\nEq.\n2\n)\nX\nk\nX_{k}\nSpatial attention mask (\nEq.\n9\n)\nB\nk\nB_{k}\nSpatial attention feature (\nEq.\n9\n)\nD\nk\nD_{k}\nFeature for attention processing\nQ\nA\nQ_{A}\nSpiking dense feature (\nEq.\n11\n)\nF\nk\nF_{k}\nExtracted dense feature map\n𝒜\n\\mathcal{A}\nAdaptive spike neuron function\nμ\nk\n\\mu_{k}\nMean of\nk\nk\n-th GMM component\nF\nf\nF_{f}\nFused feature map (\nEq.\n14\n)\na\ni\n​\nn\na_{in}\nInitial action prediction (\nEq.\n16\n)\nΣ\nk\n\\Sigma_{k}\nCovariance of\nk\nk\n-th GMM component\nl\nk\nl_{k}\nMahalanobis distance (\nEq.\n20\n)\nK\nK\nNumber of GMM components\nμ\nk\nω\n\\mu_{k}^{\\omega}\nMean of\nk\nk\n-th GMM component\nOverview of RGMP-S.\nTo achieve generalizable robotic manipulation, we introduce\nR\necurrent\nG\neometric-prior\nM\nultimodal\nP\nolicy with\nS\npiking Features (RGMP-S). This framework generates task plans and 6-DoF actions for humanoid robots using egocentric RGB inputs. RGMP-S comprises two key components: the\nL\nong-horizon\nG\neometric-prior\nS\nkill\nS\nelector (LGSS) and the\nR\necursive\nA\ndaptive\nS\npiking\nNet\nwork (RASNet). The LGSS translates natural language commands and visual observations into executable skill sequences by incorporating geometric commonsense priors. Complementarily, the RASNet converts visual inputs into robotic manipulation actions through spatiotemporal memory modeling.\nInstead of employing computationally expensive explicit 3D reconstruction, the policy learns to extract implicit geometric information from RGB inputs by correlating spatial cues with action labels and commonsense reasoning. Additionally, we incorporate spiking neural networks to process dense features that capture fine-grained spatial perception. This approach enables the model to focus on task-relevant visual regions, emphasizing important details while suppressing redundant information, thus enhancing performance. This method is inspired by the natural and intuitive process of human object manipulation. In human grasping, the eyes first detect the target object, and the brain rapidly processes this sensory input to generate an appropriate motor command for the hand, allowing the arm to execute the grasping action and complete the task successfully. Similarly, our RGMP-S mimics this process by seamlessly integrating perception with action: the RGB image is analyzed to identify the object and its relevant geometric context, while the RASNet is employed to predict the joint angles required for the robotic arm to grasp the object. A summary of notations is provided in\nTab.\nI\n.\n3.1\nLong-horizon Geometric-prior Skill Selector\nMotivation of Geometric Priors.\nA fundamental challenge in robotics is the precise selection of skills (e.g., grasping versus pinching) for objects with diverse geometries or in previously unseen scenarios. While VLMs support object recognition and localization, they often struggle to translate semantic information into accurate actions, primarily due to their lack of explicit integration of\ngeometric priors\nin the vision-action mapping process. This limitation motivates the development of our novel LGSS framework, which seamlessly combines geometric reasoning with semantic task planning through geometric commonsense alignment.\nThe LGSS operates through two sequential phases to bridge semantic instruction and physical execution. Initially, a VLM\n[\n4\n]\nis employed to interpret human instructions, allowing the robot to detect and locate the target object within the provided image. This visual grounding step generates bounding boxes that anchor subsequent reasoning processes. Building on this visual localization, the system then analyzes spatial relationships and morphological characteristics of the identified objects. This geometric analysis incorporates commonsense knowledge about object properties and their functional implications for manipulation. The resulting object-centric representation, combining semantic and geometric features, guides the selection of appropriate manipulation strategies from a predefined skill library. This structured approach enables the robot to translate abstract commands into context-aware action sequences through a novel geometric-object decomposition mechanism that coordinates perception with action selection:\n𝒫\n=\np\n​\nl\n​\na\n​\nn\n​\n(\nℐ\n,\n𝒪\n|\n𝒞\n)\n,\n\\small\\mathcal{P}=plan(\\mathcal{I},{\\kern 1.0pt}{\\kern 1.0pt}\\mathcal{O}{\\kern 2.0pt}|{\\kern 2.0pt}\\mathcal{C}\\;),\n(1)\nwhere\n𝒫\n\\mathcal{P}\nrepresents the generated action plan,\nℐ\n\\mathcal{I}\nis the current natural language user instruction,\n𝒪\n\\mathcal{O}\ndenotes the current visual observation, and\n𝒞\n\\mathcal{C}\nconstitutes a predefined contextual set containing\nn\nn\nexamples\n{\n(\nℐ\ni\n,\n𝒪\ni\n,\n𝒫\ni\n)\n}\ni\n=\n1\nn\n\\{({\\mathcal{I}_{i}},{\\mathcal{O}_{i}},{\\mathcal{P}_{i}})\\}_{i=1}^{n}\n, which encapsulates instructions, prompts, and commonsense reasoning to facilitate in-context learning.\nThe system processes an RGB image\n𝒪\n\\mathcal{O}\nwhere a Visual-Language Model first identifies the target object with a bounding box. This localization provides the foundation for generating executable manipulation skills. The model combines predefined context\n𝒞\n\\mathcal{C}\nwith geometric properties like spatial relationships and object shape to determine these skills. For example, when receiving the instruction\n“I want Fanta”\n, the LGSS follows the contextual prompt\n“Please box the target object in the instruction”\n. It locates the specific beverage can among other items, then uses YOLOv8n-seg to determine its shape. Finally, the visual-language model integrates contextual information\n𝒞\n\\mathcal{C}\nwith geometric reasoning to produce operational commands.\nThe LGSS adopts a modular design with minimal computational overhead. Its architecture integrates three key components: a visual-language interpretation module for command processing, a semantic segmentation module for object analysis, and a prompt-based skill selector for action determination. These elements operate synergistically to transform user instructions and visual inputs into appropriate skill choices. The complete inference process requires 105 milliseconds when executed on an NVIDIA 4090 GPU.\nVisual-Language Interpretation Module:\nThis component employs the Qwen-vl API for visual-language understanding, utilizing structured prompt engineering to incorporate prior knowledge. The preparation involves providing the API with carefully selected training instances, each containing: (1) an RGB image with an object bounding box, (2) corresponding semantic segmentation results, (3) manually annotated shape categories (such as “cylindrical” or “crushed”), and (4) the corresponding manipulation skill. For example, training data includes a Fanta can image with a bounding box and segmentation mask, labeled as “cylindrical shape” and paired with the “side grasp”; similarly, an encircled Fanta can is associated with the “lift up”. The model is primed with 20 representative examples spanning common object categories to establish a robust mapping between visual features, geometric attributes, and manipulation strategies. During operation, the API processes input prompts formatted as:\n“Instruction: Identify target object in image and output bounding box [x1, y1, x2, y2]”\n. This configuration achieves 93.1% localization accuracy on our dataset with a mean latency of 45 ms per query.\nSemantic Segmentation Module:\nThis component processes the bounding box coordinates provided by the Qwen-vl API by extracting the corresponding image region and passing it to a YOLOv8-seg model. The model, which has been pre-trained on large-scale datasets and subsequently fine-tuned on our proprietary data, generates precise semantic segmentation masks to capture the object’s geometric structure. On our evaluation dataset, the module achieves a mean Intersection over Union (mIoU) of 97.6%, demonstrating the reliability of its shape extraction capabilities for subsequent geometric reasoning.\nFigure 3:\nStructure of Spatial Mixing Block and Channel Mixing Block.\nThe Spatial Mixing Block uses ADM to generate Dynamic Decay\n𝒲\n\\mathcal{W}\nrecursively, and employs RoPE to introduce directional awareness relative to spatial positions. These mechanisms collectively enhance the ability of the block to integrate spatial information effectively. The Channel Mixing Block reallocates channel-wise feature responses by integrating correlations between channels. See\n§\n3.2\nfor details.\nGeometry-Grounded CoT Skill Reasoner:\nThis module orchestrates the translation of perceptual inputs into executable actions by synthesizing bounding box coordinates with morphological features via the Qwen-vl reasoning engine. Instead of simple instruction following, we deploy a structured Chain-of-Thought (CoT) protocol to enforce physical grounding. The system is instantiated with a constraint-aware prompt:\n“\nYou are a robot with five skills: Side Grasp, Lift Up, Top Pinch, Pour Water and Delivery. The image you are observing has a resolution of 640x480. Based on the observation, the coordinates of the bounding box and the shape information of the object, choose the skill without collision and generate an action plan based on these skills.\n”\nBy embedding task-specific primitives (e.g., Side Grasp, Pour Water) within this reasoning framework, the model explicitly maps latent geometric affordances to appropriate manipulation strategies. Crucially, this mechanism resolves operational ambiguities by integrating safety-critical constraints, prioritizing kinematically feasible and collision-free interactions based on environmental context. The final decision is derived from a confidence-weighted assessment of candidate skills, ensuring robust planning under uncertainty.\nSkill Library\nThe skill library encompasses a comprehensive set of predefined grasping configurations parameterized by finger joint angles, supporting three core manipulation primitives. Side grasping is employed when objects can be accessed laterally without obstruction. Lifting is utilized for vertical retrieval, often in contexts where obstacles limit horizontal approach. Pinching is reserved for handling thin or delicate items such as paper sheets and cables. These skills define hand posture without imposing object-specific constraints. The LGSS selects the appropriate skill by combining geometric priors with real-time RGB observations, determining feasible hand configurations for the current scenario. Each skill corresponds to distinct model parameters, and the RGMP-S subsequently generates corresponding action trajectories dynamically during real-time inference.\n3.2\nRecursive Adaptive Spiking Network\nMotivation of RASNet.\nEffective robotic operation necessitates a precise understanding of spatial relationships within visual scenes, particularly the correspondence between image regions and the robotic end-effector position. Existing methods often face challenges in inferring such relational structures in novel environments, primarily due to limitations in modeling spatial relationships and dense representation learning that hinder generalization. To address this issue, we introduce the RASNet framework. This framework adaptively learns spatial dependencies between the robot and target objects in previously unseen settings through recursive spiking feature processing, while enhancing robustness and mitigating overfitting by employing Gaussian action space modeling when training data is scarce.\nOur RASNet advances action generation through three interconnected technical innovations. An Adaptive Decay Mechanism (ADM) dynamically regulates the retention of historical context, enabling the model to capture long-range dependencies while maintaining spatial accuracy. Adaptive spiking neurons selectively amplify task-relevant visual features, such as object contours, and suppress non-essential background information within dense feature maps. These elements are unified by a hierarchical fusion framework, which seamlessly integrates multi-scale representations to preserve both high-level semantics and detailed spatial structure through learned attention weighting.\nSpecifically, the RASNet comprises three principal components: (1) a Stem layer for preliminary feature extraction, (2) three hierarchical processing stages, each containing two RASNet blocks, and (3) a multi-scale feature fusion module integrated with a GMM, as illustrated in Fig.\n2\n. Given an input RGB image\n𝒪\n∈\nℝ\nH\n×\nW\n×\n3\n\\mathcal{O}\\in\\mathbb{R}^{H\\times W\\times 3}\n, the Stem layer performs initial spatial downsampling and feature embedding, reducing the resolution to\nH\n4\n×\nW\n4\n\\frac{H}{4}\\times\\frac{W}{4}\nwhile preserving critical low-frequency information. This design significantly mitigates computational overhead for subsequent operations. The transformation can be formally expressed as:\nF\n0\n=\n𝒫\n​\n(\nS\n​\nR\n​\ne\n​\nL\n​\nU\n​\n(\nB\n​\nN\n​\n(\n𝒞\n3\n×\n3\n​\n(\n𝒪\n)\n)\n)\n)\n,\n\\small F_{0}=\\mathcal{P}(SReLU(BN(\\mathcal{C}_{3\\times 3}(\\mathcal{O})))),\n(2)\nwhere\n𝒞\n3\n×\n3\n​\n(\n⋅\n)\n\\mathcal{C}_{3\\times 3}(\\cdot)\ndenotes a\n3\n×\n3\n3\\times 3\nconvolutional layer,\nB\n​\nN\n​\n(\n⋅\n)\nBN(\\cdot)\nrefers to batch normalization, and\nS\n​\nR\n​\ne\n​\nL\n​\nU\n​\n(\n⋅\n)\nSReLU(\\cdot)\nrepresents the Squared ReLU activation function. This activation improves gradient flow and increases the network’s nonlinear representational capacity. The operator\n𝒫\n​\n(\n⋅\n)\n\\mathcal{P}(\\cdot)\ncorresponds to a max pooling layer. The resulting feature map\nF\n0\nF_{0}\nis then split into two parallel processing pipelines within the RASNet block at Stage 1: one for dynamic recursive computation and another for spiking-based dense feature extraction.\nDynamic Recursive Computation.\nIn this branch,\nF\n0\nF_{0}\nis first processed by the ADM to generate content-adaptive decay factors that modulate historical memory retention. This process extracts local spatial information through convolutional layers, applies channel-wise recalibration, and constrains the decay factor to the range\n[\n0\n,\n1\n]\n[0,1]\nvia a sigmoid activation function, formulated as:\n𝒲\n=\nσ\n​\n(\n𝒞\n1\n×\n1\n​\n(\nS\n​\nR\n​\ne\n​\nL\n​\nU\n​\n(\n𝒞\n3\n×\n3\n​\n(\nF\n0\n)\n)\n)\n)\n,\n\\small\\mathcal{W}=\\sigma(\\mathcal{C}_{1\\times 1}(SReLU(\\mathcal{C}_{3\\times 3}(F_{0})))),\n(3)\nwhere\n𝒞\n1\n×\n1\n​\n(\n⋅\n)\n\\mathcal{C}_{1\\times 1}(\\cdot)\ndenotes a\n1\n×\n1\n1\\times 1\nconvolutional layer that performs channel-wise recalibration, and\nσ\n​\n(\n⋅\n)\n\\sigma(\\cdot)\nrepresents the sigmoid activation function. We then apply Rotary Position Embeddings (RoPE) to encode positional information via geometric rotations in feature space. This method enhances the capacity of model to capture position-sensitive dependencies. Unlike standard additive or learnable position embeddings, RoPE incorporates relative position awareness by applying rotational transformations to queries and keys during attention computation. This design offers two main advantages: it removes learnable position parameters, thereby reducing overfitting risk while preserving efficiency; and it encodes positional offsets as angular shifts, ensuring attention scores inherently reflect relative token distances. Formally, we first generate the keys\nK\ns\nK_{s}\nand values\nV\ns\nV_{s}\nfrom\nF\n0\nF_{0}\nvia a\n1\n×\n1\n1\\times 1\nconvolution. To incorporate positional awareness, we apply the rotation matrix\n𝐑\nΘ\n\\mathbf{R}_{\\Theta}\nto pairs of channels in\nK\ns\nK_{s}\n. The rotation matrix is defined as:\n𝐑\nΘ\n​\n(\nx\n)\n=\n[\ncos\n⁡\n(\nθ\nh\n,\nw\n,\nj\n)\n−\nsin\n⁡\n(\nθ\nh\n,\nw\n,\nj\n)\nsin\n⁡\n(\nθ\nh\n,\nw\n,\nj\n)\ncos\n⁡\n(\nθ\nh\n,\nw\n,\nj\n)\n]\n,\n\\small\\mathbf{R}_{\\Theta}(x)=\\begin{bmatrix}\\cos(\\theta_{h,w,j})&-\\sin(\\theta_{h,w,j})\\\\\n\\sin(\\theta_{h,w,j})&\\cos(\\theta_{h,w,j})\\end{bmatrix},\n(4)\nwhere\nθ\nh\n,\nw\n,\nj\n\\theta_{h,w,j}\nis the two-dimensional position encoding:\nθ\nh\n,\nw\n,\nj\n=\nθ\nj\n⋅\nx\nh\n+\nθ\nj\n⋅\nx\nw\n,\nθ\nj\n=\n1\n10000\n2\n​\nj\nC\n,\n\\small\\theta_{h,w,j}=\\theta_{j}\\cdot x_{h}+\\theta_{j}\\cdot x_{w},\\quad\\theta_{j}=\\frac{1}{10000^{\\frac{2j}{C}}},\n(5)\nwhere\nx\nh\nx_{h}\nand\nx\nw\nx_{w}\nrepresent the discrete horizontal and vertical coordinates of a pixel, and the frequency parameter\nθ\n\\theta\ncontrols the rotation speed across channel dimensions (indexed by\nj\n∈\n[\n0\n,\nC\n/\n2\n)\nj\\in[0,C/2)\n). Using a base constant of 10000, low-frequency components emphasize global structure, while high-frequency components capture local positional details. By applying\n𝐑\nΘ\n​\n(\nx\n)\n\\mathbf{R}_{\\Theta}(x)\nto the query and key representations, we ensure that their inner product encodes relative positional information. After positional encoding,\nK\ns\nK_{s}\nand\nV\ns\nV_{s}\nare partitioned into\n16\n×\n16\n16\\times 16\nimage patches. Sequential dependencies among these patches are modeled using a recurrent\nW\n​\nK\n​\nV\nWKV\nmechanism:\nW\n​\nK\n​\nV\ni\n=\nn\ni\n+\nexp\n⁡\n(\nu\n)\n⊙\nk\ni\n⊙\nv\ni\nd\ni\n+\nexp\n⁡\n(\nu\n)\n⊙\nk\ni\n,\nn\ni\n=\nn\ni\n−\n1\n⊙\nexp\n⁡\n(\n−\n𝒲\n)\n+\nk\ni\n⊙\nv\ni\n⏟\nCumulative memory of\n​\nk\ni\n⊙\nv\ni\n,\nd\ni\n=\nd\ni\n−\n1\n⊙\nexp\n⁡\n(\n−\n𝒲\n)\n+\nk\ni\n⏟\nCumulative memory of\n​\nk\ni\n,\n\\small\\begin{gathered}WKV_{i}=\\frac{n_{i}+\\exp(u)\\odot k_{i}\\odot v_{i}}{d_{i}+\\exp(u)\\odot k_{i}},\\\\\n\\underbrace{\\definecolor{tcbcolframe}{rgb}{1,0,0}\\definecolor{tcbcolback}{rgb}{1,1,0.75}\\definecolor{tcbcolframe}{rgb}{1,1,1}\\definecolor{tcbcolframe}{rgb}{1,1,1}\\hbox to119.09pt{\\vbox to17.85pt{\\pgfpicture\\makeatletter\\hbox{\\thinspace\\lower 0.0pt\\hbox to0.0pt{\\pgfsys@beginscope\\pgfsys@invoke{ }\\definecolor{pgfstrokecolor}{rgb}{0,0,0}\\pgfsys@color@rgb@stroke{0}{0}{0}\\pgfsys@invoke{ }\\pgfsys@color@rgb@fill{0}{0}{0}\\pgfsys@invoke{ }\\pgfsys@setlinewidth{\\the\\pgflinewidth}\\pgfsys@invoke{ }\\nullfont\\hbox to0.0pt{{}{}{}{}\\pgfsys@beginscope\\pgfsys@invoke{ }{}{}{}{}{}{}{}{}\\definecolor[named]{pgffillcolor}{rgb}{1,1,1}\\pgfsys@color@gray@fill{1}\\pgfsys@invoke{ }\\pgfsys@fill@opacity{1.0}\\pgfsys@invoke{ }{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}\\pgfsys@moveto{0.0pt}{4.26788pt}\\pgfsys@lineto{0.0pt}{13.57736pt}\\pgfsys@curveto{0.0pt}{15.93448pt}{1.91077pt}{17.84525pt}{4.26788pt}{17.84525pt}\\pgfsys@lineto{114.82451pt}{17.84525pt}\\pgfsys@curveto{117.18163pt}{17.84525pt}{119.09239pt}{15.93448pt}{119.09239pt}{13.57736pt}\\pgfsys@lineto{119.09239pt}{4.26788pt}\\pgfsys@curveto{119.09239pt}{1.91077pt}{117.18163pt}{0.0pt}{114.82451pt}{0.0pt}\\pgfsys@lineto{4.26788pt}{0.0pt}\\pgfsys@curveto{1.91077pt}{0.0pt}{0.0pt}{1.91077pt}{0.0pt}{4.26788pt}\\pgfsys@closepath\\pgfsys@fill\\pgfsys@invoke{ }\\pgfsys@invoke{ }\\pgfsys@endscope\\pgfsys@beginscope\\pgfsys@invoke{ }{}{}{}{}{}{}{}{}\\definecolor[named]{pgffillcolor}{rgb}{1,1,0.75}\\pgfsys@color@cmyk@fill{0}{0}{0.25}{0}\\pgfsys@invoke{ }\\pgfsys@fill@opacity{1.0}\\pgfsys@invoke{ }{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}\\pgfsys@moveto{1.42262pt}{4.26788pt}\\pgfsys@lineto{1.42262pt}{13.57736pt}\\pgfsys@curveto{1.42262pt}{15.14877pt}{2.69647pt}{16.42262pt}{4.26788pt}{16.42262pt}\\pgfsys@lineto{114.82451pt}{16.42262pt}\\pgfsys@curveto{116.39592pt}{16.42262pt}{117.66977pt}{15.14877pt}{117.66977pt}{13.57736pt}\\pgfsys@lineto{117.66977pt}{4.26788pt}\\pgfsys@curveto{117.66977pt}{2.69647pt}{116.39592pt}{1.42262pt}{114.82451pt}{1.42262pt}\\pgfsys@lineto{4.26788pt}{1.42262pt}\\pgfsys@curveto{2.69647pt}{1.42262pt}{1.42262pt}{2.69647pt}{1.42262pt}{4.26788pt}\\pgfsys@closepath\\pgfsys@fill\\pgfsys@invoke{ }\\pgfsys@invoke{ }\\pgfsys@endscope\\pgfsys@beginscope\\pgfsys@invoke{ }\\pgfsys@fill@opacity{1.0}\\pgfsys@invoke{ }{{{}}{{}}{{}}{{}}{{}}{{}}{{}}\\pgfsys@beginscope\\pgfsys@invoke{ }\\pgfsys@transformcm{1.0}{0.0}{0.0}{1.0}{2.42262pt}{6.67262pt}\\pgfsys@invoke{ }\\hbox{{\\color[rgb]{0,0,0}\\definecolor[named]{pgfstrokecolor}{rgb}{0,0,0}\\pgfsys@color@gray@stroke{0}\\pgfsys@color@gray@fill{0}\\hbox{\\set@color{\\color[rgb]{0,0,0}\\definecolor[named]{pgfstrokecolor}{rgb}{0,0,0}\\pgfsys@color@gray@stroke{0}\\pgfsys@color@gray@fill{0}$\\displaystyle n_{i}=n_{i-1}\\odot\\exp(-\\mathcal{W})+k_{i}\\odot v_{i}$}}}}\\pgfsys@invoke{ }\\pgfsys@endscope}\\pgfsys@invoke{ }\\pgfsys@endscope{}{}{}\\hss}\\pgfsys@discardpath\\pgfsys@invoke{ }\\pgfsys@endscope\\hss}}\\endpgfpicture}}}_{\\textbf{Cumulative memory of }k_{i}\\odot v_{i}},\\underbrace{\\definecolor{tcbcolframe}{rgb}{1,0,0}\\definecolor{tcbcolback}{rgb}{1,1,0.75}\\definecolor{tcbcolframe}{rgb}{1,1,1}\\definecolor{tcbcolback}{rgb}{0.92,1,0.92}\\definecolor{tcbcolframe}{rgb}{1,1,1}\\hbox to100.14pt{\\vbox to17.85pt{\\pgfpicture\\makeatletter\\hbox{\\thinspace\\lower 0.0pt\\hbox to0.0pt{\\pgfsys@beginscope\\pgfsys@invoke{ }\\definecolor{pgfstrokecolor}{rgb}{0,0,0}\\pgfsys@color@rgb@stroke{0}{0}{0}\\pgfsys@invoke{ }\\pgfsys@color@rgb@fill{0}{0}{0}\\pgfsys@invoke{ }\\pgfsys@setlinewidth{\\the\\pgflinewidth}\\pgfsys@invoke{ }\\nullfont\\hbox to0.0pt{{}{}{}{}\\pgfsys@beginscope\\pgfsys@invoke{ }{}{}{}{}{}{}{}{}\\definecolor[named]{pgffillcolor}{rgb}{1,1,1}\\pgfsys@color@gray@fill{1}\\pgfsys@invoke{ }\\pgfsys@fill@opacity{1.0}\\pgfsys@invoke{ }{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}\\pgfsys@moveto{0.0pt}{4.26788pt}\\pgfsys@lineto{0.0pt}{13.57736pt}\\pgfsys@curveto{0.0pt}{15.93448pt}{1.91077pt}{17.84525pt}{4.26788pt}{17.84525pt}\\pgfsys@lineto{95.87704pt}{17.84525pt}\\pgfsys@curveto{98.23416pt}{17.84525pt}{100.14493pt}{15.93448pt}{100.14493pt}{13.57736pt}\\pgfsys@lineto{100.14493pt}{4.26788pt}\\pgfsys@curveto{100.14493pt}{1.91077pt}{98.23416pt}{0.0pt}{95.87704pt}{0.0pt}\\pgfsys@lineto{4.26788pt}{0.0pt}\\pgfsys@curveto{1.91077pt}{0.0pt}{0.0pt}{1.91077pt}{0.0pt}{4.26788pt}\\pgfsys@closepath\\pgfsys@fill\\pgfsys@invoke{ }\\pgfsys@invoke{ }\\pgfsys@endscope\\pgfsys@beginscope\\pgfsys@invoke{ }{}{}{}{}{}{}{}{}\\definecolor[named]{pgffillcolor}{rgb}{0.92,1,0.92}\\pgfsys@color@rgb@fill{0.92}{1}{0.92}\\pgfsys@invoke{ }\\pgfsys@fill@opacity{1.0}\\pgfsys@invoke{ }{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}{{}{}{{}}}{{}{}{{}}}{}{}\\pgfsys@moveto{1.42262pt}{4.26788pt}\\pgfsys@lineto{1.42262pt}{13.57736pt}\\pgfsys@curveto{1.42262pt}{15.14877pt}{2.69647pt}{16.42262pt}{4.26788pt}{16.42262pt}\\pgfsys@lineto{95.87704pt}{16.42262pt}\\pgfsys@curveto{97.44846pt}{16.42262pt}{98.7223pt}{15.14877pt}{98.7223pt}{13.57736pt}\\pgfsys@lineto{98.7223pt}{4.26788pt}\\pgfsys@curveto{98.7223pt}{2.69647pt}{97.44846pt}{1.42262pt}{95.87704pt}{1.42262pt}\\pgfsys@lineto{4.26788pt}{1.42262pt}\\pgfsys@curveto{2.69647pt}{1.42262pt}{1.42262pt}{2.69647pt}{1.42262pt}{4.26788pt}\\pgfsys@closepath\\pgfsys@fill\\pgfsys@invoke{ }\\pgfsys@invoke{ }\\pgfsys@endscope\\pgfsys@beginscope\\pgfsys@invoke{ }\\pgfsys@fill@opacity{1.0}\\pgfsys@invoke{ }{{{}}{{}}{{}}{{}}{{}}{{}}{{}}\\pgfsys@beginscope\\pgfsys@invoke{ }\\pgfsys@transformcm{1.0}{0.0}{0.0}{1.0}{2.42262pt}{6.67262pt}\\pgfsys@invoke{ }\\hbox{{\\color[rgb]{0,0,0}\\definecolor[named]{pgfstrokecolor}{rgb}{0,0,0}\\pgfsys@color@gray@stroke{0}\\pgfsys@color@gray@fill{0}\\hbox{\\set@color{\\color[rgb]{0,0,0}\\definecolor[named]{pgfstrokecolor}{rgb}{0,0,0}\\pgfsys@color@gray@stroke{0}\\pgfsys@color@gray@fill{0}$\\displaystyle d_{i}=d_{i-1}\\odot\\exp(-\\mathcal{W})+k_{i}$}}}}\\pgfsys@invoke{ }\\pgfsys@endscope}\\pgfsys@invoke{ }\\pgfsys@endscope{}{}{}\\hss}\\pgfsys@discardpath\\pgfsys@invoke{ }\\pgfsys@endscope\\hss}}\\endpgfpicture}}}_{\\textbf{Cumulative memory of }k_{i}},\\end{gathered}\n(6)\nwhere\ni\n∈\n[\n0\n,\n(\nH\n×\nW\n)\n/\n(\n16\n×\n16\n)\n)\ni\\in[0,(H\\times W)/(16\\times 16))\nindexes the sequence of image patches, and\nexp\n⁡\n(\n⋅\n)\n\\exp(\\cdot)\ndenotes the element-wise exponential function.\nk\ni\nk_{i}\nand\nv\ni\nv_{i}\ndenote the corresponding patch representations extracted from\nK\ns\nK_{s}\nand\nV\ns\nV_{s}\n. To ensure consistent accumulation, the initial states (at step\ni\n=\n0\ni=0\n) are set as\nn\n0\n=\nk\n0\n⊙\nv\n0\nn_{0}=k_{0}\\odot v_{0}\nand\nd\n0\n=\nk\n0\nd_{0}=k_{0}\n. The term\nu\n∈\n(\n0\n,\n1\n)\nu\\in(0,1)\nrepresents a learnable position bias, and\n𝒲\n∈\nℝ\nC\n\\mathcal{W}\\in\\mathbb{R}^{C}\nis the channel-wise time-decay vector.\nMotivation of Spatial Memory.\nThe recurrent connections in our framework build a spatial memory of observed scenes for the robot. This memory supports locating end-effector positions that are most relevant to the current task. However, recurrent computation is prone to vanishing gradients, which complicates training and often requires large amounts of data to alleviate this issue. To overcome this issue, we introduce an Adaptive Decay Mechanism that dynamically adjusts the decay rate of historical memory, preserving essential spatial information while adaptively emphasizing task-critical image patches. Here\n𝒲\n\\mathcal{W}\ndenotes the content-adaptive decay factors that govern memory retention (\nEq.\n3\n). Finally, a gating factor\nR\ns\nR_{s}\nproduces a dynamic weight to modulate how the output of the Spatial Mixing Block influences the current state:\nF\nS\n​\n0\n=\nσ\n​\n(\n𝒞\n1\n×\n1\n​\n(\nF\n0\n)\n)\n⊙\nW\n​\nK\n​\nV\n\\small F_{S0}=\\sigma(\\mathcal{C}_{1\\times 1}(F_{0}))\\odot WKV\n(7)\nThen we apply the Channel Mixing Block to\nF\nS\n​\n0\nF_{S0}\nto reallocate channel-wise feature weights for feature extraction:\nF\nC\n​\n0\n=\nσ\n​\n(\n𝒞\n1\n×\n1\n​\n(\nF\nS\n​\n0\n)\n)\n⊙\n(\nS\n​\nR\n​\ne\n​\nL\n​\nU\n​\n(\n𝒞\n3\n×\n3\n​\n(\nF\nS\n​\n0\n)\n)\n)\n\\small F_{C0}=\\sigma(\\mathcal{C}_{1\\times 1}(F_{S0}))\\odot(SReLU(\\mathcal{C}_{3\\times 3}(F_{S0})))\n(8)\nSpiking Dense Feature Extraction.\nIn the parallel branch, dense visual features are extracted using a Dense Block. These features capture contextual information and textural details of target objects. The input\nF\n0\n∈\nℝ\nH\n4\n×\nW\n4\n×\nC\nF_{0}\\in\\mathbb{R}^{\\frac{H}{4}\\times\\frac{W}{4}\\times C}\nis processed by the Dense Block, yielding an enriched representation\nF\nk\n∈\nℝ\nH\n4\n×\nW\n4\n×\n4\n​\nC\nF_{k}\\in\\mathbb{R}^{\\frac{H}{4}\\times\\frac{W}{4}\\times 4C}\n. This output then passes through a Linear layer with\nC\n/\nr\nC/r\noutput channels, producing two new feature maps\nB\nk\nB_{k}\nand\nD\nk\nD_{k}\n. The map\nB\nk\nB_{k}\nis subsequently used to generate a spatial attention mask\nX\nk\nX_{k}\n:\nX\nk\n=\nB\nk\n​\nI\n¯\nk\n​\nB\nk\nT\n,\nX_{k}=B_{k}\\bar{I}_{k}B_{k}^{T},\n(9)\nwhere\nI\n¯\n=\n1\nn\n​\n(\nI\n−\n1\nn\n​\n𝟏\n)\n\\bar{I}=\\frac{1}{n}\\left(I-\\frac{1}{n}\\mathbf{1}\\right)\nand\nn\n=\nh\n×\nw\nn=h\\times w\n.\nI\nI\nand\n𝟏\n\\mathbf{1}\nare the\nn\n×\nn\nn\\times n\nidentity matrix and matrix of all ones, respectively, and\nX\nk\n∈\nℝ\nn\n×\nn\nX_{k}\\in\\mathbb{R}^{n\\times n}\n. We define\nx\n(\ni\n,\nj\n)\n∈\nX\nk\nx_{(i,j)}\\in X_{k}\n(where\n0\n≤\ni\n<\nn\n0\\leq i<n\n;\n0\n≤\nj\n<\nn\n0\\leq j<n\n), which encodes the global dependencies between the\ni\ni\n-th pixel and the\nj\nj\n-th pixel from\nB\nk\nB_{k}\n.\nX\nk\nX_{k}\nis fed into a softmax function and then multiplied by\nD\nk\nD_{k}\n:\nU\nk\n=\nsoftmax\n⁡\n(\nX\nk\n)\n​\nD\nk\n,\nU_{k}=\\operatorname{softmax}\\left(X_{k}\\right)D_{k},\n(10)\nThen,\nU\nk\nU_{k}\nis reshaped and transposed to\nℝ\nn\n×\nC\n/\nr\n\\mathbb{R}^{n\\times C/r}\n. Subsequently, it is fed to a\n1\n×\n1\n1\\times 1\nconvolutional layer and added to the spiking feature\n𝒜\n​\n(\nF\nk\n)\n\\mathcal{A}(F_{k})\nby our adaptive spike neuron:\nQ\nA\n=\n𝒞\n1\n×\n1\n​\n(\nU\nk\n)\n+\n𝒜\n​\n(\nF\nk\n)\n.\nQ_{A}=\\mathcal{C}_{1\\times 1}\\left(U_{k}\\right)+\\mathcal{A}\\left(F_{k}\\right).\n(11)\nMotivation of Adaptive Spike Neuron.\nCurrent robotic manipulation models typically generate actions based solely on spatial perception, overlooking temporal information. To incorporate temporal reasoning into spatial feature understanding, we employ a spiking neuron mechanism. Conventional spiking neurons combine spatial information from previous timesteps with a decay factor to modulate the current signal, enabling robots to integrate observations from past frames when processing current visual input. However, traditional spiking neurons rely on a fixed decay factor and a binary signaling mechanism, which introduce training difficulties in spiking neural networks due to non-differentiable operations during gradient backpropagation. To address these issues, we introduce an adaptive spiking neuron. Our design replaces the static decay factor with a dynamically adjustable one at each timestep. Training focuses on learning this adaptive decay factor rather than directly optimizing the spiking neural network parameters. This approach mitigates the refractory period characteristic of spiking neurons and resolves gradient propagation challenges posed by non-differentiable components, resulting in a more stable and efficient learning process. The governing equations of our adaptive spike neuron are detailed as:\nV\nt\n=\nH\nt\n−\n1\n+\nX\nt\n,\nS\nt\n=\nΘ\n​\n(\nV\nt\n−\nu\nt\n​\nh\n)\n,\nH\nt\n=\nV\nt\n​\ne\n−\nΔ\n​\nt\n/\nτ\n​\n(\n1\n−\nS\nt\n)\n+\nV\nr\n​\ne\n​\ns\n​\ne\n​\nt\n​\nS\nt\n,\n\\begin{gathered}V_{t}=H_{t-1}+X_{t},\\quad S_{t}=\\Theta(V_{t}-u_{th}),\\\\\nH_{t}=V_{t}e^{-\\Delta t/\\tau}(1-S_{t})+V_{reset}S_{t},\\end{gathered}\n(12)\nwhere\nΔ\n​\nt\n\\Delta t\ndenotes the time interval (typically unit time), and\nV\nt\nV_{t}\nrepresents the membrane potential obtained through integration of spatial input\nX\nt\nX_{t}\nand temporal input\nH\nt\n−\n1\nH_{t-1}\n. Here\nX\nt\nX_{t}\nis extracted from dense visual features, and\nH\nt\n−\n1\nH_{t-1}\ncorresponds to the membrane potential from the previous timestep after undergoing reset or spike emission. If the membrane potential exceeds the threshold\nu\nt\n​\nh\nu_{th}\n, the neuron fires a spike; otherwise, it remains silent. The function\nΘ\n​\n(\n⋅\n)\n\\Theta(\\cdot)\ndenotes the Heaviside step function, defined as\nΘ\n​\n(\nx\n)\n=\n1\n\\Theta(x)=1\nfor\nx\n≥\n0\nx\\geq 0\nand\nΘ\n​\n(\nx\n)\n=\n0\n\\Theta(x)=0\notherwise, yielding a binary output\nS\nt\n∈\n{\n0\n,\n1\n}\nS_{t}\\in\\{0,1\\}\n. The term\nH\nt\nH_{t}\nindicates the temporal output, where\nτ\n\\tau\nrepresents the adaptive decay factor produced by our channel-wise attention mechanism. The reset potential\nV\nreset\nV_{\\text{reset}}\nis engaged after a spike is fired. In the absence of firing,\nV\nt\nV_{t}\ndecays exponentially according to the adaptive factor\nτ\n\\tau\n. To create an adaptive decay factor\nτ\n\\tau\nsuited for particular tasks, the computation of\nτ\n\\tau\nis seamlessly incorporated into the gradient backpropagation process of the policy:\nτ\n=\n𝔼\n​\n[\n𝒞\n1\n×\n1\n​\n(\nR\n​\n(\n𝒞\n1\n×\n1\n​\n(\nF\nk\n)\n)\n)\n]\n,\n\\tau=\\mathbb{E}[\\mathcal{C}_{1\\times 1}\\left(R(\\mathcal{C}_{1\\times 1}(F_{k}))\\right)],\n(13)\nwhere\n𝔼\n​\n[\n⋅\n]\n\\mathbb{E}[\\cdot]\ncomputes the average of mapped values across channels, and\nR\n​\n(\n⋅\n)\nR(\\cdot)\ndenotes a feature reshaping operation. This integration enables the decay factor to adjust dynamically based on the complexity of the current motion sequence. Finally, we apply a\n1\n×\n1\n1\\times 1\nconvolutional layer to\nQ\nA\nQ_{A}\nto obtain query vectors\nQ\nQ\nwith matching channel dimensions to the key and value vectors\nK\nK\nand\nV\nV\n. A guided self-attention mechanism then merges the dynamically recurrent features and the spiking-based dense features as follows:\nG\n=\nsoftmax\n​\n(\nQ\n​\nK\n⊤\nd\nk\n+\nB\n)\n​\nV\n,\n\\small G=\\mathrm{softmax}\\left(\\frac{QK^{\\top}}{\\sqrt{d_{k}}}+B\\right)V,\n(14)\nwhere\nd\nk\nd_{k}\ndenotes the dimensionality of the queries and keys, and\nB\nB\nrepresents a relative position bias. The feature map\nF\n1\nF_{1}\nis produced by down-sampling the output from two successive RASNet blocks using a\n3\n×\n3\n3\\times 3\nconvolution. This procedure is repeated in Stage 2 and Stage 3. The resulting multi-scale features\nF\n1\nF_{1}\n,\nF\n2\nF_{2}\n, and\nF\n3\nF_{3}\nare subsequently fused through a set of learnable weights:\nF\nf\n=\nα\n1\n​\n(\n𝒞\n1\n×\n1\n​\n(\nF\n1\n)\n)\n+\nα\n2\n​\n(\n𝒞\n1\n×\n1\n​\n(\nU\n​\np\n​\n(\nF\n2\n)\n)\n)\n+\nα\n3\n​\n(\nU\n​\np\n​\n(\nF\n3\n)\n)\n,\n\\small F_{f}=\\alpha_{1}(\\mathcal{C}_{1\\times 1}(F_{1}))+\\alpha_{2}(\\mathcal{C}_{1\\times 1}(Up(F_{2})))+\\alpha_{3}(Up(F_{3})),\n(15)\nwhere\nF\ni\nF_{i}\nrepresents the feature map produced at Stage\ni\ni\n(with\ni\n=\n1\n,\n2\n,\n3\ni=1,2,3\n), and\nα\ni\n\\alpha_{i}\ndenotes learnable parameters that weight each level during feature fusion. The fused feature map\nF\nf\nF_{f}\nis then used to generate an initial action prediction:\na\ni\n​\nn\n=\nLinear\n​\n(\n𝒞\n3\n×\n3\n​\n(\nF\nf\n)\n)\n,\n\\small a_{in}=\\mathrm{Linear}\\bigl(\\mathcal{C}_{3\\times 3}(F_{f})\\bigr),\n(16)\nTo train the model, we minimize the mean-squared error between the predicted action and the ground-truth action from human demonstrations using the following loss:\nℒ\n=\nMSE\n​\n(\na\ni\n​\nn\n,\na\nground\n)\n,\n\\mathcal{L}=\\mathrm{MSE}\\bigl(a_{in},\\;a_{\\mathrm{ground}}\\bigr),\n(17)\nwhere\nℒ\n\\mathcal{L}\nis the loss and\na\nground\na_{\\mathrm{ground}}\nis the ground-truth action.\nInput:\nTraining epochs\nE\nE\n, conversation round\nT\nT\n, human instructions\nℐ\n\\mathcal{I}\n, human demonstrations\n𝒟\n\\mathcal{D}\nwith capacity\nM\nM\n, current observation\n𝒪\n\\mathcal{O}\n, VLM model\n𝒲\n\\mathcal{W}\n, Stage of RGMP-S\n𝒮\n\\mathcal{S}\n, RGMP-S\n𝒢\nm\n\\mathcal{G}_{m}\nOutput:\nRobotic actions\na\n∗\na^{*}\n/*\nHuman Demonstration Collecting: */\nfor\ni\n=\n1\n,\n2\n,\n…\n,\nM\ni=1,2,...,M\ndo\nd\ni\n←\n(\n𝒪\ni\n,\n𝒥\ni\n)\nd_{i}\\leftarrow(\\mathcal{O}_{i},\\mathcal{J}_{i})\nthrough\nEq.\n21\n;\n//\n§\n4.1\n𝒟\n←\n𝒟\n∪\n{\nd\ni\n}\n\\mathcal{D}\\leftarrow\\mathcal{D}\\cup\\{d_{i}\\}\nΘ\n←\nEM\n​\n(\n𝒟\n)\n\\Theta\\leftarrow\\mathrm{EM}(\\mathcal{D})\nvia\nEq.\n18\nend for\nreturn\n𝒟\n\\mathcal{D}\n,\nΘ\n\\Theta\n/*\nRGMP-S Training pipeline: */\nfor\ne\n=\n1\n,\n2\n,\n…\n,\nE\ne=1,2,...,E\ndo\n1ex\nF\n0\n←\nS\n​\nt\n​\ne\n​\nm\n​\n(\n𝒪\ni\n)\nF_{0}\\leftarrow Stem(\\mathcal{O}_{i})\nby\nEq.\n2\n;\n//\n§\n3.2\n𝒲\n,\nK\ns\n,\nV\ns\n←\n𝒜\n𝒹\n​\n(\nF\n0\n)\n{\\mathcal{W}},{K_{s}},{V_{s}}\\leftarrow\\mathcal{A_{d}}(F_{0})\n,\nℛ\n​\n(\nF\n0\n)\n\\mathcal{R}(F_{0})\nby\nEq.\n3\n,\nEq.\n4\nF\n1\n,\nF\n2\n,\nF\n3\n←\n𝒮\n​\n(\nK\ns\n,\nV\ns\n,\n𝒲\n)\n×\n3\n{F_{1},F_{2},F_{3}}\\leftarrow\\mathcal{S}({K_{s}},{V_{s}},{\\mathcal{W}})_{\\times 3}\na\ni\n​\nn\n←\nℳ\n​\n(\nF\n1\n,\nF\n2\n,\nF\n3\n)\n{a_{in}}\\leftarrow\\mathcal{M}(F_{1},F_{2},F_{3})\nby\nEq.\n16\nℒ\n←\n(\na\ni\n​\nn\n,\na\ng\n​\nr\n​\no\n​\nu\n​\nn\n​\nd\n)\n\\mathcal{L}\\leftarrow({a_{in}},{a_{ground}})\nthrough\nEq.\n17\n𝒢\nm\n←\n𝒢\nm\n−\nη\n​\n∇\nℒ\n\\mathcal{G}_{m}\\leftarrow\\mathcal{G}_{m}-\\eta\\nabla\\mathcal{L}\nend for\nreturn\n𝒢\nm\n\\mathcal{G}_{m}\n1ex\n/*\nInference pipeline: */\nfor\nt\n=\n1\n,\n2\n,\n…\n,\nT\nt=1,2,...,T\ndo\nB\n​\no\n​\nx\n​\n(\nx\n1\n,\ny\n1\n,\nx\n2\n,\ny\n2\n)\n←\n𝒬\n​\n(\nℐ\n,\n𝒪\n|\n𝒞\n)\nBox(x_{1},y_{1},x_{2},y_{2})\\leftarrow\\mathcal{Q}(\\mathcal{I},\\mathcal{O}|\\mathcal{C})\nby Eq. (\n1\n)\n𝒪\ns\n←\n(\nx\n1\n,\ny\n1\n,\nx\n2\n,\ny\n2\n)\n,\nϕ\na\n​\n(\n𝒪\n,\nB\n​\no\n​\nx\n)\n\\mathcal{O}_{s}\\leftarrow(x_{1},y_{1},x_{2},y_{2}),\\kern 2.0pt\\phi_{a}(\\mathcal{O},Box)\n𝒮\ns\n​\ne\n​\nq\n,\n𝒫\n←\n𝒬\nC\n​\no\n​\nT\n​\n(\nℐ\n,\n𝒪\ns\n|\n𝒞\n)\n\\mathcal{S}_{seq},\\mathcal{P}\\leftarrow\\mathcal{Q}_{CoT}(\\mathcal{I},\\mathcal{O}_{s}|\\mathcal{C})\nVoice\n←\n\\leftarrow\nresponse in\n𝒫\n\\mathcal{P}\nif\n𝒮\ns\n​\ne\n​\nq\n≠\n∅\n\\mathcal{S}_{seq}\\neq\\emptyset\nthen\nfor\ns\nk\ns_{k}\nin\n𝒮\ns\n​\ne\n​\nq\n\\mathcal{S}_{seq}\ndo\na\n∗\n←\n𝒢\nm\n​\n(\n𝒪\n,\ns\nk\n,\nΘ\n)\na^{*}\\leftarrow\\mathcal{G}_{m}(\\mathcal{O},s_{k},\\Theta)\nthrough\nEq.\n20\nend for\nExecute\na\n∗\na^{*}\nend if\nend for\nAlgorithm 1\nThe RGMP-S Framework\nFigure 4:\nHardware configuration of our humanoid robot.\nThe platform integrates several core subsystems: an NVIDIA Jetson AGX Orin module for onboard computation; a head-mounted RGB camera for egocentric vision; an omnidirectional microphone array for audio input; a 6-degree-of-freedom robotic arm paired with a dexterous hand for manipulation; and a multi-axis joint module for torso mobility. These components collectively enable environmental perception, physical interaction, and autonomous movement. See\n§\n4.1\nfor details.\nMotivation of Gaussian Mixture Model.\nA single Gaussian distribution\n[\n10\n]\noften regresses to the mean, which can suppress distinct action modes and compromise control precision. To better represent the multi-modal nature of robotic actions, we adopt a Gaussian Mixture Model (GMM). Let\n𝐱\n∈\nℝ\nn\n\\mathbf{x}\\in\\mathbb{R}^{n}\ndenote the ground-truth joint configuration. The GMM with\nK\n=\n6\nK=6\ncomponents is defined as:\nP\n​\n(\n𝐱\n∣\nΘ\n)\n=\n∑\nk\n=\n1\nK\nα\nk\n​\n𝒩\n​\n(\n𝐱\n∣\nμ\nk\n,\nΣ\nk\n)\n,\n\\small P(\\mathbf{x}\\mid\\Theta)=\\sum_{k=1}^{K}\\alpha_{k}\\,\\mathcal{N}\\left(\\mathbf{x}\\mid\\mu_{k},\\Sigma_{k}\\right),\n(18)\nwhere\nα\nk\n\\alpha_{k}\n,\nμ\nk\n\\mu_{k}\n, and\nΣ\nk\n\\Sigma_{k}\ndenote the prior weight, mean, and covariance of the\nk\nk\n-th component. These parameters are estimated via the expectation-maximization algorithm to maximize the data likelihood. To refine the initial prediction\na\nin\na_{\\text{in}}\n, we compute the Mahalanobis distance to each GMM component. As the intrinsic metric for Gaussian distributions, it utilizes covariance to normalize deviations, ensuring statistical consistency by penalizing errors in low-variance dimensions:\nl\nk\n=\n(\na\nin\n−\nμ\nk\nω\n)\n⊤\n​\n(\nΣ\nk\nω\n,\nω\n)\n−\n1\n​\n(\na\nin\n−\nμ\nk\nω\n)\n.\n\\small l_{k}=\\sqrt{\\left(a_{\\text{in}}-\\mu_{k}^{\\omega}\\right)^{\\top}\\left(\\Sigma_{k}^{\\omega,\\omega}\\right)^{-1}\\left(a_{\\text{in}}-\\mu_{k}^{\\omega}\\right)}.\n(19)\nThe final action\na\n∗\na^{*}\ncorresponds to the mean vector of the component with the smallest distance:\na\n∗\n=\narg\n⁡\nmin\nμ\nk\nω\n⁡\nl\nk\n.\n\\small a^{*}=\\arg\\min_{\\mu_{k}^{\\omega}}\\,l_{k}.\n(20)\nThe pseudocode of RGMP-S is presented in Algorithm\n1\n.\nFigure 5:\nExperimental validation within the interactive bar service scenario.\nEvaluation of the RGMP-S framework regarding the delivery of beverages and tissues. The training phase involves 40 expert trajectories per object category. Quantitative results demonstrate that RGMP-S attains superior success rates and robustness relative to the Diffusion Policy (DP) baseline. See\n§\n4.2\nfor details.\n4\nExperiments\nThis section presents a systematic experimental evaluation of the proposed RGMP-S framework. Our experiments aim to validate the effectiveness and generalization capacity of the overall architecture and its two core modules: the LGSS and the RASNet. We analyze the distinct contribution of each module and compare the full framework against several state-of-the-art baselines on a range of manipulation tasks. The following sections detail the experimental setup, implementation specifics, evaluation metrics, and present a comprehensive discussion of the results.\n4.1\nExperimental Setup\nHardware Setup\n.\n\nOur experiments are conducted on three distinct robotic platforms. The primary platform is an upper-body humanoid robot with four integrated subsystems: vision, audio, decision-making, and actuation. A head-mounted egocentric RGB camera provides primary visual input. An iFLYTEK S0Y22F omnidirectional microphone and speaker array, mounted on the torso, handles voice interaction. An onboard NVIDIA Orin compute module performs high-level behavioral planning. The actuation system consists of two 6-degree-of-freedom (6-DOF) robotic arms, each equipped with a 6-DOF dexterous hand. The entire system (as shown in\nFig.\n4\n) is self-powered and communicates via a local wireless network, enabling fully untethered operation. To assess cross-embodiment generalization, we also employ a desktop dual-arm manipulation robot. This secondary platform is equipped with an overhead RGB camera and two 6-DOF robotic arms dedicated to executing precise physical manipulation tasks. The third platform comprises the Aloha robot, which incorporates a centrally positioned RGB camera and dual robotic arms equipped with wrist-mounted RGB sensors.\nDataset and Evaluation Criteria\n.\n\nTo verify the efficacy of the proposed RGMP-S framework, we curated a comprehensive dataset comprising 500 expert trajectories within the skill library. Each trajectory constitutes an operational path paired with a visual observation captured immediately before the initiation of a robotic task. In particular, the visual input facilitates the mapping to a specific action, while the trajectory delineates the transition of the manipulator from the starting configuration to the target spatial coordinates and end-effector pose. This data collection process is formulated in the following manner.\nd\ni\n=\n(\n𝒥\n,\n𝒪\n)\n,\nd_{i}=(\\mathcal{J,O}),\n(21)\nwhere\n𝒥\n\\mathcal{J}\nsignifies the joint space of the robotic system and\n𝒪\n\\mathcal{O}\nrepresents the corresponding perceptual observation. During physical experiments, the system performance is quantified via two complementary metrics. The skill selection accuracy\nA\n​\nc\n​\nc\ns\nAcc_{s}\nrepresents the capability of the model to identify the appropriate primitive for a given instruction. Furthermore, the execution success rate\nA\n​\nc\n​\nc\nt\nAcc_{t}\nevaluates the precision with which the manipulator interacts with the target object. Consequently, the comprehensive success rate\nA\n​\nc\n​\nc\nAcc\nis defined as the product of these two components.\nA\n​\nc\n​\nc\n=\nA\n​\nc\n​\nc\ns\n×\nA\n​\nc\n​\nc\nt\nAcc=Acc_{s}\\times Acc_{t}\n(22)\nReal-world Task Configurations.\nTo verify the performance of the RGMP-S, we conduct a comprehensive comparative evaluation against several state-of-the-art baselines across 10 manipulation tasks. This evaluation suite comprises five simulation tasks from the ManiSkill2 benchmark and five physical experiments. The specific configurations of the real-world tasks are outlined in the following descriptions.\nInteractive Bar Service\n.\nIn this scenario, the humanoid robot engages in verbal dialogue with a human and provides assistance based on vocal instructions. These tasks include the delivery of beverages or tissues (as shown in\nFig.\n5\n). During evaluation, the skill selection accuracy\nA\n​\nc\n​\nc\ns\nAcc_{s}\nis recorded as 0 if the robot selects an inappropriate skill. Typical failures primarily involve unstable side grasps on deformed objects and collisions with peripheral obstacles during cluttered manipulation. Conversely, successful skill identification is denoted as\nA\n​\nc\n​\nc\ns\n=\n1\nAcc_{s}=1\n. Furthermore, the execution success rate\nA\n​\nc\n​\nc\nt\nAcc_{t}\nis recorded as 1 only upon the successful grasping of the target object. For each behavioral primitive, the model is trained using 40 expert trajectories and subsequently validated across 20 randomly positioned objects, yielding the mean success rate as the final accuracy.\nFigure 6:\nGeneralized manipulation capabilities of the RGMP-S.\nWe evaluate the RGMP-S regarding its ability to grasp various novel objects at randomized positions. The training phase relies on a dataset containing only 40 expert demonstrations focused on grasping a Fanta can. Experimental results indicate that RGMP-S achieves proficient success rates when grasping the Fanta can across diverse spatial configurations. Furthermore, the system demonstrates substantial zero-shot transfer to previously unencountered entities such as a Coke can, a spray bottle, and a human hand. This outcome highlights the inherent versatility and adaptability of the architecture across diverse manipulation scenarios. See\n§\n4.2\n.\nZero-shot Grasping\n.\nTo assess the generalization capability of the RGMP-S framework within previously unseen environments (as shown in\nFig.\n6\n), we evaluate the performance of the action generation ability. The training phase utilizes a constrained dataset comprising 40 expert trajectories solely for grasping a Fanta can. During the inference stage, the zero-shot transfer capability is validated through grasping trials performed at randomized positions on novel objects with distinct geometries including a Coke can, a spray bottle, and a human hand. In addition to testing unseen categories, we examine spatial generalization by deploying the originally seen Fanta can in various randomized positions across the workspace. Each evaluation trial is quantified via a binary success metric, where a stable retrieval of the target is recorded as 1 and a failure as 0. For each object category, we conduct 100 independent trials at randomized locations to determine the final success rate.\nTowel Folding\n. The towel folding task involves the manipulation of deformable objects through a sequence of maneuvers intended to achieve a predefined configuration. This environment involves high degrees of freedom and stochastic physical properties including randomized initial poses and various fabric textures. Success is defined as aligning the fabric edges within a specified spatial tolerance (\n±\n\\pm\n2 cm) and maintaining a stable folded geometry. The training corpus for this task comprises 100 expert trajectories that encompass diverse towel dimensions and colors. For evaluation, we employ a validation scheme involving randomized placements and novel towel instances to assess the generalization performance of the proposed framework.\nPouring Water\n. The primary objective of this task is the coordination of a source container to facilitate the successful transfer of liquid into a target receptacle. The environment involves complex fluid dynamics and stochastic physical properties including randomized initial positions and various container geometries. Success is defined as the spill-free transfer of water into the target receptacle. The training corpus for this task comprises 100 expert trajectories that encompass different initial fill levels and container types. For evaluation, we employ a validation scheme involving novel receptacles and randomized spatial configurations to assess the robust generalization capability.\nBin Picking\n. Within the bin picking scenario, the robot is tasked with retrieving objects from a storage bin and relocating them to a designated target zone under cluttered conditions. The environment involves complex occlusions and stochastic physical arrangements including randomized orientations and various object geometries within a confined space. Success is defined as the accurate retrieval of the target object and its stable placement within the goal area without unintended collisions. The training corpus for this task comprises 100 expert trajectories per object category to capture diverse grasping configurations. For evaluation, we employ a validation scheme involving novel object instances and randomized clutter patterns to assess the generalization robustness of the proposed framework (as shown in\nFig.\n7\n).\nFigure 7:\nValidation on long-horizon tasks.\nEvaluation of the RGMP-S framework regarding towel folding, water pouring, and bin picking. See\n§\n4.2\n.\nFigure 8:\nPerformance within the ManiSkill2 benchmark.\nQuantitative evaluations on 5 representative manipulation tasks to compare the proposed framework with state-of-the-art baselines. Refer to\n§\n4.2\n.\nSimulation Benchmark Specifications.\nTo evaluate the proposed framework, we select five representative tasks from the publicly available and standardized ManiSkill2 simulation benchmark (as shown in\nFig.\n8\n). These tasks demand high-precision interaction and robust spatial reasoning. The detailed specifications for each task are described as follows.\nOpenCabinetDrawer / CabinetDoor\n: These articulated object manipulation tasks require a single-arm mobile manipulator to actuate target components on a cabinet. These environments involve stochastic physical properties, including randomized friction and damping parameters for the joints. Success is defined as opening the target component to at least 90% of the maximum range and maintaining a static state. The training corpus for these tasks comprises 300 expert trajectories per target, spanning 25 and 42 unique cabinets for drawers and doors, respectively. For evaluation, we employ a validation scheme involving ten unseen cabinets to assess the generalization capability of the model.\nPushChair\n&\nMoveBucket\n: These tasks evaluate the capacity for precise bimanual coordination. In\nPushChair\n, a dual-arm robot must translate a swivel chair to a target location without causing the object to tip over. Success requires the chair to remain static within 15 cm of the destination. The\nMoveBucket\ntask involves a complex manipulation sequence where the robot must lift a bucket containing a ball onto a raised platform without losing the internal object. Both tasks leverage a dataset of 300 trajectories per object, featuring 26 chairs and 29 buckets for training.\nPlugCharger\n: This insertion task necessitates high-precision control of the end-effector. The manipulator must insert a charger into a wall receptacle. This task provides 1,000 successful trajectories for training. The validation scheme consists of two stages of 100 episodes, each featuring randomized initial joint configurations of the robot and varied initial poses of the charger relative to the wall.\nCounterparts.\nWe compare the proposed RGMP-S framework against several representative baselines to evaluate performance across diverse manipulation tasks.\n•\nResNet\n[CVPR’16]\n[\n20\n]\n: Robust visual feature extraction via deep residual learning for manipulation tasks.\n•\nTransformer\n[NeurIPS’17]\n[\n54\n]\n: Global dependency modeling in trajectory sequences through self-attention.\n•\nDiffusion Policy\n[RSS’23]\n[\n10\n]\n: Robotic action distribution representation via an iterative denoising process.\n•\nManiSkill2 1st\n[RSS’23]\n[\n17\n]\n: A finetuning mechanism that achieved 1st place in the ManiSkill2 challenge.\n•\nOcto\n[RSS’24]\n[\n52\n]\n: An open-source generalist policy trained on massive datasets for robotic control.\n•\nOpenVLA\n[CoRL’24]\n[\n28\n]\n: Integration of VLMs with action tokens for open-world manipulation.\n•\nRDT-1B\n[arXiv’24]\n[\n34\n]\n: Performance scaling in multiple robotic tasks via a diffusion transformer architecture.\n•\nDex-VLA\n[CoRL’25]\n[\n55\n]\n: Alignment of vision and language representations for dexterous manipulation.\n4.2\nPerformance Comparison with SOTA Methods\nComprehensive evaluations are conducted against state of the art baselines across ten manipulation tasks, encompassing five physical scenarios and five simulation benchmarks.\nHuman-robot Interaction Analysis\n.\nTable\nII\ndetails the quantitative outcomes of the interactive bar service task. The tabulated data reveals that the absence of geometric guidance compromises the skill selection accuracy\nA\n​\nc\n​\nc\ns\nAcc_{s}\nof the standard Qwen-vl baseline, particularly when paired with the ResNet50 backbone. This limitation highlights the necessity of geometric inductive biases for precise decision-making. In contrast, the integration of our LGSS framework consistently outperforms the Qwen-vl counterpart across all diverse backbones. For example, within the Diffusion Policy configuration, LGSS outperforms the baseline by 15% on the squashed Coke task, which is calculated through the enhancement of overall accuracy from 0.40 to 0.55. This improvement primarily stems from the accurate identification of object orientations, which effectively mitigates unstable side grasps on deformed objects.\nFigure 9:\nQuantitative analysis of long-horizon tasks.\nThe proposed framework is compared against state of the art methods for towel folding, water pouring, and bin picking. See\n§\n4.2\nfor details.\nGeneralized Performance Analysis\n.\nWe conduct extensive comparative experiments in Table\nIII\nwith representative state-of-the-art models on the zero-shot grasping scenario, and our RGMP-S achieves consistently superior performance. As depicted in the comparison, standard data-driven methods such as Octo and OpenVLA struggle to effectively generalize to novel categories like spray bottles and human hands due to the lack of explicit geometric reasoning. RGMP-S consistently outperforms all other counterparts on different targets. Specifically, RGMP-S outperforms the best baseline Dex-VLA by 12% in terms of average success rate. Notably, in the challenging human hand handover task, our method attains a success rate of 0.93 compared to 0.84 for the second-best method, demonstrating the remarkably robust zero-shot transfer capability of the framework even when trained on a highly constrained dataset. Moreover, regarding computational efficiency, RGMP-S achieves a high inference frequency of 75.2 Hz, significantly surpassing the computationally intensive models (e.g., 3.6 Hz for OpenVLA and 1.01 Hz for Diffusion Policy), thereby ensuring the low latency required for real-time robot control.\nTABLE II:\nAblation study regarding the LGSS framework and Qwen-vl.\nExperimental validations are conducted within environments featuring Fanta cans, Sprite cans, tissue paper, squashed Coke cans, and human hands with randomized object configurations for each trial. The training phase for each skill category involves 40 expert trajectories, while quantitative results are derived from 20 randomized validation trials. Comparative experiments are performed against representative baselines, including ResNet\n[\n20\n]\n, Transformer\n[\n54\n]\n, ManiSkill2-1st\n[\n17\n]\n, and Diffusion Policy\n[\n10\n]\n. The superior performance within each category is emphasized in\nbold\nand the second-best result is denoted with an\nunderline\n. See\n§\n4.3\n.\nFanta\nSprite\nTissue\nSquashed Coke\nHuman Hand\nMethods\nA\n​\nc\n​\nc\ns\nAcc_{s}\nA\n​\nc\n​\nc\nt\nAcc_{t}\nA\n​\nc\n​\nc\n↑\nAcc\\uparrow\nA\n​\nc\n​\nc\ns\nAcc_{s}\nA\n​\nc\n​\nc\nt\nAcc_{t}\nA\n​\nc\n​\nc\n↑\nAcc\\uparrow\nA\n​\nc\n​\nc\ns\nAcc_{s}\nA\n​\nc\n​\nc\nt\nAcc_{t}\nA\n​\nc\n​\nc\n↑\nAcc\\uparrow\nA\n​\nc\n​\nc\ns\nAcc_{s}\nA\n​\nc\n​\nc\nt\nAcc_{t}\nA\n​\nc\n​\nc\n↑\nAcc\\uparrow\nA\n​\nc\n​\nc\ns\nAcc_{s}\nA\n​\nc\n​\nc\nt\nAcc_{t}\nA\n​\nc\n​\nc\n↑\nAcc\\uparrow\nwith\nResNet50\nQwen-vl\n[\n4\n]\n0.65\n0.54\n0.35\n0.60\n0.42\n0.25\n0.65\n0.46\n0.30\n0.65\n0.46\n0.30\n0.70\n0.57\n0.40\nOur LGSS\n0.85\n0.53\n0.45\n0.75\n0.46\n0.35\n0.85\n0.47\n0.40\n0.85\n0.47\n0.40\n0.85\n0.56\n0.48\nwith\nTransformer\nQwen-vl\n[\n4\n]\n0.60\n0.58\n0.35\n0.65\n0.54\n0.30\n0.70\n0.50\n0.35\n0.60\n0.58\n0.35\n0.65\n0.62\n0.40\nOur LGSS\n0.80\n0.56\n0.45\n0.75\n0.53\n0.40\n0.85\n0.53\n0.45\n0.85\n0.53\n0.45\n0.85\n0.64\n0.54\nwith\nManiSkill2-1st\nQwen-vl\n[\n4\n]\n0.70\n0.57\n0.40\n0.65\n0.69\n0.45\n0.65\n0.53\n0.34\n0.65\n0.54\n0.35\n0.65\n0.62\n0.40\nOur LGSS\n0.85\n0.53\n0.45\n0.80\n0.68\n0.54\n0.85\n0.53\n0.45\n0.80\n0.56\n0.45\n0.85\n0.70\n0.60\nwith\nDiffusion Policy\nQwen-vl\n[\n4\n]\n0.65\n0.76\n0.49\n0.65\n0.75\n0.50\n0.65\n0.68\n0.44\n0.65\n0.62\n0.40\n0.70\n0.71\n0.50\nOur LGSS\n0.85\n0.76\n0.65\n0.80\n0.77\n0.62\n0.85\n0.69\n0.59\n0.85\n0.65\n0.55\n0.90\n0.83\n0.74\nTABLE III:\nGeneralized performance and efficiency comparison.\nModels are trained on 40 Fanta can trajectories. Evaluation across Fanta, Coke, spray, and hand targets demonstrates the robust zero-shot capability and real-time inference speed (\nf\nf\n) of RGMP-S. See details in\n§\n4.2\n.\nMethods\nFanta\n↑\n\\uparrow\nCoke\n↑\n\\uparrow\nSpray\n↑\n\\uparrow\nHand\n↑\n\\uparrow\nAvg\n↑\n\\uparrow\nf\nf\n(Hz)\n↑\n\\uparrow\nManiSkill2-1st\n[\n17\n]\n0.70\n0.60\n0.63\n0.62\n0.64\n15.2\nOcto\n[\n52\n]\n0.65\n0.55\n0.58\n0.62\n0.60\n13.4\nOpenVLA\n[\n28\n]\n0.68\n0.58\n0.61\n0.60\n0.62\n3.6\nRDT-1b\n[\n34\n]\n0.70\n0.61\n0.60\n0.62\n0.64\n6.7\nDP\n[\n10\n]\n0.75\n0.65\n0.68\n0.72\n0.70\n1.01\nDex-VLA\n[\n55\n]\n0.87\n0.66\n0.71\n0.84\n0.77\n55.3\nOur RGMP\n[\n1\n]\n0.98\n0.78\n0.81\n0.90\n0.87\n78.6\nOur RGMP-S\n0.96\n0.83\n0.85\n0.93\n0.89\n75.2\nTABLE IV:\nAblation study of RASNet and GMM.\nQuantitative evaluations on tissue passing and squashed Coke manipulation tasks validate the effectiveness of the proposed components. See details in\n§\n4.3\n.\nTissue\nSquashed Coke\nMethods\nGMM\nA\n​\nc\n​\nc\ns\n↑\nAcc_{s}\\uparrow\nA\n​\nc\n​\nc\nt\n↑\nAcc_{t}\\uparrow\nA\n​\nc\n​\nc\n↑\nAcc\\uparrow\nA\n​\nc\n​\nc\ns\n↑\nAcc_{s}\\uparrow\nA\n​\nc\n​\nc\nt\n↑\nAcc_{t}\\uparrow\nA\n​\nc\n​\nc\n↑\nAcc\\uparrow\n–\n0.85\n0.58\n0.50\n0.80\n0.61\n0.49\nDP\n[\n10\n]\n✓\n\\checkmark\n0.80\n0.68\n0.56\n0.85\n0.65\n0.55\n–\n0.80\n0.69\n0.55\n0.85\n0.71\n0.60\nOur RASNet\n✓\n\\checkmark\n0.85\n0.71\n0.60\n0.90\n0.77\n0.69\nLong-horizon Manipulation Analysis\n.\nWe summarize the comparative results of long-horizon manipulation tasks in Figure\n9\n. The figure clearly depicts that under complex physical constraints, standard vision-language models like Octo and OpenVLA present significantly suboptimal performance in these three tasks. This demonstrates the difficulty of handling complex stochastic physical properties without explicit geometric guidance. Our RGMP-S framework consistently outperforms all other counterparts on different scenarios. For example, in the Pouring Water scenario, RGMP-S outperforms the best baseline Diffusion Policy by approximately 16%. This metric is calculated through the successful transfer of liquid into target receptacles with randomized spatial configurations and various container geometries. We further conduct experiments within the towel folding scenario involving highly deformable objects, and our method achieves a superior success rate of 0.86 compared to 0.68 for Dex-VLA. This validates the robust generalization capability of the proposed framework in aligning fabric edges and maintaining stable folded geometry within high-degree-of-freedom environments. Similarly, in the Bin Picking task characterized by complex occlusions, RGMP-S attains the highest success rate of 0.83 and effectively avoids unintended collisions. Relative to the preliminary RGMP conference version\n[\n1\n]\n, RGMP-S incorporates dense spiking features to enrich spatiotemporal representations. This mechanism significantly enhances the robustness of action execution across the temporal dimension for long-horizon tasks and consequently yields consistently superior performance over the previous version RGMP.\nTABLE V:\nComponent contribution analysis.\nQuantitative evaluations across grasping generalization tasks validate the efficacy of RoPE, Spatial Mixing Block (SMB), Channel Mixing Block (CMB), and Guided Self-attention Module (GSM). Please see details in\n§\n4.3\n.\nRoPE\nSMB\nCMB\nGSM\nFanta\n↑\n\\uparrow\nCoke\n↑\n\\uparrow\nSpray\n↑\n\\uparrow\nHand\n↑\n\\uparrow\n–\n✓\n\\checkmark\n✓\n\\checkmark\n✓\n\\checkmark\n0.88\n0.67\n0.73\n0.79\n✓\n\\checkmark\n–\n✓\n\\checkmark\n✓\n\\checkmark\n0.85\n0.76\n0.76\n0.84\n✓\n\\checkmark\n✓\n\\checkmark\n–\n✓\n\\checkmark\n0.92\n0.63\n0.66\n0.75\n✓\n\\checkmark\n✓\n\\checkmark\n✓\n\\checkmark\n–\n0.86\n0.61\n0.62\n0.73\n✓\n\\checkmark\n✓\n\\checkmark\n✓\n\\checkmark\n✓\n\\checkmark\n0.96\n0.83\n0.85\n0.93\nFigure 10:\nAblation study and data efficiency analysis.\nThe left panel validates the Spiking Dense Feature Extraction (SDFE) module across long-horizon tasks. The right panel illustrates that RGMP-S achieves comparable performance to the Diffusion Policy baseline with\n5\n×\n5\\times\nfewer training trajectories on grasping Fanta task. See details in\n§\n4.3\n.\nTABLE VI:\nQuantitative comparison on the ManiSkill2 benchmark.\nComparison of average success rates (in %, mean\n±\n\\pm\nstandard deviation) of our RGMP-S against state-of-the-art baselines across five diverse manipulation tasks. All results are averaged over multiple random seeds. See\n§\n4.2\n.\nMethods\nPush Chair\n↑\n\\uparrow\nMove\nBucket\n↑\n\\uparrow\nPlug\nCharger\n↑\n\\uparrow\nCabinet Door\n↑\n\\uparrow\nCabinet Drawer\n↑\n\\uparrow\nAverage Score\n↑\n\\uparrow\nRDT-1b\n[\n34\n]\n3.97\n±\n\\pm\n1.35\n1.46\n±\n\\pm\n0.34\n1.75\n±\n\\pm\n1.21\n13.44\n±\n\\pm\n3.86\n11.62\n±\n\\pm\n3.12\n6.44\n±\n\\pm\n1.98\nDex-VLA\n[\n55\n]\n2.36\n±\n\\pm\n1.33\n3.47\n±\n\\pm\n1.36\n1.62\n±\n\\pm\n1.35\n18.36\n±\n\\pm\n2.93\n8.49\n±\n\\pm\n2.48\n6.86\n±\n\\pm\n1.89\nManiSkill2-1st\n[\n17\n]\n8.63\n±\n\\pm\n2.36\n4.23\n±\n\\pm\n1.39\n3.41\n±\n\\pm\n1.42\n24.68\n±\n\\pm\n3.22\n12.48\n±\n\\pm\n3.28\n10.69\n±\n\\pm\n2.33\nOcto\n[\n52\n]\n5.35\n±\n\\pm\n1.24\n2.46\n±\n\\pm\n1.26\n3.29\n±\n\\pm\n1.48\n20.37\n±\n\\pm\n3.98\n10.35\n±\n\\pm\n1.48\n8.36\n±\n\\pm\n1.89\nOpenVLA\n[\n28\n]\n6.33\n±\n\\pm\n1.48\n4.49\n±\n\\pm\n1.63\n4.28\n±\n\\pm\n3.21\n24.29\n±\n\\pm\n4.25\n15.47\n±\n\\pm\n2.33\n10.97\n±\n\\pm\n2.58\nDiffusion Policy\n[\n10\n]\n4.39\n±\n\\pm\n1.22\n6.48\n±\n\\pm\n2.39\n6.44\n±\n\\pm\n2.36\n15.32\n±\n\\pm\n1.48\n17.38\n±\n\\pm\n2.68\n10.01\n±\n\\pm\n2.03\nOur RGMP\n[\n1\n]\n14.32\n±\n\\pm\n2.32\n8.46\n±\n\\pm\n1.43\n7.44\n±\n\\pm\n1.28\n26.48\n±\n\\pm\n4.35\n20.46\n±\n\\pm\n3.45\n15.43\n±\n\\pm\n2.57\nOur RGMP-S\n16.47\n±\n\\pm\n2.34\n9.64\n±\n\\pm\n1.46\n8.45\n±\n\\pm\n2.23\n26.48\n±\n\\pm\n4.26\n20.16\n±\n\\pm\n4.18\n16.24\n±\n\\pm\n2.89\nFigure 11:\nLearning curves on ManiSkill2 benchmark.\nThe X-axis represents training steps, and the Y-axis denotes the success rate. Shaded areas correspond to the standard deviation. Our RGMP-S variants achieve stable convergence and superior performance across all tasks. Refer to\n§\n4.2\n.\nFigure 12:\nFailure cases.\nOur method and current state-of-the-art models struggle in scenarios requiring fine-grained manipulation. Refer to\n§\n4.3\n.\nSimulation Benchmark Analysis\n. We present a comprehensive evaluation on the ManiSkill2 benchmark, summarized in\nTab.\nVI\nand visualized via the radar chart in\nFig.\n8\nand learning curves in\nFig.\n11\n. As observed, Transformer-based and Diffusion Policy methods exhibit suboptimal performance when subjected to stochastic physical constraints. This degradation highlights the inherent challenge of adapting to randomized friction parameters without explicit geometric guidance. In contrast, our RGMP-S demonstrates superior robustness, consistently outperforming state-of-the-art baselines across all evaluated scenarios. Specifically, in the\nOpen Cabinet Door\ntask involving articulated objects, RGMP-S achieves a success rate of 26.48%, surpassing the ManiSkill2-1st baseline (24.68%) and Diffusion Policy (15.32%). This performance advantage is attributed to our method’s ability to handle stochastic dynamics while actuating target components to at least 90% of their maximum range. Furthermore, in the bimanual\nPushChair\ntask, RGMP-S achieves a score of 16.47%, nearly doubling the performance of the strongest external baseline (ManiSkill2-1st at 8.63%). This significant margin validates the efficacy of our approach in preventing object tipping and ensuring precise static positioning within 15 cm of the target destination.\n4.3\nDiagnostic Experiments\nAblation study\n. To rigorously evaluate the individual contributions of the proposed components within our RGMP-S framework, we conducted a series of ablation studies across diverse manipulation tasks. First, we investigated the efficacy of the Spiking Dense Feature Extraction (SDFE) module in long-horizon tasks. As illustrated in the left panel of Fig.\n10\n, removing the SDFE module leads to a significant performance degradation across all tested tasks (Fold, Pour, Bin-pick). For instance, in the ”Pour” task, the success rate drops from 0.92 to approximately 0.65 without SDFE. This confirms that the SDFE module is crucial for capturing temporal dependencies and fine-grained spatial features necessary for complex, multi-stage manipulation. Second, we analyzed the impact of the RASNet module and the GMM component. Table\nIV\npresents quantitative results on tissue passing and squashed Coke manipulation tasks. The baseline Diffusion Policy achieves a combined accuracy (\nA\n​\nc\n​\nc\nAcc\n) of 0.50 and 0.49 on the Tissue and Squashed Coke tasks, respectively. Incorporating GMM into the baseline improves these scores to 0.56 and 0.55. However, our proposed RASNet method, even without GMM, outperforms the baseline, achieving accuracies of 0.55 and 0.60. The combination of RASNet and GMM yields the highest performance, reaching an accuracy of 0.60 on Tissue and 0.69 on Squashed Coke. This demonstrates that RASNet effectively enhances feature representation, and its synergy with GMM further enhances the robustness of the policy against object deformability and state uncertainty. Third, we performed a component contribution analysis to validate the efficacy of Rotary Positional Embeddings (RoPE), the Spatial Mixing Block (SMB), the Channel Mixing Block (CMB), and the Guided Self-attention Module (GSM) in grasping generalization tasks. As detailed in Table\nV\n, the full model achieves the highest success rates across all objects (Fanta: 0.96, Coke: 0.83, Spray: 0.85, Hand: 0.93). Removing any single component results in a noticeable performance drop. For example, omitting the GSM reduces the success rate on the ”Hand” object from 0.93 to 0.73, highlighting its importance in guiding attention to relevant geometric features. Similarly, the absence of SMB leads to a significant decrease in performance on the ”Fanta” object (0.96 to 0.85), underscoring the necessity of spatial mixing for robust grasping.\nData Efficiency Analysis.\nWe further evaluated the data efficiency of RGMP-S compared to the Diffusion Policy on the Fanta grasping task. The right panel of Fig.\n10\nillustrates the dependency of the success rate on the quantity of training trajectories. Our method demonstrates superior data efficiency, achieving a high success rate with significantly fewer demonstrations. Specifically, RGMP-S reaches a performance level comparable to the converged Diffusion Policy (trained on\n∼\n\\sim\n200 trajectories) using only\n∼\n\\sim\n40 trajectories. This 5\n×\n\\times\nimprovement in data efficiency is attributed to the inductive biases introduced by our RASNet, which allow for effective learning from sparse data.\nFailure Case Analysis and Limitations.\nTo ensure a comprehensive and rigorous evaluation, we investigate the boundary conditions where the proposed RGMP-S and other state-of-the-art baselines encounter difficulties. As visualized in\nFig.\n12\n, performance degradation is observed across all evaluated methods in scenarios demanding extreme perceptual precision. Specifically, in the\nFold Towel\ntask, when the deformable fabric lies completely flush against the table surface, the available vertical clearance for gripper insertion diminishes to the millimeter level. This insufficient manipulation margin allows for negligible error tolerance, frequently causing unintended collisions with the tabletop or failed grasping attempts due to precise z-axis control limits. Similarly, in the\nPlug Charger\ntask, the success rate drops significantly when the insertion alignment tolerance is stricter than 5 mm. Under such high-precision constraints, self-occlusion of the robotic gripper hinders the fine-grained visual feedback required for exact mating. It is worth noting that these failure modes reflect the intrinsic complexity of the physical interaction rather than specific algorithmic flaws. Empirical observations indicate that these scenarios are non-trivial even for human operators, where the one-shot success rate via teleoperation is also limited. These findings highlight the open challenges in handling high-fidelity contact dynamics and suggest future directions for integrating tactile feedback or active vision.\n5\nConclusion\nIn this paper, we present RGMP-S, a novel and robust framework for generalizable robotic manipulation. RGMP-S exploits both geometric-prior knowledge and spatiotemporal feature learning by constructing the Long-horizon Geometric-prior Skill Selector (LGSS) and the Recursive Adaptive Spiking Network (RASNet), effectively overcoming the semantic-geometric gap and acquiring generalizable dexterity in dynamic environments. Furthermore, for alleviating the data scarcity problem, we formulate an Adaptive Spike Neuron to modulate feature retention and integrate a Gaussian Mixture Model to refine action generation, enabling the policy to learn from limited demonstrations while preserving precision. Moreover, we maintain the supervision of geometric consistency to provide strong spatial constraints, boosting both long-horizon planning and fine-grained interaction performance. We experimentally demonstrate that RGMP-S performs favorably against many existing state-of-the-art methods across ten diverse manipulation tasks, including physical interactive scenarios and standard simulation benchmarks. We hope this work paves for future research on efficient and generalizable robotic learning as it is fully reproducible and includes:\n•\nRGMP-S, a strong baseline that outperforms existing approaches while maintaining\nhigh data efficiency\nand\nrobust generalization\nacross unseen scenarios.\n•\nA comprehensive benchmark comparison of the state-of-the-art on\nmultiple real-world\nand simulation tasks.\nReferences\n[1]\nX. ,Li, W. ,Huang, P. Nengyuan, Z. Kaiyan, Y. Songhua, W. Yiming, L. Mengde, Y. Mang, X. Jifeng, and M. Li\n(2026)\nRGMP: recurrent geometric-prior multimodal policy for generalizable humanoid robot manipulation\n.\nIn\nProceedings of the AAAI Conference on Artificial Intelligence\n,\nCited by:\nGeneralizable Geometric Prior and Recurrent Spiking Feature Learning for Humanoid Robot Manipulation\n,\n§1\n,\n§1\n,\n§1\n,\n§4.2\n,\nTABLE III\n,\nTABLE VI\n.\n[2]\nA. T. Abu-Jassar, H. Attar, A. Amer, V. Lyashenko, V. Yevsieiev, and A. Solyman\n(2025)\nDevelopment and investigation of vision system for a small-sized mobile humanoid robot in a smart environment\n.\nInternational Journal of Crowd Science\n9\n(\n1\n),\npp. 29–43\n.\nCited by:\n§1\n.\n[3]\nM. Ahn, A. Brohan, N. Brown, Y. Chebotar, O. Cortes, B. David, C. Finn, C. Fu, K. Gopalakrishnan, K. Hausman,\net al.\n(2022)\nDo as i can, not as i say: grounding language in robotic affordances\n.\narXiv preprint arXiv:2204.01691\n.\nCited by:\n§1\n,\n§2.1\n.\n[4]\nJ. Bai, S. Bai, S. Yang, S. Wang, S. Tan, P. Wang, J. Lin, C. Zhou, and J. Zhou\n(2023)\nQwen-vl: a frontier large vision-language model with versatile abilities\n.\narXiv preprint arXiv:2308.12966\n.\nCited by:\n§3.1\n,\nTABLE II\n,\nTABLE II\n,\nTABLE II\n,\nTABLE II\n.\n[5]\nP. W. Battaglia, J. B. Hamrick, V. Bapst, A. Sanchez-Gonzalez, V. Zambaldi, M. Malinowski, A. Tacchetti, D. Raposo, A. Santoro, R. Faulkner,\net al.\n(2018)\nRelational inductive biases, deep learning, and graph networks\n.\narXiv preprint arXiv:1806.01261\n.\nCited by:\n§1\n.\n[6]\nY. Bengio, P. Simard, and P. Frasconi\n(1994)\nLearning long-term dependencies with gradient descent is difficult\n.\nIEEE transactions on neural networks\n5\n(\n2\n),\npp. 157–166\n.\nCited by:\n§1\n.\n[7]\nA. Brohan, N. Brown, J. Carbajal, Y. Chebotar, J. Dabis, C. Finn, K. Gopalakrishnan, K. Hausman, A. Herzog, J. Hsu,\net al.\n(2022)\nRt-1: robotics transformer for real-world control at scale\n.\narXiv preprint arXiv:2212.06817\n.\nCited by:\n§1\n,\n§2.2\n.\n[8]\nL. Chen, K. Lu, A. Rajeswaran, K. Lee, A. Grover, M. Laskin, P. Abbeel, A. Srinivas, and I. Mordatch\n(2021)\nDecision transformer: reinforcement learning via sequence modeling\n.\nAdvances in neural information processing systems\n34\n,\npp. 15084–15097\n.\nCited by:\n§2.2\n.\n[9]\nL. Chen, K. Lu, A. Rajeswaran, K. Lee, A. Grover, M. Laskin, P. Abbeel, A. Srinivas, and I. Mordatch\n(2021)\nDecision transformer: reinforcement learning via sequence modeling\n.\nAdvances in neural information processing systems\n34\n,\npp. 15084–15097\n.\nCited by:\n§2.2\n.\n[10]\nC. Chi, Z. Xu, S. Feng, E. Cousineau, Y. Du, B. Burchfiel, R. Tedrake, and S. Song\n(2023)\nDiffusion policy: visuomotor policy learning via action diffusion\n.\nIn\nProceedings of Robotics: Science and Systems\n,\nCited by:\n§1\n,\n§2.2\n,\n§3.2\n,\n3rd item\n,\nTABLE II\n,\nTABLE III\n,\nTABLE IV\n,\nTABLE VI\n.\n[11]\nX. Chu, J. Deng, G. You, W. Liu, X. Li, J. Ji, and Y. Zhang\n(2025)\nGraspCoT: integrating physical property reasoning for 6-dof grasping under flexible language instructions\n.\narXiv preprint arXiv:2503.16013\n.\nCited by:\n§1\n.\n[12]\nW. Dai, J. Li, D. Li, A. Tiong, J. Zhao, W. Wang, B. Li, P. N. Fung, and S. Hoi\n(2023)\nInstructblip: towards general-purpose vision-language models with instruction tuning\n.\nAdvances in neural information processing systems\n36\n,\npp. 49250–49267\n.\nCited by:\n§1\n,\n§2.1\n.\n[13]\nD. Driess, F. Xia, M. S. M. Sajjadi, C. Lynch, A. Chowdhery, B. Ichter, A. Wahid, J. Tompson, Q. H. Vuong, T. Yu, W. Huang, Y. Chebotar, P. Sermanet, D. Duckworth, S. Levine, V. Vanhoucke, K. Hausman, M. Toussaint, K. Greff, A. Zeng, I. Mordatch, and P. R. Florence\n(2023)\nPaLM-e: an embodied multimodal language model\n.\nIn\nInternational Conference on Machine Learning\n,\nExternal Links:\nLink\nCited by:\n§1\n,\n§2.1\n.\n[14]\nH. Fang, C. Wang, M. Gou, and C. Lu\n(2023)\nGraspNet-1billion: a large-scale benchmark for general object grasping\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n45\n(\n9\n),\npp. 11427–11443\n.\nCited by:\n§2.1\n.\n[15]\nZ. Fu, T. Z. Zhao, and C. Finn\n(2024)\nMobile aloha: learning bimanual mobile manipulation with low-cost whole-body teleoperation\n.\narXiv preprint arXiv:2401.02117\n.\nCited by:\n3rd item\n.\n[16]\nG. Gallego, T. Delbruck, G. Orchard, C. Bartolozzi, B. Taba, A. Censi, S. Leutenegger, A. J. Davison, J. Conradt, K. Daniilidis, and D. Scaramuzza\n(2022)\nEvent-based vision: a survey\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n44\n(\n1\n),\npp. 154–180\n.\nCited by:\n§2.3\n.\n[17]\nF. Gao, X. Li, J. Yu, and F. Shaung\n(2023)\nA two-stage fine-tuning strategy for generalizable manipulation skill of embodied ai\n.\nIn\nProceedings of Robotics: Science and Systems\n,\nCited by:\n4th item\n,\nTABLE II\n,\nTABLE III\n,\nTABLE VI\n.\n[18]\nS. Ghosh and G. Gallego\n(2025)\nEvent-based stereo depth estimation: a survey\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n47\n(\n10\n),\npp. 9130–9149\n.\nCited by:\n§2.3\n.\n[19]\nK. Han, Y. Wang, H. Chen, X. Chen, J. Guo,\net al.\n(2023)\nA survey on vision transformer\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n45\n(\n1\n),\npp. 87–110\n.\nCited by:\n§2.2\n.\n[20]\nK. He, X. Zhang, S. Ren, and J. Sun\n(2016)\nDeep residual learning for image recognition\n.\nIn\nProceedings of the IEEE conference on computer vision and pattern recognition\n,\npp. 770–778\n.\nCited by:\n1st item\n,\nTABLE II\n.\n[21]\nS. Hochreiter and J. Schmidhuber\n(1997)\nLong short-term memory\n.\nNeural Computation\n9\n(\n8\n),\npp. 1735–1780\n.\nCited by:\n§2.3\n.\n[22]\nS. Hu, L. Shen, Y. Zhang, Y. Chen, and D. Tao\n(2024)\nOn transforming reinforcement learning with transformers: the development trajectory\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n46\n(\n12\n),\npp. 8580–8599\n.\nCited by:\n§2.2\n.\n[23]\nW. Huang, J. Liang, Z. Shi, D. Zhu, G. Wan, H. Li, B. Du, D. Tao, and M. Ye\n(2025)\nLearn from downstream and be yourself in multimodal large language model fine-tuning\n.\nIn\nInternational Conference on Machine Learning\n,\nCited by:\n§1\n.\n[24]\nW. Huang, J. Liang, G. Wan, D. Zhu, H. Li, J. Shao, M. Ye, B. Du, and D. Tao\n(2025)\nBe confident: uncovering overfitting in mllm multi-task tuning\n.\nIn\nInternational Conference on Machine Learning\n,\nCited by:\n§1\n.\n[25]\nP. Intelligence, K. Black, N. Brown, J. Darpinian, K. Dhabalia, D. Driess, A. Esmail, M. Equi, C. Finn, N. Fusai,\net al.\n(2025)\nπ\n0.5\n\\pi_{0.5}\n: A vision-language-action model with open-world generalization\n.\narXiv preprint arXiv:2504.16054\n.\nCited by:\n§1\n.\n[26]\nS. Jin, J. Xu, Y. Lei, and L. Zhang\n(2024)\nReasoning grasping via multimodal large language model\n.\narXiv preprint arXiv:2402.06798\n.\nCited by:\n§2.1\n.\n[27]\nF. Keller, N. M. Shafiullah,\net al.\n(2024)\nConsistency policy: accelerated visuomotor policies via consistency distillation\n.\narXiv preprint arXiv:2405.07503\n.\nCited by:\n§2.2\n.\n[28]\nM. J. Kim, K. Pertsch, S. Karamcheti, T. Xiao, A. Balakrishna, S. Nair, R. Rafailov, E. Foster, G. Lam, P. Sanketi,\net al.\n(2024)\nOpenvla: an open-source vision-language-action model\n.\nIn\nConference on Robot Learning\n,\npp. 2679–2713\n.\nCited by:\n6th item\n,\nTABLE III\n,\nTABLE VI\n.\n[29]\nJ. Li, Y. Zhu, Y. Xie, Z. Jiang, M. Seo, G. Pavlakos, and Y. Zhu\n(2024)\nOkami: teaching humanoid robots manipulation skills through single video imitation\n.\narXiv preprint arXiv:2410.11792\n.\nCited by:\n§1\n.\n[30]\nJ. Liang, W. Huang, F. Xia, P. Xu, K. Hausman, B. Ichter, P. Florence, and A. Zeng\n(2023)\nCode as policies: language model programs for embodied control\n.\nIn\n2023 IEEE International Conference on Robotics and Automation\n,\npp. 9493–9500\n.\nCited by:\n§1\n.\n[31]\nJ. Liang, W. Huang, G. Wan, Q. Yang, and M. Ye\n(2025)\nLorasculpt: sculpting lora for harmonizing general and specialized knowledge in multimodal large language models\n.\nIn\nProceedings of the IEEE/CVF international conference on computer vision\n,\nCited by:\n§1\n.\n[32]\nJ. Liu, W. Sun, H. Yang, P. Deng, C. Liu, N. Sebe, H. Rahmani, and A. Mian\n(2025)\nDiff9d: diffusion-based domain-generalized category-level 9-dof object pose estimation\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n47\n(\n7\n),\npp. 5520–5537\n.\nCited by:\n§2.1\n.\n[33]\nK. Liu, Y. Liu, and B. Chen\n(2025)\nGeneral 3d vision-language model with fast rendering and pre-training vision-language alignment\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n47\n(\n9\n),\npp. 7352–7368\n.\nCited by:\n§2.1\n.\n[34]\nS. Liu, L. Wu, B. Li, H. Tan, H. Chen, Z. Wang, K. Xu, H. Su, and J. Zhu\n(2024)\nRdt-1b: a diffusion foundation model for bimanual manipulation\n.\narXiv preprint arXiv:2410.07864\n.\nCited by:\n7th item\n,\nTABLE III\n,\nTABLE VI\n.\n[35]\nL. Manuelli, W. Gao, P. Florence, and R. Tedrake\n(2019)\nKpam: keypoint affordances for category-level robotic manipulation\n.\nIn\nThe International Symposium of Robotics Research\n,\npp. 132–157\n.\nCited by:\n§2.1\n.\n[36]\nA. Mousavian, C. Eppner, and D. Fox\n(2019)\n6-dof graspnet: variational grasp generation for object manipulation\n.\nIn\nProceedings of the IEEE/CVF international conference on computer vision\n,\npp. 2901–2910\n.\nCited by:\n§1\n,\n§2.1\n.\n[37]\nR. Pascanu, T. Mikolov, and Y. Bengio\n(2013)\nOn the difficulty of training recurrent neural networks\n.\nIn\nInternational conference on machine learning\n,\npp. 1310–1318\n.\nCited by:\n§1\n.\n[38]\nT. Pearce, T. Rashid, A. Kanervisto, D. Bignell, M. Sun, R. Georgescu, S. V. Macua, S. Z. Tan, I. Momennejad, K. Hofmann,\net al.\n(2023)\nImitating human behaviour with diffusion models\n.\narXiv preprint arXiv:2301.10677\n.\nCited by:\n§1\n.\n[39]\nD. A. Pomerleau\n(1988)\nAlvinn: an autonomous land vehicle in a neural network\n.\nAdvances in neural information processing systems\n1\n.\nCited by:\n§2.2\n.\n[40]\nS. Qiu, S. Anwar, and N. Barnes\n(2021)\nDense-resolution network for point cloud classification and segmentation\n.\nIn\nProceedings of the IEEE/CVF winter conference on applications of computer vision\n,\npp. 3813–3822\n.\nCited by:\n§2.1\n.\n[41]\nH. Razali and Y. Demiris\n(2025)\nKeystate-driven long-term generation of bimanual object manipulation sequences\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n47\n(\n9\n),\npp. 7784–7795\n.\nCited by:\n§2.2\n.\n[42]\nS. Ross, G. Gordon, and D. Bagnell\n(2011)\nA reduction of imitation learning and structured prediction to no-regret online learning\n.\nIn\nProceedings of the Fourteenth International Conference on Artificial Intelligence and Statistics\n,\npp. 627–635\n.\nCited by:\n§2.2\n.\n[43]\nJ. J. Rothert, S. Lang, M. Seidel, and M. Hanses\n(2024)\nSim-to-real transfer for a robotics task: challenges and lessons learned\n.\nIn\n2024 IEEE 29th International Conference on Emerging Technologies and Factory Automation\n,\npp. 1–8\n.\nCited by:\n§1\n.\n[44]\nK. Roy, A. Jaiswal, and P. Panda\n(2019)\nTowards spike-based machine intelligence with neuromorphic computing\n.\nNature\n575\n(\n7784\n),\npp. 607–617\n.\nCited by:\n§1\n.\n[45]\nH. Shi, H. Xu, S. Clarke, Y. Li, and J. Wu\n(2023)\nRobocook: long-horizon elasto-plastic object manipulation with diverse tools\n.\narXiv preprint arXiv:2306.14447\n.\nCited by:\n§1\n,\n§2.1\n.\n[46]\nM. Shridhar, L. Manuelli, and D. Fox\n(2022)\nCliport: what and where pathways for robotic manipulation\n.\nIn\nConference on robot learning\n,\npp. 894–906\n.\nCited by:\n§1\n.\n[47]\nV. Sitzmann, J. Martel, A. Bergman, D. Lindell, and G. Wetzstein\n(2020)\nImplicit neural representations with periodic activation functions\n.\nAdvances in neural information processing systems\n33\n,\npp. 7462–7473\n.\nCited by:\n§1\n,\n§2.1\n.\n[48]\nI. Skubis and K. Wodarski\n(2023)\nHUMANOID robots in managerial positions-decision-making process and human oversight.\n.\nScientific Papers of Silesian University of Technology. Organization & Management/Zeszyty Naukowe Politechniki Slaskiej. Seria Organizacji i Zarzadzanie\n(\n189\n).\nCited by:\n§1\n.\n[49]\nY. Song, P. Dhariwal, M. Chen, and I. Sutskever\n(2023)\nConsistency models\n.\nIn\nInternational Conference on Machine Learning\n,\nCited by:\n§1\n.\n[50]\nJ. Sun, Y. Wang, and D. Wang\n(2025)\nTowards real-world aerial vision guidance with categorical 6d pose tracker\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n47\n(\n7\n),\npp. 6055–6072\n.\nCited by:\n§2.1\n.\n[51]\nC. Tang, D. Huang, W. Ge, W. Liu, and H. Zhang\n(2023)\nGraspgpt: leveraging semantic knowledge from a large language model for task-oriented grasping\n.\nIEEE Robotics and Automation Letters\n8\n(\n11\n),\npp. 7551–7558\n.\nCited by:\n§1\n,\n§2.1\n.\n[52]\nO. M. Team, D. Ghosh, H. Walke, K. Pertsch, K. Black, O. Mees, S. Dasari, J. Hejna, T. Kreiman, C. Xu,\net al.\n(2024)\nOcto: an open-source generalist robot policy\n.\nIn\nProceedings of Robotics: Science and Systems\n,\nCited by:\n§1\n,\n§1\n,\n5th item\n,\nTABLE III\n,\nTABLE VI\n.\n[53]\nY. Tong, H. Liu, and Z. Zhang\n(2024)\nAdvancements in humanoid robots: a comprehensive review and future prospects\n.\nIEEE/CAA Journal of Automatica Sinica\n11\n(\n2\n),\npp. 301–328\n.\nCited by:\n§1\n.\n[54]\nA. Vaswani, N. Shazeer, N. Parmar, J. Uszkoreit, L. Jones, A. N. Gomez, Ł. Kaiser, and I. Polosukhin\n(2017)\nAttention is all you need\n.\nAdvances in neural information processing systems\n30\n.\nCited by:\n2nd item\n,\nTABLE II\n.\n[55]\nJ. Wen, Y. Zhu, J. Li, Z. Tang, C. Shen, and F. Feng\n(2025)\nDexvla: vision-language model with plug-in diffusion expert for general robot control\n.\nIn\nConference on Robot Learning\n,\nCited by:\n8th item\n,\nTABLE III\n,\nTABLE VI\n.\n[56]\nY. Wu, R. Zhao, J. Zhu, F. Chen, M. Xu, G. Li, S. Song, L. Deng, G. Wang, H. Zheng,\net al.\n(2022)\nBrain-inspired global-local learning incorporated with neuromorphic computing\n.\nNature Communications\n13\n(\n1\n),\npp. 65\n.\nCited by:\n§2.3\n.\n[57]\nM. Yao, X. Qiu, T. Hu, J. Hu, Y. Chou, K. Tian, J. Liao, L. Leng, B. Xu, and G. Li\n(2025)\nScaling spike-driven transformer with efficient spike firing approximation training\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n.\nCited by:\n§2.3\n.\n[58]\nM. Yaseen\n(2024)\nWhat is yolov9: an in-depth exploration of the internal features of the next-generation object detector\n.\narXiv preprint arXiv:2409.07813\n.\nCited by:\nFigure 2\n.\n[59]\nA. Zeng, P. Florence, J. Tompson, S. Welker, J. Chien, M. Attarian, T. Armstrong, I. Krasin, D. Duong, V. Sindhwani,\net al.\n(2021)\nTransporter networks: rearranging the visual world for robotic manipulation\n.\nIn\nConference on Robot Learning\n,\npp. 726–747\n.\nCited by:\n§2.1\n.\n[60]\nJ. Zhang, J. Huang, S. Jin, and S. Lu\n(2024)\nVision-language models for vision tasks: a survey\n.\nIEEE Transactions on Pattern Analysis and Machine Intelligence\n46\n(\n8\n),\npp. 5625–5644\n.\nCited by:\n§2.1\n.\n[61]\nT. Zhao, P. Liu, and K. Lee\n(2024)\nOmDet: large-scale vision-language multi-dataset pre-training with multimodal detection network\n.\nIET Computer Vision\n18\n(\n5\n),\npp. 626–639\n.\nCited by:\n§2.1\n.\n[62]\nT. Z. Zhao, V. Kumar, S. Levine, and C. Finn\n(2023)\nLearning fine-grained bimanual manipulation with low-cost arms\n.\nIn\nProceedings of Robotics: Science and Systems\n,\nCited by:\n§2.2\n.\n[63]\nB. Zitkovich, T. Yu, S. Xu, P. Xu, T. Xiao, F. Xia, J. Wu, P. Wohlhart, S. Welker, A. Wahid,\net al.\n(2023)\nRt-2: vision-language-action models transfer web knowledge to robotic control\n.\nIn\nConference on Robot Learning\n,\npp. 2165–2183\n.\nCited by:\n§1\n,\n§1\n,\n§2.2\n.",
  "preview_text": "Humanoid robot manipulation is a crucial research area for executing diverse human-level tasks, involving high-level semantic reasoning and low-level action generation. However, precise scene understanding and sample-efficient learning from human demonstrations remain critical challenges, severely hindering the applicability and generalizability of existing frameworks. This paper presents a novel RGMP-S, Recurrent Geometric-prior Multimodal Policy with Spiking features, facilitating both high-level skill reasoning and data-efficient motion synthesis. To ground high-level reasoning in physical reality, we leverage lightweight 2D geometric inductive biases to enable precise 3D scene understanding within the vision-language model. Specifically, we construct a Long-horizon Geometric Prior Skill Selector that effectively aligns the semantic instructions with spatial constraints, ultimately achieving robust generalization in unseen environments. For the data efficiency issue in robotic action generation, we introduce a Recursive Adaptive Spiking Network. We parameterize robot-object interactions via recursive spiking for spatiotemporal consistency, fully distilling long-horizon dynamic features while mitigating the overfitting issue in sparse demonstration scenarios. Extensive experiments are conducted across the Maniskill simulation benchmark and three heterogeneous real-world robotic systems, encompassing a custom-developed humanoid, a desktop manipulator, and a commercial robotic platform. Empirical results substantiate the superiority of our method over state-of-the-art baselines and validate the efficacy of the proposed modules in diverse generalization scenarios. To facilitate reproducibility, the source code and video demonstrations are publicly available at https://github.com/xtli12/RGMP-S.git.\n\nGeneralizable Geometric Prior and Recurrent Spiking Feature Learning for Humanoid Robot Manipulation\nXuetao Li\nİD\n, Wenke Huang\nİD\n, Mang Ye\nİD\n, , Jifeng Xuan\nİD\n,\nBo Du\n",
  "is_relevant": true,
  "relevance_score": 6.0,
  "extracted_keywords": [
    "VLA",
    "locomotion",
    "whole body control"
  ],
  "one_line_summary": "该论文提出了一种结合几何先验和递归尖峰特征学习的方法，用于提升人形机器人操作的高层语义推理和数据效率运动合成，在未见环境中实现鲁棒泛化。",
  "detailed_summary": "## 论文摘要\n\n**论文标题：** 用于人形机器人操作的可泛化几何先验与递归脉冲特征学习\n\n### 1. 研究背景和动机\n人形机器人操作是执行多样化人类级别任务的关键领域，涉及高级语义推理和低级动作生成。然而，精确的场景理解和从人类演示中进行样本高效学习仍是关键挑战，严重阻碍了现有框架的适用性和泛化能力。现有方法主要面临两大瓶颈：**I）语义-几何鸿沟**：视觉语言模型（VLM）擅长语义理解，但缺乏显式的几何推理能力，导致生成的技能计划在物理上不可行（例如，无法区分抓握与捏取变形物体）。**II）数据效率低下**：扩散策略等生成模型表达能力虽强，但推理延迟高；而前馈式模型（如Transformer）实现实时控制又需要海量数据，在稀疏演示场景下容易过拟合。\n\n### 2. 核心方法和技术创新\n本文提出了一个名为 **RGMP-S** 的统一框架，通过两个核心模块解决上述问题：\n- **长时域几何先验技能选择器（LGSS）**：提出一种轻量级的几何调优策略，将几何常识（如物体形状）注入VLM。它通过**链式思维（CoT）机制**，结合物体边界框和分割信息，对语义指令进行几何一致性检查，从而从预定义技能库中可靠地选择物理上可行的操作技能（如侧抓、上提、捏取）。\n- **递归自适应脉冲网络（RASNet）**：设计了一种新颖的策略架构，用于从稀疏演示中高效学习稳健的动作策略。其核心创新包括：**1）自适应衰减机制（ADM）** 和**旋转位置编码（RoPE）**，以递归方式构建全局空间记忆；**2）脉冲密集特征提取（SDFE）** 和**自适应脉冲神经元（ASN）**，动态过滤冗余视觉噪声并增强任务关键特征；**3）高斯混合模型（GMM）** 用于精细化多模态动作生成，提升控制精度。\n\n### 3. 主要实验结果\n研究在**ManiSkill2仿真基准**和**三个异构真实机器人平台**（定制人形机器人、桌面机械臂、商用Aloha机器人）上进行了广泛验证，涵盖交互式服务、零样本抓取、毛巾折叠、倒水、分拣等10项任务。关键结果包括：\n- **性能优越**：在真实世界交互任务中，RGMP-S比扩散策略基线性能提升**19%**，整体泛化成功率高达**89%**。\n- **数据高效**：在抓取任务中，仅需**40条**专家轨迹即可达到扩散策略使用**200条**轨迹的性能，数据效率提升**5倍**。\n- **实时性强**：推理频率达到**75.2 Hz**，远超扩散策略（1.01 Hz）和OpenVLA（3.6 Hz），满足实时控制需求。\n- **零样本泛化能力强**：仅在“芬达罐”数据上训练，即可成功抓取未见过的“可乐罐”、“喷雾瓶”甚至“人手”。\n\n### 4. 研究意义和价值\n本工作为**实现高效、稳健且可泛化的机器人操作**提供了重要思路和实践方案。其价值体现在：\n- **方法论创新**：创造性地将**几何先验推理**与**脉冲时空特征学习**相结合，为弥补语义规划与物理执行之间的鸿沟提供了新范式。\n- **实用性强**：框架兼具**高数据效率**和**低推理延迟**，降低了对大规模演示数据和昂贵算力的依赖，更贴近实际机器人部署需求。\n- **开源与可复现**：公开了源代码和视频演示，为社区提供了强大的基准，推动了通用机器人学习的研究。",
  "qa_pairs": [
    {
      "question": "这篇论文的核心创新点是什么，他想解决什么问题，怎么解决的？",
      "answer": "## 论文核心分析\n\n### **论文标题**\n《Generalizable Geometric Prior and Recurrent Spiking Feature Learning for Humanoid Robot Manipulation》\n\n### **核心研究问题**\n论文旨在解决人形机器人灵巧操作中的两大关键挑战：\n1.  **语义-几何鸿沟**：现有视觉语言模型（VLM）能理解高级语义指令，但缺乏对物体**三维几何结构**的精确感知，导致生成的技能计划（如抓取 vs. 捏取）在物理上不可行。\n2.  **数据效率与泛化能力**：在动态、非结构化环境中，从**稀疏的人类演示**中高效学习鲁棒、可泛化的动作策略非常困难。主流方法（如扩散策略）存在推理延迟高、数据需求大、易过拟合等问题。\n\n### **核心解决方案：RGMP-S框架**\n论文提出了一个名为 **RGMP-S** 的统一框架，它通过两个核心模块协同工作来解决上述问题：\n\n#### **1. 技术创新一：长时域几何先验技能选择器**\n*   **是什么**：一个轻量级的**几何推理模块**，用于桥接语义指令与物理执行。\n*   **如何解决“语义-几何鸿沟”**：\n    *   **原理**：不依赖计算昂贵的显式3D重建，而是从2D RGB图像中提取**隐式几何先验**（如物体形状、空间关系）。\n    *   **方法**：\n        *   **视觉-语言解释**：使用VLM（Qwen-VL）解析指令并定位目标物体（输出边界框）。\n        *   **语义分割**：使用YOLOv8-seg从边界框中提取物体的精确形状信息。\n        *   **几何接地的思维链推理**：通过精心设计的提示词，将边界框坐标、形状类别与**常识几何知识**结合，进行多步推理，选择物理上可行且无碰撞的操作技能（如侧抓、上提、捏取）。\n    *   **价值**：使机器人能像人类一样，根据物体的**几何形变**（如压扁的易拉罐）自适应选择正确技能，实现了**对未见场景的鲁棒泛化**。\n\n#### **2. 技术创新二：递归自适应脉冲网络**\n*   **是什么**：一个新型的**策略网络架构**，用于从稀疏演示中高效学习时空一致的动作策略。\n*   **如何解决“数据效率与泛化”**：\n    *   **原理**：将**脉冲神经网络**的动态特性与递归计算结合，显式地建模机器人-物体交互的时空机制。\n    *   **核心组件**：\n        *   **自适应衰减机制**：动态调节历史记忆的保留，缓解递归网络中的梯度消失问题。\n        *   **自适应脉冲神经元**：替代传统SNN中固定的衰减因子和不可微的脉冲函数，实现可微分训练，能动态放大任务关键特征、抑制视觉噪声。\n        *   **脉冲密集特征提取**：在空间特征中嵌入**时间推理**能力，帮助模型从密集的视觉流中过滤冗余信息。\n        *   **高斯混合模型精炼**：用GMM对动作空间进行多模态建模，避免单高斯回归到均值，提升控制精度。\n    *   **价值**：赋予了策略强大的**时空特征提取和记忆能力**，使其能从极少的演示（如每个技能仅40条轨迹）中学习，并泛化到新物体、新背景中，同时保持**高推理频率**。\n\n### **实际价值与实验验证**\n*   **性能提升**：在ManiSkill2仿真基准和三个异构真实机器人平台（自定义人形机器人、桌面机械臂、商用Aloha机器人）上进行了广泛实验。\n*   **关键结果**：\n    *   **泛化能力强**：在零样本抓取任务中，对未见过物体（喷雾瓶、人手）的成功率显著高于基线模型。\n    *   **数据效率高**：仅需**基线方法1/5的演示数据**即可达到相当或更优的性能。\n    *   **实时性高**：推理频率达**75.2 Hz**，远超扩散策略，满足实时控制需求。\n    *   **处理复杂任务**：在折叠毛巾、倒水、箱内取物等长时域、多步骤任务上表现优异。\n\n### **总结**\n这篇论文的核心创新在于**创造性地将几何先验推理与脉冲时空特征学习相结合**，提出了一个既“聪明”（能进行几何推理）又“高效”（数据需求少、推理快）的机器人操作框架RGMP-S。它有效地解决了当前机器人学习范式中**语义与物理脱节**以及**严重依赖大数据**的痛点，为实现在开放世界中通用、灵巧的机器人操作提供了有前景的路径。",
      "timestamp": "2026-01-20T17:51:14.669071",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "基于他的前作，梳理这个方向的整个发展脉络，每一步相比于之前的工作都改进了什么，着重于几个不同的发展方向。",
      "answer": "## 论文发展脉络梳理：从RGMP到RGMP-S\n\n本文提出的 **RGMP-S** 是其前作 **RGMP** 的扩展与深化。通过梳理从RGMP到RGMP-S的演进，可以清晰地看到该研究方向在解决**人形机器人灵巧操作**核心挑战上的发展脉络，主要沿着**高层语义-几何推理**和**底层数据高效策略学习**两个关键方向进行迭代与融合。\n\n### 发展脉络总览\n\n| 工作阶段 | 核心框架 | 关键改进方向 | 解决的问题 | 与前作相比的进步 |\n| :--- | :--- | :--- | :--- | :--- |\n| **前作 (AAAI 2026)** | RGMP | 1. **几何先验引入** <br> 2. **递归计算架构** | 语义-几何鸿沟；稀疏演示下的策略学习 | 首次将几何常识与递归模型结合，实现初步的泛化操作。 |\n| **本工作 (扩展版)** | **RGMP-S** | 1. **几何推理增强 (LGSS)** <br> 2. **时空特征学习深化 (RASNet)** <br> 3. **评估范围扩展** | 长视野任务规划；复杂背景下的鲁棒性；更广泛的泛化验证 | 在推理架构、特征提取机制和实验验证上进行了系统性增强，性能与泛化能力显著提升。 |\n\n---\n\n### 发展方向一：高层语义-几何推理的演进\n\n这个方向致力于解决 **“语义计划在物理上不可执行”** 的根本问题，即让机器人不仅能听懂指令，还能理解物体的几何结构并选择可行的操作技能。\n\n- **RGMP 的奠基工作：**\n    - **做了什么：** 提出了初步的**几何先验技能选择器**。通过将轻量化的2D几何归纳偏置（如物体形状）注入视觉语言模型，使模型能够根据物体几何属性（如“圆柱形” vs. “压扁的”）选择不同的抓取技能（如“侧握” vs. “捏取”）。\n    - **改进点：** 相较于传统仅依赖语义嵌入或粗糙空间提示（如边界框）的VLM方法，RGMP首次明确地将**几何常识**作为连接语义与动作的桥梁，缓解了在物体形变等未见场景下的技能选择错误。\n\n- **RGMP-S 的增强与深化：**\n    - **核心改进：** 将技能选择器升级为 **长视野几何先验技能选择器**。\n    - **技术增强：**\n        1.  **结构化推理链：** 引入了 **Chain-of-Thought** 机制，能够将复杂的长视野任务（如“叠毛巾”、“倒水”）分解为结构化的多阶段技能序列。\n        2.  **更强的物理 grounding：** CoT提示中明确加入了**无碰撞**、**运动学可行**等物理约束，使生成的计划不仅在语义上合理，在物理上也更可靠。\n    - **带来的价值：** 显著提升了在**长视野、多步骤**操作任务上的成功率。推理过程更加透明和符合人类认知，增强了系统在复杂、动态环境中的决策鲁棒性。\n\n### 发展方向二：底层数据高效策略学习的演进\n\n这个方向致力于解决 **“如何从有限的演示数据中学习鲁棒、实时的控制策略”** 的问题，避免对大规模数据和迭代扩散模型的依赖。\n\n- **RGMP 的奠基工作：**\n    - **做了什么：** 采用了**递归计算**架构来建模机器人末端执行器与目标物体之间的空间关系，作为动作生成的基础策略。\n    - **改进点：** 相较于计算延迟高的扩散策略或需要海量数据的Transformer策略，递归模型提供了**前向、高效**的推理方式。但作者指出其存在**梯度消失**和难以从复杂视觉背景中筛选任务相关特征的局限。\n\n- **RGMP-S 的增强与深化：**\n    - **核心改进：** 提出了全新的 **递归自适应脉冲网络**。\n    - **技术增强：**\n        1.  **时空特征融合：** 引入 **脉冲密集特征提取** 模块。SDFE利用**自适应脉冲神经元**模拟生物神经元的动态特性，能有效抑制密集视觉特征中的冗余信息（背景噪声），同时增强对任务关键特征（物体轮廓）的感知。\n        2.  **动态记忆机制：** 通过**自适应衰减机制**动态调节历史信息的保留率，解决了标准递归模型的梯度问题，并构建了更有效的**空间记忆**。\n        3.  **多模态动作表征：** 沿用并强调了**高斯混合模型**来拟合动作分布，避免了单高斯分布回归到平均值的弊端，能更好地捕捉演示数据中的多模态特性（如不同的抓取角度）。\n    - **带来的价值：**\n        - **数据效率极大提升：** 实验表明，RGMP-S仅需 **1/5** 的演示数据即可达到与扩散策略基线相当的性能。\n        - **推理速度与鲁棒性兼得：** 保持高推理频率（75.2 Hz）的同时，在杂乱背景和未见物体上的泛化成功率显著提高。\n        - **赋予策略“时空感知”：** ASN的引入使策略不仅考虑当前空间特征，还能隐式地利用时间上下文信息，这对于处理动态和长视野任务至关重要。\n\n### 发展方向三：系统整合与评估范式的扩展\n\n- **RGMP 的奠基工作：** 提出了RGMP统一框架的概念，并在仿真和部分真实机器人平台上进行了验证。\n- **RGMP-S 的增强与深化：**\n    - **系统整合更成熟：** LGSS和RASNet的升级使得两个模块的协作更加紧密和高效，形成了从“听懂指令 -> 几何分析 -> 技能选择 -> 时空特征提取 -> 精细动作生成”的完整、鲁棒流水线。\n    - **评估范围大幅扩展：**\n        1.  **任务复杂度增加：** 新增了“叠毛巾”、“倒水”、“箱内取物”等极具挑战性的**长视野、非刚性物体、动态场景**任务。\n        2.  **机器人平台多样化：** 在自定义人形机器人基础上，增加了桌面机械臂和商用Aloha机器人平台，验证了框架的**跨本体泛化能力**。\n        3.  **基准测试更全面：** 在ManiSkill2仿真基准上进行了更广泛的对比，证明了其相对于SOTA方法的持续领先优势。\n\n### 总结\n\n从RGMP到RGMP-S的发展脉络，清晰地展示了一条通向**通用化、数据高效、鲁棒**的人形机器人操作技术的路径：\n\n1.  **从“有无”到“优劣”：** RGMP**解决了**几何先验和递归模型用于操作策略的“有无”问题；RGMP-S则在此基础上**优化了**推理的深度（CoT）和特征学习的质量（脉冲网络），实现了从“可用”到“好用、强大”的跨越。\n2.  **双轮驱动，深度融合：** 两个核心发展方向并行推进且相互促进。更好的几何推理（LGSS）为底层策略提供了更准确的技能和约束目标；更强大的时空特征学习（RASNet）则能更精准地执行这些技能，尤其在复杂环境下。两者的深度融合是RGMP-S高性能的关键。\n3.  **面向真实世界的闭环：** 研究始终以解决真实世界挑战为导向（数据稀缺、环境非结构化、物体多样性），并通过不断扩展和严苛的实验评估来验证其实际价值。RGMP-S在多项真实长视野任务上的成功，标志着该框架向实际应用迈出了坚实的一步。\n\n**未来方向** 已在失败案例分析中指明：如何整合触觉反馈或主动视觉以解决**毫米级精操作**和**严重自遮挡**等极端情况，将是下一个需要攻克的堡垒。",
      "timestamp": "2026-01-20T17:52:11.945725",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "他的前作有哪些？使用表格仔细讲讲他的每篇前作，他和前作的区别是什么，主要改善是什么？着重于具体相比于之前文章的改动",
      "answer": "## 论文前作分析\n\n根据提供的论文内容，作者团队在本文（RGMP-S）之前，有一篇发表于AAAI 2026的会议论文作为其初步版本。以下是关于这篇前作的详细分析。\n\n### 前作信息总览表\n\n| 项目 | 前作 (AAAI 2026) | 当前工作 (本期刊论文 RGMP-S) | 主要区别与改进 |\n| :--- | :--- | :--- | :--- |\n| **论文标题** | **RGMP: Recurrent Geometric-prior Multimodal Policy for Generalizable Humanoid Robot Manipulation** | **Generalizable Geometric Prior and Recurrent Spiking Feature Learning for Humanoid Robot Manipulation** | 标题更精确地反映了**新增的脉冲特征学习**核心贡献。 |\n| **核心框架** | **RGMP** (Recurrent Geometric-prior Multimodal Policy) | **RGMP-S** (RGMP with **Spiking** features) | **“-S”后缀**明确标识了在原有框架基础上集成了**脉冲神经网络**模块。 |\n| **两大核心模块** | 1. **几何先验技能选择器** (初步版本) <br> 2. **递归计算模块** (用于动作生成) | 1. **长视距几何先验技能选择器 (LGSS)** <br> 2. **递归自适应脉冲网络 (RASNet)** | 1. **LGSS**：增强了**层次化思维链**机制，支持更复杂的**长视距任务分解**。<br> 2. **RASNet**：完全**重构了动作生成网络**，引入了**脉冲密集特征提取**和**自适应脉冲神经元**。 |\n| **技术创新点** | 1. 将轻量级几何先验与VLM结合。<br>2. 使用递归计算构建机器人-目标空间关系。 | 1. **LGSS**：通过**CoT机制**实现结构化任务分解。<br>2. **RASNet**：包含**SDFE** (脉冲密集特征提取)、**ASN** (自适应脉冲神经元)、**ADM** (自适应衰减机制)。<br>3. 使用**高斯混合模型**进行动作精炼。 | **从“几何+递归”升级为“几何+脉冲递归”**。重点解决了前作中**特征冗余**和**缺乏时序逻辑**的问题，增强了在复杂背景和长序列任务中的**鲁棒性**与**泛化能力**。 |\n| **实验评估** | 在ManiSkill仿真基准和**自研人形机器人**上进行了验证。 | **大幅扩展了实验范围**：<br>1. 增加了**商用Aloha机器人**平台。<br>2. 引入了三个新的**长视距挑战任务**：毛巾折叠、倒水、箱内取物。<br>3. 进行了更全面的**消融实验**和**数据效率分析**。 | 评估更**系统、严格、多样化**，旨在验证框架在**更复杂任务**和**不同机器人本体**上的**通用性**。证明了新模块（尤其是SDFE）在长视距任务中的关键作用。 |\n| **主要改善目标** | 解决**语义-几何鸿沟**，实现从演示中**数据高效**的技能学习。 | 在继承前作目标基础上，**重点解决**：<br>1. **长视距推理能力**不足。<br>2. 在杂乱场景中**特征冗余**和**噪声敏感**问题。<br>3. **时序动态特性**建模能力弱。 | 改善是**根本性的架构演进**，而非微调。**RASNet替代了原有的递归模块**，通过脉冲动力学显式地建模**时空一致性**，使策略能更好地**蒸馏长视距动态特征**并**抑制过拟合**。 |\n| **性能表现** | 已展现出优于扩散策略等基线方法的性能和数据效率。 | **性能全面提升**：<br>• 在零样本抓取任务上，平均成功率从RGMP的87%提升至**89%**。<br>• 在长视距任务（如倒水）上，相比扩散策略基线有约**16%** 的性能提升。<br>• 保持了**75.2 Hz**的高实时推理频率和**5倍**于扩散策略的数据效率。 | 通过引入脉冲特征学习和增强的几何推理，在**保持高实时性**的同时，进一步提升了在**未见过的复杂场景**和**长序列任务**中的**成功率和鲁棒性**。 |\n\n### 总结：与前作的核心区别\n\n本期刊论文 **RGMP-S** 相对于前作 **RGMP** 的改进主要体现在 **深度、广度和机制** 三个层面：\n\n1.  **算法深度增强**：将初步的几何技能选择器升级为具有**链式思维（CoT）** 的 **LGSS**，使其能进行**多阶段、结构化的任务分解**，显著提升了**长视距规划能力**（如毛巾折叠）。\n2.  **架构机制革新**：这是最核心的改进。用全新的 **RASNet** 取代了原有的递归动作生成器。\n    *   **动机**：解决前作模型在**复杂背景**下特征冗余、缺乏**时序过滤**能力的问题。\n    *   **核心创新**：\n        *   **Spiking Dense Feature Extraction (SDFE)**：引入脉冲神经元处理密集视觉特征，动态过滤冗余信息，增强对任务关键特征（如物体轮廓）的聚焦。\n        *   **Adaptive Spike Neurons (ASN)**：用**自适应衰减因子**替代传统脉冲神经元的固定参数，解决了训练中的梯度难题，并实现了对时序信息的动态调控。\n        *   **Adaptive Decay Mechanism (ADM)**：在递归计算中动态调节历史记忆留存，更好地捕获长程空间依赖。\n    *   **结果**：使策略具备了内在的**时空一致性建模能力**，从稀疏演示中学习动态特征更高效，泛化能力更强。\n3.  **评估广度拓展**：通过增加**商业机器人平台**和**更具挑战性的长视距任务**，全面验证了框架的**通用性**和**实用性**，证明了其改进不仅在指标上，更体现在实际应用的广度上。\n\n**总而言之，前作RGMP提出了一个融合几何先验和递归计算的创新框架，而本工作RGMP-S则通过引入脉冲神经网络和增强的推理机制，对该框架进行了深刻的“智能化”升级，使其时空感知、抗干扰和复杂任务推理能力得到了质的飞跃。**",
      "timestamp": "2026-01-20T17:52:58.970739",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文提出了哪些关键技术方法，请列表格具体详细说明技术细节，需要包含具体的数学原理推导，以及具体参数。",
      "answer": "## 论文关键技术方法分析\n\n本文提出的RGMP-S框架包含两个核心技术模块：**长时域几何先验技能选择器**和**递归自适应脉冲网络**。以下是详细的技术细节表格：\n\n| 模块名称 | 核心组件 | 技术细节与数学原理 | 具体参数与实现 |\n|---------|---------|-------------------|--------------|\n| **长时域几何先验技能选择器** | 视觉-语言解释模块 | 使用Qwen-VL API进行视觉-语言理解，通过结构化提示工程整合先验知识。输入提示格式：`\"Instruction: Identify target object in image and output bounding box [x1, y1, x2, y2]\"`。模型使用20个代表性示例建立视觉特征、几何属性与操作策略的映射。 | - 定位准确率：93.1%<br>- 查询延迟：45 ms<br>- 训练示例：20个跨类别样本<br>- 输入图像分辨率：640×480 |\n| | 语义分割模块 | 使用YOLOv8n-seg模型处理边界框区域，生成精确的语义分割掩码以捕获物体几何结构。模型在大型数据集上预训练，并在专有数据上微调。 | - 平均交并比：97.6%<br>- 模型：YOLOv8n-seg<br>- 输入：边界框坐标提取的图像区域 |\n| | 几何基础链式思维技能推理器 | 采用链式思维协议将感知输入转换为可执行动作。提示模板嵌入任务特定原语（如侧抓、倒水），通过置信度加权评估候选技能。决策函数：<br>`𝒫 = plan(ℐ, 𝒪 | 𝒞)`<br>其中𝒞为预定义上下文集`{(ℐ_i, 𝒪_i, 𝒫_i)}`，包含指令、提示和常识推理。 | - 技能库：5种技能（侧抓、抬起、顶部捏取、倒水、递送）<br>- 推理机制：结构化CoT协议<br>- 输出：技能序列𝒫 |\n| **递归自适应脉冲网络** | 自适应衰减机制 | 动态调节历史记忆保留，生成内容自适应衰减因子：<br>`𝒲 = σ(𝒞_{1×1}(SReLU(𝒞_{3×3}(F_0))))`<br>其中σ为sigmoid函数，𝒞为卷积层，SReLU为平方ReLU激活。 | - 衰减因子范围：[0, 1]<br>- 卷积核：3×3和1×1<br>- 激活函数：SReLU |\n| | 旋转位置编码 | 通过几何旋转在特征空间中编码位置信息，增强位置敏感依赖。旋转矩阵定义为：<br>`𝐑_Θ(x) = [[cos(θ), -sin(θ)], [sin(θ), cos(θ)]]`<br>其中`θ_{h,w,j} = θ_j·x_h + θ_j·x_w`, `θ_j = 1/(10000^{2j/C})`。 | - 基础常数：10000<br>- 通道维度：C<br>- 位置编码：二维离散坐标(x_h, x_w) |\n| | 递归计算机制 | 使用WKV机制建模图像块间的序列依赖：<br>`WKV_i = (n_i + exp(u)⊙k_i⊙v_i) / (d_i + exp(u)⊙k_i)`<br>`n_i = n_{i-1}⊙exp(-𝒲) + k_i⊙v_i`<br>`d_i = d_{i-1}⊙exp(-𝒲) + k_i`<br>其中k_i、v_i为图像块表示，u为可学习位置偏置。 | - 图像块大小：16×16<br>- 初始状态：n_0=k_0⊙v_0, d_0=k_0<br>- 位置偏置：u∈(0,1) |\n| | 脉冲密集特征提取 | 通过密集块提取上下文信息，生成空间注意力掩码：<br>`X_k = B_k Ī_k B_k^T`<br>其中`Ī = (1/n)(I - (1/n)𝟏)`，n=h×w。随后通过softmax和自适应脉冲神经元融合特征：<br>`Q_A = 𝒞_{1×1}(U_k) + 𝒜(F_k)`。 | - 注意力矩阵维度：n×n<br>- 输出通道：C/r<br>- 融合方式：逐元素相加 |\n| | 自适应脉冲神经元 | 引入动态衰减因子替代固定衰减，解决脉冲神经元不可微问题。膜电位更新公式：<br>`V_t = H_{t-1} + X_t`<br>`S_t = Θ(V_t - u_th)`<br>`H_t = V_t e^{-Δt/τ}(1 - S_t) + V_reset S_t`<br>其中τ为自适应衰减因子，通过通道注意力机制计算：<br>`τ = 𝔼[𝒞_{1×1}(R(𝒞_{1×1}(F_k)))]`。 | - 阈值：u_th<br>- 重置电位：V_reset<br>- 衰减因子τ：动态计算<br>- 时间间隔：Δt（单位时间） |\n| | 高斯混合模型精炼 | 使用GMM建模动作多模态分布，通过马氏距离选择最优组件：<br>`P(𝐱∣Θ) = Σ_{k=1}^K α_k 𝒩(𝐱∣μ_k, Σ_k)`<br>`l_k = √[(a_in - μ_k^ω)^⊤ (Σ_k^{ω,ω})^{-1} (a_in - μ_k^ω)]`<br>最终动作选择：`a^* = arg min_{μ_k^ω} l_k`。 | - 组件数：K=6<br>- 参数估计：期望最大化算法<br>- 距离度量：马氏距离 |\n\n### 关键技术原理总结\n\n1. **几何先验注入**：通过轻量级几何适配器将形状级常识偏置注入VLM，实现语义指令与潜在几何约束的对齐，无需任务特定微调。\n\n2. **时空一致性建模**：\n   - **递归计算**：通过WKV机制建立空间记忆，捕获机器人末端执行器与目标物体的方向性空间依赖。\n   - **脉冲机制**：自适应脉冲神经元动态过滤冗余视觉噪声，增强时间维度上的鲁棒性。\n\n3. **多模态动作生成**：GMM有效表示动作分布的多峰特性，避免单高斯分布回归到均值导致的控制精度损失。\n\n4. **高效推理设计**：整个框架采用前馈架构，避免扩散策略的迭代去噪过程，实现75.2 Hz的高推理频率，满足实时控制需求。\n\n### 实际价值体现\n- **数据效率**：仅需40条专家轨迹即可达到与扩散策略（需200条轨迹）相当的性能，数据效率提升5倍。\n- **泛化能力**：在零样本抓取任务中，对未见物体（如喷雾瓶、人手）达到85%-93%的成功率。\n- **实时性**：推理延迟仅13.3ms，适合高频率响应操作任务。\n\n这些技术创新共同解决了机器人操作中的语义-几何鸿沟问题，并在有限演示数据下实现了鲁棒、通用的操作能力。",
      "timestamp": "2026-01-20T17:53:52.482044",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "他使用了哪些评价指标与数据集，列表格具体讲讲他的评价指标的细节与数据集的细节",
      "answer": "## 论文评价指标与数据集分析\n\n### 一、 评价指标\n\n论文使用了**两类核心评价指标**，分别用于评估高层技能选择和底层动作执行，并最终合成一个综合成功率。\n\n| 指标名称 | 符号表示 | 定义与计算方式 | 评估目标 |\n| :--- | :--- | :--- | :--- |\n| **技能选择准确率** | `Acc_s` | 模型为给定指令选择正确操作技能（如侧抓、捏取、提起等）的概率。这是一个**分类准确率**，成功记为1，失败记为0。 | 评估**高层语义-几何推理**模块（LGSS）的性能，即能否根据物体几何形状和场景约束选择物理上可行的技能。 |\n| **任务执行成功率** | `Acc_t` | 机器人成功完成与目标物体的物理交互（如稳定抓取、倒水、折叠等）的概率。这是一个**二元成功指标**，仅当任务被完全、稳定地完成时才记为1。 | 评估**底层动作生成**策略（RASNet）的性能，即生成的关节动作能否在物理世界中精确执行。 |\n| **综合成功率** | `Acc` | **`Acc = Acc_s × Acc_t`**。该指标反映了从指令理解到任务完成的端到端系统性能。 | 评估**整个RGMP-S框架**的总体效能，强调了高层决策和底层控制缺一不可。 |\n\n**指标细节与特点：**\n- **严格性**：`Acc_t` 的定义非常严格，要求任务“成功完成”，例如在抓取任务中必须稳定拿起物体，在倒水任务中必须无洒漏。\n- **模块化评估**：通过分离 `Acc_s` 和 `Acc_t`，可以精准定位系统瓶颈（是选错了技能，还是技能执行不到位）。\n- **任务特异性**：在不同任务中，`Acc_t` 的成功判定有具体标准（见下文“任务配置”部分）。\n\n### 二、 数据集与任务配置\n\n论文的验证体系非常全面，涵盖了**模拟基准测试**和**多样化的真实世界任务**。\n\n#### 1. 模拟基准数据集：ManiSkill2\n- **来源**：公开的标准机器人操作模拟基准。\n- **用途**：在受控环境中进行大规模、可重复的算法比较。\n- **选取任务**：共5个，涵盖不同操作类型：\n    - **OpenCabinetDrawer / OpenCabinetDoor**：操作铰接物体（抽屉/门）。\n    - **PushChair**：双臂协调推动椅子。\n    - **MoveBucket**：双臂协调移动带球的桶。\n    - **PlugCharger**：高精度的插充电器任务。\n- **数据规模**：每个任务使用**300-1000条**专家演示轨迹进行训练。\n- **评估方式**：在**未见过的**物体实例（如新柜子、新椅子）和随机化的物理参数（摩擦、阻尼）上进行测试，评估泛化能力。\n\n#### 2. 真实世界数据集与任务\n作者构建了包含**500条专家轨迹**的技能库，用于训练不同的操作技能。在此基础上，设计了5类物理实验任务进行验证：\n\n| 任务名称 | 核心挑战 | 训练数据量（每技能） | 成功判定标准 (`Acc_t`=1的条件) | 评估重点 |\n| :--- | :--- | :--- | :--- | :--- |\n| **交互式酒吧服务** | 人机对话、根据指令选择并执行技能（递饮料、纸巾）。 | 40条专家轨迹 | 稳定抓取目标物体并成功交付。 | **技能选择准确性** (`Acc_s`)、系统整体交互成功率。 |\n| **零样本抓取** | 在**仅用“芬达罐”数据训练**后，抓取未见过的物体（可乐罐、喷雾瓶、人手）。 | 40条（仅芬达罐） | 从随机位置稳定抓取并拿起目标物体。 | **几何与动作表示的强泛化能力**、零样本迁移性能。 |\n| **毛巾折叠** | 操作高自由度、状态随机的可变形物体。 | 100条专家轨迹 | 将毛巾折叠并保持稳定，边缘对齐容差在 **±2 cm** 内。 | **长时程任务规划**、对可变形物体的精细操作能力。 |\n| **倒水** | 处理复杂流体动力学和随机初始状态。 | 100条专家轨迹 | 将水从源容器无洒漏地倒入目标容器。 | **动态物质操作**、手眼协调与轨迹精度。 |\n| **箱内取物** | 在杂乱、遮挡的环境中识别并抓取特定物体。 | 100条专家轨迹（每类物体） | 从杂乱箱子中准确取出目标物体，并稳定放置到目标区域，无意外碰撞。 | **复杂场景感知**、抗遮挡能力、在约束空间中的运动规划。 |\n\n**数据集与实验设计的特点：**\n1.  **数据高效性**：强调使用**少量演示**（低至40条）进行学习，与需要海量数据的“暴力缩放”方法形成对比。\n2.  **泛化性验证**：通过**零样本抓取**和**模拟基准中的未见实例**，严格测试模型对**新物体、新形状、新场景**的适应能力。\n3.  **任务多样性**：涵盖了从简单抓取到复杂长时程操作（折叠、倒水）、从刚性物体到可变形物体、从清洁环境到杂乱场景的全方位测试。\n4.  **平台多样性**：在**自定义人形机器人**、**桌面机械臂**和**商用Aloha机器人**三种异构平台上验证，证明了框架的跨平台通用性。\n\n### 总结\n该论文构建了一套**层次清晰、定义严格、覆盖全面**的评价体系。**综合成功率 `Acc`** 是其核心的端到端性能指标，而**技能选择准确率 `Acc_s`** 和**任务执行成功率 `Acc_t`** 则用于诊断性分析。通过结合**大规模模拟基准（ManiSkill2）** 和**精心设计的多样化真实世界任务**，论文从**泛化性、数据效率、鲁棒性和任务复杂性**等多个维度，有力地验证了RGMP-S框架的优越性。",
      "timestamp": "2026-01-20T17:54:38.858866",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文在哪些数据集上进行了实验？主要的评估指标和性能提升是多少？",
      "answer": "## 论文实验数据集、评估指标与性能提升分析\n\n### 一、实验数据集\n论文在以下两类数据集/平台上进行了全面的实验验证：\n\n#### 1. **仿真基准测试**\n- **ManiSkill2 仿真基准**：选取了5个具有代表性的高精度交互与空间推理任务进行测试：\n  - `OpenCabinetDrawer`：打开抽屉（25个训练柜，10个未见测试柜）\n  - `OpenCabinetDoor`：打开柜门（42个训练柜，10个未见测试柜）\n  - `PushChair`：双手推动转椅（26把训练椅）\n  - `MoveBucket`：双手搬运带球的桶（29个训练桶）\n  - `PlugCharger`：高精度插入充电器（1000条训练轨迹）\n\n#### 2. **真实世界机器人平台与任务**\n论文在**三个异构的真实机器人系统**上进行了验证：\n- **自研人形机器人**：配备头部RGB相机、6自由度机械臂与灵巧手。\n- **桌面双臂操作机器人**：配备顶置RGB相机。\n- **商用Aloha机器人**：配备中央RGB相机与腕部RGB传感器。\n\n**真实世界任务配置**（共5个场景）：\n- **交互式酒吧服务**：根据语音指令递送饮料（如Fanta、Sprite）或纸巾。\n- **零样本抓取**：训练仅使用40条抓取**Fanta罐**的专家轨迹，测试时泛化到未见过的物体（Coke罐、喷雾瓶、人手）。\n- **长时程操作任务**（新增于期刊版本）：\n  - `Towel Folding`：折叠毛巾（100条专家轨迹，涉及不同尺寸/颜色）。\n  - `Water Pouring`：倒水（100条专家轨迹，涉及不同初始水位/容器）。\n  - `Bin Picking`：从杂乱箱子中拾取物体（每类物体100条专家轨迹）。\n\n### 二、主要评估指标\n论文采用了一套分层的评估指标来全面衡量系统性能：\n\n1. **综合成功率 (`Acc`)**：\n   ```math\n   Acc = Acc_s × Acc_t\n   ```\n   - **技能选择准确率 (`Acc_s`)**：高层技能选择模块（LGSS）是否正确选择了操作技能（如侧握、捏取、抬起）。\n   - **任务执行成功率 (`Acc_t`)**：底层动作生成模块（RASNet）是否成功完成了物理交互（如稳定抓取、倒水成功）。\n\n2. **数据效率**：衡量模型在**有限演示数据**下的学习能力。论文强调其方法在**仅需少量专家轨迹**（如40条）时即可达到高性能。\n\n3. **推理速度 (`f`，单位：Hz)**：衡量策略的实时性，对于高频响应操作至关重要。\n\n4. **零样本泛化能力**：在**未见过的物体类别**和**空间配置**上的成功率。\n\n### 三、主要性能提升与关键结果\n与现有最先进方法相比，RGMP-S框架在多个维度上取得了显著提升：\n\n#### 1. **整体性能与泛化能力**\n- **在真实世界交互任务中**，RGMP-S相比**Diffusion Policy (DP) 基线**实现了 **19% 的综合性能提升**（`Acc`）。\n- **在零样本抓取任务中**，RGMP-S在**平均成功率**上比最佳基线 **Dex-VLA 高出 12%**，在最具挑战性的“人手交接”任务上达到 **93%** 的成功率（Dex-VLA为84%）。\n- **在长时程任务中**（如倒水），RGMP-S比DP基线提升约 **16%**；在毛巾折叠任务上达到 **86%** 成功率（Dex-VLA为68%）。\n\n#### 2. **数据效率**\n- RGMP-S展现出 **5倍** 于Diffusion Policy的数据效率。**仅需约40条专家轨迹**即可达到DP使用约200条轨迹才能达到的相近性能水平（在Fanta抓取任务上）。\n\n#### 3. **推理速度**\n- RGMP-S实现了 **75.2 Hz** 的高频实时推理，远超计算密集型模型：\n  - **Diffusion Policy：1.01 Hz**\n  - **OpenVLA：3.6 Hz**\n  这确保了其适用于需要低延迟实时控制的机器人任务。\n\n#### 4. **仿真基准结果**\n- 在ManiSkill2基准测试的5个任务上，RGMP-S的**平均得分**显著高于所有对比基线。\n- 例如，在`PushChair`任务中，RGMP-S得分 **16.47%**，几乎是当时最佳外部基线 **ManiSkill2-1st (8.63%)** 的两倍。\n\n#### 5. **模块有效性验证**\n- **LGSS模块**：在交互酒吧任务中，与纯Qwen-VL基线相比，结合DP后端时，LGSS将压扁可乐罐任务的综合准确率从 **0.40 提升至 0.55**（相对提升15%）。\n- **RASNet + GMM模块**：在组织传递任务中，将综合准确率从基线的0.50提升至 **0.60**。\n\n### 总结\n该论文通过**仿真与多真实平台**的广泛实验，系统验证了RGMP-S框架的**优越性**。其核心价值体现在：\n- **技术创新**：通过几何先验（LGSS）和脉冲时空特征学习（RASNet），有效弥合了语义-几何鸿沟。\n- **实际价值**：在保持**高实时性（75.2 Hz）** 的同时，实现了**强大的零样本泛化能力**和**极高的数据效率（5倍于基线）**，为在数据稀缺、环境多变的真实场景中部署通用化机器人操作提供了切实可行的解决方案。",
      "timestamp": "2026-01-20T17:55:21.130437",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文的主要局限性有哪些？未来可能的改进方向是什么？",
      "answer": "## 论文主要局限性分析\n\n基于对论文内容的深入分析，本文提出的RGMP-S框架虽然在多个方面取得了显著进展，但仍存在以下主要局限性：\n\n- **对极端精细操作场景的适应性不足**：如图12所示，在需要毫米级精度（如毛巾完全平铺时的抓取、充电器插拔公差<5mm）或存在严重自遮挡的场景中，模型性能会显著下降。这源于当前框架主要依赖RGB视觉输入，缺乏**高分辨率的触觉反馈或主动视觉机制**来补偿视觉信息的不足。\n\n- **对高度动态和非刚性物体的泛化能力有限**：论文的实验主要针对形状相对固定的物体（如易拉罐、瓶子）或具有固定操作模式的变形物体（如折叠毛巾）。对于**形状实时剧烈变化、流体或颗粒物**的操纵，文中未进行充分验证。LGSS模块的几何先验可能难以适应此类无限可变形的几何结构。\n\n- **技能库的静态性与组合泛化瓶颈**：LGSS从一个**预定义的、参数化的技能库**中选择技能。虽然这提高了决策效率，但也限制了系统处理**需要新颖技能组合或未见过的原子动作**的长时程任务的能力。系统的泛化在很大程度上依赖于技能库的完备性。\n\n- **计算效率与模块化设计的权衡**：RGMP-S采用了模块化设计（LGSS + RASNet），虽然整体推理频率（75.2 Hz）很高，优于扩散策略等基线，但**多模块串联**（VLM API调用、分割、推理）可能引入累积延迟，在需要极低延迟（如高速动态抓取）的场景中可能成为瓶颈。\n\n- **对仿真与真实世界差异的鲁棒性依赖特定训练**：尽管在ManiSkill2基准测试和三个真实平台上验证了有效性，但成功依赖于在**特定任务上收集的专家轨迹**进行训练。对于全新的物体或任务，仍然需要一定量的示范数据来训练RASNet策略或更新技能库，并非完全的“零样本”适应。\n\n## 未来可能的改进方向\n\n针对上述局限性，未来的研究工作可以从以下几个方向展开：\n\n- **融合多模态感知**：集成**高分辨率触觉传感器**（如光学触觉传感器）和**深度相机**的数据。触觉反馈可以直接提供接触力、滑动信息，用于修正抓取位姿和力度；深度信息可以补充RGB在几何理解上的不足，特别是在遮挡和精细对齐任务中。可以探索如何将触觉和深度信息高效地融入LGSS的几何推理和RASNet的特征提取中。\n\n- **发展动态几何与物理推理能力**：增强LGSS模块，使其不仅能处理静态形状先验，还能进行**简单的物理动力学预测**（如液体倾倒轨迹、可变形物体的力学特性）。这可以通过将物理仿真引擎作为推理工具，或训练轻量级的物理世界模型来实现，使机器人能预测动作后果并提前规划。\n\n- **实现技能的自进化与组合学习**：将静态技能库扩展为**可动态扩展的技能图或技能语法**。结合大语言模型（LLM）的规划能力和强化学习，让机器人能够**自主合成新的技能原语**，或将已有技能以新的序列和参数组合起来，解决更复杂的任务。这有助于突破预定义技能库的边界。\n\n- **优化架构以实现端到端高效推理**：研究如何将LGSS的几何推理能力更紧密地集成到策略网络中，减少模块间的通信开销。例如，可以探索**轻量级、可微的几何推理模块**，使其能与RASNet一起进行端到端训练，在保持几何感知优势的同时，进一步降低延迟并提升整体优化效率。\n\n- **推进无监督与自监督技能获取**：减少对大量任务特定专家示范的依赖。未来可以探索**从网络视频、机器人自主交互探索**等非结构化数据中，通过自监督学习提取通用的操纵概念和技能。结合世界模型和因果发现方法，使机器人能够主动探索环境并发现有效的交互策略，实现更高层次的数据效率与泛化能力。\n\n**总结**：RGMP-S框架在利用几何先验和脉冲时空特征学习方面做出了重要创新，为样本高效、可泛化的人形机器人操纵提供了强有力的基线。未来的工作应致力于突破其在**感知模态、动态物理理解、技能组合创造性以及学习范式**方面的限制，向更通用、更自主的 embodied AI 迈进。",
      "timestamp": "2026-01-20T17:55:55.305376",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    }
  ],
  "is_hidden": false,
  "is_starred": false,
  "flag": "",
  "published_date": "2026-01-13T23:36:30Z",
  "created_at": "2026-01-20T17:49:47.356417",
  "updated_at": "2026-01-20T17:49:47.356424"
}