{
  "id": "2601.11043v1",
  "title": "Haptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators",
  "authors": [
    "Max Linnander",
    "Yon Visell"
  ],
  "abstract": "We present Haptic Light-Emitting Diodes (HLEDs), luminous thermopneumatic actuators that directly convert pulsed light into mechanical forces and displacements. Each device packages a miniature surface-mount LED in a gas-filled cavity that contains a low-inertia graphite photoabsorber. The cavity is sealed by an elastic membrane, which functions as a working diaphragm. Brief optical pulses heat the photoabsorber, which heats the gas. The resulting rapid pressure increases generate forces and displacements at the working diaphragm. Millimeter-scale HLEDs produce forces exceeding 0.4 N and displacements of 1 mm at low voltages, with 5 to 100 ms response times, making them attractive as actuators providing tactile feedback in human-machine interfaces. Perceptual testing revealed that the strength of tactile feedback increased linearly with optical power. HLEDs devices are mechanically simple and efficient to fabricate. Unusually, these actuators are also light-emitting, as a fraction of optical energy is transmitted through the membrane. These opto-mechanical actuators have many potential applications in tactile displays, human interface engineering, wearable computing, and other areas.",
  "url": "https://arxiv.org/abs/2601.11043v1",
  "html_url": "https://arxiv.org/html/2601.11043v1",
  "html_content": "Also at ]Department of Bioengineering, Media Arts & Technology Program, and Department of Electrical and Computer Engineering, University of California, Santa Barbara, USA.\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\nMax Linnander\nYon Visell\n[\nDepartment of Mechanical Engineering, University of California, Santa Barbara, USA\nAbstract\nWe present Haptic Light-Emitting Diodes (HLEDs), luminous thermopneumatic actuators that directly convert pulsed light into mechanical forces and displacements. Each device packages a miniature surface-mount LED in a gas-filled cavity that contains a low-inertia graphite photoabsorber. The cavity is sealed by an elastic membrane, which functions as a working diaphragm. Brief optical pulses heat the photoabsorber, which heats the gas. The resulting rapid pressure increases generate forces and displacements at the working diaphragm. Millimeter-scale HLEDs produce forces exceeding 0.4 N and displacements of 1 mm at low voltages, with 5 to 100 ms response times, making them attractive as actuators providing tactile feedback in human-machine interfaces. Perceptual testing revealed that the strength of tactile feedback increased linearly with optical power. HLEDs devices are mechanically simple and efficient to fabricate. Unusually, these actuators are also light-emitting, as a fraction of optical energy is transmitted through the membrane. These opto-mechanical actuators have many potential applications in tactile displays, human interface engineering, wearable computing, and other areas.\nConverting optical energy directly into mechanical work in compact, manufacturable devices would bridge solid-state optoelectronics with mesoscale actuation regimes, including displacements and forces beyond the reach of micro-electromechanical (MEMS) actuators. Haptics provides a stringent and well-characterized target for the design of such transducers.\nPractical, high-fidelity tactile actuation demands localized actuation via interfaces on the millimeter-scale that operate at moderate voltages and can generate substantial out of plane displacement (\n10\n−\n3\n10^{-3}\nm) and forces (\n10\n−\n2\n10^{-2}\nto\n10\n−\n1\n10^{-1}\nN), with short activation response times (\n10\n−\n3\n10^{-3}\nto\n10\n−\n1\n10^{-1}\ns). These requirements are motivated by findings in tactile perception, psychophysics, and engineering spanning several decades.\nJones and Lederman (\n2006\n); Copeland and Finlay (\n2010\n); Craig and Evans (\n1987\n)\nExisting actuator families meet subsets of these requirements but exhibit familiar tradeoffs. Electromagnetic devices serve the bulk of needs in mechatronics, but their miniaturization is affected by current-density and thermal constraints on force capacity and power.\nKastor\net al.\n(\n2023\n); Streque\net al.\n(\n2012\n)\nElectrostatic and dielectric-elastomer actuators can provide high bandwidth and strain, but generally require kilovolt-scale driving signals, imposing onerous demands on insulation, packaging, and manufacturing.\nLeroy\net al.\n(\n2020\n); Grasso\net al.\n(\n2023\n); Mitchell\net al.\n(\n2022\n)\nPiezoelectric transduction methods offer speed and efficiency yet typically compromise stroke while increasing requirements on electronic and magnetic circuit designs.\nWood\net al.\n(\n2005\n)\nEmerging material technologies, including electroactive polymers and microhydraulic drives exploiting electroosmosis\nBiswas and Visell (\n2019\n); Shultz and Harrison (\n2023\n)\n, are promising, but rely on specialized materials and fabrication processes that may not translate to manufacturing at scale.\nFigure 1:\nDesign and operating principle of the Haptic Light-Emitting Diode. (a) Light from the LED is converted into heat by the photoabsorber. Heat is transferred to air in the cavity, raising gas temperature\nT\nT\nand pressure\nP\nP\n. Gas expansion drives the deflection of the elastic membrane. (b) The HLED is an assembly of patterned layers, supporting manufacturability. From top: Elastic membrane (PDMS), cavity walls (Aluminum), thin photoabsorber (pyrolytic graphite sheet suspended on nichrome wires), cavity walls (PS), PCB with an LED. (c) Photo of a 3x3 array of HLEDs with the elastic membrane partially removed. (d) Photo of PGS threaded on NiCr wires.\nPhoto-thermomechanical actuation – via thermoelastic expansion of solids, photothermal bilayers, and light-driven gas expansion – has been investigated for microvalves, tactile Braille displays, and soft robotics.\nMcKenzie\net al.\n(\n1995\n); Torras\net al.\n(\n2014\n); Paul\net al.\n(\n2024\n)\nIn the mesoscale regime relevant to haptics, most embodiments deposit heat primarily in solids (thick films, elastomers, or composites). The dynamics of such systems is determined by thermal diffusion and heat capacity: The characteristic time scale grows as\nτ\n∼\nL\n2\n/\nα\n\\tau\\sim L^{2}/\\alpha\n, where\nL\nL\nis material thickness and\nα\n\\alpha\nis thermal diffusivity, while the energy required to attain a designated temperature increase scales with the effective net heat capacity,\nC\nC\n. Large heat capacities and strong thermal coupling to supporting structures slow transients and dissipate energy before it can perform useful work, yielding response times of\n10\n0\n−\n10\n2\n10^{0}-10^{2}\ns.\nCamargo\net al.\n(\n2012\n); Hiraki\net al.\n(\n2020\n)\nThermopneumatic transduction offers opportunities to circumvent some of these challenges at small scales by using a thermodynamic working gas to generate mechanical work. Performance is maximized when most of the deposited energy heats the gas rather than surrounding solids, which can be achieved if the captive gas forms a gap insulating the heating element. Conventional wall-mounted resistive microheaters increase the effective thermal mass and shunt heat into the substrate, slowing pressure rise. These problems can be avoided by exploiting radiative heat transfer to a low-inertia photoabsorber suspended within the gas cavity, so that the dominant thermal pathway is from absorber to gas. Schemes exploiting targeted light transmission from an external optical source demonstrated these advantages, but required external optoelectronics.\nLinnander\net al.\n(\n2025\n)\nLow-voltage thermopneumatic devices using resistive heaters simplify electronics, but often at the expense of bandwidth, response time, and force.\nMazzotta and Mattoli (\n2023\n); Mazzotta\net al.\n(\n2025\n)\nThese comparisons motivate our concept of encapsulating a miniature low-voltage light source in a cavity encapsulating a captive gas and suspended low thermal inertia photoabsorber.\nHere, we present Haptic Light-Emitting Diodes (HLEDs) – millimeter-scale luminous thermopneumatic actuators that encapsulate miniature surface-mount device (SMD) power LEDs in packaging that facilitates photomechanical energy conversion via light absorption and heating of gas within a sealed cavity. Within each pixel, an LED emits pulsed light on application of a brief current pulse, 5 to 100 ms, supplied at low voltage (here, 4 V). The majority of emitted light is absorbed by a graphite film photoabsorber suspended within the cavity. The photoabsorber has minimal thermal inertia and thus is rapidly driven to high temperatures, quickly transferring heat to the small volume of encapsulated gas. Gas temperature and pressure rapidly increase over a timescale of tens of milliseconds, driving gas expansion and mechanical deflection of the top membrane sealing the cavity, which functions as the working diaphragm of the actuator. Light pulses with energies of 1 to 200 mJ are sufficient to generate localized forces of nearly 500 mN, and displacements of nearly 1 millimeter. The fast response time of the actuator (1 to 100 milliseconds) and high rates at which it can be driven (from 0.5 Hz to 200 Hz) meet requirements for high-fidelity tactile feedback, and hold promise for applications in other domains. The pixels emit a fraction of emitted light scattered in the cavity, which lends them unique capabilities for simultaneous optical and mechanical feedback. The parsimonious design, simplicity of fabrication, and low voltages required for driving these devices facilitate deployment in arrays of pixels suitable for visual-tactile display. We demonstrate this using laboratory prototypes with 9 independently addressable HLEDs. The same techniques used here could be scaled to much larger arrays using standard techniques. We characterize the thermomechanical performance of these devices. We also report experimental results that demonstrate that HLEDs are capable of delivering perceivable tactile feedback across a substantial dynamic range, with an approximately linear relationship between perceived tactile intensity and power or energy.\nFigure\n1\n(a) illustrates the design, operating principle, and physical process. Each HLED acts as an episodically driven thermodynamic engine driven by the absorption of pulsed light as heat. Due to the low net heat capacity of the photoabsorber, its temperature rapidly increases by several hundred degrees Celsius under illumination. Heat is rapidly transferred to the gas, which is initially near room temperature, transiently increasing gas pressure. Because the cavity dimensions are small, the characteristic (acoustic) time for pressure to equilibrate is small,\nτ\neq\n≪\n1\n\\tau_{\\mathrm{eq}}\\ll 1\nms, relative to the time scales of interest, thus pressure is effectively constant across the cavity. Pressure, volume, and mean cavity temperature are related by the ideal gas law,\nP\n​\n(\nt\n)\n​\nV\n​\n(\nt\n)\n=\nn\n​\nR\n​\nT\n​\n(\nt\n)\nP(t)V(t)=nRT(t)\n. Gas expansion drives expansion of the working membrane, yielding forces\nF\n​\n(\nt\n)\nF(t)\nand displacements\nz\n​\n(\nt\n)\nz(t)\n. At the end of the light pulse, heat in the air is transferred through the cavity walls to the cooler environment, restoring the device to its initial state over a fraction of a second.\nThis general strategy may be used to realize a large variety of actuators, of different sizes or configurations. The following design choices exemplify one way HLEDs can be implemented. A multi-layered architecture was used to facilitate ease of manufacturing and scalability (Fig.\n1\n(b-c)). A printed circuit board (PCB, thickness: 1.6 mm) with an SMD LED forms a base layer. An array of air-filled cylindrical cavities is formed from one layer of polysiloxane (PS, diameter: 4 mm) and one layer of aluminum (Al, diameter: 5 mm) that are patterned via laser cutting and drilling. Between the pixel cavity layers is a pyrolytic graphite sheet (PGS, 17\nμ\n\\mu\nm) that is cut in a circular shape (diameter: 3.3 mm) using a vinyl cutter and suspended on 40 AWG Nichrome (NiCr) wires (Fig.\n1\n(d)). PGS was selected due to its high thermal stability and broad spectrum absorption\nLinnander\net al.\n(\n2025\n)\n, and NiCr for its oxidation resistance. Capping this assembly is the elastic membrane – a 250\nμ\n\\mu\nm polydimethylsiloxane (PDMS) layer that seals the air-filled cavity. The full assembly is approximately 4 mm thick. The cavity aperture diameter at the membrane is 5 mm. The display can be made flexible through the use of compliant materials, including flexible PCB elastic wall materials. Additional manufacturing information can be found in Supplemental Materials.\nHLEDs are stimulated by brief light pulses (0.5 to 100 ms) delivered from a blue LED (\nλ\n=\n\\lambda=\n458 nm, Cree XEG), which is driven by a MOSFET. The control signal is delivered from a data acquisition device (National Instruments USB DAQ) using a pulse-width modulation signal at the MOSFET gate (Fig. S2). Concurrently, localized visible light is emitted due to the transmission of scattered light through the top membrane.\nWe characterized the thermal and mechanical responses using numerical finite element analysis (FEA) and laboratory measurements under constant power pulse driving (pulse duration\nt\np\nt_{p}\n, power\nP\nL\nP_{L}\n; Fig.\n2\n(a)). In the simulations, geometric and material properties were swept across a range reflecting manufacturing and geometric uncertainties, yielding an envelope of thermomechanical response behaviors (Table S2). In laboratory testing, force was isometrically measured using a load cell (Futek LSB200). Unloaded displacement was measured at the center of the membrane aperture using a laser displacement sensor (Keyence IL-065). In both simulations and lab experiments, air temperature,\nT\nair\n​\n(\nt\n)\nT_{\\mathrm{air}}(t)\n, was computed from measured force using an analytical heat transfer expression derived from the ideal gas law,\nT\nair\n​\n(\nt\n)\n=\nT\n0\n​\n(\nF\n​\n(\nt\n)\n/\n(\nπ\n​\n(\nd\n/\n2\n)\n2\n⋅\nP\n0\n)\n+\n1\n)\nT_{\\mathrm{air}}(t)=T_{0}\\Big(F(t)/(\\pi(d/2)^{2}\\cdot P_{0})+1\\Big)\n, where\nd\nd\nis the cavity diameter at the interface with the elastic membrane, and\nP\n0\nP_{0}\nand\nT\n0\nT_{0}\nare the initial pressure and temperature in the cavity.\nWe observed the mean temperature,\nT\nabs\n​\n(\nt\n)\nT_{\\mathrm{abs}}(t)\n, in the photoabsorber to rise monotonically during light exposure, driving monotonic increases in cavity air temperature and pressure. The resulting force,\nF\n​\n(\nt\n)\n,\nF(t),\nat the working membrane yielded unloaded displacement,\nz\n​\n(\nt\n)\nz(t)\n(Fig.\n2\n(b)). Temperature, force, and displacement reached maximum values near the time at which light exposure ceased. The relationship between photoabsorber temperature, pressure, and force was thus nearly static, as has been observed in thermopneumatic devices with similar dimensions.\nLinnander\net al.\n(\n2025\n)\nHeat transfer from the suspended photoabsorber to the environment can be modeled via an effective thermal circuit. The solution for photoabsorber temperature has the form\nT\nabs\n​\n(\nt\n)\n=\nε\n​\nP\nL\n​\nR\n​\n(\n1\n−\nexp\n⁡\n(\n−\nt\n/\nτ\n)\n)\n+\nT\n0\n​\nexp\n⁡\n(\n−\nt\n/\nτ\n)\n,\nT_{\\mathrm{abs}}(t)=\\varepsilon P_{L}R\\Big(1-\\exp(-t/\\tau)\\Big)+T_{0}\\exp(-t/\\tau),\n(1)\nHere,\nε\n\\varepsilon\nis the fraction of incident power absorbed; At\nλ\n=\n458\n\\lambda=458\nnm, the absorption coefficient of PGS is 0.72.\nLinnander\net al.\n(\n2025\n)\nR\nR\nis the effective thermal resistance determined by heat transfer to the air and through the NiCr wires. The characteristic time constant,\nτ\n=\nR\n​\nC\n\\tau=RC\n, where\nC\nC\nis the net heat capacity, governs the free temperature response of the photoabsorber;\nτ\n\\tau\nis the time scale of relaxation of the photoabsorber temperature toward the ambient temperature,\nT\n0\nT_{0}\n. In contrast, heat can be injected at any rate, via light absorption, at an arbitrary rate (subject to constraints). We computed emitted optical power,\nP\nL\nP_{L}\n, for each experiment using the LED manufacturer specifications, referenced to the applied driving current.\nCree LED (\n2025\n)\nThe maximum instantaneous current used in this research was\nI\nmax\n=\n2400\nI_{\\mathrm{max}}=2400\nmA, corresponding to emitted optical power\nP\nL\n≈\n2.5\nP_{L}\\approx 2.5\nW. The amount of this power that was converted to heat in the photoabsorber is 1.8 W.\nFigure 2:\n(a) Experimental configurations: Finite element analysis (FEA), isometric force measurement, and free-displacement measurement. (b) Photoabsorber temperature\nT\nabs\n​\n(\nt\n)\nT_{\\mathrm{abs}}(t)\n, cavity air temperature\nT\nair\n​\n(\nt\n)\nT_{\\mathrm{air}}(t)\n, isometric force\nF\n​\n(\nt\n)\nF(t)\n, and free displacement\nz\n​\n(\nt\n)\nz(t)\n, for a 100-ms, 2.5-W optical pulse. Solid black lines are laboratory measurements, except for air temperature, which is obtained after application of the ideal gas law. Dashed line and shaded region: numerical (FEA) results, mean response and variation envelope obtained by sweeping geometric and material parameters across uncertainty ranges. (c) Force,\nF\n​\n(\nt\n)\nF(t)\n, for pulse durations\nt\np\n=\n25\n,\n50\n,\n75\nt_{p}=25,50,75\nms at optical power\nP\nL\n=\n2.5\nP_{L}=2.5\nW. Laboratory measurements. (d) Peak measured force as a function of LED optical power\nP\nL\nP_{L}\n(Error bar: standard deviation,\nn\n=\n4\nn=4\n).\nAt an optical power of\nP\nL\n=\n2.5\nP_{L}=2.5\nW and a pulse duration of\nt\np\n=\n100\nt_{p}=100\nms, the FEA predicted the photoabsorber to reach a temperature of\n340\n∘\n340~^{\\circ}\nC. The shaded region represents the uncertainty and was obtained by sweeping the geometric and material parameters in the FEA model over their parameter ranges (Table S1 & S2). The corresponding laboratory experiments yielded a peak air temperature of 85\n∘\nC (computed from the isometric force), a peak force of 440 mN, and a peak displacement of 0.9 mm. After the LED was switched off, the system returned to its original state with a cooling time constant of\nτ\n=\n440\n\\tau=440\nms (determined by fitting eq.\n1\nto the data,\nr\n2\n=\n0.99\nr^{2}=0.99\n). With power held constant, the peak force increased with pulse duration (Fig.\n2\n(c)). Similarly, with pulse duration held constant, we observed the peak output force to increase monotonically with increasing optical power (Fig.\n2\n(d)), as expected from Eq. 1. The mechanical output of the HLED was highly consistent, with the standard deviation from 4 consecutive pulses being 0.13 mN at\nP\nL\n=\n2.5\nP_{L}=2.5\nW.\nFigure 3:\n(a) Isometric force responses to pulse trains at pulse rates\nf\n=\n5\nf=5\n,\n10\n10\n, and\n25\n25\nHz (top to bottom) at duty cycle\nt\np\n/\nT\n=\n0.3\nt_{p}/T=0.3\n. (b) Peak-to-peak force component\nF\np\n​\np\nF_{pp}\nas a function of pulse rate\nf\nf\nwith duty cycle\nt\np\n/\nT\n=\n0.2\nt_{p}/T=0.2\n. Regression fit:\nlog\n10\n⁡\n(\nF\np\n​\np\n)\n=\nα\n​\nlog\n10\n⁡\n(\nf\n)\n+\nβ\n\\log_{10}(F_{pp})=\\alpha\\log_{10}(f)+\\beta\n,\nα\n=\n−\n1.08\n\\alpha=-1.08\n,\nβ\n=\n2.83\n\\beta=2.83\n,\nr\n2\n=\n0.99\nr^{2}=0.99\n. (c) Mean free displacement is consistent over 13,000 actuations. Each dot corresponds to the mean of 100 peaks.\nDuring manual activities, the sense of touch exploits temporal content with millisecond temporal resolution in gauging the texture of surfaces, detecting the onset of skin-object contact in grasping, and in many other manual tasks. Touch is thus sensitive to wide-band frequency content up to several hundred Hz. Consequently, actuator dynamics is paramount in the engineering of tactile devices. Response time and operating frequency range are key figures of merit. As seen in Fig.\n3\n, HLEDs exhibit rapid response times of 5 to 100 ms, and wide ranges of operating frequency, up to 200 Hz. The characteristic time scale for thermal relaxation is comparatively larger,\nτ\n≈\n440\n\\tau\\approx 440\nms, due to the large thermal resistance between the photoabsorber and the surrounding materials, which are separated by an air gap. If two successive brief pulses are supplied with a temporal spacing shorter than\nτ\n\\tau\n, the operating point of the device is biased by the residual heat in the device. This leads to a bimodal response, common to many thermomechanical actuators, consisting of a slowly varying component,\nF\n0\nF_{0}\n, and a rapidly oscillating component that tracks the pulse rate,\nF\np\n​\np\nF_{pp}\n.\nLinnander\net al.\n(\n2025\n); Hwang\net al.\n(\n2021\n); Mazzotta\net al.\n(\n2025\n)\nThe slow component results from residual heat accumulating in the cavity across pulses, causing a thermal buildup, which occurs when the inter-pulse interval is shorter than the thermal time constant,\nτ\n\\tau\n.\nLinnander\net al.\n(\n2025\n)\nOperating the actuator at repetition rates faster than\n1\n/\nτ\n1/\\tau\nis suitable for tactile applications, since the human tactile system is orders of magnitude more sensitive to frequency stimuli around 200 Hz than slowly varying stimuli.\nMorioka and Griffin (\n2005\n)\nGiven the heightened sensitivity of the tactile system to transient, high-frequency components of mechanical stimulation, the peak-to-peak force component,\nF\np\n​\np\nF_{pp}\n, is the primary metric of interest. We measured\nF\np\n​\np\nF_{pp}\nfor pulse rates,\nf\nf\n, between 5 and 200 Hz (Fig.\n3\n(b)). Across this range, the peak-to-peak amplitudes for force ranged from 113 mN down to 2.2 mN, whereas the displacement ranged from 170\nμ\n\\mu\nm down to 4.4\nμ\n\\mu\nm (Fig. S1).\nBoth force and displacement amplitudes scale approximately as\nf\n−\n1\nf^{-1}\n, corresponding to a slope of\n−\n1\n-1\nin log–log space, consistent with the fact that the energy delivered per pulse scales as\nE\n∝\n1\n/\nf\nE\\propto 1/f\n. The limitation of driving the HLED at pulse rates exceeding its thermal relaxation time is heat accumulation in the cavity, which eventually leaks through the elastic membrane.\nWe actuated the HLED for 13,000 cycles, using low-duty-cycle pulses, and observed no change in displacement amplitude or material degradation (Fig.\n2\n(c)). This outcome is consistent with material limits: in air, graphite oxidation mainly occurs at sustained temperatures above 400\n∘\nC.\nXiaowei\net al.\n(\n2004\n)\nThe photoabsorber likely maintained a temperature well below this threshold, as indicated by Fig.\n2\n(b). Likewise, the mean cavity air temperature reached a peak of 84\n∘\nC, so we expected no degradation of the adhesives or cavity walls, which had temperature ratings of 200\n∘\nC.\nFigure 4:\n(a) Transient surface temperature rise for duty cycles of 0.1, 0.2, and 0.3 during a 2.5-s actuation window, followed by passive cooling. (b) Adding an additional PGS heat-spreading layer beneath the PDMS membrane suppresses the temperature rise across all duty cycles.\nAfter initially observing that continuously pulsing the actuator caused the surface temperature to increase (Fig\n4\n(a)), we modified the design to integrate a thin layer of PGS immediately below the elastic top membrane (Fig.\n4\n(b), exploiting the very high in-plane thermal conductivity of PGS. As shown in the figure, prior to adding the PGS layer, the surface temperature increase was\nΔ\n​\nT\nsurf\n=\n9.2\n\\Delta T_{\\mathrm{surf}}=9.2\n∘\nC after 2.5 seconds of operation. With the PGS layer integrated, the temperature increase was reduced to\nΔ\n​\nT\nsurf\n=\n0.8\n\\Delta T_{\\mathrm{surf}}=0.8\n∘\nC, which is comparable to the amount of heating that would be supplied by a human finger in contact with the membrane\nLinnander\net al.\n(\n2025\n)\n. The effect on blocked force was negligible (Fig. S3(a)), even though we took no measures (e.g. perforation) to ensure that the PGS sheet was gas permeable. Pulse driving the improved HLED continuously over a duration four times longer, for 10 seconds, yielded a temperature increase of\nΔ\n​\nT\nsurf\n=\n1.5\n\\Delta T_{\\mathrm{surf}}=1.5\n∘\nC that is very slight, particularly for an electronic device such as an actuator, but is perceptually noticeable. To place these observations in context, we note that it is rarely desirable for tactile actuators to be pulsed continuously for more than a fraction of a second, due to the annoyance it causes and due to sensory adaptation effects.\nVerrillo and Gescheider (\n1977\n)\nIndeed, modern consumer devices rarely output sustained buzzing, but rather use very brief vibrational pulses for notifications.\nFigure 5:\nThe perceived intensity of a pulse train from a single HLED increased linearly with optical power\nP\nL\nP_{L}\n. Regression fit:\nI\n=\nα\n​\nP\nL\n+\nβ\nI=\\alpha P_{L}+\\beta\n,\nα\n=\n0.0197\n\\alpha=0.0197\n,\nβ\n=\n−\n0.2693\n\\beta=-0.2693\n,\nr\n2\n=\n0.99\nr^{2}=0.99\n.\nThe forces and displacements the HLED generates are well within the perceptual range\nJones and Lederman (\n2006\n)\n. We experimentally characterized the perceived intensity,\nI\nI\n, of HLED feedback as a function of optical power,\nP\nL\nP_{L}\n, in a psychophysical human subjects experiment, based on the method of magnitude estimation – a well-established quantitative technique in perception research\nJones and Tan (\n2013\n); Stevens (\n1958\n)\n. We recruited seven participants for the experiment (3 female), all of whom gave their written informed consent. The protocol was approved by the human subjects research review board at the authors’ institution (protocol number: 13-22-0139). The stimuli were pulse trains (\nf\n=\n20\nf~=~20\nHz,\nt\np\n/\nT\n=\n0.3\nt_{p}/T~=~0.3\n, duration = 0.5 s) at each of nine different power levels (\nP\nL\n=\nP_{L}=\n0.42 to 2.1 W). Participants rated the intensity of each stimulus on a continuous numerical scale. Perceived intensity\nI\n​\n(\nP\nL\n)\nI(P_{L})\nwas computed for each\nP\nL\nP_{L}\nby averaging the normalized geometric mean of responses across all participants, as is standard.\nJones and Tan (\n2013\n)\nThe results indicate that perceived intensity increased linearly as optical power increased (Fig.\n5\n), indicating that a wide range of perceptually distinct levels of tactile feedback can be generated by modulating power. In post-experiment surveys, five participants reported feeling no warmth from the device, while two participants reported feeling slight warmth.\nHLEDs generate localized forces and displacements sufficient for tactile feedback. The devices are photomechanical, converting light energy into work. We examined the proportion of optical energy that is converted to work. The ratio can be approximated by\ne\n=\nF\n​\n(\nt\np\n)\n​\nz\n​\n(\nt\np\n)\n/\n(\n2\n​\nP\nL\n​\nt\np\n)\ne~=~F(t_{p})z(t_{p})/(2P_{L}t_{p})\nfor linear loads, yielding\ne\n=\n0.08\n%\ne=0.08\\%\n, which is consistent with values we experimentally determined for other thermopneumatic devices of similar dimensions\nLinnander\net al.\n(\n2025\n)\n. The value of this ratio can be understood to arise from several factors, which, in turn, suggest several opportunities for improvement. First, the quantity of heat transferred to air is proportional to the ratio\nb\n=\nC\nair\n/\nC\nabs\nb=C_{\\mathrm{air}}/C_{\\mathrm{abs}}\nof thermal capacities of the photoabsorber assembly and air. This ratio is of order 10\n-1\n. Optimizing this ratio could yield improvements in work output. Second, because heat transfer through air is conduction-dominated in our system, over the timescale of excitation (\nt\np\n=\n100\nt_{p}=100\nms), a thermal temperature gradient exists that reduces the rate of heat diffusion throughout air in the cavity. We calculate that this effect likely reduces heat transferred to air by an order of magnitude. Optimizing our geometry and design to promote convection during actuation could increase work output. Increasing the surface area of the photoabsorber could also provide gains. Third, the rate of heat transfer to air increases monotonically with photoabsorber temperature. Higher temperatures are feasible, using modern SMD LEDs of similar dimensions, some of which can output an order of magnitude more optical power. Replacing air with an inert gas would facilitate operation at photoabsorber temperatures up to 1000\n∘\nC, increasing work output, although changes to other assembly materials may be required. Fourth, extensive prior literature demonstrates that in a thermodynamic system, the fraction of heat in a gas that is converted into work is often modest without optimization; in our system, a reasonable estimate, consistent with the output work we observe, is 10%. This fraction can likely be increased, but gains by more than a factor of two are unlikely. Fifth, although the great majority of light is incident on the photoabsorber, 30% is reflected. Altering the surface properties of the photoabsorber could reduce these losses.\nThe substantial range of forces and short response times of HLEDs compare favorably with previously reported thermopneumatic tactile actuators at this scale. Force outputs here are an order of magnitude higher than in similar thermopneumatic devices reported in prior literature.\nLinnander\net al.\n(\n2025\n); Mazzotta and Mattoli (\n2023\n); Mazzotta\net al.\n(\n2025\n)\nWhile HLEDs were designed for haptic applications, the same general design strategy could be applied in order to realize devices suitable for use in other domains. By increasing size, and altering the geometry and configuration, it is feasible to increase the range of forces and displacements, which may make these devices suitable for applications in microrobotics and microfluidics, among others. As noted above, commercially available SMD LEDs can deliver optical powers exceeding those used here by more than an order of magnitude, supporting a significantly broader operating envelope than demonstrated in this work.\nIn conclusion, we introduced compact thermopneumatic actuators, Haptic Light-Emitting Diodes (HLED). These devices consist of packaging supplementing miniature SMD power LEDs, converting optical energy into mechanical work through rapid thermodynamic gas expansion. The devices operate at 4 V, exhibit millisecond response times, displacements approaching 1 mm, forces up to 440 mN, and support actuation rates from 1–200 Hz. A unique advantage of these actuators is that they also output light, similar to a standard LED, thus furnishing visual and mechanical output. Because a portion of the LED emission exits the cavity during actuation, the HLED can deliver both mechanical and visual cues, and we demonstrated its suitability for tactile interaction through a perceptual study. These findings highlight the broader potential of optically driven thermopneumatic actuation for compact, high-performance devices across a range of emerging applications.\nAuthor Declarations\nConflict of Interest\nThe authors have no conflicts to disclose.\nAuthor Contributions\nMax Linnander:\nConceptualization (equal); Data curation (equal); Investigation (equal); Writing original draft (equal); Writing–review&editing (equal).\nYon Visell:\nConceptualization (equal); Supervision (equal); Validation (equal); Writing– review & editing (equal).\nData and materials availability:\nAll data needed to evaluate the conclusions have been made publicly available on Zenodo: 10.5281/zenodo.18222861.\nReferences\nS. Biswas and Y. Visell (2019)\nEmerging material technologies for haptics\n.\nAdvanced Materials Technologies\n4\n(\n4\n),\npp. 1900042\n.\nExternal Links:\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nC. J. Camargo, H. Campanella, J. E. Marshall, N. Torras, K. Zinoviev, E. M. Terentjev, and J. Esteve (2012)\nBatch fabrication of optical actuators using nanotube–elastomer composites towards refreshable braille displays\n.\nJournal of Micromechanics and Microengineering\n22\n(\n7\n),\npp. 075009\n.\nExternal Links:\nDocument\n,\nLink\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nD. Copeland and J. Finlay (2010)\nIdentification of the optimum resolution specification for a haptic graphic display\n.\nInteracting with Computers\n22\n(\n2\n),\npp. 98–106\n.\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nJ. C. Craig and P. M. Evans (1987)\nVibrotactile masking and the persistence of tactual features\n.\nPerception & psychophysics\n42\n(\n4\n),\npp. 309–317\n.\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nCree LED (2025)\nXLamp\n®\nXE-G LEDs Data Sheet\n.\nRev. 7D edition\n.\nNote:\nAccessed: August 26, 2025\nExternal Links:\nLink\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nG. Grasso, S. Rosset, and H. Shea (2023)\nFully 3d-printed, stretchable, and conformable haptic interfaces\n.\nAdvanced Functional Materials\n33\n(\n20\n),\npp. 2213821\n.\nExternal Links:\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nT. Hiraki, K. Nakahara, K. Narumi, R. Niiyama, N. Kida, N. Takamura, H. Okamoto, and Y. Kawahara (2020)\nLaser pouch motors: selective and wireless activation of soft actuators by laser-powered liquid-to-gas phase change\n.\nIEEE Robotics and Automation Letters\n5\n(\n3\n),\npp. 4180–4187\n.\nExternal Links:\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nI. Hwang, H. J. Kim, S. Mun, S. Yun, and T. J. Kang (2021)\nA light-driven vibrotactile actuator with a polymer bimorph film for localized haptic rendering\n.\nACS Applied Materials & Interfaces\n13\n(\n5\n),\npp. 6597–6605\n.\nExternal Links:\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nL. A. Jones and H. Z. Tan (2013)\nApplication of psychophysical techniques to haptic research\n.\nIEEE Transactions on Haptics\n6\n(\n3\n),\npp. 268–284\n.\nExternal Links:\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nL. Jones and S. Lederman (2006)\nHuman hand function\n.\nOxford University Press\n.\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nN. Kastor, B. Dandu, V. Bassari, G. Reardon, and Y. Visell (2023)\nFerrofluid electromagnetic actuators for high-fidelity haptic feedback\n.\nSensors and Actuators A: Physical\n355\n,\npp. 114252\n.\nExternal Links:\nISSN 0924-4247\n,\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nE. Leroy, R. Hinchet, and H. Shea (2020)\nMultimode hydraulically amplified electrostatic actuators for wearable haptics\n.\nAdvanced Materials\n32\n(\n36\n),\npp. 2002564\n.\nExternal Links:\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nM. Linnander, D. Goetz, G. Reardon, V. Kumar, E. Hawkes, and Y. Visell (2025)\nTactile displays driven by projected light\n.\nScience Robotics\n10\n(\n107\n),\npp. eadv1383\n.\nExternal Links:\nDocument\n,\nLink\n,\nhttps://www.science.org/doi/pdf/10.1126/scirobotics.adv1383\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nA. Mazzotta, S. Taccola, I. Cesini,\net al.\n(2025)\nLow-voltage wearable tactile display with thermo-pneumatic actuation\n.\nnpj Flexible Electronics\n9\n(\n70\n).\nExternal Links:\nDocument\n,\nLink\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nA. Mazzotta and V. Mattoli (2023)\nUltrathin conformable electronic tattoo for tactile sensations\n.\nAdvanced Electronic Materials\n9\n(\n9\n),\npp. 2201327\n.\nExternal Links:\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n,\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nJ. McKenzie, C. Clark, B. Jones, and A. Jacobs-Cook (1995)\nDesign and construction of a multiple-wafer integrated micromechanical optical actuator\n.\nSensors and Actuators A: Physical\n47\n(\n1-3\n),\npp. 566–571\n.\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nS. K. Mitchell, T. Martin, and C. Keplinger (2022)\nA pocket-sized ten-channel high voltage power supply for soft electrostatic actuators\n.\nAdvanced Materials Technologies\n7\n(\n8\n),\npp. 2101469\n.\nExternal Links:\nDocument\n,\nLink\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nM. Morioka and M. J. Griffin (2005)\nThresholds for the perception of hand-transmitted vibration: dependence on contact area and contact location\n.\nSomatosensory & Motor Research\n22\n(\n4\n),\npp. 281–297\n.\nExternal Links:\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nS. Paul, M. R. Devlin, and E. W. Hawkes (2024)\nA scalable, light-controlled, individually addressable, non-metal actuator array\n.\nIn\n2024 IEEE International Conference on Robotics and Automation (ICRA)\n,\nVol.\n,\npp. 684–690\n.\nExternal Links:\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nC. Shultz and C. Harrison (2023)\nFlat panel haptics: embedded electroosmotic pumps for scalable shape displays\n.\nIn\nProceedings of the 2023 CHI Conference on Human Factors in Computing Systems\n,\nCHI ’23\n,\nNew York, NY, USA\n.\nExternal Links:\nISBN 9781450394215\n,\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nS. S. Stevens (1958)\nProblems and methods of psychophysics.\n.\nPsychological bulletin\n55\n(\n4\n),\npp. 177\n.\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nJ. Streque, A. Talbi, P. Pernod, and V. Preobrazhensky (2012)\nPulse-driven magnetostatic micro-actuator array based on ultrasoft elastomeric membranes for active surface applications\n.\nJournal of Micromechanics and Microengineering\n22\n(\n9\n),\npp. 095020\n.\nExternal Links:\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nN. Torras, K.E. Zinoviev, C.J. Camargo, E. M. Campo, H. Campanella, J. Esteve, J.E. Marshall, E.M. Terentjev, M. Omastová, I. Krupa, P. Teplický, B. Mamojka, P. Bruns, B. Roeder, M. Vallribera, R. Malet, S. Zuffanelli, V. Soler, J. Roig, N. Walker, D. Wenn, F. Vossen, and F.M.H. Crompvoets (2014)\nTactile device based on opto-mechanical actuation of liquid crystal elastomers\n.\nSensors and Actuators A: Physical\n208\n,\npp. 104–112\n.\nExternal Links:\nISSN 0924-4247\n,\nDocument\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nR. T. Verrillo and G. A. Gescheider (1977)\nEffect of prior stimulation on vibrotactile thresholds\n.\nSensory Processes\n1\n(\n4\n),\npp. 292–300\n.\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nR.J. Wood, E. Steltz, and R.S. Fearing (2005)\nOptimal energy density piezoelectric bending actuators\n.\nSensors and Actuators A: Physical\n119\n(\n2\n),\npp. 476–488\n.\nExternal Links:\nISSN 0924-4247\n,\nDocument\n,\nLink\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.\nL. Xiaowei, R. Jean-Charles, and Y. Suyuan (2004)\nEffect of temperature on graphite oxidation behavior\n.\nNuclear Engineering and Design\n227\n(\n3\n),\npp. 273–280\n.\nExternal Links:\nISSN 0029-5493\n,\nDocument\n,\nLink\nCited by:\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\n.",
  "preview_text": "We present Haptic Light-Emitting Diodes (HLEDs), luminous thermopneumatic actuators that directly convert pulsed light into mechanical forces and displacements. Each device packages a miniature surface-mount LED in a gas-filled cavity that contains a low-inertia graphite photoabsorber. The cavity is sealed by an elastic membrane, which functions as a working diaphragm. Brief optical pulses heat the photoabsorber, which heats the gas. The resulting rapid pressure increases generate forces and displacements at the working diaphragm. Millimeter-scale HLEDs produce forces exceeding 0.4 N and displacements of 1 mm at low voltages, with 5 to 100 ms response times, making them attractive as actuators providing tactile feedback in human-machine interfaces. Perceptual testing revealed that the strength of tactile feedback increased linearly with optical power. HLEDs devices are mechanically simple and efficient to fabricate. Unusually, these actuators are also light-emitting, as a fraction of optical energy is transmitted through the membrane. These opto-mechanical actuators have many potential applications in tactile displays, human interface engineering, wearable computing, and other areas.\n\nAlso at ]Department of Bioengineering, Media Arts & Technology Program, and Department of Electrical and Computer Engineering, University of California, Santa Barbara, USA.\nHaptic Light-Emitting Diodes: Miniature, Luminous Tactile Actuators\nMax Linnander\nYon Visell\n[\nDepartment of Mechanical Engineering, University of California, Santa Barbara, USA\nAbstract\nWe present Haptic Light-Emitting Diodes (HLEDs), luminous thermopneumatic actuators that directly convert pulsed light into mechanical forces and displacements. Each device packages a miniature surface-mount LED in a gas-filled cavity that contains a low-inertia graphite photoabsorber. The cavity is sealed by an elastic membrane, which functions as a working diaphragm. Brief optical pulses heat the photoabsorber, which heats the gas",
  "is_relevant": false,
  "relevance_score": 0.0,
  "extracted_keywords": [
    "haptic",
    "actuator",
    "tactile",
    "LED",
    "thermopneumatic",
    "human-machine interface"
  ],
  "one_line_summary": "这篇论文介绍了一种新型的触觉发光二极管（HLEDs），它是一种将光能直接转换为机械力的微型热致动器，主要用于人机界面的触觉反馈应用。",
  "detailed_summary": "",
  "qa_pairs": [],
  "is_hidden": false,
  "is_starred": false,
  "flag": "",
  "published_date": "2026-01-16T07:18:18Z",
  "created_at": "2026-01-20T17:49:58.729967",
  "updated_at": "2026-01-20T17:49:58.729978"
}