{
    "id": "2601.07559v1",
    "title": "Stable In-hand Manipulation for a Lightweight Four-motor Prosthetic Hand",
    "authors": [
        "Yuki Kuroda",
        "Tomoya Takahashi",
        "Cristian C. Beltran-Hernandez",
        "Kazutoshi Tanaka",
        "Masashi Hamaya"
    ],
    "abstract": "电动假手应轻量化以减轻使用者负担，外形需仿照人手以满足美观需求，并采用内置电机设计以保护电机免受损坏和污物侵蚀。此外，为实现日常活动中的姿态转换（如从桌面拾取笔后调整至书写姿势），假手需具备通过旋转运动实现的手内操控能力。我们此前研发的PLEXUS手（精密侧向灵巧操作手）是一款由四个电机驱动的轻型假手（311克），该假手能对不同物体实现精密抓握与侧向抓握间的姿态转换。然而其控制器需预定义物体宽度，且仅能处理轻量物体（最大重量34克）。本研究通过采用电机电流反馈解决了这些局限性，结合该假手先前优化的单轴拇指设计，实现了通过估算物体宽度并调整食指位置以在重定向过程中保持物体稳定抓握的操控方式。使用不同宽度（5-30毫米）和形状（圆柱体与棱柱）的基础物体进行实验验证，结果显示对轻量物体的操作成功率达100%，即使对重达289克的铝制棱柱仍保持较高成功率（≥80%）。相比之下，在缺乏食指协调的情况下，对最重289克棱柱的操作成功率骤降至40%。该假手还成功完成了包括旋紧瓶盖、调整笔具书写方向在内的多项日常任务。",
    "url": "https://arxiv.org/abs/2601.07559v1",
    "html_url": "https://arxiv.org/html/2601.07559v1",
    "html_content": "Stable In-hand Manipulation for a Lightweight Four-motor\nProsthetic Hand\nYuki Kuroda\n1\n, Tomoya Takahashi\n1\n, Cristian C. Beltran-Hernandez\n1\n,\nKazutoshi Tanaka\n1\nand Masashi Hamaya\n1\n1\nOMRON SINIC X Corporation, Tokyo, Japan.\nyuki.kuroda@sinicx.com\nAbstract\nElectric prosthetic hands should be lightweight to decrease the burden on the user, shaped like human hands for cosmetic purposes, and designed with motors enclosed inside to protect them from damage and dirt.\nAdditionally, in-hand manipulation is necessary to perform daily activities such as transitioning between different postures, particularly through rotational movements, such as reorienting a pen into a writing posture after picking it up from a desk.\nWe previously developed PLEXUS hand (Precision–Lateral dEXteroUS manipulation hand), a lightweight (311 g) prosthetic hand driven by four motors. This prosthetic performed reorientation between precision and lateral grasps with various objects. However, its controller required predefined object widths and was limited to handling lightweight objects (of weight up to 34 g).\nThis study addresses these limitations by employing motor current feedback. Combined with the hand’s previously optimized single-axis thumb, this approach achieves more stable manipulation by estimating the object’s width and adjusting the index finger position to maintain stable object holding during the reorientation.\nExperimental validation using primitive objects of various widths (5–30 mm) and shapes (cylinders and prisms) resulted in a 100% success rate with lightweight objects and maintained a high success rate (\n≧\n\\geqq\n80%) even with heavy aluminum prisms (of weight up to 289 g). By contrast, the performance without index finger coordination dropped to just 40% on the heaviest 289 g prism. The hand also successfully executed several daily tasks, including closing bottle caps and orienting a pen for writing.\n©2026 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works.\nI\nINTRODUCTION\nElectric prosthetic hands restore functionality in individuals who have lost their hands owing to congenital anomalies or acquired causes. For user acceptance and practical daily use, key design considerations of these prosthetic hands include the following: a human-like, five-fingered appearance for cosmetic reasons\n[\n3\n]\n, lightweight design (ideally less than 500 g\n[\n18\n]\n) to reduce the physical burden on the user, internal motors for dirt and damage protection\n[\n11\n]\n, and the ability to support diverse activities of daily living (ADL)\n[\n1\n]\n. ADLs include fundamental self-care and household tasks involving grasping and in-hand manipulation. One particularly critical capability, which we term “precision–lateral (PL) manipulation,” is the ability to switch between precision and lateral grasps smoothly without re-grasping (see Fig.\n1\n). This function is crucial for prosthetic users, particularly for those with bilateral limb losses or an occupied unaffected hand, enabling single-handed task completion (e.g., closing a bottle cap and reorienting a pen for writing). Practical application demands stable manipulation of objects varying in shape and weight, and a final grasp sufficiently firm to resist external forces, such as during writing (as illustrated in Fig.\n1\n).\nFigure 1:\nPL and LP in-hand manipulation. To effectively support the thumb’s force, the index finger shifts its position using motor current feedback, as illustrated by the change from the red (without (w/o) the use of the index) to the yellow (with (w/) the use of the index) line in the red insets. This enables both stable object manipulation and a firm grip for tool use (w/ index), whereas a lack of coordination leads to grip failure (w/o index).\nDespite recent advancements, lightweight five-finger prosthetic hands (e.g., the bebionic hand\n[\n15\n]\n: 14 grip patterns and 495–529 g, and the i-Limb\n[\n14\n]\n: 36 grip patterns and 454–628 g) still primarily provide only static grasping. In contrast, in-hand manipulation typically relies on dexterous hands with many degrees of freedom (DOFs), such as the Shadow Dexterous Hand (20 motors)\n[\n12\n]\n, TWENDY-ONE hand (13 motors)\n[\n7\n]\n, and the Allegro Hand (16 motors)\n[\n13\n]\n. In these hands, a high-DOF mechanism and dense sensory information form the basis for dexterous manipulation control. However, this hardware-intensive approach results in substantial weight (\n>\n>\n1500 g) and complexity, rendering it impractical for the lightweight, self-contained design required by prosthetics. Consequently, a technology that can achieve dexterous in-hand manipulation while satisfying the demanding constraints of electric prostheses has not yet been established.\nTo address this challenge, we previously developed a lightweight prosthetic hand that enables stable PL in-hand manipulation. Our proposed PLEXUS hand (Precision–Lateral dEXteroUS manipulation hand)\n[\n9\n]\nis a 311 g four-motor prosthetic hand featuring a single-axis thumb that rotates around a carpometacarpal (CM) joint.\nWe computationally optimized the position of the CM joint so that the PLEXUS hand could perform PL manipulation of various objects.\nHowever, in a previous study\n[\n9\n]\n, we were required to input a predefined object width for the open-loop controller. Additionally, the study dealt with relatively lightweight objects (up to 34.34 g).\nThis study addressed the aforementioned issue by employing motor current feedback, which works in conjunction with the hand’s previously optimized single-axis thumb for more stable and practical PL manipulation.\nBecause each finger is actuated by a single motor, the motor current provides a clear indication of the contact state, enabling threshold-based detection without the need for additional sensors.\nOur current feedback has two roles. First, it is used for object width estimation during the precision grasp; second, based on the estimated width, it strategically coordinates the index finger to apply a sufficient force, a method inspired by human hand mechanics used for applying torques\n[\n16\n]\n. This feature enables the stable PL manipulation of heavy objects without the manual inputs of the object width, addressing limitations of previous methods\n[\n9\n]\n.\nWe validated the performance and force application capabilities of this hand via PL manipulation evaluations that included heavy items. The hand achieved a 100% success rate with lightweight objects (cylinders and prisms, 5–30 mm) and maintained a high success rate (\n≧\n\\geqq\n80%) even with heavy aluminum prisms (up to 289 g). Furthermore, we demonstrated the practical utility of the hand in several ADL tasks, including closing bottle caps and orienting a pen for writing, highlighting its potential for daily use.\nThe main contributions of this study are as follows: first, an estimation method for object widths is introduced using only motor current feedback. The feedback is based on a simplified mechanism for PL in-hand manipulation (which eliminates the need for manual input required by previous open-loop systems). Second, an index finger coordination strategy is proposed based on a human-inspired approach that uses this estimated width to adapt the grasp and apply sufficient force, enabling the stable manipulation of heavy objects.\nII\nIntroduction of PLEXUS Hand\nThe core design objective of the PLEXUS hand is to enable both fundamental grasping\n[\n5\n,\n4\n]\nand PL manipulation based on a minimal number of actuators using an optimized single-axis thumb. The design of the four fingers (index, middle, ring, and little fingers), including their basic configuration and actuation mechanisms (e.g., four-bar linkages), was based on approaches detailed in previous studies, such as that of Wang et al.\n[\n19\n]\n, and these finger configurations and actuation mechanisms were considered as fixed parameters in our study. Additional details regarding the optimization and the overall mechanical design of the PLEXUS hand, including the finger mechanisms, can be found in our previous publication\n[\n9\n]\n. This section introduces the PLEXUS hand and its open-loop control method.\nFigure 2:\nActuation mechanisms for the thumb, ring, and little fingers\n[\n9\n]\n.\nIn the case of the thumb, rotation is driven by a linear actuator operated based on a piston–crank mechanism. For the ring and little fingers, a single actuator drives both digits via a differential Y-shaped linkage.\nII-A\nPLEXUS Hand\nWe engineered and fabricated a PLEXUS hand prototype based on the optimization process described in our previous publication\n[\n9\n]\n. This hardware implementation embodies the optimal thumb-axis position determined by the proposed algorithms. As demonstrated in our previous study\n[\n9\n]\n, the PLEXUS hand is capable of performing five basic grasp postures essential for ADLs in addition to the PL manipulation capability, which is the focus of the current study (shown in Fig.\n1\n).\nThe PLEXUS hand employs distinct actuation mechanisms for different digit groups, all of which are driven by linear actuators (LAS16-023D and LAS10-023D, Beijing Inspire Robots Technology, Beijing, China) for a simplified system integration. The specific designs of these mechanisms, including the piston–crank mechanism for the thumb, the four-bar linkage of the index and middle fingers, and the differential mechanism for the ring and little fingers (Fig.\n2\n), are described in our previous study\n[\n9\n]\n.\nII-B\nOpen-loop Control Based on a Predefined Object Width\nIn our preliminary work\n[\n9\n]\n, the PLEXUS hand was operated by an open-loop controller that relied on a predefined object width\nw\nw\n. The manipulation sequence was as follows:\n1.\nThe object width\nw\nw\nis input to the controller before initiating the grasp.\n2.\nWhen the user commands an initial precision grasp, the controller drives the thumb and index finger. The thumb stops at a predefined angle\nθ\nT\n,\nP\n\\theta_{\\mathrm{T,P}}\ndirectly below the index finger.\n3.\nThe index finger stops at a target angle\nθ\nc\n\\theta_{\\text{c}}\n, determined by a precalibrated mapping function\nf\n′\n:\nw\n↦\nθ\nc\nf^{\\prime}:w\\mapsto\\theta_{\\text{c}}\n. This mapping\nf\n′\nf^{\\prime}\nis derived beforehand based on the optimization algorithm described in\n[\n9\n]\n.\n4.\nThe controller then uses the input width\nw\nw\nand a second predefined mapping\ng\n′\n:\nw\n↦\nθ\nT\n,\nL\ng^{\\prime}:w\\mapsto\\theta_{\\mathrm{T,L}}\n(also based on the optimization algorithm) to determine the target joint angle\nθ\nT\n,\nL\n\\theta_{\\mathrm{T,L}}\nfor the thumb in the target lateral grasp posture.\nThis open-loop approach, which lacks feedback on contact or force states, struggled to apply appropriate force to prevent object ejection and to coordinate the fingers to optimal positions for a stable hold. Consequently, the hand’s manipulation capabilities were limited.\nIII\nPL Manipulation Using Motor Current Feedback\nWhen using the PLEXUS hand developed in this study as a myoelectric prosthesis, the user is assumed to control the hand via surface electromyogram (EMG) sensors. One plausible control method is an EMG pattern recognition system\n[\n10\n]\nin which the user learns to generate specific muscle contraction patterns corresponding to several target grasp postures (e.g., rest, precision grasp, lateral grasp, and power grasp), and selects the desired posture by intentionally producing the learned pattern. However, as suggested in\n[\n10\n]\n, the number of patterns a user can reliably discriminate and control in practical situations is limited and is reported to be approximately four.\nEven if the user can select a target grasp posture, directly controlling the complex coordinated finger movements required for the transition from one posture to another while holding an object (i.e., in-hand manipulation) in real-time via EMG signals alone is extremely difficult.\nThe system implemented in this study controls the transition process between the grasp postures. Its implementation and the relative simplicity of its control logic, which avoids relying on sophisticated sensor systems (e.g., dense tactile arrays and vision) or machine-learning algorithms often used for controlling dexterous manipulation\n[\n12\n,\n7\n,\n8\n,\n20\n]\n, are characteristic features. This is made possible because the core hardware design of the hand—the optimized single-axis thumb—simplifies the control problem by mechanically generating the entire motion path required for PL manipulation. To complement this mechanical design, the control logic incorporates a strategic, human-inspired coordination of the index finger\n[\n16\n]\nthat provides the stability needed to manipulate heavy objects. This current-based control system was developed to overcome the limitations of our preliminary work\n[\n9\n]\n, which relied on an open-loop scheme and could not provide sufficient force for manipulating heavy objects.\nFigure 3:\nSchematic of the control system for the PL manipulation of the PLEXUS Hand. The flowchart illustrates the logic for estimating the object width using the index finger motor current and subsequently coordinating the thumb and index finger movements to facilitate object reorientation.\nThis autonomous transition system is activated when the user issues a high-level command, such as selecting the EMG pattern corresponding to the intent to transition from a precision grasp to a lateral grasp. The system then executes the following control flow using only the motor-current monitoring function (which is commonly available on the actuators) as the sensory input. The control flow primarily comprises two stages: an initial grasp based on an estimation of the object width, and subsequent width-adaptive finger coordination (see the schematic in Fig.\n3\n). To clarify the variables used in this control system, we adopt a unified subscript notation. Subscripts, written in Roman type (e.g.,\nθ\nT\n,\nP\n\\theta_{\\mathrm{T,P}}\n), denote the relevant finger and the context. The primary symbols are defined as:\nT\n\\mathrm{T}\n(Thumb),\nI\n\\mathrm{I}\n(Index finger),\nP\n\\mathrm{P}\n(Precision grasp),\nL\n\\mathrm{L}\n(Lateral grasp),\nc\n\\mathrm{c}\n(contact), and\nth\n\\mathrm{th}\n(threshold). Thus,\nθ\nT\n,\nP\n\\theta_{\\mathrm{T,P}}\ndenotes the Thumb’s angle for the Precision grasp, and\nI\nI\n,\nth\nI_{\\mathrm{I,th}}\ndenotes the current threshold for the Index finger.\nIII-A\nStage 1: Initial Grasp and Object Width Estimation\n1.\nWhen the user commands an initial precision grasp, the controller drives the thumb and index finger in the closing direction. The thumb stops at a predefined angle\nθ\nT\n,\nP\n\\theta_{\\mathrm{T,P}}\ndirectly below the index finger.\n2.\nAs the fingers contact the object and motor load increases, the motor current (\nI\nI\nI_{\\text{I}}\n) of the index finger increases abruptly due to the low backdrivability of the actuators used in this hand.\n3.\nThe controller monitors\nI\nI\nI_{\\text{I}}\nand detects contact when it exceeds a predefined threshold (\nI\nI\n,\nth\nI_{\\mathrm{I,th}}\n= 300 mA).\n4.\nUpon contact detection, the controller stops the driving motor of the index finger and records the corresponding joint angle\nθ\nI\n,\nc\n\\theta_{\\mathrm{I,c}}\n. Notably, a low actuator backdrivability indicates that current spikes are useful only for detecting the initial object contact (not for monitoring the static hold), as the mechanism maintains the position without a sustained high current.\n5.\nAn estimated object width\nw\n^\n\\hat{w}\nis determined from the recorded angle using a precalibrated mapping function\nf\n:\nθ\nI\n,\nc\n↦\nw\n^\nf:\\theta_{\\mathrm{I,c}}\\mapsto\\hat{w}\n. This function\nf\nf\nmaps the direct kinematic relationship between the index finger’s contact angle (\nθ\nI\n,\nc\n\\theta_{\\mathrm{I,c}}\n) and the object width (\nw\n^\n\\hat{w}\n), which is geometrically defined when the thumb is positioned at its pre-grasp position\nθ\nT\n,\nP\n\\theta_{\\mathrm{T,P}}\n. In practice, this mapping is implemented as a discrete lookup table, interpolating between pre-calibrated angle-to-width values, corrected for offsets measured on the actual hardware.\nIII-B\nStage 2: Width-adaptive Finger Coordination\nThis stage implements a human-inspired coordination strategy\n[\n16\n]\n. The index finger is actively positioned to create a stable pivot, which is critical for the manipulation of heavy objects. The control sequence is as follows:\n1.\nWhen the user commands the transition to the next target posture (i.e., lateral grasp), the autonomous manipulation sequence begins.\n2.\nThe controller uses the estimated width\nw\n^\n\\hat{w}\nand a predefined mapping\ng\n:\nw\n^\n↦\nθ\nT\n,\nL\ng:\\hat{w}\\mapsto\\theta_{\\mathrm{T,L}}\nto determine the target joint angle\nθ\nT\n,\nL\n\\theta_{\\mathrm{T,L}}\nfor the thumb in the target lateral grasp posture. This mapping\ng\ng\nis derived from the optimization process in\n[\n9\n]\n, which pre-calculates the optimal angle\nθ\nT\n,\nL\n\\theta_{\\mathrm{T,L}}\nthat satisfies the lateral grasp stability constraints (as described in\n[\n9\n]\n) for a given object width\nw\n^\n\\hat{w}\n. As with\nf\nf\n, this function is implemented as a lookup table storing the pre-computed angles for discrete object widths (e.g., at 5 mm width intervals).\n3.\nThe controller first drives the thumb from its current position to the calculated target angle\nθ\nT\n,\nL\n\\theta_{\\mathrm{T,L}}\n.\n4.\nInspired by human strategies\n[\n16\n]\n, the controller drives the index finger to the stationary target angle\nθ\nI\n,\nL\n,\nfixed\n\\theta_{\\mathrm{I,L,fixed}}\n, which is determined by empirically refining a theoretically optimal posture. The optimization process in\n[\n9\n]\nfirst provided this theoretical ideal for a firm grasp, which corresponds to the intersection of the thumb line of action and the index-finger center. We then fine-tuned this posture via experimental trials to identify the final, robust angle used for the manipulation tasks.\n5.\nAfter the index finger reaches its target position, the controller drives the thumb again to grasp the object firmly against the index finger. During this final grasp closure, the thumb motor current is monitored, and the drive stops when it exceeds a predefined grasping threshold (\nI\nT\n,\nth\nI_{\\mathrm{T,th}}\n= 400 mA), corresponding to the desired holding force.\nThe transition from a lateral to a precision grasp follows an analogous procedure, but with reversed finger roles. Notably, the final current-based grasping closure (step 5) is omitted for lateral–precision (LP) manipulation to prevent potential object ejection, given the kinematics of the precision grasp posture, where excessive force could misalign the fingertips.\nIV\nExperiments\nWe conducted two experiments to evaluate the performance and practical applicability of the PLEXUS hand equipped with the proposed current-based control system, as described in Section\nIII\n. These tasks were required to be executed autonomously by the hand’s controller in response to a high-level user command.\nExperiment 1 aimed to assess quantitatively two key advancements in the PL manipulation capabilities of the PLEXUS hand. The first objective was to evaluate the performance of the system in adapting to objects of varying widths without the manually preset width information required in our previous study. The hand was required to reorient objects with flat or curved surfaces up to 30 mm in width while maintaining a stable hold without dropping, a target selected to exceed the median width of objects typically handled in precision grasps during daily activities\n[\n6\n]\n. The second objective was to determine whether a relatively simple control strategy, namely the coordination of the index finger based on this width estimation, could overcome the grasp stability and forceful manipulation limitations previously encountered with a stationary index finger. The hand was required to manipulate objects weighing up to 150 g, a target selected to exceed the median weight of objects handled in precision grasps in daily life\n[\n6\n]\n.\nExperiment 2 demonstrated the utility of the hand in several representative daily tasks that require object reorientation. Specifically, the experiment was designed to confirm two points: whether the index finger coordination strategy is effective in daily tasks, and whether these tasks can be successfully performed with a high-level user command, such as activating a switch for a lateral grasp.\nIV-A\nExperiment 1: Quantitative Evaluation of PL Manipulation\nIV-A\n1\nEvaluation Tasks\nThe experiment focused on the execution of PL manipulation in both directions. Three control conditions were evaluated.\n•\nPL Manipulation with Index Finger Coordination (PL w/ index):\nTransition from precision to lateral grasp using the full control strategy, including index finger movement.\n•\nPL Manipulation without Index Finger Coordination (PL w/o index):\nTransition from precision to lateral grasp during which the index finger remained stationary at its initial contact angle. This condition isolates the effect of the index finger coordination by comparing its results to PL w/ index.\n•\nLP Manipulation with Index Finger Coordination (LP w/ index):\nTransition from lateral to precision grasp. As the index finger coordination is essential for this direction, only this condition was evaluated for LP manipulation to assess its absolute performance.\nIV-A\n2\nEvaluated Objects and Materials\nThe objects evaluated included primitive shapes and common daily items.\n•\nPrimitive Objects:\nCylinders and square prisms (height: 120 mm) with varying widths and diameters (5, 10, 15, 20, 25, 30 mm) were evaluated. Both lightweight polylactic acid versions and heavier aluminum versions were used to assess the performance under different inertial loads and surface conditions.\n•\nCommon Objects:\nA diverse set of items representative of ADLs were evaluated, including tools (e.g., precision screwdriver, seal stamp), stationery items (e.g., pen, eraser), and household items (e.g., card, spoon).\nIV-A\n3\nProcedure\nTen trials were conducted for each object for each relevant task condition (PL w/ index, PL w/o index, LP w/ index). This sample size was chosen to demonstrate the feasibility of the proposed method and is consistent with evaluation methodologies employed in related previous studies on PL manipulation\n[\n13\n,\n7\n]\n. The procedure for each trial was as follows:\nS1)\nThe trial started with the hand in an open state.\nS2)\nAn initial grasp (precision for PL w/ index and PL w/o index tasks; lateral for LP w/ index task) was commanded. The system performed Stage 1: grasping the object via motor current feedback and estimating its width\nw\n^\n\\hat{w}\n.\nS3)\nInitial Object Placement and Stability Check:\nDuring the initial grasp (S2), the experimenter visually adjusted the object placement configuration according to the task type. For the initial precision grasp (PL tasks), the object was adjusted to ensure that it was (i) grasped near its center of gravity, (ii) oriented perpendicular to the thumb rotation axis, and (iii) the object center was positioned between the relevant fingertip centers. For the initial lateral grasp (LP task), the object was adjusted to ensure that it was (i) grasped near its center of gravity, (ii) oriented parallel to the central axis of the index fingertip, and (iii) positioned between the side surfaces of the thumb and index finger. After the grasping process was completed, the experimenter lightly perturbed the object by hand to confirm the grasp stability before proceeding.\nS4)\nSubsequently, a command to transition to the target posture (lateral for PL tasks, precision for an LP task) was issued. The system performed Stage 2, executing finger coordination according to the specified task condition as described in Section\nIII\n. Success was evaluated at this point based on the criteria described below.\nS5)\nFinally, the grasp was released, and the hand returned to the open state.\nThe sequence from the initial grasp command in S2 through the completion of the transition in S4 (excluding the experimenter check in S3) was executed autonomously in response to the respective commands.\nIV-A\n4\nSuccess Criteria\nA trial was considered successful if after completing the transition movement in S4 and reaching the target posture, the object was stably held (did not drop or slip), as confirmed via visual inspection by the experimenter. Even if the position of the object shifted during manipulation owing to factors such as weight, the trial was still considered successful if the object was ultimately stably grasped (and remained within the hand, that is, it did not drop).\nTABLE I:\nSuccess rates (%) for manipulation tasks over 10 trials.\nObject type\nWidth\nMaterial\nWeight\nSuccess rate (%)\n(mm)\n(g)\nPL w/ index\nPL w/o index\nLP w/ index\nPrimitive objects\nCylinder\n5\nPLA\n2.79\n2.79\n100\n100\n100\nSquare prism\n5\nPLA\n2.49\n2.49\n100\n100\n100\nCylinder\n10\nPLA\n5.04\n5.04\n100\n100\n100\nSquare prism\n10\nPLA\n6.20\n6.20\n100\n100\n100\nCylinder\n15\nPLA\n9.90\n9.90\n100\n90\n100\nSquare prism\n15\nPLA\n11.59\n11.59\n100\n100\n100\nCylinder\n20\nPLA\n14.58\n14.58\n100\n40\n80\nSquare prism\n20\nPLA\n18.03\n18.03\n100\n100\n100\nCylinder\n25\nPLA\n20.80\n20.80\n100\n80\n80\nSquare prism\n25\nPLA\n24.65\n24.65\n100\n100\n100\nCylinder\n30\nPLA\n28.34\n28.34\n100\n100\n80\nSquare prism\n30\nPLA\n34.34\n34.34\n100\n100\n100\nCylinder\n5\nAl\n6.25\n6.25\n100\n100\n90\nSquare prism\n5\nAl\n8.04\n8.04\n100\n100\n100\nCylinder\n10\nAl\n24.92\n24.92\n100\n100\n100\nSquare prism\n10\nAl\n32.18\n32.18\n100\n80\n100\nCylinder\n15\nAl\n56.48\n56.48\n80\n40\n40\nSquare prism\n15\nAl\n72.18\n72.18\n90\n60\n100\nCylinder\n20\nAl\n100.31\n100.31\n70\n70\n30\nSquare prism\n20\nAl\n128.53\n128.53\n100\n100\n100\nCylinder\n25\nAl\n158.41\n158.41\n50\n0\n10\nSquare prism\n25\nAl\n200.66\n200.66\n100\n90\n100\nCylinder\n30\nAl\n228.00\n228.00\n40\n20\n10\nSquare prism\n30\nAl\n289.09\n289.09\n80\n40\n100\nCommon Objects\nBusiness card\n0.3\n—\n1.16\n1.16\n0\n20\n100\nHeavy pen\n10.3\n—\n23.45\n23.45\n100\n100\n100\nLight pen\n10.2\n—\n9.75\n9.75\n100\n100\n100\nSeal stamp\n9.9\n—\n4.68\n4.68\n100\n100\n100\nSpoon\n1.7\n—\n15.48\n15.48\n20\n0\n100\nScrewdriver (#1)\n6.2\n—\n21.22\n21.22\n100\n100\n100\nKnife\n10.5–12.5\n—\n63.03\n63.03\n100\n0\n100\nThick spoon\n10.15\n—\n48.08\n48.08\n100\n100\n100\nThick teaspoon\n8.55\n—\n26.63\n26.63\n100\n100\n100\nThick fork\n10.15\n—\n32.44\n32.44\n100\n100\n100\nEraser\n12.6\n—\n39.11\n39.11\n100\n90\n100\nDishwashing det.\n43.86\n—\n207.34\n207.34\n50\n0\n80\nToothpaste\n20–24\n—\n98.22\n98.22\n100\n0\n100\nBolt (M12-80 mm)\n11.81\n—\n75.54\n75.54\n50\n50\n30\n*\nPL: Precision–lateral; LP: Lateral–precision; w/: with; w/o: without; Al: Aluminum; PLA: Polylactic acid.\nIV-B\nExperiment 2: Demonstration of Practical Applications\nAlthough comprehensive testing involving prosthesis users remains essential for future work, we conducted preliminary demonstrations in several practical scenarios to demonstrate qualitatively the potential utility of the manipulation capability of the PLEXUS hand (specifically, using the PL w/ index strategy) in tasks representative of ADLs that benefit from object reorientation.\nThese demonstrations involved an operator supporting the base of the hand using a selfie stick to position it for the task. This setup is intended to simulate the actual usage environment of a prosthesis, where the user must actively adjust the hand’s position for tasks. Therefore, the goal of this experiment was not to measure quantitative success but to qualitatively confirm the feasibility of the manipulation itself in representative ADLs. Success was assessed qualitatively based on task completion. These included dexterous daily tasks requiring PL manipulation, including knob turning and bottle cap closing, as shown in Fig.\n4\n.\nFigure 4:\nDemonstrations of dexterous daily tasks with the PLEXUS Hand. The figure illustrates PL manipulation (PL w/ index strategy) for tasks such as knob turning and bottle cap closing. The yellow frame highlights an instance where manipulation is essential to avoid palmar obstruction. See supplementary Movie S1 (https://youtu.be/TswoBs84uyE) for full sequences.\nV\nResults and Discussion\nV-A\nExperiment 1: Quantitative Evaluation of PL Manipulation\nThe success rates for the manipulation tasks using primitive and common objects are summarized in Table\nI\n, where boldface fonts are used to highlight cases in which the two PL conditions differ by 30 percentage points or more. The quantitative results from Experiment 1 demonstrate the effectiveness of the proposed hand while also highlighting the benefits and limitations of the approach.\nThe high success rates obtained using the primary control strategy (PL w/ index) were observed for most lightweight primitive objects (PLA cylinders and prisms), indicating that the combination of the optimized single-axis thumb design and relatively simple current-based control is sufficient for achieving reliable PL manipulation in basic scenarios. This finding demonstrates that a meticulous mechanical design can simplify the control requirements for specific manipulation tasks. This contrasts with strategies that rely solely on complex sensing and control architectures typical of high-DOF hands (discussed in Section\nI\n).\nSecond, the comparison between the PL w/ index and PL w/o index conditions underscores the importance of index finger coordination, particularly when handling heavier objects. As demonstrated by the aluminum objects (Table\nI\n), the success rate for the PL w/o index decreased markedly, particularly for wider objects (e.g., 60% for 15 mm prism and 40% for 30 mm prism), whereas the PL w/ index maintained a considerably improved performance (e.g.,\n≥\n\\geq\n80% for all prisms), achieving our 150 g target with a simpler design than the dexterous hands used in related work on lighter objects\n[\n7\n,\n13\n]\n. This confirms that actively positioning the index finger to provide appropriate support against the thumb during the lateral grasp phase, which is enabled by the width estimation, substantially enhances the grasp stability and force application capabilities, overcoming a key limitation identified in our previous work\n[\n9\n]\n.\nHowever, the experiments also revealed the limitations of our approach. The lower success rates for the cylinders compared with those of the prisms likely originates from a different grasp instability aspect, which stems from the difficulty in establishing a stable contact area on a curved surface. This highlights the trade-off in our optimization method. We evaluated grasp stability based on the conditions indicated in our previous work\n[\n9\n]\n, which assumes point contact for computational tractability. However, as noted in prior studies, grasps planned with point-contact models are vulnerable to these types of rotational moments\n[\n2\n]\n, a problem that is more pronounced on the point contact of a cylinder than on the surface contact of a prism\n[\n17\n]\n. Further refinement of this optimization is another important direction for future research.\nV-B\nExperiment 2: Demonstration of Practical Applications\nThe practical utility of the PL manipulation capability (using the PL w/ index strategy) was demonstrated via several tasks representative of ADLs. The successful execution of these tasks is demonstrated in Fig.\n4\n, as well as supplementary Movies S1 (https://youtu.be/TswoBs84uyE), which highlight the potential benefits of this system.\nThe demonstrations in Experiment 2 qualitatively confirmed the practical potential of the manipulation system. By controlling the PL transition based on simple current feedback, the PLEXUS hand could perform a wider range of functional tasks compared with scenarios requiring manual reorientation of the object with the other hand or where static grasps are only used (as illustrated in Fig.\n4\n). Tasks such as turning knobs, closing caps, and orienting a marker for writing were successfully executed, suggesting its potential for reducing compensatory user movements. This success also validates our control approach, in which in-hand manipulation is autonomously executed from a single user command, thereby suggesting its compatibility with prosthetic control schemes that rely on a limited set of discrete commands.\nDespite the various advantages exemplified herein, this study is also associated with limitations. As noted in the bottle cap task case the maximum applicable torque for complete tightening was inherently limited by the grasp force achievable by the actuators despite the fact that the hand was able to perform the rotation sufficiently to prevent spillage. This can be insufficient for tasks requiring very high torques. Furthermore, real-world applications would necessitate seamless integration and coordination of wrist and arm movements, which constitutes an area for future work.\nVI\nConclusion\nThis study developed a novel lightweight electric prosthetic hand (311 g, four motors) that enables stable PL in-hand manipulation, including heavy objects, without the use of external sensors. The core achievement of this study is the demonstration of a lightweight prosthetic hand that can achieve dexterous PL manipulation via the combination of an optimized, mechanically simple thumb and a basic motor-current-based controller. This study demonstrated a viable pathway toward prosthetic hands that combine functionality with low user burden in daily use.\nACKNOWLEDGMENT\nThis work was supported by JSPS KAKENHI (grant numbers JP24KJ0248 and JP25K00150).\nReferences\n[1]\nJ. T. Belter and A. M. Dollar\n(2011-06)\nPerformance characteristics of anthropomorphic prosthetic hands\n.\nIn\n2011 IEEE International Conference on Rehabilitation Robotics (ICORR)\n,\npp. 1–7\n.\nExternal Links:\nISBN 978-1-4244-9862-8\nCited by:\n§I\n.\n[2]\nAntonio. Bicchi and Vijay. Kumar\n(2000)\nRobotic grasping and contact: a review\n.\nIn\n2000 IEEE International Conference on Robotics and Automation (ICRA)\n,\npp. 348–353 vol.1\n.\nCited by:\n§\nV-A\n.\n[3]\nÁ. M. Carroll and N. Fyfe\n(2004-04)\nA comparison of the effect of the aesthetics of digital cosmetic prostheses on body image and well-being\n.\nJournal of Prosthetics and Orthotics\n16\n,\npp. 66–68\n.\nExternal Links:\nISSN 1040-8800\nCited by:\n§I\n.\n[4]\nC. Cipriani, M. Controzzi, and M. C. Carrozza\n(2010-10)\nObjectives, criteria and methods for the design of the smarthand transradial prosthesis\n.\nRobotica\n28\n,\npp. 919–927\n.\nExternal Links:\nDocument\n,\nISSN 02635747\nCited by:\n§II\n.\n[5]\nC. Cipriani, F. Zaccone, S. Micera, and M. C. Carrozza\n(2008-02)\nOn the shared control of an emg-controlled prosthetic hand: analysis of user-prosthesis interaction\n.\nIEEE Transactions on Robotics\n24\n,\npp. 170–184\n.\nExternal Links:\nDocument\n,\nISSN 15523098\nCited by:\n§II\n.\n[6]\nT. Feix, I. M. Bullock, and A. M. Dollar\n(2014-07)\nAnalysis of human grasping behavior: object characteristics and grasp type\n.\nIEEE Transactions on Haptics\n7\n,\npp. 311–323\n.\nExternal Links:\nDocument\n,\nISSN 1939-1412\nCited by:\n§IV\n.\n[7]\nS. Funabashi, A. Schmitz, T. Sato, S. Somlor, and S. Sugano\n(2018-11)\nVersatile in-hand manipulation of objects with different sizes and shapes using neural networks\n.\nIn\n2018 IEEE-RAS 18th International Conference on Humanoid Robots (Humanoids)\n,\npp. 1–9\n.\nExternal Links:\nISBN 978-1-5386-7283-9\nCited by:\n§I\n,\n§III\n,\n§\nIV-A\n3\n,\n§\nV-A\n.\n[8]\nA. Handa, A. Allshire, V. Makoviychuk, A. Petrenko, R. Singh, J. Liu, D. Makoviichuk, K. V. Wyk, A. Zhurkevich, B. Sundaralingam, G. State, and J. F. Lafleche\n(2023)\nDeXtreme: transfer of agile in-hand manipulation from simulation to reality\n.\nIn\n2023 IEEE International Conference on Robotics and Automation (ICRA)\n,\npp. 5977–5984\n.\nExternal Links:\nISBN 9798350323658\n,\nISSN 10504729\nCited by:\n§III\n.\n[9]\nY. Kuroda, T. Takahashi, C. C. Beltran-Hernandez, M. Hamaya, and K. Tanaka\n(2025)\nPLEXUS hand: lightweight four-motor prosthetic hand enabling precision–lateral dexterous manipulation\n.\nIn\n2025 IEEE International Conference on Rehabilitation Robotics (ICORR)\n,\nCited by:\n§I\n,\n§I\n,\nFigure 2\n,\nitem 3\n,\n§\nII-A\n,\n§\nII-A\n,\n§\nII-B\n,\n§II\n,\nitem 2\n,\nitem 4\n,\n§III\n,\n§\nV-A\n,\n§\nV-A\n.\n[10]\nY. Kuroda, Y. Yamanoi, H. Jiang, Y. Yabuki, Y. Inoue, D. Bai, Y. Jiang, J. Zhu, and H. Yokoi\n(2025)\nToward cyborg: exploring long-term clinical outcomes of a multi-degree-of-freedom myoelectric prosthetic hand\n.\nCyborg and Bionic Systems\n6\n.\nExternal Links:\nDocument\n,\nISSN 26927632\nCited by:\n§III\n.\n[11]\nA. Mohammadi, J. Lavranos, H. Zhou, R. Mutlu, G. Alici, Y. Tan, P. Choong, and D. Oetomo\n(2020-05)\nA practical 3d-printed soft robotic prosthetic hand with multi-articulating capabilities\n.\nPLoS ONE\n15\n,\npp. e0232766\n.\nExternal Links:\nISSN 19326203\nCited by:\n§I\n.\n[12]\nOpenAI, I. Akkaya, M. Andrychowicz, M. Chociej, M. Litwin, B. McGrew, A. Petron, A. Paino, M. Plappert, G. Powell, R. Ribas, J. Schneider, N. Tezak, J. Tworek, P. Welinder, L. Weng, Q. Yuan, W. Zaremba, and L. Zhang\n(2019-10)\nSolving rubik’s cube with a robot hand\n.\nExternal Links:\nLink\nCited by:\n§I\n,\n§III\n.\n[13]\nK. Or, M. Tomura, A. Schmitz, S. Funabashi, and S. Sugano\n(2016-10)\nPosition-force combination control with passive flexibility for versatile in-hand manipulation based on posture interpolation\n.\nIn\n2016 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)\n,\npp. 2542–2547\n.\nExternal Links:\nISBN 978-1-5090-3762-9\nCited by:\n§I\n,\n§\nIV-A\n3\n,\n§\nV-A\n.\n[14]\nÖssur\nI-limb quantum\n.\nNote:\nAccessed: Nov. 21, 2024\nExternal Links:\nLink\nCited by:\n§I\n.\n[15]\nOttobock US\nBebionic\n.\nNote:\nAccessed: Nov. 21, 2024\nExternal Links:\nLink\nCited by:\n§I\n.\n[16]\nJ. K. Shim, J. Huang, A. Hooke, M. Latsh, and V. Zatsiorsky\n(2007-05)\nMulti-digit maximum voluntary torque production on a circular object\n.\nErgonomics\n50\n(\n5\n),\npp. 660–675\n(\nEnglish\n).\nExternal Links:\nISSN 0014-0139\nCited by:\n§I\n,\nitem 4\n,\n§\nIII-B\n,\n§III\n.\n[17]\nF. Veiga, B. Edin, and J. Peters\n(2020)\nGrip stabilization through independent finger tactile feedback control\n.\nSensors\n20\n(\n6\n).\nExternal Links:\nISSN 1424-8220\nCited by:\n§\nV-A\n.\n[18]\nR. Vinet, Y. Lozac, N. Beaudry, and G. Drouin\n(1995)\nDesign methodology for a multifunctional hand prosthesis\n.\nDepartment Veterans Affairs Journal of Rehabilitation Research and Development\n32\n,\npp. 316–324\n.\nExternal Links:\nISBN 07487711\n,\nISSN 0748-7711\nCited by:\n§I\n.\n[19]\nY. Wang, Y. Tian, H. She, Y. Jiang, H. Yokoi, and Y. Liu\n(2022-02)\nDesign of an effective prosthetic hand system for adaptive grasping with the control of myoelectric pattern recognition approach\n.\nMicromachines\n13\n.\nExternal Links:\nDocument\n,\nISSN 2072666X\nCited by:\n§II\n.\n[20]\nZ. Yin, B. Huang, Y. Qin, Q. Chen, and X. Wang\n(2023)\nRotating without seeing: towards in-hand dexterity through touch\n.\nRobotics: Science and Systems\n.\nCited by:\n§III\n.",
    "preview_text": "Electric prosthetic hands should be lightweight to decrease the burden on the user, shaped like human hands for cosmetic purposes, and designed with motors enclosed inside to protect them from damage and dirt. Additionally, in-hand manipulation is necessary to perform daily activities such as transitioning between different postures, particularly through rotational movements, such as reorienting a pen into a writing posture after picking it up from a desk. We previously developed PLEXUS hand (Precision-Lateral dEXteroUS manipulation hand), a lightweight (311 g) prosthetic hand driven by four motors. This prosthetic performed reorientation between precision and lateral grasps with various objects. However, its controller required predefined object widths and was limited to handling lightweight objects (of weight up to 34 g). This study addresses these limitations by employing motor current feedback. Combined with the hand's previously optimized single-axis thumb, this approach achieves more stable manipulation by estimating the object's width and adjusting the index finger position to maintain stable object holding during the reorientation. Experimental validation using primitive objects of various widths (5-30 mm) and shapes (cylinders and prisms) resulted in a 100% success rate with lightweight objects and maintained a high success rate (>=80) even with heavy aluminum prisms (of weight up to 289 g). By contrast, the performance without index finger coordination dropped to just 40% on the heaviest 289 g prism. The hand also successfully executed several daily tasks, including closing bottle caps and orienting a pen for writing.\n\nStable In-hand Manipulation for a Lightweight Four-motor\nProsthetic Hand\nYuki Kuroda\n1\n, Tomoya Takahashi\n1\n, Cristian C. Beltran-Hernandez\n1\n,\nKazutoshi Tanaka\n1\nand Masashi Hamaya\n1\n1\nOMRON SINIC X Corporation, Tokyo, Japan.\nyuki.kuroda@sinicx.com\nAbstract\nElectric prosthetic hands should be lightweight to decrease the burden on the user, ",
    "is_relevant": false,
    "relevance_score": 1.0,
    "extracted_keywords": [
        "prosthetic hand",
        "in-hand manipulation",
        "motor current feedback",
        "lightweight",
        "reorientation",
        "experimental validation"
    ],
    "one_line_summary": "这篇论文提出了一种基于电机电流反馈的轻量四电机假肢手控制方法，通过优化拇指和食指协调实现稳定物体重定向，但未涉及强化学习、VLA、扩散模型、Flow Matching、运动控制、VLM或全身控制等关键词。",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-12T14:15:15Z",
    "created_at": "2026-01-21T12:09:10.922868",
    "updated_at": "2026-01-21T12:09:10.922875",
    "recommend": 0
}