{
    "id": "2601.08819v1",
    "title": "Older Adults' Preferences for Feedback Cadence from an Exercise Coach Robot",
    "authors": [
        "Roshni Kaushik",
        "Reid Simmons"
    ],
    "abstract": "人们对于反馈和指导的反应方式各异，因此机器人个性化互动并运用言语与非言语沟通线索至关重要。本研究旨在探究老年人如何对机器人运动教练不同节奏的言语与非言语反馈作出反应。我们开展了一项针对老年人的线上研究，参与者通过观看机器人以不同节奏提供各模态反馈的视频进行评估。结果表明，改变某一模态的反馈节奏会影响对该模态及另一模态的感知。基于此研究结果，我们可优化机器人教练在与该群体进行运动训练时的反馈频率设计。",
    "url": "https://arxiv.org/abs/2601.08819v1",
    "html_url": "https://arxiv.org/html/2601.08819v1",
    "html_content": "Older Adults’ Preferences for Feedback Cadence from an Exercise Coach Robot\nRoshni Kaushik\n1\nand Reid Simmons\n2\n1\nCarnegie Mellon University, Robotics Institute, Pittsburgh, PA,\nroshnika@andrew.cmu.edu\n2\nCarnegie Mellon University, Robotics Institute, Pittsburgh, PA,\nrsimmons@andrew.cmu.edu\nAbstract\nPeople can respond to feedback and guidance in different ways, and it is important for robots to personalize their interactions and utilize verbal and nonverbal communication cues. We aim to understand how older adults respond to different cadences of verbal and nonverbal feedback of a robot exercise coach. We conducted an online study of older adults, where participants evaluated videos of the robot giving feedback at different cadences for each modality. The results indicate that changing the cadence of one modality affects the perception of both it and the other modality. We can use the results from this study to better design the frequency of the robot coach’s feedback during an exercise session with this population.\nI\nIntroduction\nAs researchers try to create robots that integrate in a variety of domains, they explore how robots can move from controlled factories to more complex environments such as healthcare and education\n[\n8\n]\n. In these domains, it is crucial for robots to personalize their interactions, be aware of the contextual nuances surrounding their behavior, and effectively utilize verbal and nonverbal communication cues. Robots that do not personalize their behavior and deploy a one-size-fits-all approach could miss out on opportunities to improve an individual’s performance and experience based on their preferences and the contextual situation.\nIn the domain of exercise, guidance and feedback are especially important, as a personalized coach could provide corrections to ensure that the individual performs the exercises correctly with minimal injury risk, as well as providing motivation and encouragement to promote consistency and enjoyment of the exercise experience. In prior work\n[\n7\n]\n, we developed a robotic exercise coach that evaluated the exercises that participants performed in real-time and provided feedback in multiple styles. We found that people performed differently and had different preferences for the styles.\nOne aspect we did not explore in this previous study was people’s preferences for feedback cadence. For an exercise coach, some people may prefer feedback more frequently, and others may feel overwhelmed by too much feedback. People may also prefer different frequencies depending on the feedback modality, such as preferring a greater frequency of nonverbal feedback compared to verbal feedback\n[\n1\n]\n.\nIn this work, we specifically focus on older adults (ages 60+) and their preferences for verbal and nonverbal feedback in the domain of exercise. Exercise is extremely important in promoting physical, mental, and emotional well-being in older adults, and it is important to understand how they respond to different feedback levels, so an exercise coach robot could personalize its feedback to those preferences\n[\n10\n]\n. Our main research question is:\n•\nWhat are older adults’ preferences for verbal and nonverbal feedback for a robot exercise coach?\nTo explore this question, we use the same exercise coach robot in\n[\n7\n]\nthat evaluates how well the participants perform exercises and provides verbal and nonverbal feedback while they exercise. We generate videos of the robot responding to exercises with different cadences of\nverbal\nand\nnonverbal\nfeedback, and explore through an online study how older adults’ preferences change with the different cadences in an online study. We find support for both main effects (changing the cadence of one modality affects the perception of it) and secondary effects (changing the cadence of one modality affects the perception of the other modality).\nII\nRelated Work\nResearchers have explored how different frequencies of verbal feedback have an impact on performance and subjective experience during human-human interactions. In a card-sorting task, researchers found that the percentage of responses accompanied by verbal feedback affected the number of trials it took the participants to complete the task\n[\n2\n]\n. When learning a complex movement task, participants preferred a medium cadence of feedback; too high of a frequency reduced the effectiveness of feedback\n[\n12\n]\n. Researchers found that including verbal robot commands was the most effective form of communication while maintaining user trust when the robot was teaching the human\n[\n11\n]\n. Robot verbal feedback in a collaborative task with a human improved task performance and the human’s subjective experience\n[\n15\n]\n.\nResearchers have also explored how nonverbal feedback affects people. An increase in the frequency of genuine teacher smiles during an interaction improved the likelihood of students correcting mistakes\n[\n5\n]\n. A study on the effects of affective human-like and robot-specific behavior showed that these behaviors do impact the perception of the robot and the human’s affect\n[\n13\n]\n. Robot motion and mimicry had a significant impact on similarity and closeness in robot-mediated communication\n[\n3\n]\n. Combining nonverbal gestures with verbal information can further improve the human experience, as found in\n[\n14\n]\n. Our work explores specifically how changing the frequency of both verbal and nonverbal feedback affects the human’s perception of the interaction\nIII\nMethodology\nIII-A\nExercise Evaluation\nThe robot firsts evaluates each repetition of the exercise the participant performs in real-time. We choose bicep curls and lateral raises as the two exercises based on prior work (\n[\n7\n]\n), which also includes the technical details of the evaluation.\nFor each rep, the robot computes two kinds of evaluation information. The speed of a rep can be good, fast, or slow. Additionally, the form of a rep can be: good, low range of motion, high range of motion, or generically bad. This evaluation information is vital for the robot to provide specific feedback on the individual’s performance.\nIII-B\nRobot Feedback\nOnce the robot evaluates a new repetition, it should react in a multi-modal way. We consulted with two domain experts\n1\n1\n1\nAyotoni Aroyo, ACSM-CPT (Exercise Physiologist and Physical Activity Lead at Emory University’sCognitive Empowerment Program); Gustavo J Almeida, PT, Ph.D. (UT Health San Antonio)\nto determine what kinds of verbal and nonverbal feedback are appropriate for an exercise coach. From the expert discussions, we design a controller that reacts to the specific feedback outputted by the exercise evaluation. For each modality, we have to answer the questions: (1) what should the feedback look like, and (2) when should the feedback occur?\nIII-C\nVerbal Feedback\nWe define three categories of verbal feedback after discussions with our domain experts:\n1.\nPositive -\nα\n1\n\\alpha_{1}\ngood evals or\nα\n2\n\\alpha_{2}\ngood speed in a row\n2.\nNegative -\nβ\n1\n\\beta_{1}\nbad evals with the same message or\nβ\n2\n\\beta_{2}\nfast/slow in a row\n3.\nCorrection -\nβ\n1\n\\beta_{1}\nbad evals with the same message followed by a good eval or\nβ\n2\n\\beta_{2}\nfast/slow in a row followed by a good speed\nwhere\nα\n1\n,\nα\n2\n,\nβ\n1\n,\nβ\n2\n\\alpha_{1},\\alpha_{2},\\beta_{1},\\beta_{2}\nare all determined by which cadence level is chosen. The robot gives positive or negative feedback generally if it sees a pattern (good or bad) in the human’s behavior. We choose to structure the feedback in this way because our domain experts indicated the importance of ensuring that the robot sees a pattern before intervening. Additionally, they emphasized the importance of rewarding a correction of behavior (third bullet), so the human knows that they have successfully incorporated the robot’s correction.\nWe choose values (based on discussions with our experts) for each parameter for {\nlow\n,\nmedium\n,\nhigh\n}\nverbal\nfeedback:\nα\n1\n=\n{\n4\n,\n3\n,\n2\n}\n\\alpha_{1}=\\{4,3,2\\}\n,\nα\n2\n=\n{\n5\n,\n4\n,\n3\n}\n\\alpha_{2}=\\{5,4,3\\}\n,\nβ\n1\n=\n{\n3\n,\n2\n,\n1\n}\n\\beta_{1}=\\{3,2,1\\}\n, and\nβ\n2\n=\n{\n4\n,\n3\n,\n2\n}\n\\beta_{2}=\\{4,3,2\\}\n. Note that when the robot has multiple options for how to respond (form and speed verbal feedback), the robot will prioritize form feedback. Additionally, the robot says a message only if it has not finished a previous message 3 seconds prior (experimentally determined) to not overwhelm the human with verbal feedback. The robot has a set of options for exact messages to utter based on the situation. Some examples include:\n•\nLast few reps were slow\n→\n\\rightarrow\nNice job, can you speed up a little on the next few?\n•\nLast few reps had a low range of motion\n→\n\\rightarrow\nYou are doing great, try to get a full range of motion in your elbows.\n•\nLast few reps were good form\n→\n\\rightarrow\nNice job, looking great!\nIII-D\nNonverbal Feedback\nThe robot’s\nnonverbal\nfeedback has two forms: facial expressions and body movements. Details of the feedback generation can be found in\n[\n7\n]\n, and the robot reacts\npositively\nwith a happy facial expression and body movement and\nnegatively\nwith a sad facial expression and body movement.\nVerbal-nonverbal incongruence is a studied area in human-human interactions, and the interpretation of communication where the nonverbal and verbal reactions do not match can be unclear\n[\n4\n]\n. To avoid any potential misinterpretations, we choose to match the nonverbal reactions to the verbal utterances of the robot (\npositive\nwith a positive or correction verbal phrase and\nnegative\nwith a negative verbal phrase).\nWhen the robot does not utter anything verbally after a rep, it has a choice of whether or not to react nonverbally. We want to test different frequencies of reacting at these points in the session where the robot is silent. We choose to test three different cadence levels of the\nnonverbal\nfeedback. For the\nhigh\ncadence, the robot always reacts positively or negatively; the robot reacts only 50% of the time for the\nmedium\ncadence; and it reacts only 25% of the time for the\nlow\ncadence. We choose these numerical values as they were visually distinguishable when tested on the robot and represent a large variety of response frequencies.\nIV\nStudy Design\nOur user study tests the preferences of older adults for different levels of\nverbal\nand\nnonverbal\nfeedback. After discussions with our domain experts, we choose to test the cadence levels of\nnonverbal\nfeedback at or above the cadence levels of\nverbal\nfeedback to reduce the number of combinations of cadences to test. For example, when the\nverbal\ncadence is high and the\nnonverbal\ncadence is low, the robot would react verbally very frequently, so changes in the\nnonverbal\ncadence (which only change after the reps where the robot does not react verbally) would be minimal. However, when the\nverbal\ncadence is low, there are many opportunities for the\nnonverbal\ncadence to affect the number of nonverbal reactions the human sees since there are many reps to which the robot does not react verbally.\nFor each of the 6 conditions, we record one session of bicep curls and one session of lateral raises. Each session includes: 4 good form/good speed, 3 low range form/good speed, 3 good form/slow, and 5 good form/good speed. This results in a total of 12 videos (see Figure\n1\nfor screenshot), 2 per condition.\nFigure 1:\nScreenshot for a video from the study with the human exerciser on the left and the robot providing verbal and nonverbal feedback on the right.\nParticipants begin this online study on Qualitrics with a consent form and demographic information. They read through an explanation of the videos they will see in the study that includes a description of the two feedback modalities. They also complete one training question that asks “Which of the following will the robot change as part of its feedback?” where the required answer is selecting facial expressions, body movements, and what the robot says. This question is intended to ensure the participants pay attention to the robot’s behavior.\nThey then see one video per condition (randomly chosen between the two videos in each condition), with the order of the videos randomized. After seeing each video, the participants complete two sets of questions: one about their impressions of the robot’s\nverbal\nfeedback and one about the\nnonverbal\nfeedback. On a 5-pt scale from strongly disagree to strongly agree, they evaluate the usefulness, clarity, timeliness, and helpfulness of each type of feedback. They then have the option to explain their choice in a free-form text format.\nWe discuss the results and hypotheses representing main effects (changes in a modality affect the perception of it) and secondary effects (changes in a modality affect the perception of the other modality) in the following section.\nFigure 2:\nResults of all Likert-style measures with perceptions of verbal feedback in the first row and nonverbal feedback in the second row. Significant differences are marked with one asterisk (\np\n<\n0.05\np<0.05\n) or two asterisks (\np\n<\n0.01\np<0.01\n). Each box plot shows the interquartile range of the data, as well as the min and max of the data. The mean is shown with a green triangle.\nV\nResults and Discussion\nWe recruited 100 online participants using Prolific, with a criterion of age greater than 60, as we want to focus on older adults’ perceptions of the robot, with the study protocol approved by the IRB. We convert the Likert-style results into numeric values from 1-5 and perform a repeated measures ANOVA with the\nverbal\nand\nnonverbal\ncadences as two within-subjects conditions, using the Greenhouse-Geisser corrected p-value. Where we found significance, we then perform a pairwise post-hoc test to determine which pairwise differences between feedback cadence levels are significant. Figure\n2\nshows the results marked with significant differences.\nH1:\nChanging the\nverbal\nfeedback cadence affects the participants’ view of the\nverbal\nfeedback\nWe have support for this hypothesis. Changing the\nverbal\nfeedback cadence has an effect on the perceived clarity and helpfulness of the robot’s\nverbal\nfeedback. Specifically, participants seemed to prefer the\nhigh\nlevel compared to the\nmedium\nin terms of clarity (\np\n<\n0.05\n,\nF\n​\n(\n2\n,\n198\n)\n=\n3.26\np<0.05,F(2,198)=3.26\n) and the\nmedium\nand\nhigh\nover the\nlow\nin terms of helpfulness (\np\n<\n0.01\n,\nF\n​\n(\n2\n,\n198\n)\n=\n6.47\np<0.01,F(2,198)=6.47\n). This result illustrates that the\nlow\nlevel of verbal feedback is generally not preferred and that\nmedium\nand\nhigh\nlevels are perceived as more helpful and clear. The more frequent feedback could make the robot feel more responsive and aware of what the human is doing.\nH2:\nChanging the\nnonverbal\nfeedback cadence affects the participants’ view of the\nnonverbal\nfeedback\nWe have support for this hypothesis. Changing the\nnonverbal\nfeedback cadence has an effect on the perceived timeliness (\np\n<\n0.05\n,\nF\n​\n(\n2\n,\n198\n)\n=\n3.70\np<0.05,F(2,198)=3.70\n) and helpfulness (\np\n<\n0.05\n,\nF\n​\n(\n2\n,\n198\n)\n=\n3.42\np<0.05,F(2,198)=3.42\n) of the robot’s feedback. Participants preferred a\nmedium\nlevel for both of these measures over the\nlow\nlevel. The higher frequency of nonverbal reactions could be more engaging for participants, and they could feel that the robot is actually responding to the exercises.\nH3:\nChanging the\nverbal\nfeedback cadence affects the participants’ view of the\nnonverbal\nfeedback\nWe have support for this hypothesis. Changing the robot’s\nverbal\nfeedback cadence affects the perception of the\nnonverbal\nfeedback’s clarity (\np\n<\n0.01\n,\nF\n​\n(\n2\n,\n198\n)\n=\n4.39\np<0.01,F(2,198)=4.39\n) and timeliness (\np\n<\n0.05\n,\nF\n​\n(\n2\n,\n198\n)\n=\n3.75\np<0.05,F(2,198)=3.75\n). Participants thought the\nmedium\nand\nhigh\nlevels of verbal feedback paired with better clarity and timeliness of the nonverbal feedback. This is an interesting secondary effect that shows that the two feedback modalities are inexorably linked. Changing the cadence of one will affect the perception of the other.\nPsychology researchers have explored this interaction, and\n[\n9\n]\nexplores many possibilities for how they are linked, including aggressive verbal utterances signaling aggressive nonverbal reactions. In our results, changing the verbal frequency could help participants interpret the nonverbal feedback better and make it appear more clear and timely.\nH4:\nChanging the\nnonverbal\nfeedback cadence affects the participants’ view of the\nverbal\nfeedback\nWe have support for this hypothesis. Changing the robot’s\nnonverbal\nfeedback cadence affects the perception of the\nverbal\nfeedback’s timeliness (\np\n<\n0.05\n,\nF\n​\n(\n2\n,\n198\n)\n=\n4.36\np<0.05,F(2,198)=4.36\n). Participants preferred the\nmedium\nlevel of nonverbal feedback when thinking about the timeliness of verbal feedback. This also agrees with our finding in\nH2\nthat the\nmedium\nnonverbal cadence is preferred to the\nlow\nlevel.\nVI\nConclusion\nWe present a robot exercise coach with an exercise evaluator that provides both verbal and nonverbal feedback. We then introduce an online user study that explores how older adults perceive different cadence levels of the two feedback modalities by showing them videos with different combinations of feedback levels. The results support all our hypotheses for both main effects (changing the cadence of one modality affects the perception of it) and secondary effects (changing the cadence of one modality affects the perception of the other modality). Our results allow us to choose the feedback cadences that older adults prefer for this robot exercise coach.\nThe main limitation of our work is that the results are based on participants viewing a video of the robot giving feedback to another individual rather than experiencing the feedback themselves. People may have different perceptions of feedback when directed at themselves, so we will keep that in mind when generalizing these results to in-person interactions. Additionally, when people view the robot giving multi-modal feedback, they may not be fully aware of how it is affecting them. Qualitative comments in prior work indicated that some people were unaware of the effect of nonverbal feedback on their performance\n[\n6\n]\n. This highlights the differences between actual and perceived impact of feedback.\nIn this work, we do show that older adults have preferences for specific levels of verbal and nonverbal feedback, and we can use these results to better design the frequency of the robot’s feedback during the exercise coach session.\nACKNOWLEDGMENT\nThis work was funded by NSF Grant #2112633.\nReferences\n[1]\nM. Bani\n(2011-02)\nThe use and frequency of verbal and non-verbal praise in nurture groups\n.\nEmotional and Behavioural Difficulties\n16\n(\n1\n),\npp. 47–67\n(\nen\n).\nExternal Links:\nISSN 1363-2752, 1741-2692\n,\nDocument\nCited by:\n§I\n.\n[2]\nL. E. Bourne Jr, D. E. Guy, and N. Wadsworth\n(1967)\nVerbal-reinforcement combinations and the relative frequency of informative feedback in a card-sorting task.\n.\nJournal of Experimental Psychology\n73\n(\n2\n),\npp. 220\n.\nCited by:\n§II\n.\n[3]\nM. Choi, R. Kornfield, L. Takayama, and B. Mutlu\n(2017)\nMovement matters: effects of motion and mimicry on perception of similarity and closeness in robot-mediated communication\n.\nIn\nProceedings of the 2017 CHI conference on human factors in computing systems\n,\npp. 325–335\n.\nCited by:\n§II\n.\n[4]\nL. V. Creek and J. T. Watkins\n(1972)\nResponses to incongruent verbal and nonverbal emotional cues\n.\nJournal of Communication\n22\n(\n3\n),\npp. 311–316\n.\nCited by:\n§\nIII-D\n.\n[5]\nH. Ergül\n(2023)\nThe case for smiling? Nonverbal behavior and oral corrective feedback\n.\nJournal of Psycholinguistic Research\n52\n(\n1\n),\npp. 17–32\n.\nCited by:\n§II\n.\n[6]\nR. Kaushik and R. Simmons\n(2022)\nAffective Robot Behavior Improves Learning in a Sorting Game\n.\nIn\n2022 31st IEEE International Conference on Robot and Human Interactive Communication (RO-MAN)\n,\npp. 436–441\n.\nCited by:\n§VI\n.\n[7]\nR. Kaushik and R. Simmons\n(2024)\nEffects of Feedback Styles on Performance and Preference for an Exercise Coach\n.\nIn\n2024 33st IEEE International Conference on Robot and Human Interactive Communication (RO-MAN)\n,\nCited by:\n§I\n,\n§I\n,\n§\nIII-A\n,\n§\nIII-D\n.\n[8]\nM. Kyrarini, F. Lygerakis, A. Rajavenkatanarayanan, C. Sevastopoulos, H. R. Nambiappan, K. K. Chaitanya, A. R. Babu, J. Mathew, and F. Makedon\n(2021)\nA survey of robots in healthcare\n.\nTechnologies\n9\n(\n1\n),\npp. 8\n.\nCited by:\n§I\n.\n[9]\nO. I. Lovaas\n(1961)\nInteraction between verbal and nonverbal behavior\n.\nChild Development\n,\npp. 329–336\n.\nCited by:\n§V\n.\n[10]\nJ. C. Mora and W. M. Valencia\n(2018)\nExercise and older adults\n.\nClinics in geriatric medicine\n34\n(\n1\n),\npp. 145–162\n.\nCited by:\n§I\n.\n[11]\nS. Nikolaidis, M. Kwon, J. Forlizzi, and S. Srinivasa\n(2018)\nPlanning with verbal communication for human-robot collaboration\n.\nACM Transactions on Human-Robot Interaction (THRI)\n7\n(\n3\n),\npp. 1–21\n.\nCited by:\n§II\n.\n[12]\nT. Niznikowski, J. Sadowski, and A. Mastalerz\n(2013)\nThe effectiveness of different types of verbal feedback on learning complex movement tasks\n.\nHuman movement\n14\n(\n2\n),\npp. 148–153\n.\nCited by:\n§II\n.\n[13]\nA. M. Rosenthal-von der Pütten, N. C. Krämer, and J. Herrmann\n(2018)\nThe effects of humanlike and robot-specific affective nonverbal behavior on perception, emotion, and behavior\n.\nInternational Journal of Social Robotics\n10\n(\n5\n),\npp. 569–582\n.\nCited by:\n§II\n.\n[14]\nM. Salem, K. Rohlfing, S. Kopp, and F. Joublin\n(2011)\nA friendly gesture: Investigating the effect of multimodal robot behavior in human-robot interaction\n.\nIn\n2011 Ro-Man\n,\npp. 247–252\n.\nCited by:\n§II\n.\n[15]\nA. St. Clair and M. Mataric\n(2015)\nHow robot verbal feedback can improve team performance in human-robot task collaborations\n.\nIn\nProceedings of the tenth annual acm/ieee international conference on human-robot interaction\n,\npp. 213–220\n.\nCited by:\n§II\n.",
    "preview_text": "People can respond to feedback and guidance in different ways, and it is important for robots to personalize their interactions and utilize verbal and nonverbal communication cues. We aim to understand how older adults respond to different cadences of verbal and nonverbal feedback of a robot exercise coach. We conducted an online study of older adults, where participants evaluated videos of the robot giving feedback at different cadences for each modality. The results indicate that changing the cadence of one modality affects the perception of both it and the other modality. We can use the results from this study to better design the frequency of the robot coach's feedback during an exercise session with this population.\n\nOlder Adults’ Preferences for Feedback Cadence from an Exercise Coach Robot\nRoshni Kaushik\n1\nand Reid Simmons\n2\n1\nCarnegie Mellon University, Robotics Institute, Pittsburgh, PA,\nroshnika@andrew.cmu.edu\n2\nCarnegie Mellon University, Robotics Institute, Pittsburgh, PA,\nrsimmons@andrew.cmu.edu\nAbstract\nPeople can respond to feedback and guidance in different ways, and it is important for robots to personalize their interactions and utilize verbal and nonverbal communication cues. We aim to understand how older adults respond to different cadences of verbal and nonverbal feedback of a robot exercise coach. We conducted an online study of older adults, where participants evaluated videos of the robot giving feedback at different cadences for each modality. The results indicate that changing the cadence of one modality affects the perception of both it and the other modality. We can use the results from this study to better design the frequency of the robot coach’s feedback during an exercise session with this population.\nI\nIntroduction\nAs researchers try to create robots that integrate in a variety of domains, they explore how robots can move from controlled factories to more complex environments such as healthcare and education\n[\n8\n]\n. In these domains",
    "is_relevant": false,
    "relevance_score": 1.0,
    "extracted_keywords": [
        "❌ healthcare"
    ],
    "one_line_summary": "论文包含负面关键词「healthcare」，自动标记为不相关",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-13T18:53:58Z",
    "created_at": "2026-01-20T17:49:46.065055",
    "updated_at": "2026-01-20T17:49:46.065062"
}