{
    "id": "2601.07060v1",
    "title": "PALM: Progress-Aware Policy Learning via Affordance Reasoning for Long-Horizon Robotic Manipulation",
    "authors": [
        "Yuanzhe Liu",
        "Jingyuan Zhu",
        "Yuchen Mo",
        "Gen Li",
        "Xu Cao",
        "Jin Jin",
        "Yifan Shen",
        "Zhengyuan Li",
        "Tianjiao Yu",
        "Wenzhen Yuan",
        "Fangqiang Ding",
        "Ismini Lourentzou"
    ],
    "abstract": "视觉-语言-动作模型在机器人操作领域的最新进展展现出潜力，但其在处理长周期多步骤任务时仍面临挑战。现有方法缺乏能够识别任务相关交互线索或追踪子任务进度的内部推理机制，导致重复动作、步骤遗漏及过早终止等关键执行错误。为应对这些挑战，我们提出PALM框架——一种围绕交互核心可供性推理与子任务进度线索构建策略学习的VLA架构。该框架通过提炼互补的可供性表征，捕捉对象关联性、接触几何特征、空间布局及运动动态，为视觉运动控制提供任务相关的锚点。为进一步稳定长周期任务执行，PALM通过预测连续的子任务内部进度实现无缝子任务转换。在大量仿真与真实环境实验中，PALM始终优于基线方法：在LIBERO-LONG任务中达成91.8%成功率，在CALVIN ABC->D任务中平均执行长度提升12.5%，并在三种长周期泛化场景中实现真实世界基线方法两倍的性能提升。",
    "url": "https://arxiv.org/abs/2601.07060v1",
    "html_url": "https://arxiv.org/html/2601.07060v1",
    "html_content": "PALM: Progress-Aware Policy Learning via Affordance Reasoning for Long-Horizon Robotic Manipulation\nYuanzhe Liu\n1,2\nJingyuan Zhu\n1\nYuchen Mo\n2\nGen Li\n3\nXu Cao\n2\nJin Jin\n4\nYifan Shen\n2\nZhengyuan Li\n2\nTianjiao Yu\n2\nWenzhen Yuan\n2\nFangqiang Ding\n5\n​\n†\n{}^{5\\text{\\textdagger}}\nIsmini Lourentzou\n2\n​\n†\n{}^{2\\text{\\textdagger}}\n1\nUniversity of Pennsylvania\n2\nUniversity of Illinois Urbana-Champaign\n3\nNanyang Technological University\n4\nUniversity of Oxford\n5\nMassachusetts Institute of Technology\nAbstract\nRecent advancements in vision-language–action (VLA) models have shown promise in robotic manipulation, yet they continue to struggle with long-horizon, multi-step tasks. Existing methods lack internal reasoning mechanisms that can identify task-relevant interaction cues or track progress within a subtask, leading to critical execution errors such as repeated actions, missed steps, and premature termination. To address these challenges, we introduce\nPALM\n, a VLA framework that structures policy learning around interaction-centric affordance reasoning and subtask progress cues.\nPALM\ndistills complementary affordance representations that capture object relevance, contact geometry, spatial placements, and motion dynamics, and serve as task-relevant anchors for visuomotor control. To further stabilize long-horizon execution,\nPALM\npredicts continuous within-subtask progress, enabling seamless subtask transitions. Across extensive simulation and real-world experiments,\nPALM\nconsistently outperforms baselines, achieving a 91.8% success rate on LIBERO-LONG, a 12.5% improvement in average length on CALVIN ABCD, and a 2 improvement over real-world baselines across three long-horizon generalization settings.\nFigure 1\n:\nIn contrast to vanilla VLAs that directly map inputs to actions or to predictive methods that forecast dense future images,\nPALM\nintroduces learnable queries to forecast a structured set of future affordances. Conditioned on these affordances, a diffusion-based policy jointly decodes the robot’s action and a continuous progress value, enabling temporal state tracking and seamless subtask transitions in multi-step, long-horizon tasks. Our training strategy utilizes large-scale pre-training on both robot datasets (BridgeDataV2\n[\nkhazatsky2025droidlargescaleinthewildrobot\n]\n, DROID\n[\nwalke2024bridgedatav2datasetrobot\n]\n) and long-horizon video data (EPIC-KITCHENS\n[\ndamen2020epickitchensdatasetcollectionchallenges\n]\n, RoboCerebra\n[\nhan2025robocerebralargescalebenchmarklonghorizon\n]\n), followed by fine-tuning on our collected human-annotated affordance dataset. Consequently,\nPALM\nattains state-of-the-art performance on long-horizon simulation benchmarks (CALVIN ABCD\n[\nmees2022calvinbenchmarklanguageconditionedpolicy\n]\n, LIBERO-LONG\n[\nliu2023liberobenchmarkingknowledgetransfer\n]\n) and demonstrates strong results under real-world long-horizon generalization settings.\n1\nIntroduction\nRobot learning has made significant strides in developing generalizable policies for diverse tasks and environments\n[\nbharadhwaj2024gen2acthumanvideogeneration\n,\nbrohan2023rt1roboticstransformerrealworld\n,\ncheang2024gr2generativevideolanguageactionmodel\n,\ndriess2023palmeembodiedmultimodallanguage\n,\ndu2023videolanguageplanning\n,\nfu2024mobilealohalearningbimanual\n,\nhu2025datascalinglawsimitation\n,\nzawalski2025roboticcontrolembodiedchainofthought\n,\nmu2023embodiedgptvisionlanguagepretrainingembodied\n,\nshridhar2021cliportpathwaysroboticmanipulation\n,\nwen2024anypointtrajectorymodelingpolicy\n,\nwu2023unleashinglargescalevideogenerative\n,\nyang2024pushinglimitscrossembodimentlearning\n,\nzhang2025learningmanipulationskillsrobot\n]\n. Much of this progress is driven by Vision-Language-Action (VLA) models, which leverage pre-trained vision-language backbones to map visual observations and language instructions directly to robot actions\n[\nzhen20243dvla3dvisionlanguageactiongenerative\n,\noctomodelteam2024octoopensourcegeneralistrobot\n,\nkim2024openvlaopensourcevisionlanguageactionmodel\n,\nblack2024pi0visionlanguageactionflowmodel\n,\nintelligence2025pi05visionlanguageactionmodelopenworld\n,\nchi2024diffusionpolicyvisuomotorpolicy\n,\nli2025cogvlacognitionalignedvisionlanguageactionmodel\n,\nli2025coavlaimprovingvisionlanguageactionmodels\n,\nblack2023zeroshotroboticmanipulationpretrained\n,\nbrohan2023rt1roboticstransformerrealworld\n,\nbrohan2023rt2visionlanguageactionmodelstransfer\n,\nnasiriany2024rtaffordanceaffordancesversatileintermediate\n,\ngu2023rttrajectoryrobotictaskgeneralization\n,\nli2024visionlanguagefoundationmodelseffective\n,\nxiao2022maskedvisualpretrainingmotor\n,\nzeng2024learningmanipulationpredictinginteraction\n,\nreuss2024multimodaldiffusiontransformerlearning\n]\n.\nHowever, current VLA methods are fundamentally limited to short-horizon manipulation and struggle with long-horizon, multi-step planning in dynamic scenes. For example, on “clean a cluttered table,” state-of-the-art policies typically succeed initially but fail mid-task, unable to reliably complete the full sequence.\nA fundamental limitation is the absence of structured affordance cues\n[\nyuan2024robopointvisionlanguagemodelspatial\n,\nkuang2024ramretrievalbasedaffordancetransfer\n,\nsundaresan2023kitekeypointconditionedpoliciessemantic\n,\nhuang2024copageneralroboticmanipulation\n,\nhuang2024rekepspatiotemporalreasoningrelational\n]\nand explicit state tracking\n[\nchen2025sarmstageawarerewardmodeling\n,\nsun2025hypertasrhypernetworkdriventaskawarescene\n,\nkang2024incorporatingtaskprogressknowledge\n]\n. Although existing models\n[\nzhang2025upvlaunifiedunderstandingprediction\n,\nzhang2025dreamvlavisionlanguageactionmodeldreamed\n,\nhu2025videopredictionpolicygeneralist\n,\ntian2024predictiveinversedynamicsmodels\n,\nchen2025villaxenhancinglatentaction\n,\nzhao2025cotvlavisualchainofthoughtreasoning\n]\nmay infer the final goal and produce intermediate actions, they lack internal representations that disambiguate which object should be targeted next, which part or region is relevant for interaction, where items should be placed or moved, or what motion is appropriate for the upcoming step. Consequently, many visually similar states become ambiguous, obscuring the underlying task stage and destabilizing long-horizon control.\nIn addition, existing VLAs lack mechanisms for continuously estimating progress within a subtask. Without a persistent online notion of advancement, the policy cannot reliably decide whether to continue, switch stages, or terminate. This absence of temporal grounding leads to characteristic long-horizon failure modes: repeated or unnecessary actions, skipped required subtasks, premature termination, and even declaring success in incorrect states.\nTo address these gaps, we introduce\nPALM\n, a novel end-to-end framework for learning scalable, long-horizon manipulation. As illustrated in\nFig.\n1\n,\nPALM\nintegrates perception, action, and progress within a closed loop and is built around two complementary capabilities. First,\nPALM\npredicts structured future affordances encoded as latent queries, which are refined through a block-wise structured attention mechanism and specialize into four types, capturing object relevance (global), contact-level geometry (local), candidate placement regions (spatial), and plausible motion trajectories for the next interaction step (dynamic). These latents form a compact and task-relevant representation of the evolving scene state.\nSecond,\nPALM\nestimates fine-grained subtask progress through a continuous progress signal. Conditioned on both the affordance latents and the current multimodal context, the action policy employs a diffusion transformer to jointly predict action and progress sequences.\nBy combining structured affordance prediction with progress-aware action generation,\nPALM\nmaintains stable, coherent behavior across long, multi-step manipulation sequences.\nWe conduct large-scale pre-training on both robot datasets\n[\nkhazatsky2025droidlargescaleinthewildrobot\n,\nwalke2024bridgedatav2datasetrobot\n]\nand long-horizon video data\n[\ndamen2020epickitchensdatasetcollectionchallenges\n,\nhan2025robocerebralargescalebenchmarklonghorizon\n]\n, and then fine-tune the model on human-annotated robot trajectories. Through extensive experiments in both simulation and real-world settings,\nPALM\ndemonstrates clear and consistent gains in long-horizon manipulation. On two widely used long-horizon simulation benchmarks, it improves the success rate on CALVIN ABCD\n[\nmees2022calvinbenchmarklanguageconditionedpolicy\n]\nby 12.5% over prior state-of-the-art baselines and reaches 91.8% success on LIBERO-LONG\n[\nliu2023liberobenchmarkingknowledgetransfer\n]\n. Beyond simulation, we design three types of challenging real-world generalization tests for long-horizon scenarios that vary in localization, lighting, and visual distractors. Under all conditions,\nPALM\nconsistently demonstrates strong performance and robustness with limited fine-tuning data. Our contributions are as follows:\n•\nWe introduce\nPALM\n, a unified VLA framework that integrates structured affordance reasoning and progress-aware policy generation to enable reliable execution across long-horizon, contact-rich manipulation tasks.\n•\nWe propose two novel complementary modules: (1) a fine-grained affordance predictor that acts as an intermediate implicit reasoning step, producing structured and task-relevant representations, and (2) a progress-aware inverse-dynamics module that couples action generation with subtask progress estimation, ensuring temporally coherent execution over long action sequences.\n•\nWe conduct comprehensive evaluations both in simulation and the real world, achieving a 12.5% improvement on CALVIN ABCD over prior state-of-the-art, 91.8% success on LIBERO-LONG, and consistent gains across three real-world long-horizon generalization tests.\n2\nRelated Works\nVision-Language-Action Models.\nSeveral works repurpose pre-trained Vision-Language Models (VLMs) into VLA policies that map visual observations and language instructions to low-level robot actions\n[\nshridhar2021cliportpathwaysroboticmanipulation\n,\ndeng2025graspvlagraspingfoundationmodel\n,\nreed2022generalistagent\n,\nzhao2025vlasvisionlanguageactionmodelspeech\n,\nsong2025acceleratingvisionlanguageactionmodelintegrated\n,\nding2025quarvlavisionlanguageactionmodelquadruped\n,\nkaramcheti2023languagedrivenrepresentationlearningrobotics\n,\ndriess2023palmeembodiedmultimodallanguage\n,\ndu2023visionlanguagemodelssuccessdetectors\n]\nby fine-tuning on large-scale robotics datasets\n[\nembodimentcollaboration2025openxembodimentroboticlearning\n,\nebert2021bridgedataboostinggeneralization\n,\nkhazatsky2025droidlargescaleinthewildrobot\n]\n. A prominent paradigm, pioneered by the RT series\n[\nbrohan2023rt1roboticstransformerrealworld\n,\nbrohan2023rt2visionlanguageactionmodelstransfer\n,\nbelkhale2024rthactionhierarchiesusing\n]\n, formulates action generation as autoregressive prediction over tokenized sequences\n[\nblattmann2023stablevideodiffusionscaling\n,\nzhu2024visionmambaefficientvisual\n,\nniu2024llarvavisionactioninstructiontuning\n,\nli2025llarasuperchargingrobotlearning\n,\nkim2024openvlaopensourcevisionlanguageactionmodel\n]\n.\nIn parallel, diffusion-based action generators\n[\nchi2024diffusionpolicyvisuomotorpolicy\n,\nhou2025ditascalingdiffusiontransformer\n,\nliu2025rdt1bdiffusionfoundationmodel\n,\nke20243ddiffuseractorpolicy\n,\nze20243ddiffusionpolicygeneralizable\n]\ntreat control as a denoising process in continuous trajectory spaces, producing smoother temporal dynamics. Despite their success, both paradigms rely on direct action prediction, which lacks explicit reasoning and fine-grained representations of spatial or physical dynamics. Subsequent works address these limitations by incorporating future prediction through goal-image generation\n[\ndu2023learninguniversalpoliciestextguided\n,\nzawalski2025roboticcontrolembodiedchainofthought\n,\nzhen20243dvla3dvisionlanguageactiongenerative\n,\nnasiriany2024pivotiterativevisualprompting\n,\ngu2023rttrajectoryrobotictaskgeneralization\n,\nzhang2024pivotrprimitivedrivenwaypointawareworld\n,\nwen2024anypointtrajectorymodelingpolicy\n,\nhu2025videopredictionpolicygeneralist\n]\nor integrated forecasting\n[\ntian2024predictiveinversedynamicsmodels\n,\nzhang2025upvlaunifiedunderstandingprediction\n,\nzhao2025cotvlavisualchainofthoughtreasoning\n,\nyang2025gripperkeyposeobjectpointflow\n,\nzhu2025unifiedworldmodelscoupling\n,\nzhang2025reinbotamplifyingrobotvisuallanguage\n]\n, or by enhancing spatio-temporal grounding via keypoint prediction\n[\nyuan2024robopointvisionlanguagemodelspatial\n,\nhuang2024rekepspatiotemporalreasoningrelational\n]\nand historical visual traces\n[\nniu2024llarvavisionactioninstructiontuning\n]\n. In contrast, our work introduces a closed perception–action–progress loop that improves long-horizon manipulation by integrating affordance and subtask progress reasoning into the VLA.\nFigure 2\n:\nPALM\nOverview.\n(a) Model Architecture:\nGiven a language instruction\nl\nl\n, observation\no\nt\no_{t}\n, and robot state\ns\nt\ns_{t}\n,\nPALM\nencodes each modality using frozen encoders to obtain text, visual, and state tokens.\nThese tokens are fused by a GPT-style transformer with\nunidirectional attention\nand two specialized query sets:\nfine-grained affordance\nand\naction–progress\n.\nDuring training, affordance queries attend to context tokens to predict foresight\n𝐅\n^\nt\n+\nn\n\\hat{\\mathbf{F}}_{t+n}\nwith four supervised heads (\n<Global>\n,\n<Local>\n,\n<Spatial>\n,\n<Dynamic>\n) that ground future scene understanding.\nAt inference, the affordance heads are removed; the action–progress query attends to both context and affordance foresight to condition a diffusion transformer that predicts action\na\n^\nt\n:\nt\n+\nn\n−\n1\n\\hat{a}_{t:t+n-1}\nand progress\np\n^\nt\n:\nt\n+\nn\n−\n1\n\\hat{p}_{t:t+n-1}\ntrajectories for continuous control.\n(b) Structured Attention:\nAffordance subqueries attend only to shared context tokens to stay disentangled, while both query types use causal attention to preserve temporal consistency.\nImitation Learning with Progress Supervision.\nEarly imitation learning approaches for long-horizon tasks relied on explicit task decomposition, such as symbolic planning\n[\ngarrett2020pddlstreamintegratingsymbolicplanners\n,\njiang2019taskplanningroboticsempirical\n]\nor predefined visual keyframes\n[\nchanesane2021goalconditionedreinforcementlearningimagined\n,\npertsch2020keyframingfuturekeyframediscovery\n]\n.\nRecent works have shifted towards learning continuous progress representations directly from large-scale video data\n[\nnair2022r3muniversalvisualrepresentation\n,\nma2023livlanguageimagerepresentationsrewards\n,\nmajumdar2024searchartificialvisualcortex\n]\n. These learned progress metrics can be used to reweight behavior cloning\n[\nchen2020bailbestactionimitationlearning\n,\nsiegel2020doingworkedbehavioralmodelling\n,\nxu2022discriminatorweightedofflineimitationlearning\n]\n, assigning higher importance to demonstrations that yield greater progress.\nCompared to computationally expensive bootstrapping methods\n[\nxu2022discriminatorweightedofflineimitationlearning\n]\nor strategies that rely on a small, high-quality subset for data labeling\n[\nwu2019imitationlearningimperfectdemonstration\n,\nwang2023improvingbehaviouralcloningpositive\n]\n, this intrinsic progress weighting offers improved scalability and stability.\nOur approach augments the action space with a scalar progress indicator, which is used to supervise stage-wise policy learning for improved long-horizon manipulation consistency.\nAffordance Representations for Robotic Manipulation.\nRepresenting affordances is a core problem in robot learning. Early work generated structured visual outputs from sensor data, predicting affordances as heatmaps over interaction regions\n[\nbahl2023affordanceshumanvideosversatile\n,\nchen2023affordancegroundingdemonstrationvideo\n,\ngeng2022endtoendaffordancelearningrobotic\n,\nling2024articulatedobjectmanipulationcoarsetofine\n,\nmo2021where2actpixelsactionsarticulated\n,\nqian2024affordancellmgroundingaffordancevision\n,\nli2023locate\n,\nli2024one\n]\nor as bounding boxes and keypoints to localize relevant parts\n[\nhuang2024a3vlmactionablearticulationawarevision\n,\nhuang2024rekepspatiotemporalreasoningrelational\n,\nliu2024mokaopenworldroboticmanipulation\n,\nmanuelli2019kpamkeypointaffordancescategorylevel\n,\nqin2019ketolearningkeypointrepresentations\n,\nmo2021where2actpixelsactionsarticulated\n,\nli2025learning\n]\n. With VLMs, affordance reasoning became open-vocabulary, either via retrieval from knowledge bases\n[\nju2024roboabcaffordancegeneralizationcategories\n,\nkuang2024ramretrievalbasedaffordancetransfer\n]\nor via fine-tuning on affordance datasets\n[\nqian2024affordancellmgroundingaffordancevision\n,\nma2025glovergeneralizableopenvocabularyaffordance\n,\nma2025gloverunleashingpotentialaffordance\n]\n. Recent VLA models further integrate affordance into the policy loop by injecting visual interaction traces\n[\nzheng2025tracevlavisualtraceprompting\n]\n, predicting affordance plans\n[\nnasiriany2025rt\n]\n, or encoding affordance types into reasoning chains\n[\nli2025coavlaimprovingvisionlanguageactionmodels\n]\n. Our approach predicts multiple affordance types as structured latent tokens that provide implicit task-aware representations for progress estimation and subtask policy learning.\n3\nMethod\n3.1\nProblem Formulation\nLong-horizon, language-conditioned manipulation requires policies that remain temporally consistent across sub-tasks with heterogeneous dynamics.\nLet a robot operate over a distribution of tasks\n𝒯\n=\n{\nτ\nk\n}\nk\n=\n1\nK\n\\mathcal{T}\\!=\\!\\left\\{\\tau_{k}\\right\\}_{k=1}^{K}\n. Each task\nτ\n​\n𝒯\n\\tau\\in\\mathcal{T}\ndefines an observation–action distribution\np\n​\n(\no\nt\n,\na\nt\n​\nτ\n)\np\\left({o}_{t},{a}_{t}\\mid\\tau\\right)\nand an implicit temporal phase progression. Differences in background, lighting, object configuration, and viewpoint, compounded by cumulative control errors, alter the observation space. As a result, when sub-policies are trained in isolation, the terminal state of one often deviates from the expected start state of the next, leading to unstable transitions.\nConventional behavior cloning that directly fits\nπ\n​\n(\na\nt\n​\no\nt\n)\n\\pi\\left({a}_{t}\\mid{o}_{t}\\right)\non a mixture of demonstrations collapses these distinct phases, causing repetition or skipped subtasks during rollout.\nAs illustrated in\nFig.\n2\n,\nPALM\naddresses long-horizon stability through two tightly coupled components:\n\\lxSVG@picture\n1\n\\endlxSVG@picture\na fine-grained affordance prediction module\nthat anticipates future interaction cues by estimating an affordance-centric latent at future offsets\nt\n+\nn\nt+n\n,\nf\naff\n:\n𝒪\n​\n𝒯\n​\nℱ\nf_{\\mathrm{aff}}\\!:\\!\\mathcal{O}\\!\\times\\mathcal{T}\\!\\rightarrow\\!\\mathcal{F}\n, serving as a task-relevant intermediate representation that stabilizes perception (§\n3.3\n), and\n\\lxSVG@picture\n2\n\\endlxSVG@picture\na progress-aware policy\nπ\n:\n𝒪\n​\n𝒯\n​\n𝒜\n~\n\\pi\\!:\\!\\mathcal{O}\\!\\times\\!\\mathcal{T}\\!\\rightarrow\\!\\tilde{\\mathcal{A}}\n,\n𝒜\n~\n=\n𝒜\n​\n𝒫\n\\tilde{\\mathcal{A}}\\!=\\!\\mathcal{A}\\!\\times\\!\\mathcal{P}\n, where\n𝒫\n​\n[\n0\n,\n1\n]\n\\mathcal{P}\\subset[0,1]\nis a continuous progress space.\nAt time\nt\nt\n, given observations\no\nt\n​\n𝒪\n{o}_{t}\\!\\in\\!\\mathcal{O}\n, and task specification\nτ\n​\n𝒯\n\\tau\\!\\in\\!\\mathcal{T}\n, and conditioned on the predicted affordance latent, the policy jointly decodes an action\na\nt\n​\n𝒜\n{a}_{t}\\!\\in\\!\\mathcal{A}\nalongside a scalar\np\nt\n​\n𝒫\np_{t}\\!\\in\\!\\mathcal{P}\nthat encodes progress within the current subtask and serves as a temporal regularizer that mitigates phase ambiguity and enables smooth subtask transitions without relying on separate planners or hierarchical controllers (§\n3.4\n).\n3.2\nPALM\nArchitecture\nMulti-Modal Encoders.\nPALM\nprocesses three synchronized inputs: a language instruction\nl\nl\n, an image observation\no\nt\no_{t}\n, and a robot state\ns\nt\ns_{t}\n. Instructions are embedded using a CLIP text encoder\n[\nradford2021learningtransferablevisualmodels\n]\n, observations are encoded with a Masked Autoencoder\n[\nhe2021maskedautoencodersscalablevision\n]\nand downsampled by a Perceiver Resampler\n[\njaegle2021perceivergeneralperceptioniterative\n]\nto retain task-relevant visual tokens. The robot state is projected through a lightweight MLP. The resulting tokens are concatenated into a single sequence with time index\nt\nt\nto form a unified multimodal sequence passed to the transformer backbone.\nBackbone and Learnable Queries.\nThe backbone follows a GPT-2-style transformer\n[\nradford2019language\n]\nto integrate the token sequence with causal and cross-modal attention.\nOn top of this backbone,\nPALM\nintroduces two learnable query sets that instantiate the affordance and progress-aware policy components:\nFine-grained affordance queries\ncomprise four subqueries\n<Global>\n,\n<Local>\n,\n<Spatial>\n, and\n<Dynamic>\n, that attend over language, vision, and state tokens to extract task-relevant representation at complementary scales and produce the affordance-centric latent\n𝐅\n^\nt\n+\nn\n=\nf\naff\n​\n(\nl\n,\no\nt\n,\ns\nt\n)\n​\nℱ\n.\n\\hat{\\mathbf{F}}_{t+n}=f_{\\mathrm{aff}}\\!\\left(l,o_{t},s_{t}\\right)\\in\\mathcal{F}.\n(1)\nAction–progress queries\npool control-relevant context and condition on\n𝐅\n^\nt\n+\nn\n\\hat{\\mathbf{F}}_{t+n}\nto support progress-aware inverse-dynamics decoding for temporally consistent long-horizon control.\nBuilding on prior inverse-dynamics formulations\n[\nchen2025villaxenhancinglatentaction\n,\ntian2024predictiveinversedynamicsmodels\n,\nhu2025videopredictionpolicygeneralist\n]\n, these queries aggregate current observations with the predicted affordance latent to infer action sequences that align with the forecasted interaction state.\nDecoders.\nThe action head is a denoising diffusion transformer\n[\npeebles2023scalablediffusionmodelstransformers\n]\nthat conditions on the action–progress queries and the affordance latent to generate a horizon-\nn\nn\ntrajectory:\n(\na\n^\nt\n:\nt\n+\nn\n−\n1\n,\np\n^\nt\n:\nt\n+\nn\n−\n1\n)\n=\nDiT\n⁡\n(\nl\n,\no\nt\n,\ns\nt\n,\n𝐅\n^\nt\n+\nn\n)\n,\n(\\hat{a}_{t:t+n-1},\\hat{p}_{t:t+n-1})\\ =\\operatorname{DiT}\\!\\left(l,o_{t},s_{t},\\hat{\\mathbf{F}}_{t+n}\\right),\n(2)\nwhere\na\n^\nt\n:\nt\n+\nn\n−\n1\n\\hat{{a}}_{t:t+n-1}\nis the predicted action sequence and\np\n^\nt\n:\nt\n+\nn\n−\n1\n\\hat{p}_{t:t+n-1}\nthe predicted sequence of scalar progress values at each step. Details can be found in the supplementary material.\n3.3\nFine-Grained Affordance Prediction\nGlobal Prediction.\nGlobal affordance provides a high-level semantic prior that identifies\nwhich\nobject in the scene is relevant to the instruction and\nwhere\nit is located.\nGiven a command such as “pick up the cup,” the model parses the referent (\ni.e\n.\n, the instruction-specified object) at time\nt\nt\nand predicts, for a future offset\nt\n+\nn\nt\\!+\\!n\n, an object-centric prior that marks the referred instance and its approximate region.\nThis global prior anchors all subsequent affordance cues and constrains local reasoning to the correct region of interest.\nTargets are obtained by first resolving the referent via Grounding DINO\n[\nliu2024groundingdinomarryingdino\n]\nand then segmenting the instance with SAM\n[\nkirillov2023segment\n]\nto obtain a binary mask on the observation lattice. An object representation is further extracted by masked pooling over a frozen image encoder within this region. During training, the predicted future mask and object feature are supervised against these targets. The training objective for global affordance tokens is then formulated as:\nℒ\nglobal\n\\displaystyle\\mathcal{L}_{\\text{global}}\n=\nℒ\nFL\n​\n(\nℳ\nt\n+\nn\nglobal\n,\nℳ\n^\nt\n+\nn\nglobal\n)\n\\displaystyle=\\mathcal{L}_{\\text{FL}}\\!\\left(\\mathcal{M}_{t+n}^{\\text{global}},\\,\\hat{\\mathcal{M}}_{t+n}^{\\text{global}}\\right)\n(3)\n+\nℒ\nDice\n​\n(\nℳ\nt\n+\nn\nglobal\n,\nℳ\n^\nt\n+\nn\nglobal\n)\n\\displaystyle\\quad+\\mathcal{L}_{\\text{Dice}}\\!\\left(\\mathcal{M}_{t+n}^{\\text{global}},\\,\\hat{\\mathcal{M}}_{t+n}^{\\text{global}}\\right)\nwhere\nℳ\n^\nt\n+\nn\nglobal\n=\nf\nglobal\n​\n(\nl\n,\no\nt\n,\ns\nt\n)\n\\hat{\\mathcal{M}}_{t+n}^{\\text{global}}\\!=\\!f_{\\text{global}}\\left(l,o_{t},s_{t}\\right)\ndenotes the predicted global affordance mask at time\nt\n+\nn\nt\\!+\\!n\n, and\nℳ\nt\n+\nn\nglobal\n\\mathcal{M}_{t+n}^{\\text{global }}\nis the corresponding binary target mask on the image (observation) lattice. Here,\nℒ\nFL\n\\mathcal{L}_{\\text{FL}}\ndenotes the pixel-wise focal loss computed over image domain\nΩ\n\\Omega\n, and\nℒ\nDice\n\\mathcal{L}_{\\text{Dice }}\ndenotes the soft Dice loss.\nLocal Prediction.\nLocal affordance captures fine-grained geometric localization affordance cues necessary for precise contact reasoning. Conditioned on the region highlighted by the global prior, it analyzes high-frequency local visual structure, such as edges, textures, and part geometry, to predict, at time\nt\n+\nn\nt\\!+\\!n\n, a dense contact-likelihood distribution over the object of interest. Following GLOVER++\n[\nma2025gloverunleashingpotentialaffordance\n]\n, annotated contact points are converted into Gaussian heatmaps that serve as continuous supervision targets. The model is trained to match this target heatmap distribution.\nThe training objective for local affordance tokens is thus formulated as:\nℒ\nlocal\n\\displaystyle\\mathcal{L}_{\\text{local}}\n=\nℒ\nFL\n​\n(\nℳ\nt\n+\nn\nlocal\n,\nℳ\n^\nt\n+\nn\nlocal\n)\n\\displaystyle=\\mathcal{L}_{\\text{FL}}\\!\\left(\\mathcal{M}_{t+n}^{\\text{local}},\\,\\hat{\\mathcal{M}}_{t+n}^{\\text{local}}\\right)\n(4)\n+\nℒ\nKL\n​\n(\nℳ\n~\nt\n+\nn\nlocal\n,\nℳ\n^\n~\nt\n+\nn\nlocal\n)\n,\n\\displaystyle\\quad+\\mathcal{L}_{\\text{KL}}\\!\\left(\\tilde{\\mathcal{M}}_{t+n}^{\\text{local}},\\,\\tilde{\\hat{\\mathcal{M}}}_{t+n}^{\\text{local}}\\right),\nℳ\n~\n=\nℳ\n\\slimits@\n(\ni\n,\nj\n)\n​\nΩ\n​\nℳ\n(\ni\n,\nj\n)\n+\nε\n,\n\\tilde{\\mathcal{M}}=\\frac{\\mathcal{M}}{\\tsum\\slimits@_{(i,j)\\in\\Omega}\\mathcal{M}^{(i,j)}+\\varepsilon},\n(5)\nwhere\nℳ\n^\nt\n+\nn\nlocal\n=\nf\nlocal\n​\n(\nl\n,\no\nt\n,\ns\nt\n)\n\\hat{\\mathcal{M}}_{t+n}^{\\text{local }}\\!=\\!f_{\\text{local }}\\left(l,o_{t},s_{t}\\right)\nis the predicted future local contact-likelihood map at\nt\n+\nn\n,\nℳ\nt\n+\nn\nlocal\nt\\!+\\!n,\\mathcal{M}_{t+n}^{\\text{local }}\nis the soft Gaussian target heatmap, and\nℳ\n~\n\\tilde{\\mathcal{M}}\ndenotes the\nℓ\n1\n\\ell_{1}\n-normalized map used in the KL term with a small\nε\n>\n0\n\\varepsilon>0\n.\nSpatial Prediction.\nSpatial affordance converts underspecified spatial language into executable placement proposals that remain robust under layout changes.\nInstead of memorizing a single coordinate, the model predicts a small set of candidate placement points at time\nt\n+\nn\nt\\!+\\!n\n, each representing a plausible region for placing the object.\nGround-truth targets are obtained by first converting the instruction into spatial semantics using SpatialVLM\n[\nchen2024spatialvlmendowingvisionlanguagemodels\n]\nand then sampling executable 2D coordinates with RoboPoint\n[\nyuan2024robopointvisionlanguagemodelspatial\n]\n.\nThe training objective minimizes a set-matching objective that aligns each target point with its closest predicted candidate:\nℒ\nspatial\n=\n1\nC\nt\n+\nn\n​\n\\slimits@\nc\n=\n1\nC\nt\n+\nn\n​\nmin\n1\n​\nm\n​\nM\n⁡\n\\|\n​\n𝐩\n^\nt\n+\nn\n(\nm\n)\n−\n𝐩\nt\n+\nn\n(\nc\n)\n​\n\\|\n2\n2\n\\mathcal{L}_{\\text{spatial}}=\\frac{1}{C_{t+n}}\\tsum\\slimits@_{c=1}^{C_{t+n}}\\min_{1\\leq m\\leq M}\\left\\|\\hat{\\mathbf{p}}_{t+n}^{(m)}-\\mathbf{p}_{t+n}^{(c)}\\right\\|_{2}^{2}\n(6)\nwhere\n𝒮\n^\nt\n+\nn\n=\n{\n𝐩\n^\nt\n+\nn\n(\nm\n)\n}\nm\n=\n1\nM\n\\hat{\\mathcal{S}}_{t+n}\\!=\\!\\{\\hat{\\mathbf{p}}_{t+n}^{(m)}\\}_{m=1}^{M}\nand\n𝒮\nt\n+\nn\n=\n{\n𝐩\nt\n+\nn\n(\nc\n)\n}\nc\n=\n1\nC\nt\n+\nn\n\\mathcal{S}_{t+n}\\!=\\!\\{{\\mathbf{p}}_{t+n}^{(c)}\\}_{c=1}^{C_{t+n}}\nare the set of\nM\nM\npredicted normalized 2D candidates and\nC\nt\n+\nn\nC_{t+n}\ntarget placement points at\nt\n+\nn\nt\\!+\\!n\n, respectively.\nDynamic Prediction.\nDynamic affordance identifies the pixels corresponding to the robot gripper and movable objects, and predicts how these regions will evolve over time. Its goal is to predict and establish the statistical associations among the current scene, the language instruction, and the actions required to realize the predicted motion.\nTo construct supervision, we apply a grid-based tracking protocol: an\nN\n​\nN\nN\\!\\times\\!N\nvisual grid of query points is placed on the first frame of a short history at\nt\n−\nδ\nt-\\delta\n. CoTracker\n[\nkaraev2024cotrackerbettertrack\n]\nfollows each point forward in time. We compute cumulative displacement for each trajectory and retain those that exceed a threshold, ensuring that the dynamic mask captures genuine motion rather than static background or tracker jitter. The selected trajectories are then rasterized at\nt\n+\nn\nt\\!+\\!n\ninto a dynamic region. Given inputs at time\nt\nt\n, the model predicts a future dynamic probability map that highlights pixels likely to belong to the gripper or other moving objects at\nt\n+\nn\nt\\!+\\!n\n. Training encourages calibrated per-pixel probabilities and alignment with the tracked motion regions. The training objective for dynamic affordance tokens is formulated as a masked reconstruction loss using a latent-variable model:\nℒ\ndynamic\n=\n𝔼\n𝐳\n​\nQ\nϕ\n​\n(\n𝐳\n​\nx\nt\n+\nn\nℳ\n)\n​\n[\n−\nlog\n⁡\nP\nψ\n​\n(\nx\nt\n+\nn\nℳ\n​\n𝐳\n)\n]\n+\nβ\n​\nKL\n⁡\n(\nQ\nϕ\n​\n(\n𝐳\n​\nx\nt\n+\nn\nℳ\n)\n​\n\\|\n​\np\n​\n(\n𝐳\n)\n)\n\\begin{split}\\mathcal{L}_{\\text{dynamic}}=\\mathbb{E}_{\\mathbf{z}\\sim Q_{\\phi}\\!\\left(\\mathbf{z}\\mid x_{t+n}^{\\mathcal{M}}\\right)}\\!\\left[-\\log P_{\\psi}\\!\\left(x_{t+n}^{\\mathcal{M}}\\mid\\mathbf{z}\\right)\\right]\\\\\n\\qquad+\\beta\\operatorname{KL}\\!\\Big(Q_{\\phi}\\!\\left(\\mathbf{z}\\mid x_{t+n}^{\\mathcal{M}}\\right)\\,\\|\\,p(\\mathbf{z})\\Big)\\end{split}\n(7)\nwhere\nℳ\nt\n+\nn\n\\mathcal{M}_{t+n}\nis the dynamic region mask from tracking,\nx\nt\n+\nn\nℳ\nx_{t+n}^{\\mathcal{M}}\nis the future frame restricted to those masked pixels,\nQ\nϕ\n​\n(\n𝐳\n​\nx\nt\n+\nn\nℳ\n)\nQ_{\\phi}(\\mathbf{z}\\mid x_{t+n}^{\\mathcal{M}})\nis the posterior,\nP\nψ\n​\n(\nx\nt\n+\nn\nℳ\n​\n𝐳\n)\nP_{\\psi}(x_{t+n}^{\\mathcal{M}}\\mid\\mathbf{z})\nthe decoder likelihood,\np\n​\n(\n𝐳\n)\np(\\mathbf{z})\nthe prior, and\nβ\n\\beta\nthe KL weight.\n3.4\nProgress-aware Policy via Inverse Dynamics\nIn addition to predicting where to act via affordances, we introduce a progress-aware prediction task that estimates how far execution has advanced within the current subtask. At each time step\nPALM\nfirst infers the active subtask stage from the affordance latent and derives a stage embedding. Conditioned on this embedding, the model predicts a scalar\np\nt\n​\n[\n0\n,\n1\n]\np_{t}\\in[0,1]\nthat quantifies within-stage completion.\nWe append this scalar to the action output so the policy jointly predicts\n(\na\nt\n,\np\nt\n)\n\\left(a_{t},p_{t}\\right)\nunder a shared multimodal context. This explicit progress signal reduces ambiguity in long-horizon control: visually similar observations may correspond to different actions depending on stage, and\np\nt\np_{t}\ndisambiguates these cases by providing a continuous indicator of “where we are”, stabilizing learning and execution by encouraging monotonic, stage-consistent evolution of the latent state and by smoothing transitions at sub-policy boundaries without relying on separate high-level controllers.\nClassical inverse dynamics predicts the action\na\n^\nt\n\\hat{a}_{t}\nbridging two temporally ordered observations\n(\no\nt\n,\no\nt\n+\n1\n)\n(o_{t},o_{t+1})\n. We extend this to predict an\nn\nn\n-step action–progress sequence conditioned on the current inputs and a single-step affordance latent. We instantiate\nf\ninv\nf_{\\mathrm{inv}}\nas a denoising diffusion transformer that conditions on the current observation\no\nt\no_{t}\n, the instruction\nl\nl\n, the robot state\ns\nt\ns_{t}\n, and the predicted affordance latent\n𝐅\n^\nt\n+\nn\n=\nf\naff\n​\n(\nl\n,\no\nt\n,\ns\nt\n)\n\\hat{\\mathbf{F}}_{t+n}\\!=\\!f_{\\mathrm{aff}}(l,o_{t},s_{t})\nto generate\n(\na\n^\nt\n:\nt\n+\nn\n−\n1\n,\np\n^\nt\n:\nt\n+\nn\n−\n1\n)\n=\nf\ninv\n​\n(\nl\n,\no\nt\n,\ns\nt\n,\n𝐅\n^\nt\n+\nn\n)\n.\n\\left(\\hat{a}_{t:t+n-1},\\,\\hat{p}_{t:t+n-1}\\right)=f_{\\mathrm{inv}}\\!\\left(l,o_{t},s_{t},\\hat{\\mathbf{F}}_{t+n}\\right).\n(8)\nThe DiT head jointly models action distributions and progress values, capturing correlations among these cross-modal inputs across the trajectory. Training follows the standard diffusion objective:\n𝐲\n~\nt\n:\nt\n+\nn\n−\n1\n,\nt\nd\n=\nα\n¯\nt\nd\n​\n𝐲\nt\n:\nt\n+\nn\n−\n1\n+\n1\n−\nα\n¯\nt\nd\n​\nϵ\n\\tilde{\\mathbf{y}}_{t:t+n-1,t_{d}}=\\sqrt{\\bar{\\alpha}_{t_{d}}}\\,\\mathbf{y}_{t:t+n-1}+\\sqrt{1-\\bar{\\alpha}_{t_{d}}}\\,\\boldsymbol{\\epsilon}\n(9)\nℒ\nDiT\n=\n𝔼\nt\nd\n,\nϵ\n\\|\nϵ\n−\nϵ\nθ\n(\n𝐲\n~\nt\n:\nt\n+\nn\n−\n1\n,\nt\nd\n|\nl\n,\no\nt\n,\ns\nt\n,\n𝐅\n^\nt\n+\nn\n,\nt\nd\n)\n\\|\n2\n2\n\\mathcal{L}_{\\text{DiT}}=\\mathbb{E}_{t_{d},\\,\\boldsymbol{\\epsilon}}\\big\\|\\boldsymbol{\\epsilon}-\\epsilon_{\\theta}\\!\\left(\\tilde{\\mathbf{y}}_{t:t+n-1,t_{d}}\\,\\middle|\\,l,o_{t},s_{t},\\hat{\\mathbf{F}}_{t+n},t_{d}\\right)\\big\\|_{2}^{2}\n(10)\nwhere\n𝐲\nt\n:\nt\n+\nn\n−\n1\n\\mathbf{y}_{t:t+n-1}\nis the target action–progress vector over steps\nt\nt\nto\nt\n+\nn\n−\n1\nt{+}n{-}1\n,\nϵ\n​\n𝒩\n​\n(\n𝟎\n,\n𝐈\n)\n\\boldsymbol{\\epsilon}\\sim\\mathcal{N}(\\mathbf{0},\\mathbf{I})\nis Gaussian noise,\nt\nd\nt_{d}\nis the diffusion time with\nα\n¯\nt\nd\n\\bar{\\alpha}_{t_{d}}\nthe cumulative noise schedule,\n𝐲\n~\nt\n:\nt\n+\nn\n−\n1\n,\nt\nd\n\\tilde{\\mathbf{y}}_{t:t+n-1,t_{d}}\nis the noised target, and\nϵ\nθ\n​\n(\n)\n\\epsilon_{\\theta}(\\cdot)\nis the noise predictor.\nTable 1\n:\nCALVIN ABCD experimental results.\nWe group the baselines into four types and report the average success rate of the top three checkpoints, computed over 1,000 rollouts per task, as well as the average number of consecutively completed tasks to solve 5 instructions (Avg. Len.). PALM consistently and substantially outperforms all baselines. Best results are shown in\nbold\n.\nMethod\nType\nTask completed in a row\n1\n2\n3\n4\n5\nAvg. Len.\n\\uparrow\n\\uparrow\nRT-1\n[\nbrohan2023rt1roboticstransformerrealworld\n]\nAutoregressive\n53.3%\n22.2%\n9.40%\n3.80%\n1.30%\n0.90\nRobo-Flamingo\n[\nli2024visionlanguagefoundationmodelseffective\n]\nAutoregressive\n82.4%\n61.9%\n46.6%\n33.1%\n23.5%\n2.47\nOpenVLA\n[\nkim2024openvlaopensourcevisionlanguageactionmodel\n]\nAutoregressive\n91.3%\n77.8%\n62.0%\n52.1%\n43.5%\n3.27\nDiffusion Policy\n[\nchi2024diffusionpolicyvisuomotorpolicy\n]\nDiffusion-based\n40.2%\n12.3%\n2.60%\n0.80%\n0.00%\n0.56\nπ\n0\n\\pi_{0}\n[\nblack2024pi0visionlanguageactionflowmodel\n]\nDiffusion-based\n93.8%\n85.0%\n76.7%\n68.1%\n59.9%\n3.92\n3D-VLA\n[\nzhen20243dvla3dvisionlanguageactiongenerative\n]\n3D-Aware\n44.7%\n16.3%\n8.10%\n1.60%\n0.00%\n0.71\n3D Diffuser Actor\n[\nke20243ddiffuseractorpolicy\n]\n3D-Aware\n92.2%\n78.7%\n63.9%\n51.2%\n41.2%\n3.27\nRoboUniview\n[\nliu2024robouniviewvisuallanguagemodelunified\n]\n3D-Aware\n94.2%\n84.2%\n73.4%\n62.2%\n50.7%\n3.65\nSusie\n[\nblack2023zeroshotroboticmanipulationpretrained\n]\nPrediction\n87.0%\n69.0%\n49.0%\n38.0%\n26.0%\n2.69\nGR-1\n[\nwu2023unleashinglargescalevideogenerative\n]\nPrediction\n85.4%\n71.2%\n59.6%\n49.7%\n40.1%\n3.06\nSeer\n[\ntian2024predictiveinversedynamicsmodels\n]\nPrediction\n94.4%\n87.2%\n79.9%\n72.2%\n64.3%\n3.98\nPALM\n(\n✗\nprogress)\nPrediction\n95.3%\n85.6%\n79.5%\n74.3%\n67.0%\n4.02\nPALM\nPrediction + Progress\n96.9%\n93.8%\n89.3%\n85.9%\n82.0%\n4.48\n4\nExperiments\nTraining Details.\nOur training process consists of a pre-training and a fine-tuning stage. For pre-training, we utilize a mixed dataset from the DROID\n[\nkhazatsky2025droidlargescaleinthewildrobot\n]\nand BridgeData V2\n[\nwalke2024bridgedatav2datasetrobot\n]\ndatasets, which together provide large-scale, in-the-wild robotic arm demonstrations to build a foundational understanding of diverse real-world tasks, and EPIC-KITCHENS\n[\ndamen2020epickitchensdatasetcollectionchallenges\n]\nand RoboCerebra\n[\nhan2025robocerebralargescalebenchmarklonghorizon\n]\n, which provide fine-grained sub-steps and time-segment annotations to supervise the learning of semantic progress estimation in long-horizon, contact-rich scenarios. For fine-tuning, we select 942 trajectories from robot data and annotate them with affordance data and continuous progress labels using a semi-automated method. Details can be found in the supplementary material.\n4.1\nSimulation Experiments\nBenchmarks.\nWe conduct evaluations across two simulation benchmarks: the\nLIBERO\n[\nliu2023liberobenchmarkingknowledgetransfer\n]\nbenchmark comprising\nfour distinct task suites (Spatial, Object, Goal, Long), each with 10 tasks and 50 demonstrations for evaluating the robot’s comprehension of spatial relationships, and the\nCALVIN\n[\nmees2022calvinbenchmarklanguageconditionedpolicy\n]\nbenchmark, designed to evaluate the instruction-following capabilities of robotic policies on long-horizon language-conditioned tasks, comprising 34 tasks across four distinct environments. We focus on the challenging ABCD setting, where we pre-train in the ABC environments and evaluate in the unseen D environment.\nTable 2\n:\nLIBERO experimental results.\nFor each task suite (Spatial, Object, Goal, Long), we report the average success rate and standard error across\n3\n3\nseeds with\n500\n500\nepisodes each. PALM achieves the best performance over previous methods. Best results in\nbold\n.\nAverage (\n\\uparrow\n\\uparrow\n)\nSpatial (\n\\uparrow\n\\uparrow\n)\nObject (\n\\uparrow\n\\uparrow\n)\nGoal (\n\\uparrow\n\\uparrow\n)\nLong (\n\\uparrow\n\\uparrow\n)\nOpenVLA\n[\nkim2024openvlaopensourcevisionlanguageactionmodel\n]\n76.5  0.6%\n84.7  0.9%\n88.4  0.8%\n79.2  1.0%\n53.7  1.3%\nDiffusion Policy\n[\nchi2024diffusionpolicyvisuomotorpolicy\n]\n72.4  0.7%\n78.3  1.1%\n92.5  0.7%\n68.3  1.2%\n50.5  1.3%\nOcto fine-tuned\n[\noctomodelteam2024octoopensourcegeneralistrobot\n]\n75.1  0.6%\n78.9  1.0%\n85.7  0.9%\n84.6  0.9%\n51.1  1.3%\nSpatialVLA\n[\nqu2025spatialvlaexploringspatialrepresentations\n]\n69.0  1.2%\n88.2  0.7%\n89.9  1.3%\n78.6  0.9%\n55.5  1.5%\nCoT-VLA\n[\nzhao2025cotvlavisualchainofthoughtreasoning\n]\n81.1  0.6 %\n87.5  1.4%\n91.6  0.5%\n87.6  0.6%\n69.0  0.8%\nTraceVLA\n[\nzheng2025tracevlavisualtraceprompting\n]\n74.8  0.9%\n84.6  1.0%\n85.2  0.6%\n75.1  1.4%\n54.1  1.0%\nCoA-VLA\n[\nli2025coavlaimprovingvisionlanguageactionmodels\n]\n79.8  0.5%\n85.3  0.9%\n93.1  1.0%\n85.8  0.9%\n55.0  1.2%\nPALM\n94.5  1.0%\n95.2  1.2 %\n96.7  0.7%\n94.3  1.6%\n91.8  0.8%\nBaselines.\nWe compare\nPALM\nwith four types of baselines: autoregressive methods, diffusion-based methods, 3D-aware methods and prediction methods. For the CALVIN ABCD benchmark, we compare to RT-1\n[\nbrohan2023rt1roboticstransformerrealworld\n]\n, Robo-Flamingo\n[\nli2024visionlanguagefoundationmodelseffective\n]\n, and OpenVLA\n[\nkim2024openvlaopensourcevisionlanguageactionmodel\n]\n, which are autoregressive action models that generate actions from pre-trained VLMs. Diffusion Policy\n[\nchi2024diffusionpolicyvisuomotorpolicy\n]\nand\nπ\n0\n\\pi_{0}\n[\nblack2024pi0visionlanguageactionflowmodel\n]\nare selected as representative diffusion-based methods that use a denoising diffusion process to model high-dimensional action distributions, while 3D-VLA\n[\nzhen20243dvla3dvisionlanguageactiongenerative\n]\n, 3D Diffuser Actor\n[\nke20243ddiffuseractorpolicy\n]\n, and RoboUniview\n[\nliu2024robouniviewvisuallanguagemodelunified\n]\nspecialize in capturing 3D-aware representations to enhance manipulation. Prediction-based methods, represented by Susie\n[\nblack2023zeroshotroboticmanipulationpretrained\n]\n, GR-1\n[\nwu2023unleashinglargescalevideogenerative\n]\n, and Seer\n[\ntian2024predictiveinversedynamicsmodels\n]\n, merge visual foresight as a future representation to enhance performance in multi-task robot manipulation. For LIBERO, we compare with OpenVLA, Diffusion Policy, and Seer. Additionally, we compare against Octo\n[\noctomodelteam2024octoopensourcegeneralistrobot\n]\n, which pre-trains robot policies on diverse datasets to enhance generalization. SpatialVLA\n[\nqu2025spatialvlaexploringspatialrepresentations\n]\n, CoT-VLA\n[\nzhao2025cotvlavisualchainofthoughtreasoning\n]\n, TraceVLA\n[\nzheng2025tracevlavisualtraceprompting\n]\n, and CoA-VLA\n[\nli2025coavlaimprovingvisionlanguageactionmodels\n]\nare included to compare diverse task representation methods.\nResults.\nTable\n1\nsummarizes performance on the CALVIN ABCD long-horizon benchmark, demonstrating that\nPALM\nachieves state-of-the-art results across all metrics and outperforms all baselines. First,\nPALM\n(Prediction + Progress) reaches a 96.9% success rate on the first subtask and maintains strong performance as horizon length increases (\ne.g\n.\n, 82.0% for five consecutive subtasks). This is a +17.7% absolute improvement over the strongest prior baseline (Seer at 64.3%)\nat the 5-task horizon.\nPALM\nalso yields the longest average task trajectory (4.48), exceeding Seer (3.98) and\nπ\n0\n\\pi_{0}\n(3.92), indicating significantly more stable execution over extended sequences.\nImportantly, results confirm that the progress-aware policy is critical for long-horizon generalization, as removing the progress prediction (\nPALM\n✗\nprogress) reduces performance consistently across horizons (\ne.g\n.\n, average length 4.02  4.48).\nMoreover, as shown in\nTable\n2\n, across all four LIBERO suites,\nPALM\nachieves state-of-the-art performance with an average success rate of 94.5%. The largest gain is in LIBERO-LONG, where\nPALM\nreaches 91.8%, outperforming the strongest baseline (CoT-VLA at 69.0%) by 22.8%.\n4.2\nAblation Studies\nFigure 3\n:\nAblation studies of affordance components.\non CALVIN ABCD and LIBERO-LONG benchmarks demonstrate the effectiveness of the four components of affordance prediction.\nHow do the components of the fine-grained affordance module affect performance?\nWe evaluate the four types of predictable affordance latents:\nGlobal\n,\nLocal\n,\nSpatial\n, and\nDynamic\nto measure their respective contributions. We train models by cumulatively adding these affordances to a vanilla VLA. As illustrated in\nFigure\n3\n, adding Global affordance (G) already yields a consistent improvement on both CALVIN and LIBERO-LONG, indicating that coarse object-centric cues help stabilize long-horizon reasoning. Incorporating Local affordance (L) provides additional gains on CALVIN but introduces a slight dip on LIBERO-LONG, likely due to viewpoint-induced geometric bias that affects fine-grained edge-based features. Adding Spatial affordance (S) restores and further improves performance across both benchmarks by providing robust placement priors that generalize across layout variations. Finally, adding Dynamic affordance (D) to the full set (\nPALM\n) yields the best performance, indicating that combining motion cues with structured spatial reasoning produces the most reliable long-horizon behavior.\nHow do the proposed\nPALM\nmodules affect performance?\nWe study the contributions of\nPALM\n’s three core components (affordance prediction module, inverse dynamics prediction, and progress-aware prediction) by conducting ablations during both pre-training and fine-tuning on the CALVIN ABCD benchmark.\nTable\n4.2\nshows that all three\nPALM\ncomponents contribute complementary capabilities and collectively result in the best performance. Removing affordance foresight produces the largest drop in fine-tuning performance (4.48  3.58), confirming that structured future affordance prediction is essential for precise long-horizon planning once the policy is adapted to downstream robot data. In contrast, removing progress prediction causes the largest degradation during pre-training (4.48  3.73), highlighting that large-scale long-horizon datasets are particularly valuable for learning a strong progress prior that stabilizes temporal reasoning. Eliminating inverse dynamics prediction also reduces performance in both stages, showing that predicting multi-step action trajectories conditioned on affordance latents provides an important training signal beyond direct behavior cloning.\nTable 3\n:\nAblation studies of\nPALM\ncomponents.\nResults on the CALVIN ABCD benchmark demonstrate the effectiveness of each training module under both pre-training and fine-tuning.\nAblation Type\nPre-training\nFine-tuning\nAvg. Len.\n\\uparrow\n\\uparrow\nAvg. Len.\n\\uparrow\n\\uparrow\nPALM\n4.48\n4.48\n✗\nAffordance Foresight\n3.90\n3.58\n✗\nInverse Dynamic Prediction\n4.17\n3.92\n✗\nProgress Prediction\n3.73\n4.02\nTable 4\n:\nAblation studies on training data composition.\nResults on the CALVIN ABCD and LIBERO-LONG benchmarks demonstrate the data efficiency of each source type.\nAblation Type\nCALVIN ABCD\nLIBERO-LONG\nAvg. Len.\n\\uparrow\n\\uparrow\nSR (%)\n\\uparrow\n\\uparrow\nPALM\n4.48\n91.8\n✗\nIn-the-Wild Data\n3.90\n73.5\n✗\nLong-Horizon Video Data\n3.73\n84.5\n✗\nHuman Annotated Data\n3.58\n76.5\n✗\nSimulation Data (Pretrain)\n3.96\n81.0\nFigure 4\n:\nReal-world experimental setup and task design.\nLeft:\nWe use a UFACTORY xArm6 robot with the matched Gripper G2 and two RealSense D455 cameras.\nRight:\nWe design a real-world long-horizon manipulation task consisting of six consecutive subtasks, driven by a single high-level instruction.\nTable 5\n:\nReal-world experimental results\non long-horizon task under different generalization settings.\nType\nMethod\nTask completed in a row\nAvg. Len.\n\\uparrow\n\\uparrow\n1\n2\n3\n4\n5\n6\nRandom Localization\nOpenVLA\n[\nkim2024openvlaopensourcevisionlanguageactionmodel\n]\n0.45\n0.30\n0.15\n0.05\n0.00\n0.00\n0.95\nOcto\n[\noctomodelteam2024octoopensourcegeneralistrobot\n]\n0.35\n0.20\n0.10\n0.00\n0.00\n0.00\n0.65\nPALM\n0.70\n0.65\n0.55\n0.45\n0.40\n0.30\n3.05\nVisual Distraction\nOpenVLA\n[\nkim2024openvlaopensourcevisionlanguageactionmodel\n]\n0.65\n0.50\n0.25\n0.15\n0.05\n0.00\n1.60\nOcto\n[\noctomodelteam2024octoopensourcegeneralistrobot\n]\n0.45\n0.35\n0.15\n0.00\n0.00\n0.00\n0.95\nPALM\n0.85\n0.80\n0.65\n0.60\n0.50\n0.40\n3.80\nUnseen Lighting\nOpenVLA\n[\nkim2024openvlaopensourcevisionlanguageactionmodel\n]\n0.55\n0.35\n0.25\n0.10\n0.00\n0.00\n1.25\nOcto\n[\noctomodelteam2024octoopensourcegeneralistrobot\n]\n0.50\n0.35\n0.15\n0.05\n0.00\n0.00\n1.05\nPALM\n0.80\n0.70\n0.60\n0.60\n0.45\n0.40\n3.55\nEffectiveness of training data composition for robot manipulation.\nTraining data is a critical factor influencing the performance of robot policies. Accordingly, we classify our training data into four primary types based on their task orientation: (1) In-the-wild datasets, represented by DROID\n[\nkhazatsky2025droidlargescaleinthewildrobot\n]\nand BridgeData V2\n[\nwalke2024bridgedatav2datasetrobot\n]\ndatasets for the pre-training stage, (2) Long-horizon video datasets, consisting of EPIC-KITCHENS\n[\ndamen2020epickitchensdatasetcollectionchallenges\n]\nand RoboCerebra\n[\nhan2025robocerebralargescalebenchmarklonghorizon\n]\n, which are also utilized during pre-training to learn the understanding of semantic progress in complex, multi-step scenarios, (3) Human-annotated datasets, employed in the fine-tuning stage to train affordance and progress-aware policy, and (4) Simulation datasets for post-training evaluation (CALVIN ABCD\n[\nmees2022calvinbenchmarklanguageconditionedpolicy\n]\nand LIBERO-LONG\n[\nliu2023liberobenchmarkingknowledgetransfer\n]\n).\nAs illustrated in\nSection\n4.2\n, excluding any single data type invariably degrades model performance, though to varying extents.\nThis degradation is most pronounced for the In-the-Wild and Human-Annotated datasets. A substantial performance decrease also occurs when removing the pre-training data corresponding to the simulation benchmarks.\n4.3\nReal-World Experiments\nExperimental Setup.\nAs shown in Figure\n4\n, we use a UFACTORY xArm6 with a Gripper G2 to conduct real-world experiments. For visual input, we use two RealSense D455 cameras configured as eye-on-hand and eye-on-base to capture RGB images. We design several types of generalization tests for long-horizon tasks, including Visual Distraction, Random Localization, and Unseen Lighting.\nWe select a mixed pre-training dataset composed of DROID\n[\nkhazatsky2025droidlargescaleinthewildrobot\n]\nand BridgeData V2\n[\nwalke2024bridgedatav2datasetrobot\n]\n, while the fine-tuning dataset consists of 200 demonstrations collected on the xArm with RGB images, robot states, and actions.\nBaselines and Metrics.\nWe select OpenVLA\n[\nkim2024openvlaopensourcevisionlanguageactionmodel\n]\nand Octo\n[\noctomodelteam2024octoopensourcegeneralistrobot\n]\nas baselines. We report the success rate (SR) and average length for each task over 20 real-world rollouts. For each rollout, each method is permitted a maximum of three execution attempts. To ensure fairness, all models are fine-tuned on our training dataset, trained for an equal number of iterations, and evaluated with the final checkpoint.\nGeneralization Evaluation for Long-Horizon Task.\nTo evaluate generalization in long-horizon tasks, we construct a sequential pick-and-place task consisting of 6 consecutive subtasks, driven by a single high-level instruction, as shown in Table\n5\n. We consider three generalization settings:\n\\lxSVG@picture\n1\n\\endlxSVG@picture\nvarying the target object pose,\n\\lxSVG@picture\n2\n\\endlxSVG@picture\nchanging the scene lighting to unseen conditions, and\n\\lxSVG@picture\n3\n\\endlxSVG@picture\nadding multiple distractor objects to induce visual clutter. The results demonstrate\nPALM\n’s superior generalization over baselines as the task sequence length increases, showing its robustness in long-horizon settings. Details are available in the Appendix.\n5\nConclusion\nIn this work, we introduce\nPALM\n, a novel end-to-end vision–language–action (VLA) approach for long-horizon robotic manipulation by coupling structured future affordance prediction with continuous progress estimation in a closed loop.\nPALM\nachieves state-of-the-art results on two simulation benchmarks, with a 12.5% improvement on CALVIN ABCD and 91.8% success on LIBERO-LONG, and shows significant robustness in real-world experiments across long-horizon generalization settings.\nReferences\n\\thetitle\nSupplementary Material\nAppendix A\nImplementation Details\nA.1\nPALM\nModel Details\nVision.\nVisual encoding employs a MAE-pretrained ViT-B\n[\nhe2021maskedautoencodersscalablevision\n]\nbackbone, which serves as the primary feature extractor. For each timestep, the model processes images from two viewpoints: a static eye-on-base camera for global context and an eye-on-hand camera for local, gripper-centric views. The ViT transforms each image into 196 patch embeddings plus a [CLS] token. To maintain computational tractability over long temporal sequences, we employ a Perceiver Resampler\n[\njaegle2021perceivergeneralperceptioniterative\n]\n. This module uses a set of learnable latent vectors and cross-attention to distill the initial 197 high-dimensional tokens into a compact, fixed-size set of task-relevant visual embeddings, which are then fed to the main backbone.\nText.\nTo ground the policy in natural language, we encode task instructions using a pretrained CLIP text encoder\n[\nradford2021learningtransferablevisualmodels\n]\n. This module converts the input instruction into a fixed-length embedding that captures its semantic intent. A subsequent linear projection maps this embedding into the model’s shared latent space, allowing effective integration with visual and state information.\nRobot State.\nThe model receives proprioceptive feedback describing the robot’s physical configuration. This state is represented by a six-dimensional vector for the end-effector’s 6-DoF Cartesian pose (position and Euler angles) and a binary value for the gripper’s open/closed status. For processing, the binary gripper value is first transformed into a two-dimensional one-hot vector. Both the 6-D pose and the one-hot gripper vector are projected through separate linear layers, then concatenated and passed through a final MLP to generate a single, unified state token.\nLearnable Queries.\nWe introduce two sets of learnable query tokens that are appended to the multimodal token sequence at each step\nt\nt\nand updated inside the transformer via cross-attention under causal masking. Each query set extracts and integrates information from multimodal inputs to enable joint prediction.\n•\nFine-grained affordance queries\nare specialized tokens that extract a structured view of future interaction. Organized into four sub-queries (\n<Global>\n,\n<Local>\n,\n<Spatial>\n,\n<Dynamic>\n), they attend to the multimodal context to produce a disentangled, affordance-centric latent\n𝐅\n^\nt\n+\nn\n\\hat{\\mathbf{F}}_{t+n}\nthat guides downstream control.\n•\nAction–progress queries\ngenerate the final control sequence. They pool control-relevant information from current observations and explicitly condition on\n𝐅\n^\nt\n+\nn\n\\hat{\\mathbf{F}}_{t+n}\n, enabling a progress-aware inverse-dynamics formulation so actions remain temporally consistent and aligned with the predicted future state.\nBackbone.\nThe core of our model is a GPT-2 style transformer\n[\nradford2019language\n]\n, which functions as the central multi-modal reasoning engine. It takes as input a concatenated sequence containing the encoded vision, text, and state tokens, alongside the learnable affordance and action-progress queries. By applying causal and cross-modal attention, the backbone fuses these diverse inputs into a coherent latent representation of the world state.\nDecoders.\nWe preserve spatial correspondence by adding fixed 2D sine–cosine positional encodings to the image patch tokens and propagating these coordinates through a stack of Transformer encoder layers. After this shared encoding, modality-specific heads decode the four affordance latents.\n<Global>\nand\n<Spatial>\nuse lightweight 2-layer MLP heads, producing respectively a future object mask and a set of candidate placement points.\n<Local>\nand\n<Dynamic>\nuse 2-layer Transformer blocks followed by linear projections to produce a future contact heatmap and a dynamic region. These targets are defined at\nt\n+\nn\nt+n\nto supervise the affordance latents and are used only during training. The primary model output is produced by the action–progress decoder, which jointly predicts actions and scalar progress. Configuration details for each module are given in Table\n6\n.\nTable 6\n:\nKey parameters of each module in\nPALM\n.\nType\nHidden Size\nNumber of Layers\nNumber of Heads\nImage Encoder\n768\n12\n12\nPerceiver Resampler\n768\n3\n8\nGPT-2 (LLM Backbone)\n384\n24\n12\nGlobal Decoder\n384\n2\n16\nLocal Decoder\n384\n2\n16\nSpatial Decoder\n384\n2\n16\nDynamic Decoder\n384\n2\n16\nPrediction with Diffusion Transformer.\nWe formulate action–progress generation as a conditional denoising task and employ a Diffusion Transformer (DiT) decoder\n[\npeebles2023scalablediffusionmodelstransformers\n]\n. The decoder conditions on the latent embedding from the action–progress queries, which already integrates the predicted affordance information. By iteratively reversing a Gaussian noise process over a sequence of latent vectors, the DiT models complex, multimodal action distributions and yields a temporally coherent trajectory. It produces a joint sequence of 7-DoF actions and the corresponding scalar progress values associated with subtask completion. Configuration details of the DiT are provided in Table\n7\n.\nTable 7\n:\nConfiguration of the Diffusion Transformer\nused for action-progress prediction.\nParameter\nValue\nHidden Size\n384\nNumber of Layers\n12\nNumber of Heads\n12\nSampling Steps\n10\nNoise Schedule\nCosine\nAction Prediction Steps\n3\nLoss Function\nMSE (\nL\n2\nL_{2}\nloss)\nPrecision\nfp32\nA.2\nTraining Details\nDatasets.\nOur training process consists of a pre-training and a fine-tuning stage. For pre-training, we utilize a mixed dataset from two domains. One part is drawn from the DROID\n[\nkhazatsky2025droidlargescaleinthewildrobot\n]\ndataset and BridgeData V2\n[\nwalke2024bridgedatav2datasetrobot\n]\n, which together provide large-scale, in-the-wild robotic arm demonstrations to build a foundational understanding of diverse real-world tasks. Another part is from EPIC-KITCHENS\n[\ndamen2020epickitchensdatasetcollectionchallenges\n]\nand RoboCerebra\n[\nhan2025robocerebralargescalebenchmarklonghorizon\n]\n, which provides fine-grained sub-steps and time-segment annotations to supervise the learning of semantic progress estimation in long-horizon, contact-rich scenarios. To keep storage and computation requirements manageable during pre-training, the model predicts entire frames rather than fine-grained affordances. For the fine-tuning stage, we select 942 trajectories from robot data and annotate them with affordance data and continuous progress labels using a semi-automated method. We then fine-tuned model on these annotated trajectories to learn conditional affordance foresight for inverse dynamics prediction, ultimately outputting an action-progress pair. For the post-training stage, we adopt dataset-specific schedules. For LIBERO\n[\nliu2023liberobenchmarkingknowledgetransfer\n]\n, we pre-train on LIBERO-90, which contains fully annotated demonstrations for 90 short-horizon tasks, and then fine-tune and evaluate on LIBERO-LONG, which features long-horizon tasks. For CALVIN ABC\nD\n[\nmees2022calvinbenchmarklanguageconditionedpolicy\n]\n, we first pre-train on the official robot play data without language instructions; the remaining language-conditioned data with full annotations is used for fine-tuning.\nHyperparameters.\nWe perform training on 8 NVIDIA A100 GPUs, and set an initial learning rate of 1e-3, a weight decay of 1e-4, and a batch size of 64. Throughout the entire training process, the pre-trained visual and text encoders are kept frozen. All models are trained for a total of 30 epochs. Our model has 68 million trainable parameters. This lightweight architecture offers a compact and flexible base for fine-tuning, allowing it to be performed on smaller GPUs such as the RTX 4090. Details are illustrated in Table\n8\n.\nTable 8\n:\nTraining hyperparameters.\nHyperparameters\nPre-training\nFine-tuning\nNumber of GPUs\n8\n8\nBatch Size\n80 / GPU\n64 / GPU\nLearning Rate\n1e-4\n1e-3\nWeight Decay\n1e-4\n1e-4\nOptimizer\nAdamW\nAdamW\nLearning Rate Schedule\nCosine decay\nCosine decay\nTraining Epochs\n30\n40\nHistorical Sequence Length\n7\n7\nAction Prediction Length\n3\n3\nA.3\nPolicy Roll-out Details\nTo ensure efficiency during inference, we set the number of DiT diffusion steps to 10, the number of observation steps to 7, and the number of future prediction steps to 3. This configuration results in a rapid sampling time of approximately 40 ms. Our approach uses fine-grained affordances for conditional visual foresight, which avoids the need for explicit image decoding. This enables a closed-loop frequency of 10-15 Hz, with each decision cycle taking less than 80 ms.\nAppendix B\nLong-Horizon Real-World Task Details\nB.1\nTask Setup and Success Criteria\nWe design a long-horizon manipulation task to evaluate the model’s ability to follow complex, sequential instructions. The experimental setup consists of a UFACTORY xArm 6 robot arm equipped with a Gripper G2. Visual perception is provided by two RealSense D455 cameras: one mounted on the robot’s wrist for an eye-in-hand perspective, and another positioned statically for a third-person, eye-on-base view. The task is driven by a single, high-level language instruction:\n\"Put the pineapple on the white plate, the grape on the white bowl, and the orange on the blue bowl.\"\nThe scene contains three toy fruits (pineapple, grape, orange), two white containers (a plate and a bowl), and one blue bowl. For each trial, the initial positions of all objects are randomized within a predefined workspace to test policy robustness.\nThe full task is considered a success only when all three fruits are correctly placed in their designated containers as specified by the instructions. The success criteria for each of the six subtasks are detailed below.\nSubtask 1. Pick up pineapple:\nThe robot must successfully grasp the toy pineapple from its initial randomized location. Success for this subtask is defined as the robot securely gripping the pineapple and lifting it clear of the table surface without dropping it. This initial step challenges the policy’s ability to generalize its grasping strategy to objects with irregular shapes and textures, evaluating its local geometric reasoning for identifying stable contact points.\nSubtask 2. Place on white plate:\nThe robot must transport the grasped pineapple and place it onto the white plate. Success is achieved if the pineapple is fully supported by the plate and remains stable after the gripper retracts. This step tests both precise spatial targeting and the model’s capacity for language-based disambiguation, as it must correctly identify the “plate” from two similar white containers.\nSubtask 3. Pick up grape:\nThe robot must successfully grasp the toy grape from its initial position. The success criteria are identical to Subtask 1. This action requires fine-grained motor control, evaluating the policy’s precision when interacting with small objects where the margin for positional error is minimal.\nSubtask 4. Place on white bowl:\nThe robot must transport the grasped grape and place it inside the white bowl. Success is achieved if the grape is fully contained within the bowl after the gripper retracts. This subtask again evaluates language disambiguation (“bowl” vs. “plate”) and tests the model’s understanding of different placement affordances, specifically placing an object\ninto\na concave container versus\nonto\na flat surface.\nSubtask 5. Pick up orange:\nThe robot must successfully grasp the toy orange from its initial position. The success criteria are identical to Subtask 1. This action serves as a baseline evaluation of the model’s core grasping capability on a simple, regular object shape.\nSubtask 6. Place on blue bowl:\nThe robot must transport the grasped orange and place it inside the blue bowl. Success is achieved if the orange is fully contained within the bowl after the gripper retracts. This explicitly tests the model’s language grounding for object attributes, as it must correctly associate the color “blue” with the appropriate target container.\nB.2\nRobustness of Progress Estimates\nTo evaluate the reliability and physical grounding of the learned self-progress indicator\np\nt\np_{t}\n, we subject a representative subtask to three categories of dynamic perturbations injected twice per episode at random timesteps. Specifically, we test:\n\\lxSVG@picture\n1\n\\endlxSVG@picture\nrandom object relocations,\ni.e\n.\n, changing the target’s pose or position mid-execution to require geometric reactivity;\n\\lxSVG@picture\n2\n\\endlxSVG@picture\nunseen lighting,\ni.e\n.\n, switching illumination to out-of-distribution conditions (\ne.g\n.\n, sudden dimming or color-temperature shifts) to require perceptual invariance; and\n\\lxSVG@picture\n3\n\\endlxSVG@picture\nvisual distractions,\ni.e\n.\n, introducing additional distractor objects to induce workspace clutter and occlusions. This analysis verifies that the progress estimate tracks the underlying task state rather than spurious visual correlations, supporting robust closed-loop behavior in unstructured environments. The details and results are as follows.\nRandom Relocation Disturbances.\nAs illustrated in\nFigure\n5\n, during the subtask of\npick up grape\n,\nwe relocate the grape to a new pose twice mid-execution\n(vertical dashed lines). The predicted progress increases smoothly over time and, at each relocation event, exhibits a transient deviation followed by a rapid recovery that quickly returns to the previous upward trend rather than resetting or collapsing. This behavior indicates that the progress signal is robust to substantial changes in the target object’s pose and continues to track subtask completion rather than the instantaneous geometric configuration of the scene.\nFigure 5\n:\nRandom Relocation Disturbances.\nPredicted progress in the\npick up grape\nsubtask under two random grape relocations.\nUnseen Lighting Disturbances.\nAs illustrated in\nFigure\n6\n, during the subtask of\npick up grape\nwe introduce two abrupt switches to unseen illumination conditions (vertical dashed lines), substantially altering global brightness and shadows while leaving the physical scene unchanged. The predicted progress continues to increase over time, with only mild local deviations at the change points before returning to its prior upward trend. This indicates that the progress estimator is robust to severe photometric disturbances, exhibiting stable behavior under illumination changes.\nFigure 6\n:\nUnseen Lighting Disturbances.\nPredicted progress in the\npick up grape\nsubtask under two unseen lighting changes.\nMulti-Object Visual Distractions.\nAs illustrated in\nFigure\n7\n, during the subtask of\npick up grape\nwe introduce\nmultiple additional objects into the scene twice\n(vertical dashed lines), placing them near the target and within the camera’s field of view to create visual clutter. The predicted progress keeps increasing over time, with localized deviations at the distraction events that promptly recover and return to the overall upward trend. This indicates that the progress estimator remains stable under multi-object visual distractions, with limited sensitivity to distractors.\nFigure 7\n:\nMulti-Object Visual Distractions.\nPredicted progress in\npick up grape\nsubtask under two injected visual distraction events.\nAppendix C\nMore Experiments\nC.1\nAblation on Progress Threshold\nThe threshold\nϕ\n\\phi\nserves as the decision boundary for terminating the current sub-policy and triggering the subsequent phase based on the predicted progress signal\np\nt\np_{t}\n. Since\np\nt\np_{t}\nserves as a continuous indicator of the sub-task’s temporal progress, the setting of this threshold directly governs the transition timing: a lower threshold risks premature termination of the action, while an excessively high threshold may induce execution stagnation due to signal non-saturation. To investigate the impact of this parameter on final manipulation performance, we conduct an ablation study on the CALVIN ABC\nD benchmark across\nϕ\n​\n{\n70\n%\n,\n80\n%\n,\n90\n%\n,\n100\n%\n}\n\\phi\\in\\{70\\%,80\\%,90\\%,100\\%\\}\n, with\nϕ\n=\n90\n%\n\\phi=90\\%\nas the default setting. This analysis aims to validate the effectiveness of the switching logic in long-horizon tasks by quantifying this trade-off.\nAs illustrated in Table\n9\n, the default threshold of\n90\n%\n90\\%\nyields the highest success rates across all chain lengths, achieving an average sequence length of 4.48. Reducing\nϕ\n\\phi\nto\n70\n%\n70\\%\nsignificantly degrades performance due to premature transitions, whereas increasing it to 100% causes a slight decline, confirming that a strict saturation requirement can hinder task completion.\nTable 9\n:\nAblation studies on the progress threshold\nϕ\n\\phi\n.\nResults on the CALVIN ABCD benchmark demonstrate the effect of the threshold setting on long-horizon task performance.\nThreshold\nϕ\n\\phi\nTask completed in a row\n1\n2\n3\n4\n5\nAvg. Len.\n70%\n93.4\n86.3\n78.4\n71.9\n65.5\n3.96\n80%\n95.3\n90.2\n84.2\n79.7\n74.1\n4.24\n90%\n96.9\n93.8\n89.3\n85.9\n82.0\n4.48\n100%\n95.2\n89.7\n84.4\n78.3\n73.0\n4.21\nC.2\nAblation on Prediction vs. Reconstruction\nWe perform an ablation on prediction targets vs. reconstruction to understand which form of foresight best supports long-horizon control. With the backbone and task-conditioned policy fixed, we compare: (1) Affordance Foresight, which predicts future affordance maps to highlight actionable regions and interaction points; (2) Image/Video Foresight, which predicts future RGB observations as a purely pixellevel forecasting objective; and (3) Auxiliary or Reconstruction, which reconstructs the current observation at time\nt\nt\nas a representation-learning signal without future prediction. All variants are evaluated on CALVIN ABC\nD using the average number of consecutively completed subtasks (Avg. Len.) and inference latency.\nAs shown in Table\nC.2\n, affordance foresight attains the highest average length (4.48) with moderate latency (\n70 ms), while future RGB prediction yields lower performance (4.17) at higher latency (\n90 ms) and auxiliary reconstruction is fastest (\n55 ms) but degrades performance the most (3.58). This pattern indicates that structured, action-centric affordance prediction yields substantial long-horizon gains without prohibitive computational cost, and provides the most effective trade-off among the tested prediction types.\nTable 10\n:\nAblation on prediction vs. reconstruction.\nResults on CALVIN ABCD and inference latency, demonstrating the impact of different prediction and reconstruction objectives on long-horizon task performance.\nAblation Type\nCALVIN ABC\nD\nLatency\nAvg. Len.\n\\uparrow\n\\uparrow\n(ms)\n\\downarrow\n\\downarrow\nAffordance\n(\nPALM\n)\n4.48\n70\nImage / Video\n4.17\n90\nAuxiliary\n3.58\n55\nAppendix D\nQualitative Results and Visualization\nFigure 8\n:\nVisualization of affordance predictions.\nAcross sequential progress steps, the model predicts four complementary affordances to guide policy generation:\nGlobal Affordance\nsegments task-relevant objects and goals;\nLocal Affordance\ngenerates heatmaps for precise contact points;\nSpatial Affordance\npredicts candidate placement regions; and\nDynamic Affordance\nforecasts motion trajectories.\nIn this section, we visualize the internal reasoning process of\nPALM\nduring the execution of a long-horizon manipulation task: “Slide the pick block into the drawer.” As illustrated in Figure\n8\n, our model actively predicts structured affordances to guide its decision-making. We display the rollout over five timesteps, visualizing the four distinct affordance outputs that the model generates:\n•\nGlobal Affordance:\nThe model correctly segments the target object (the pink block) and the goal region (the open drawer), demonstrating semantic understanding of the instruction.\n•\nLocal Affordance:\nThe heatmaps focus precisely on the interaction points, shifting from the block’s graspable surface to the handle of the drawer as the task progresses.\n•\nSpatial Affordance:\nThe predicted yellow keypoints indicate valid placement candidates, guiding the robot to move the block towards the drawer’s opening.\n•\nDynamic Affordance:\nThe arrows visualize the predicted motion of the end-effector and the object, showing a clear trajectory for sliding the block forward.\nThese visualizations confirm that\nPALM\nbuilds a comprehensive, structured representation of the task. By explicitly forecasting\nwhat\nto interact with (Global/Local),\nwhere\nto move (Spatial), and\nhow\nthe scene will evolve (Dynamic), the model achieves precise and robust control, successfully completing the task where baselines often fail due to ambiguity or lack of spatial reasoning.\nAppendix E\nBroader Impacts\nPALM\nadvances robotic manipulation by enhancing intermediate reasoning to mitigate common failures in long-horizon tasks. Rather than direct sensorimotor mapping, the model first anticipates a structured set of future affordances that encode task-relevant object identities, interaction points, spatial goal regions, and motion patterns. It then couples these predictions with a mechanism for estimating progress within the current subtask. This combination of structured affordance prediction and progress-aware state tracking yields an internal representation that helps policies remain coherent and effective across complex multi-stage activities where traditional models often fail.\nAt the application level, progress-aware, affordance-based policies can help move long-horizon manipulation from controlled labs to open-world settings (\ne.g\n.\n, homes, warehouses, hospitals) when paired with sufficient data and stronger inductive priors. Because\nPALM\nexposes explicit affordance and progress signals, it integrates more naturally with safety monitors, constraint checks, and human-in-the-loop control, and it simplifies visualization and debugging relative to black-box policies.\nHowever, these structured representations may reflect dataset biases (\ne.g\n.\n, which objects are prioritized or what counts as success), and premature deployment in safety-critical environments could amplify such risks. Realizing the benefits, therefore, requires standardized evaluation, robust sim-to-real transfer, and careful safety and societal-impact assessments so that capability gains do not come at the expense of safety, employment, or privacy.",
    "preview_text": "Recent advancements in vision-language-action (VLA) models have shown promise in robotic manipulation, yet they continue to struggle with long-horizon, multi-step tasks. Existing methods lack internal reasoning mechanisms that can identify task-relevant interaction cues or track progress within a subtask, leading to critical execution errors such as repeated actions, missed steps, and premature termination. To address these challenges, we introduce PALM, a VLA framework that structures policy learning around interaction-centric affordance reasoning and subtask progress cues. PALM distills complementary affordance representations that capture object relevance, contact geometry, spatial placements, and motion dynamics, and serve as task-relevant anchors for visuomotor control. To further stabilize long-horizon execution, PALM predicts continuous within-subtask progress, enabling seamless subtask transitions. Across extensive simulation and real-world experiments, PALM consistently outperforms baselines, achieving a 91.8% success rate on LIBERO-LONG, a 12.5% improvement in average length on CALVIN ABC->D, and a 2x improvement over real-world baselines across three long-horizon generalization settings.\n\nPALM: Progress-Aware Policy Learning via Affordance Reasoning for Long-Horizon Robotic Manipulation\nYuanzhe Liu\n1,2\nJingyuan Zhu\n1\nYuchen Mo\n2\nGen Li\n3\nXu Cao\n2\nJin Jin\n4\nYifan Shen\n2\nZhengyuan Li\n2\nTianjiao Yu\n2\nWenzhen Yuan\n2\nFangqiang Ding\n5\n​\n†\n{}^{5\\text{\\textdagger}}\nIsmini Lourentzou\n2\n​\n†\n{}^{2\\text{\\textdagger}}\n1\nUniversity of Pennsylvania\n2\nUniversity of Illinois Urbana-Champaign\n3\nNanyang Technological University\n4\nUniversity of Oxford\n5\nMassachusetts Institute of Technology\nAbstract\nRecent advancements in vision-language–action (VLA) models have shown promise in robotic manipulation, yet they continue to struggle with long-horizon, multi-step tasks. Existing methods lack internal reasoning mechanisms that can identify task-relevant interaction cues or track ",
    "is_relevant": true,
    "relevance_score": 8.0,
    "extracted_keywords": [
        "VLA",
        "locomotion",
        "whole body control"
    ],
    "one_line_summary": "PALM是一个基于视觉-语言-动作（VLA）模型的机器人操作框架，通过交互中心的可供性推理和子任务进度跟踪，提升长时程多步任务的执行成功率。",
    "detailed_summary": "## PALM 论文详细摘要\n\n### 1. 研究背景和动机\n近年来，视觉-语言-动作模型在机器人操作领域取得了显著进展，但在处理需要多步骤规划的**长视野任务**时仍面临挑战。现有方法缺乏内部推理机制，无法识别任务相关的交互线索或跟踪子任务进度，导致重复动作、遗漏步骤和过早终止等关键执行错误。为解决这些问题，本文提出了**PALM**框架，旨在通过结构化的**可供性推理**和**进度感知**策略学习，实现可靠的长视野操作。\n\n### 2. 核心方法和技术创新\nPALM的核心创新在于构建了一个集成了感知、动作与进度的闭环框架，主要包括两个互补模块：\n- **细粒度可供性预测模块**：该模块通过一组可学习的查询，预测未来时刻的结构化可供性表征。这些表征分为四种互补类型，分别捕捉**对象相关性**、**接触几何**、**空间放置区域**和**运动动态**，为视觉运动控制提供了任务相关的锚点。\n- **进度感知策略模块**：该模块基于扩散变换器，在预测动作序列的同时，**联合预测一个连续的进度标量**。这个进度信号用于跟踪当前子任务的完成度，从而实现子任务间的无缝、稳定过渡，避免了传统行为克隆方法在长视野任务中常见的阶段模糊问题。\n\n### 3. 主要实验结果\nPALM在仿真和真实世界实验中均取得了最先进的性能：\n- **仿真基准测试**：在CALVIN ABCD基准上，平均连续完成任务数达到**4.48**，比之前的最佳方法提升了12.5%。在LIBERO-LONG基准上，成功率高达**91.8%**，显著优于基线模型。\n- **真实世界泛化测试**：在包含随机定位、视觉干扰和未知光照三种挑战性泛化设置的长视野任务中，PALM的表现均大幅优于OpenVLA和Octo等基线模型，展示了强大的鲁棒性和泛化能力。\n- **消融研究**：实验证实了四种可供性类型和进度预测模块各自的重要贡献，并证明了结构化可供性预测相比未来图像预测或重建任务，在性能与效率上具有更优的权衡。\n\n### 4. 研究意义和价值\nPALM通过将结构化的中间推理（可供性预测）与显式的时序状态跟踪（进度估计）深度融合，为长视野机器人操作提供了一个新颖且高效的解决方案。其意义在于：\n- **技术价值**：提出了一种可扩展的VLA框架，有效解决了长视野任务中的状态歧义和时序不一致问题，推动了从“端到端映射”到“结构化推理”的范式转变。\n- **应用价值**：模型输出的显式可供性和进度信号更易于与安全监控、人机交互集成，并简化了策略调试过程，有助于将复杂的多步骤操作能力从实验室推广到更开放的真实世界场景（如家庭、仓库）。同时，研究也指出了需关注数据偏见和安全性评估等更广泛的影响。",
    "qa_pairs": [
        {
            "question": "这篇论文的核心创新点是什么，他想解决什么问题，怎么解决的？",
            "answer": "## 论文核心分析：PALM\n\n### **一、 核心问题**\n当前基于视觉-语言-动作（VLA）的机器人操作模型在**长视野、多步骤任务**中存在根本性缺陷。它们缺乏内部推理机制，导致：\n1.  **无法识别任务相关的交互线索**：分不清下一步该操作哪个物体、哪个部位、如何放置或移动。\n2.  **无法跟踪子任务内的执行进度**：导致重复动作、跳过必要步骤、过早终止等典型失败模式。\n\n### **二、 核心创新点**\nPALM 提出一个统一的 VLA 框架，通过**结构化可供性推理**和**进度感知策略生成**来解决上述问题。其创新主要体现在两个紧密耦合的模块：\n\n1.  **结构化未来可供性预测模块**\n    *   **创新**：不是直接预测动作或未来图像，而是预测一组**结构化的、面向未来的可供性潜在表示**，作为任务相关的中间推理锚点。\n    *   **具体实现**：通过四类专门的查询（Queries）预测互补的可供性：\n        *   **全局可供性**：识别与指令相关的**目标物体及其大致区域**。\n        *   **局部可供性**：在全局区域内预测**精细的接触点几何热图**，用于精确交互。\n        *   **空间可供性**：将模糊的空间指令（如“放在旁边”）转化为一组**候选放置点**，增强布局变化的鲁棒性。\n        *   **动态可供性**：预测**未来可能移动的区域（如夹爪、物体）**，捕捉运动动态。\n\n2.  **进度感知的逆动力学策略模块**\n    *   **创新**：将动作预测与**连续的子任务进度估计**进行联合解码。策略不仅输出动作，还输出一个标量进度值 `p_t ∈ [0,1]`。\n    *   **具体实现**：使用**扩散变换器**，以预测的可供性潜变量为条件，联合生成未来多步的`（动作，进度）`序列。进度信号作为时间正则化器，帮助模型区分视觉相似但处于不同任务阶段的状态，从而实现**平滑的子任务转换**。\n\n### **三、 解决方案架构**\nPALM 采用端到端训练，其工作流程如下：\n\n```mermaid\ngraph TD\n    A[输入: 语言指令l, 视觉观测o_t, 机器人状态s_t] --> B[多模态编码器<br/>（CLIP文本编码器 + MAE视觉编码器）]\n    B --> C[GPT-2风格Transformer主干]\n    C --> D{两类可学习查询}\n    D --> E[“**可供性查询**<br/>（Global, Local, Spatial, Dynamic）”]\n    D --> F[“**动作-进度查询**”]\n    E --> G[预测结构化未来可供性潜变量 F_hat_t+n]\n    G --> F\n    F --> H[扩散变换器解码器]\n    H --> I[“**联合输出**<br/>动作序列 a_hat 与 进度序列 p_hat”]\n```\n\n**训练策略**：\n1.  **大规模预训练**：混合使用机器人数据集（DROID, BridgeDataV2）和长视野视频数据（EPIC-KITCHENS, RoboCerebra）进行预训练，学习通用表示和进度概念。\n2.  **精细化微调**：在人工标注了可供性和进度标签的机器人轨迹数据集上进行微调，使模型学会基于可供性进行精确的逆动力学预测。\n\n### **四、 实际价值与技术优势**\n*   **性能提升显著**：在主流仿真基准测试中取得SOTA。\n    *   **CALVIN ABCD**：平均连续完成任务数达 **4.48**，比之前最佳方法提升 **12.5%**。\n    *   **LIBERO-LONG**：成功率高达 **91.8%**，比最强基线提升 **22.8%**。\n*   **泛化与鲁棒性强**：在真实世界实验中，在**随机定位、视觉干扰、未知光照**三种泛化设置下，性能均大幅超过基线（OpenVLA, Octo），展示了出色的环境适应能力。\n*   **可解释性与模块化**：结构化的可供性预测（如热图、关键点）提供了策略决策的**中间可视化依据**，增强了模型的可解释性和调试便利性。\n*   **高效推理**：通过预测紧凑的可供性潜变量而非完整图像，实现了 **10-15 Hz** 的闭环控制频率，满足实时性要求。\n\n**总结**：PALM 的核心突破在于将**基于可供性的结构化场景理解**与**显式的时序进度跟踪**深度融合到VLA策略中，为长视野机器人操作提供了一个兼具**推理能力、时序一致性和强泛化性**的端到端解决方案。",
            "timestamp": "2026-01-21T12:10:16.918326",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "基于他的前作，梳理这个方向的整个发展脉络，每一步相比于之前的工作都改进了什么，着重于几个不同的发展方向。",
            "answer": "## PALM论文分析：基于前作的发展脉络梳理\n\nPALM（Progress-Aware Policy Learning via Affordance Reasoning）是机器人长时程操作领域的一项最新工作。要理解其创新性，需要梳理其所在方向（Vision-Language-Action模型用于长时程操作）的发展脉络。该脉络可以概括为**从直接映射到结构化推理**的演进，主要沿着**三个发展方向**展开：\n\n### 发展脉络总览\n\n| 发展阶段 | 核心思想 | 代表性工作 | 主要改进 | 遗留问题 |\n| :--- | :--- | :--- | :--- | :--- |\n| **1. 基础VLA模型** | 将预训练的视觉-语言模型（VLM）直接微调，实现从观测和指令到动作的端到端映射。 | RT-1/RT-2, OpenVLA | 利用大规模互联网预训练知识，实现开集指令跟随和一定的泛化能力。 | 缺乏内部推理，对长时程、多步骤任务表现不佳，易出现重复、遗漏、提前终止等错误。 |\n| **2. 引入未来预测** | 在动作预测之外，增加对未来观测（如图像、状态）的预测，以提供更丰富的规划信号。 | Seer, GR-1, 3D-VLA | 通过预测未来状态，使策略具备一定的前瞻性，改善了多步骤任务的连贯性。 | 预测目标通常是密集的像素级图像，计算开销大，且与具体的交互意图（“在哪里、如何操作”）关联不够直接。 |\n| **3. 集成结构化表征** | 引入更结构化、任务相关的中间表征（如关键点、轨迹、affordance）来引导策略。 | RoboPoint, CoT-VLA, RT-Affordance | 提供了更明确的空间、几何或语义 grounding，减少了状态歧义，提升了操作精度。 | 表征通常是静态的或单一尺度的，缺乏对任务**时序进展**的显式建模，在长序列中仍可能迷失阶段。 |\n| **4. PALM (本工作)** | **耦合结构化Affordance推理与连续进度感知**，形成一个闭环的感知-动作-进度系统。 | PALM | 1. **多粒度Affordance预测**：同时预测物体、接触点、放置区域、运动轨迹四种互补affordance，提供全面的交互线索。<br>2. **连续进度估计**：联合预测动作和标量进度值，显式跟踪子任务内部进展，实现平滑过渡。<br>3. **统一框架**：将affordance作为条件，通过扩散Transformer联合解码动作和进度，实现端到端训练与推理。 | 模型相对复杂，需要多阶段训练和特定标注数据。 |\n\n---\n\n### 着重分析的几个发展方向\n\n#### 发展方向一：**从直接动作预测到以未来预测为引导**\n\n*   **前作（如Seer, GR-1）的改进**：认识到仅映射当前状态到动作的局限性，引入了**未来状态预测**作为辅助任务。这相当于让模型进行“心理模拟”，预测执行动作后的结果，从而选择能导向预期未来的动作。这提升了策略在多步任务中的连贯性和目的性。\n*   **PALM的进一步推进**：PALM认为预测整个未来图像是低效且与动作解耦的。它转而预测**结构化的未来affordance**。这有两大优势：\n    1.  **高效与相关**：Affordance latent是紧凑的、任务相关的表征，直接回答了“下一步可能在哪里、如何交互”，计算成本远低于图像生成。\n    2.  **结构化信息**：四种affordance分别从全局语义、局部几何、空间关系和运动动态提供信息，比单一的图像或状态预测包含更丰富的引导信号。\n\n#### 发展方向二：**从粗糙语义理解到细粒度空间/几何 grounding**\n\n*   **前作（如RoboPoint, CoT-VLA）的改进**：早期VLA模型的空间理解较粗糙。这些工作引入了**关键点检测、视觉链式推理（CoT）或affordance热图**，使模型能够关注到场景中与任务执行具体相关的部分（如把手、放置面），显著提升了操作的精确度。\n*   **PALM的进一步推进**：PALM没有使用单一的 grounding 方式，而是提出了一个**多粒度、互补的affordance预测框架**：\n    *   **Global**：识别和分割任务相关物体（“操作什么”）。\n    *   **Local**：预测精确的接触点热图（“具体碰哪里”）。\n    *   **Spatial**：生成多个候选放置区域（“放到哪里”）。\n    *   **Dynamic**：预测可能发生运动的区域（“什么会动”）。\n    这种组合提供了从宏观意图到微观执行的全方位 grounding，比单一的关键点或热图更全面、更鲁棒。\n\n#### 发展方向三：**从隐式阶段管理到显式进度感知**\n\n*   **前作（如基于Hierarchical RL或任务分解的方法）的改进**：传统方法使用显式的分层策略或符号规划来管理长时程任务的不同阶段，但依赖人工定义或难以学习。近期一些工作尝试从视频数据中学习**进展奖励或表征**。\n*   **PALM的进一步推进**：PALM创新性地将**连续进度估计**作为策略的一个核心输出，与动作联合预测。\n    *   **关键创新**：`(a_t, p_t)` 的联合输出。标量 `p_t` 表示当前子任务完成的百分比。\n    *   **价值**：\n        1.  **消除歧义**：视觉上相似的观测可能属于任务的不同阶段，需要不同的动作。进度值 `p_t` 提供了额外的时序上下文来消除这种歧义。\n        2.  **平滑过渡**：进度值自然上升至阈值（如90%）时触发子任务切换，实现了无需高层规划器的、数据驱动的平滑阶段过渡。\n        3.  **稳定训练**：进度信号作为一种时序正则化，鼓励策略产生单调、连贯的行为序列，避免了行为克隆中常见的阶段混淆问题。\n\n### 总结\n\nPALM的工作站在了VLA模型用于长时程操作研究的前沿，它**系统性地整合并推进了多个发展方向**：\n1.  它将**未来预测**从“预测像素”升级为“预测结构化交互可能性（affordance）”。\n2.  它将**空间 grounding** 从单一形式扩展为多粒度互补的联合预测。\n3.  它开创性地将**显式、连续的进度感知**深度集成到策略学习中，解决了长时程任务中最核心的时序一致性问题。\n\n因此，PALM的核心贡献在于构建了一个**“感知（多粒度affordance）-推理（进度跟踪）-动作（条件生成）”的闭环**，通过内部的结构化推理和显式状态跟踪，显著提升了模型在复杂、多步骤操作任务中的鲁棒性和成功率。其实验结果在仿真和现实世界中的显著优势，验证了这条技术路线的有效性和实际价值。",
            "timestamp": "2026-01-21T12:11:09.118776",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他的前作有哪些？使用表格仔细讲讲他的每篇前作，他和前作的区别是什么，主要改善是什么？着重于具体相比于之前文章的改动",
            "answer": "## PALM 的前作分析\n\n根据论文内容，PALM 的研究团队（尤其是作者 Yuanzhe Liu 等人）在相关领域有多篇前期工作。这些工作主要集中在**视觉语言动作模型**、**具身智能**和**长时程操作**等方向。以下表格详细梳理了其主要前作，并重点分析了 PALM 与这些前作的区别与改进。\n\n| 前作论文标题 | 核心贡献 / 方法 | 与 PALM 的主要区别 | PALM 的主要改进 / 创新点 |\n| :--- | :--- | :--- | :--- |\n| **RoboPoint: Vision-Language Models as Spatial Reasoners for Robotic Manipulation** (Yuanzhe Liu 等, 2024) | 提出 **RoboPoint**，利用视觉语言模型进行**空间推理**，将模糊的空间语言指令（如“靠近”、“左边”）转化为机器人可执行的2D坐标点。 | 1. **范围聚焦**：专注于**空间指令解析**这一特定子问题。<br>2. **表示单一**：输出主要是2D坐标点，缺乏对交互几何、运动动态等多维度线索的捕捉。<br>3. **无状态跟踪**：没有显式地建模任务进度或子任务状态转移。 | 1. **统一框架**：PALM 将空间推理（Spatial Affordance）**整合**为一个更广泛的、结构化的**可预见性推理**框架中的一部分。<br>2. **多维度表征**：除了空间位置，PALM 还预测**全局物体相关性、局部接触几何、动态运动轨迹**，形成互补的、任务相关的中间表征。<br>3. **进度感知**：引入了**连续的子任务进度估计**，实现了显式的状态跟踪和流畅的子任务转换，这是 RoboPoint 所不具备的。 |\n| **MOKA: Open-World Robotic Manipulation through Spatial and Visual Goal Abstraction** (Liu 等, 2024) | 提出 **MOKA**，通过**空间和视觉目标抽象**来实现开放世界的机器人操作。它可能涉及使用关键点或抽象表示来泛化到新物体和新场景。 | 1. **目标抽象**：MOKA 侧重于对**最终目标**进行抽象表示（如关键点），以支持零样本泛化。<br>2. **推理过程**：可能缺乏对**执行过程中间步骤**的细粒度、结构化的前瞻性推理。<br>3. **时序一致性**：未强调在长时程任务中维持**跨子任务的时序一致性**和状态跟踪。 | 1. **过程推理**：PALM 的核心创新在于对**未来交互线索**（Affordance）进行预测，这为**当前动作生成**提供了直接的、结构化的条件信息，是一种“向前看”的推理机制。<br>2. **结构化锚点**：PALM 的四种可预见性（全局、局部、空间、动态）作为策略学习的**结构化锚点**，提供了比单一目标抽象更丰富、更解耦的场景理解。<br>3. **闭环集成**：PALM 将可预见性推理与进度感知策略**紧密耦合在一个端到端框架**中，形成了“感知-动作-进度”的闭环，专门针对长时程任务的稳定性进行优化。 |\n| **相关工作（非直接前作，但代表技术背景）**： **CoA-VLA**, **TraceVLA**, **Seer**, **3D-VLA** 等 | 这些工作代表了VLA领域的不同改进方向：<br>- **CoA-VLA**: 引入思维链推理。<br>- **TraceVLA**: 注入视觉交互轨迹作为提示。<br>- **Seer**: 集成未来预测作为中间表示。<br>- **3D-VLA**: 利用3D感知增强操作。 | 1. **表示形式**：这些方法或使用语言链、或使用历史图像、或预测未来RGB图像、或依赖3D几何，但都**没有明确提出一套结构化的、多粒度的“可预见性”作为核心中间表征**。<br>2. **进度建模**：它们普遍**缺乏对子任务内部连续进度的显式建模和利用**，来指导动作生成和子任务切换。 | 1. **可预见性作为统一表征**：PALM 的核心思想是将“**在哪里行动、如何行动**”的物理可能性（即可预见性）提炼为一种**可学习的、结构化的查询和预测目标**。这比预测整张未来图像更紧凑、更任务相关，比语言链更 grounded 于视觉几何。<br>2. **进度作为时序正则器**：PALM **在动作空间额外增加了一个连续的进度标量**，并与动作通过扩散变换器联合预测。这个进度信号作为一个内在的时序正则器，有效消除了长时程任务中视觉相似状态下的动作歧义，防止了重复、跳过或提前终止等典型错误。 |\n\n### 总结：PALM 相对于前作的核心理念提升\n\n1.  **从“解决子问题”到“构建统一推理框架”**：前作（如RoboPoint）致力于解决长时程操作中的某个具体挑战（如空间指令解析）。而PALM旨在构建一个**统一的、内省的推理框架**，该框架能自动分解任务，并预测执行下一步所需的所有关键交互线索（可预见性）。\n\n2.  **从“静态目标表示”到“动态过程推理”**：前作（如MOKA及相关工作）侧重于对任务目标或历史状态进行表征。PALM则强调对**未来交互状态的预测**，这是一种主动的、面向过程的推理，能为即时动作生成提供更直接的指导。\n\n3.  **引入“进度”作为核心状态变量**：这是PALM最显著的创新之一。之前的VLA模型大多隐式地处理任务阶段，而PALM**显式地建模并预测子任务进度**，将其作为策略的一部分输出。这相当于为策略配备了一个“我在哪一阶段”的持续自省信号，极大地增强了长时程执行的**时序连贯性和鲁棒性**。\n\n4.  **技术实现上的集成与深化**：PALM在架构上集成了多种先进组件（如GPT风格Transformer、扩散变换器、多种预训练编码器），并创造性地设计了**两套可学习查询**（可预见性查询、动作-进度查询）和**块状结构化注意力机制**，来实现其核心理念。它不是在某个单一技术上突破，而是在**系统设计层面**进行了深度整合与创新。\n\n**总而言之，PALM 的核心改善在于：它通过结构化可预见性推理和连续进度估计，为VLA模型赋予了类似“内省”和“前瞻”的能力，从而系统性地解决了长时程操作中因缺乏中间表示和状态跟踪而导致的执行错误问题。** 其实验结果在仿真和现实世界中的显著提升，验证了这种系统级设计创新的有效性。",
            "timestamp": "2026-01-21T12:12:00.927781",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文提出了哪些关键技术方法，请列表格具体详细说明技术细节，需要包含具体的数学原理推导，以及具体参数。",
            "answer": "好的，作为一名专业的学术论文分析助手，我将为您深入分析论文《PALM: Progress-Aware Policy Learning via Affordance Reasoning for Long-Horizon Robotic Manipulation》提出的关键技术方法。\n\n## 论文核心技术创新\n\nPALM 的核心创新在于为解决长视野、多步骤机器人操作任务中的两大关键挑战——**任务相关交互线索模糊**和**子任务内部状态跟踪缺失**——而设计了一个统一的端到端框架。其关键技术方法可归纳为以下两大模块：\n\n1.  **结构化、细粒度的可操作性预测模块**：作为隐式的中间推理步骤，预测未来交互状态的结构化表征。\n2.  **基于逆动力学的进度感知策略模块**：将动作生成与子任务进度估计耦合，确保长序列执行的时间一致性。\n\n下面以表格形式详细说明各项技术细节，包括数学原理和具体参数。\n\n### 关键技术方法详述\n\n| 模块 | 子组件/方法 | 技术细节与数学原理 | 具体参数与实现 |\n| :--- | :--- | :--- | :--- |\n| **1. 细粒度可操作性预测** | **整体架构** | 引入一组**可学习的可操作性查询**，通过块状结构化注意力机制进行精炼，并特化为四种类型。这些查询通过因果注意力与多模态上下文（语言、视觉、状态）交互，预测未来时刻 `t+n` 的结构化可操作性潜在表示 `𝐅̂_{t+n}`。 | • **查询类型**：4种（Global, Local, Spatial, Dynamic）<br>• **预测偏移**：`n` 步（未来）<br>• **注意力机制**：因果注意力，确保时序一致性 |\n| | **全局可操作性** | **目标**：识别与指令相关的**对象**及其**大致区域**。<br>**数学原理**：<br>1. **监督目标生成**：使用 Grounding DINO 解析指代对象，SAM 生成实例分割掩码 `ℳ_{t+n}^{global}`。<br>2. **损失函数**：结合 Focal Loss 和 Dice Loss 监督预测的掩码 `ℳ̂_{t+n}^{global}`。<br>`ℒ_global = ℒ_FL(ℳ_{t+n}^{global}, ℳ̂_{t+n}^{global}) + ℒ_Dice(ℳ_{t+n}^{global}, ℳ̂_{t+n}^{global})`<br>其中，Focal Loss 处理类别不平衡，Dice Loss 优化掩码重叠区域。 | • **解码器**：2层 MLP<br>• **损失**：Focal Loss + Dice Loss<br>• **辅助特征**：对掩码区域进行掩码池化，提取对象特征 |\n| | **局部可操作性** | **目标**：在全局区域基础上，预测**精细的接触点几何分布**（热力图）。<br>**数学原理**：<br>1. **监督目标生成**：将人工标注的接触点转换为高斯热力图 `ℳ_{t+n}^{local}`。<br>2. **损失函数**：使用 Focal Loss 和 KL 散度。首先对热力图进行 L1 归一化：`ℳ̃ = ℳ / (∑_{(i,j)∈Ω} ℳ^{(i,j)} + ε)`，然后计算 KL 散度。<br>`ℒ_local = ℒ_FL(ℳ_{t+n}^{local}, ℳ̂_{t+n}^{local}) + ℒ_KL(ℳ̃_{t+n}^{local}, ℳ̂̃_{t+n}^{local})` | • **解码器**：2层 Transformer Block + 线性投影<br>• **损失**：Focal Loss + KL Divergence<br>• **归一化**：`ε` 为小常数防止除零 |\n| | **空间可操作性** | **目标**：将模糊的空间语言（如“放在旁边”）转化为一组**可行的放置位置候选点**。<br>**数学原理**：<br>1. **监督目标生成**：使用 SpatialVLM 解析空间语义，RoboPoint 采样得到一组目标点 `𝒮_{t+n} = {𝐩_{t+n}^{(c)}}`。<br>2. **损失函数**：采用**集合匹配损失**（Set-Matching Loss），最小化每个目标点到其最近预测点的距离。<br>`ℒ_spatial = (1/C_{t+n}) ∑_{c=1}^{C_{t+n}} min_{1≤m≤M} ‖ 𝐩̂_{t+n}^{(m)} - 𝐩_{t+n}^{(c)} ‖_2^2`<br>其中 `M` 是预测点数，`C_{t+n}` 是目标点数。 | • **解码器**：2层 MLP<br>• **输出**：一组 M 个归一化的 2D 坐标点<br>• **损失**：集合匹配损失（匈牙利算法的一种简化形式） |\n| | **动态可操作性** | **目标**：预测未来哪些像素（机械爪、可移动物体）将发生**运动**，建立场景、语言与所需动作的统计关联。<br>**数学原理**：<br>1. **监督目标生成**：使用 CoTracker 在历史帧上跟踪网格点，将位移超过阈值的轨迹光栅化为未来动态区域掩码 `ℳ_{t+n}`。<br>2. **损失函数**：采用**变分自编码器（VAE）** 形式的掩码重建损失，鼓励模型学习产生动态区域的潜变量分布。<br>`ℒ_dynamic = 𝔼_{𝐳∼Q_ϕ(𝐳∣x_{t+n}^ℳ)}[-log P_ψ(x_{t+n}^ℳ∣𝐳)] + β KL( Q_ϕ(𝐳∣x_{t+n}^ℳ) ‖ p(𝐳) )`<br>其中 `x_{t+n}^ℳ` 是未来帧在动态掩码区域内的像素，`β` 是 KL 权重。 | • **解码器**：2层 Transformer Block + 线性投影（推测为 VAE 的 decoder）<br>• **损失**：VAE 的 ELBO（重构损失 + β * KL 散度） |\n| **2. 进度感知策略** | **基于扩散的逆动力学** | **目标**：联合预测未来 `n` 步的**动作序列**和**进度标量序列**。<br>**数学原理**：<br>1. **条件输入**：当前观测 `o_t`、指令 `l`、状态 `s_t` 以及预测的可操作性潜在表示 `𝐅̂_{t+n}`。<br>2. **扩散过程**：采用 Diffusion Transformer (DiT)。首先定义目标向量 `𝐲_{t:t+n-1} = [a_t, p_t, ..., a_{t+n-1}, p_{t+n-1}]`。在训练时，向目标添加噪声：<br>`𝐲̃_{t:t+n-1, t_d} = √(ᾱ_{t_d}) 𝐲_{t:t+n-1} + √(1-ᾱ_{t_d}) ϵ`，其中 `ϵ ∼ 𝒩(0, I)`，`t_d` 是扩散时间步。<br>3. **训练目标**：训练一个去噪网络 `ϵ_θ` 来预测添加的噪声。<br>`ℒ_DiT = 𝔼_{t_d, ϵ} ‖ ϵ - ϵ_θ(𝐲̃_{t:t+n-1, t_d} ∣ l, o_t, s_t, 𝐅̂_{t+n}, t_d) ‖_2^2`<br>4. **推理**：从纯噪声开始，通过 `ϵ_θ` 迭代去噪，生成动作-进度序列。 | • **解码器**：Diffusion Transformer (DiT)<br>• **隐藏层大小**：384<br>• **层数/头数**：12层，12头<br>• **采样步数**：10<br>• **噪声计划**：Cosine<br>• **预测步长**：`n=3`<br>• **进度范围**：`p_t ∈ [0, 1]` |\n| | **进度信号的作用** | **数学原理**：进度标量 `p_t` 作为**时间正则器**。在视觉相似但属于不同子任务阶段的观测中，`p_t` 提供了额外的**时间上下文**，帮助策略 `π(a_t ∣ o_t, l, p_t)` 消除歧义。它鼓励潜在状态随任务推进而单调演化，从而平滑子策略边界处的过渡，无需依赖单独的高层控制器。 | • **决策阈值**：默认 `φ = 90%`。当 `p_t > φ` 时，认为当前子任务完成，可准备过渡。<br>• **监督来源**：从长视野视频数据（EPIC-KITCHENS, RoboCerebra）中学习语义进度，并在机器人数据上微调。 |\n| **3. 模型架构与训练** | **多模态编码器** | • **视觉**：MAE",
            "timestamp": "2026-01-21T12:13:05.393909",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他使用了哪些评价指标与数据集，列表格具体讲讲他的评价指标的细节与数据集的细节",
            "answer": "## PALM论文评价指标与数据集分析\n\n### 一、 评价指标\n\n论文在仿真和真实世界实验中使用了以下核心评价指标，具体细节如下：\n\n| 指标名称 | 计算方式与细节 | 评估目的 |\n| :--- | :--- | :--- |\n| **任务成功率** | 在固定次数的测试回合（Rollout）中，成功完成指定任务的比率。 <br> - **CALVIN ABCD**: 报告连续完成1至5个子任务的成功率。 <br> - **LIBERO**: 报告四个任务套件（Spatial, Object, Goal, Long）各自的平均成功率。 <br> - **真实世界**: 报告完成6步长程任务中每个子任务的成功率。 | 衡量模型在单步和多步长程任务中的**绝对性能**和**可靠性**。 |\n| **平均连续完成长度** | 在CALVIN ABCD基准测试中，模型能够连续成功完成的子任务的平均数量。计算基于解决5条指令的测试结果。 | 量化模型在**长程序列**中的**稳定性**和**连贯性**。避免因单个子任务失败导致整个长程任务中断。 |\n| **推理延迟** | 模型在单个决策周期内（从接收观察到输出动作）所花费的时间（毫秒，ms）。论文中PALM的闭环频率为10-15 Hz（约66-100 ms/周期）。 | 评估模型的**实时性**和**计算效率**，这对真实世界部署至关重要。 |\n\n**指标的技术内涵**:\n- **长程评估核心**: 论文特别强调**多步连续成功率**和**平均长度**，而非单步成功率。这直接针对现有VLA模型在长程任务中“中途失败”的痛点，如重复动作、跳过步骤、提前终止等。\n- **稳健性指标**: 在真实世界实验中，通过改变物体位姿（Random Localization）、光照（Unseen Lighting）和添加视觉干扰物（Visual Distraction）来测试**泛化能力**，成功率在这些扰动下的保持度是隐含的稳健性指标。\n\n### 二、 数据集\n\n论文采用了分阶段的训练策略，使用了多种类型的数据集，细节如下：\n\n| 数据集类型 | 具体数据集 | 用途与细节 | 贡献与价值 |\n| :--- | :--- | :--- | :--- |\n| **预训练 - 机器人数据** | **DROID** [khazatsky2025droid] <br> **BridgeData V2** [walke2024bridgedatav2] | - **用途**: 大规模预训练，学习多样化的真实世界机器人操作技能。 <br> - **细节**: 提供“野外”环境下的机械臂演示数据，覆盖广泛的任务和场景。 | 建立**机器人操作的基础世界模型**和**动作先验**，为模型提供丰富的动作-观察配对数据。 |\n| **预训练 - 长程视频数据** | **EPIC-KITCHENS** [damen2020epickitchens] <br> **RoboCerebra** [han2025robocerebra] | - **用途**: 预训练，专门用于学习**语义进度估计**。 <br> - **细节**: 提供精细标注的子步骤和时间分段信息，包含人类日常活动中长程、接触丰富的复杂任务视频。 | 赋予模型理解**长程任务时序结构**和**阶段进展**的能力，这是传统机器人数据集所缺乏的。 |\n| **微调 - 人工标注数据** | 论文自行收集 | - **用途**: 模型微调，学习**具身化的可操作性预测**和**进度感知策略**。 <br> - **细节**: 从机器人数据中选取942条轨迹，通过半自动方法标注了**四种可操作性**（全局、局部、空间、动态）和**连续进度标签**。 | 将预训练获得的通用知识**对齐到具体的机器人控制任务**上，是实现高性能长程操作的关键环节。 |\n| **评估 - 仿真基准** | **CALVIN ABCD** [mees2022calvin] | - **用途**: 主要长程评估基准。 <br> - **细节**: 包含34个语言指令任务，分布在A、B、C、D四个不同环境中。采用**ABCD设置**：在A、B、C环境上预训练/微调，在**未见过的D环境**上测试，评估**跨场景泛化**能力。 | 标准化的**长程、语言条件**操作测试平台，用于公平比较不同方法的性能。 |\n| **评估 - 仿真基准** | **LIBERO-LONG** [liu2023libero] | - **用途**: 长程评估基准。 <br> - **细节**: LIBERO基准的“Long”套件，专注于评估对**物体属性、空间关系、目标状态**的长期推理和知识迁移能力。 | 专门为评估**知识迁移**和**长程逻辑推理**而设计，挑战性极高。 |\n| **评估 - 真实世界数据** | 论文自行搭建 | - **用途**: 真实世界长程泛化测试。 <br> - **细节**: 设计了一个包含6个连续子任务（如“将菠萝放在白盘子上，葡萄放在白碗里…”）的复杂操作任务。在**随机初始位姿、未知光照、视觉干扰**三种设置下进行评估。 | 验证模型从仿真到真实世界的**零样本/少样本泛化能力**，以及在实际物理环境中的**鲁棒性**，是技术实用性的最终检验。 |\n\n**数据集使用的技术创新**:\n1.  **多源异构数据融合**: 创新性地将**机器人演示数据**（提供动作动力学）与**人类日常视频数据**（提供丰富的长程任务语义和进度信息）结合进行预训练，突破了单一数据源的局限。\n2.  **可操作性标注**: 构建了包含多粒度可操作性（从物体级到像素级，从静态到动态）的标注数据集，为模型提供了密集的、与任务相关的监督信号，驱动其进行结构化推理。\n3.  **严格的评估协议**: 采用 **“训练域与测试域分离”**（如CALVIN ABCD）和**多维度扰动测试**（真实世界），确保了评估结果的**泛化性**和**可信度**，避免了过拟合到特定训练环境。",
            "timestamp": "2026-01-21T12:13:50.657851",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文在哪些数据集上进行了实验？主要的评估指标和性能提升是多少？",
            "answer": "## 论文实验数据集、评估指标与性能提升分析\n\n### 一、实验数据集\n论文在**仿真**和**真实世界**两个层面使用了多个数据集进行训练和评估。\n\n#### 1. 训练数据集\n- **预训练阶段**：\n    - **机器人数据集**：`DROID` 和 `BridgeData V2`，提供大规模、真实世界的机器人演示数据，用于学习多样化的任务基础。\n    - **长时程视频数据集**：`EPIC-KITCHENS` 和 `RoboCerebra`，提供细粒度的子步骤和时间段标注，用于学习复杂、多步骤场景中的语义进度估计。\n- **微调阶段**：\n    - **人工标注数据集**：从机器人数据中选取 **942 条轨迹**，通过半自动方法标注了**可承受性（affordance）数据**和**连续进度标签**，用于训练可承受性感知和进度感知策略。\n\n#### 2. 评估基准（仿真）\n- **CALVIN ABCD**：一个长时程、语言条件化的机器人操作基准，包含 **34 个任务**，分布在四个不同环境中。论文在 **ABCD 设置**下评估，即在 ABC 环境中预训练，在未见过的 D 环境中测试。\n- **LIBERO**：包含四个任务套件（Spatial, Object, Goal, Long），每个套件有 **10 个任务**，用于评估机器人对空间关系、物体、目标和长时程任务的理解。重点评估了 **LIBERO-LONG**。\n\n#### 3. 真实世界实验\n- 使用 **UFACTORY xArm6 机器人**和 **Gripper G2**，配备两个 **RealSense D455 相机**（眼在手和眼在基座）。\n- 设计了包含 **6 个连续子任务**的长时程操作任务（例如，“将菠萝放在白盘子上，葡萄放在白碗里，橙子放在蓝碗里”）。\n- 在三种泛化设置下测试：**随机定位**、**视觉干扰**和**未见过的光照**。\n\n### 二、主要评估指标\n1. **成功率（Success Rate, SR）**：成功完成（子）任务的比率。\n2. **平均连续完成长度（Avg. Len.）**：在长时程任务中，平均能连续成功完成的任务数量（例如，在 CALVIN 中最多连续完成 5 个子任务）。\n3. **平均成功率**：在 LIBERO 的不同任务套件上的平均成功率。\n\n### 三、性能提升与关键结果\n\n#### 1. CALVIN ABCD 基准\n- **PALM（完整模型）** 取得了 **SOTA 性能**：\n    - **5 个连续任务的成功率**：**82.0%**，比之前最强的基线（Seer，64.3%）**绝对提升了 17.7%**。\n    - **平均连续完成长度**：**4.48**，显著高于 Seer（3.98）和 π₀（3.92）。\n    - **关键对比**：移除进度预测的 PALM（✗ progress）性能下降（平均长度 4.02 → 4.48），凸显了进度感知对长时程泛化的关键作用。\n\n#### 2. LIBERO 基准\n- **PALM 在四个任务套件上均达到 SOTA**：\n    - **平均成功率**：**94.5%**。\n    - **LIBERO-LONG 成功率**：**91.8%**，比最强基线（CoT-VLA，69.0%）**绝对提升了 22.8%**。\n\n#### 3. 真实世界实验\n- 在三种泛化设置下，PALM 均显著优于基线（OpenVLA 和 Octo）：\n    - **随机定位**：平均连续完成长度 **3.05**（基线最高 0.95）。\n    - **视觉干扰**：平均连续完成长度 **3.80**（基线最高 1.60）。\n    - **未见过的光照**：平均连续完成长度 **3.55**（基线最高 1.25）。\n\n### 四、总结\n- **技术创新**：通过结合**结构化可承受性预测**与**连续进度估计**，PALM 解决了长时程操作中的状态模糊和时序不一致问题。\n- **实际价值**：在仿真和真实世界中均表现出强大的泛化能力和鲁棒性，为将复杂多步骤任务部署到动态、开放世界环境（如家庭、仓库）提供了更可靠的解决方案。",
            "timestamp": "2026-01-21T12:14:21.900430",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文的主要局限性有哪些？未来可能的改进方向是什么？",
            "answer": "## 论文主要局限性分析\n\n基于对论文内容的分析，**PALM** 框架虽然在长视野操作任务上取得了显著进展，但仍存在以下几个主要局限性：\n\n- **数据依赖与标注成本**：\n    - 模型训练严重依赖大规模、多源数据集（如机器人数据、长视野视频数据）以及**人工标注的示教轨迹**（fine-tuning阶段使用了942条人工标注轨迹）。\n    - 获取高质量、细粒度的**可操作性（affordance）标注**（如接触点、放置区域、动态区域）和**连续进度标签**成本高昂，限制了模型的快速扩展和新任务的适应能力。\n    - 论文提到使用“半自动化方法”进行标注，但该方法的具体细节、可扩展性和通用性未充分说明。\n\n- **泛化能力的边界**：\n    - 尽管在**仿真基准（CALVIN, LIBERO）** 和设计的**真实世界泛化测试**（随机定位、视觉干扰、未知光照）中表现出色，但这些测试场景仍是受控和结构化的。\n    - 模型在**极端分布外（OOD）场景**下的鲁棒性未经充分验证，例如：全新的物体类别、完全未知的物体材质、动态干扰（如移动的障碍物）、或指令语义极度模糊的情况。\n    - 进度估计模块（`p_t`）的鲁棒性虽然在附录中针对特定扰动进行了测试，但其在更复杂、连续扰动下的长期稳定性仍有待考察。\n\n- **计算效率与实时性**：\n    - 模型架构集成了多个复杂模块（多模态编码器、GPT风格Transformer、四个可操作性预测头、扩散Transformer解码器），尽管通过Perceiver Resampler等技术进行了压缩，但整体计算开销仍然较大。\n    - 推理时，扩散Transformer需要**10步去噪**才能生成动作，虽然论文称闭环频率可达10-15Hz（约70-100ms/步），但这在需要更高频率（如>30Hz）的**动态、高速操作任务**中可能成为瓶颈。\n    - 训练需要**8块A100 GPU**，资源要求较高。\n\n- **模块化设计与误差传播**：\n    - 框架采用了**级联预测**结构：先预测未来可操作性，再基于此生成动作和进度。这种设计虽然提供了结构化推理，但也引入了**误差传播风险**。如果可操作性预测出现偏差（例如，在杂乱场景中错误识别了相关物体），后续的动作生成将基于错误的前提，可能导致任务失败。\n    - 四个可操作性预测头（全局、局部、空间、动态）是独立监督的，它们之间的**协同优化和一致性**可能不足，特别是在数据有限的场景下。\n\n- **对仿真与特定硬件的依赖**：\n    - 大部分性能评估在仿真环境中完成。虽然进行了真实世界实验，但任务设置（六步顺序放置）和机器人平台（xArm6）相对特定。\n    - 模型对**视觉编码器（MAE ViT）和文本编码器（CLIP）的冻结权重**存在依赖，这些预训练模型的偏差和能力上限会直接影响PALM的性能。\n\n---\n\n## 未来可能的改进方向\n\n针对上述局限性，未来的研究工作可以从以下几个方向展开：\n\n- **降低数据依赖与开发自监督方法**：\n    - 探索更强的**自监督或弱监督学习范式**，以减少对昂贵人工标注的依赖。例如，利用大规模未标注视频数据，通过**对比学习、掩码建模或时间一致性约束**来自动学习可操作性和进度表示。\n    - 研究**仿真到真实（Sim2Real）的迁移技术**，利用丰富的仿真数据生成可操作性标注，并设计域适应方法以降低真实世界数据的需求。\n\n- **增强泛化与鲁棒性**：\n    - 将**物理常识和世界模型**更显式地融入框架。例如，引入轻量级的物理引擎推理或基于物理的约束，使模型对物体属性（质量、摩擦）、物理交互（碰撞、支撑）有更好的理解，从而应对更复杂的OOD场景。\n    - 开发**更健壮的进度估计器**，使其不仅能基于视觉线索，还能结合**力觉、触觉等多模态传感信息**，在视觉信息缺失或不可靠时（如严重遮挡）仍能可靠跟踪任务状态。\n\n- **提升计算与架构效率**：\n    - 对模型进行**压缩与蒸馏**，探索更轻量级的架构（如高效的Transformer变体、更小的扩散步数），在保持性能的同时提升推理速度，以满足更高频率的实时控制需求。\n    - 研究**可操作性预测与动作生成的联合优化或端到端训练**方法，减少模块间的误差传播，并可能提升整体效率。\n\n- **扩展任务范围与交互能力**：\n    - 将框架扩展到**非刚性物体操作、双手操作、人机协作**等更复杂的任务领域。\n    - 探索**主动感知与规划**的结合，使机器人不仅能预测可操作性，还能在不确定时主动调整视角或进行探索性动作以获取更好信息。\n    - 研究**与大型语言模型（LLMs）或视觉语言模型（VLMs）的更深度集成**，利用其强大的常识和推理能力进行更高层次的任务分解和意图理解，而PALM专注于低层的、基于物理的细粒度推理与控制。\n\n- **开源与生态建设**：\n    - **开源代码、模型和标注工具链**，以促进社区研究，共同攻克数据瓶颈和泛化挑战。\n    - 建立更**多样化、更具挑战性的长视野操作基准测试**，涵盖更广泛的物体、场景、干扰类型和任务复杂度，以推动领域发展。\n\n**总结**：PALM的核心价值在于通过**结构化的可操作性推理**和**连续的进度感知**，为长视野操作提供了关键的内部状态表示和时序 grounding。未来的改进将围绕如何以更低的成本（数据、计算）获得更强大、更通用、更鲁棒的能力，最终实现机器人在开放世界中的自主、可靠操作。",
            "timestamp": "2026-01-21T12:15:06.171895",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        }
    ],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-11T21:00:58Z",
    "created_at": "2026-01-21T12:09:07.021874",
    "updated_at": "2026-01-21T12:09:07.021880",
    "recommend": 0
}