{
    "id": "2601.08143v1",
    "title": "A Pin-Array Structure for Gripping and Shape Recognition of Convex and Concave Terrain Profiles",
    "authors": [
        "Takuya Kato",
        "Kentaro Uno",
        "Kazuya Yoshida"
    ],
    "abstract": "本文提出了一种适用于极端环境下移动机器人的抓取与地形识别夹持器。配备夹持器的多足攀爬机器人在悬崖、洞穴壁等崎岖地形中具有显著优势，但在未知自然环境中，这类机器人可能因抓取失误或可抓取点缺失而发生倾覆或卡滞。为解决这些问题，需要一种既能自适应抓取不规则地形，又能精确测量地表形状的夹持器。我们通过引入针阵列结构，开发出可同时抓取凸凹地形并实时测量地形轮廓的夹持装置。通过原型机实验，我们验证了该夹持器的工作原理，并评估了其抓取性能与地形识别能力。实验表明，所提出的针阵列设计不仅适用于不规则地形的自适应抓取，在三维地形测绘方面也表现出良好性能。",
    "url": "https://arxiv.org/abs/2601.08143v1",
    "html_url": "https://arxiv.org/html/2601.08143v1",
    "html_content": "A Pin-Array Structure for Gripping and Shape Recognition\nof Convex and Concave Terrain Profile\nTakuya Kato\n1\n, Kentaro Uno\n1\nand Kazuya Yoshida\n1\n1\nThe authors are with the Department of Aerospace Engineering, Graduate School of Engineering, Tohoku University, Sendai 9808579, Japan.\nkato.takuya.s8@dc.tohoku.ac.jp,\n{unoken, yoshida.astro}@tohoku.ac.jp\nAbstract\nThis paper presents a gripper capable of grasping and recognizing terrain shapes for mobile robots in extreme environments. On rough terrains such as cliffs and cave walls, multi-limbed climbing robots with grippers are effective. However, such robots may fall over due to\nmisgrasping the surface or get stuck due to the loss of graspable points in unknown natural environments. To overcome such issues, we need a gripper capability of adaptive grasping to irregular terrain, and not only for grasping but also for measuring the shape of the terrain\nsurface accurately. We have developed a gripper that can grasp both convex and concave terrains and measure the terrain shape at the same time, by introducing a pin-array structure. We show the mechanism of the gripper and evaluate its grasping and terrain recognition performance\nusing a prototype. We demonstrate the proposed pin-array design works well for 3D terrain mapping, as well as adaptive grasping for irregular terrain.\nI\nINTRODUCTION\nMobile robots locomote effectively by utilizing the interaction with an environment intelligently\n[\n1\n,\n2\n]\n. Particularly in unstructured and extreme environments, robots need to acquire environmental information accurately and efficiently to feedback them to the controller. Wheels are widely used for mobility on relatively smooth and non-steep terrain because of the simplicity of the control and mechanism, and energy efficiency. However, it is too tough for the wheeled robots to traverse rigorous natural terrain such as cliffs, ocean floors, and asteroid surfaces. In such natural environments, unevenness of the terrain and the gravitational effect make it difficult to maintain contact with the terrain surface and the robot pose. The addition of adhesivity to grasp the terrain surface helps to maintain the reaction force from the terrain surface and to support the robot body stably.\nMeanwhile, the legged robot’s high traversability in natural uneven and steep terrain is widely demonstrated and showing the robustness\n[\n3\n]\n. Therefore, various legged robots with grippers installed at the feet are considered to be the effective solution to realize the traversing and climbing capability of the mobile robots\n[\n4\n,\n5\n,\n6\n]\n.\nFor stable and efficient locomotion of these climbing robots, it is essential to gain and utilize the appropriate reaction force through the interaction between the gripers and the terrain surface. In this research field, Shirai\net al.\nhave proposed contact-rich grasping/locomotion planning with the terrain surface\n[\n7\n]\n. Another quadrupedal climbing robot: HubRobo\n[\n6\n]\ndeveloped by our research group is capable of sustaining the foot contact and robot pose by installing the passive spine gripper mechanisms\n[\n8\n]\n.\nFigure 1:\nThe proposed gripper and conceptual illustration of application to a robot.\nHowever, these robotic climbing has only been demonstrated in simulated environments composed of easily graspable footholds that are discretely arranged. In contrast, natural terrains extend continuously, and some parts are convex and some are concave. Therefore, robots should observe the terrain and accurately detect the graspable shapes in it. Through this sensing and detection process, the graspable points are randomly extracted on the terrain surface. Graspable target detection using the 3D point cloud of the terrain is also reported\n[\n9\n]\n, however, vision-based terrain sensing and mapping capabilities depend on optical conditions and are limited in terms of accuracy. Moreover, even though the robot can sense the terrain precisely and detect the graspable shapes, the more limited shapes the gripper can grasp, the less graspable areas are on the terrain. Then if the nearest graspable points are not in the range that the robot’s feet reach, it will get stuck. Various grippers to grasp the natural terrains have been proposed so far, however, the graspable shapes are limited (e.g., convex, planar only)\n[\n10\n,\n11\n]\n. As another approach to maximize the graspable parts in terrain, NASA/JPL’s quadrupedal rock-climbing robot: LEMUR3’s microspine grippers have hundreds of hooks. This redundant design enables it to grasp almost everywhere on the rocky surface. However, this concept results in the large size and weight of the grippers, which made the locomotion slow (three minutes per grip/ungrip cycle). In summary, significant improvements are essential in 1) terrain sensing/mapping and 2) versatile grasping for the climbing robots to perform autonomous locomotion.\nIn this paper, to address the aforementioned technical problems: limitation of 1) the accuracy in the terrain mapping and 2) the graspability of the various shapes, we propose a novel pin-array gripper that can grasp both convex and concave terrain surfaces and simultaneously measure the shape of the terrain by the tactile sensing (Fig.\n1\n). By gripping the terrain surface and measuring its shape at the same time, the robot can move on the terrain surface without any pre-observation processes. We first present the pin-array gripper design that enables simultaneous grasping and shape recognition of the unstructured terrain, as well as the mechanistic model of gripping. We then experimentally evaluate the gripping performance of the prototyped gripper and its functionality. Lastly, we demonstrate 3D terrain mapping with the proposed gripper and discuss the applicability of the system to a mobile robot.\nII\nGRIPPER DESIGN\nII-A\nMechanism for Gripping\nSome flexible grippers have been proposed that adapt and deform themselves to the shape of a target object. This adaptability allows them to grasp universal shapes without posture estimation of the object or grasp planning. However, there are not many grippers capable of a strong grip both convex and concave terrains. Although one example of the universal gripper uses the jamming transition phenomenon of powders or granules\n[\n13\n]\n, it is hard to apply in a natural environment where the gripper’s material property changes. Pin-array mechanisms, such as a contour gauge, have also been proposed. The principal example is the Omnigripper\n[\n14\n]\n, which can only grasp convex shapes. Grippers that grasp various objects have been developed by improving the pins’ movement and geometry\n[\n15\n,\n16\n]\n. However, they do not have sufficient power to support a robot because they grasp the target object by friction between pins and the target. Noh\net al.\nproposed a robot with pin-array legs\n[\n17\n]\n, but it cannot maintain the robot body stably on inclined surfaces because it does not have grasping ability.\nFigure 2:\nSchematic of the proposed gripping structure. The upper illustration shows the basic structure of the gripper. The lower side view illustrations show the movement of pins and holders when gripping convex/concave shapes.\nWe propose a new gripping mechanism using a pin-array with spines and two types of holders. The schematic diagram is shown on the upside of Fig.\n2\n. The pins are divided vertically into two parts and stored in separate holders. The backside holder is fixed to the gripper, and the front holder can slide horizontally. Each tip of the pin has an elastic component and spines. The elastic force presses the spine against a target to obtain a holding force.\nAs shown at the bottom in Fig.\n2\n, the grasping flow is classified into three phases. In (a) Approaching phase, detailed shape and posture information of a target terrain surface is not required. In (b) Adapting phase, the gripper is simply pressed against a target terrain surface, and the pin-array is passively adapted. Finally, in (c) Locking phase, the movable holder is actively actuated horizontally. This motion enables the spines to press against a target terrain surface, providing a holding force by hooking. The same sequence is used to grasp an object, whether it is convex or concave. For example, when gripping a convex shape, the pins apply a pinching force from the outside, and when gripping a concave shape, they apply an expanding force from the inside. In (c) Locking phase, the vertical movement of all pins should be locked.\nII-B\nMechanistic Model with External Force\nIn this section, we study the holding force using a mechanistic model when a pulling force is applied to the gripper in the\nZ\nZ\n-axis (vertical) direction.\nThe elastic component of the pin can be assumed to be a cantilevered beam, as shown in Fig.\n3\n. If the distance that the holder slides after a spine touch a terrain surface is\nδ\ni\n\\delta_{i}\n, the pushing force by the spine\nP\ni\nP_{i}\nis given by\nP\ni\n=\n3\n​\nδ\ni\n​\nE\n​\nI\nl\n3\n\\displaystyle P_{i}=\\frac{3\\delta_{i}EI}{l^{3}}\n(1)\nwhere\nE\nE\nis Young’s modulus of the elastic component,\nI\nI\nis the second moment of area, and\nl\nl\nis the distance from the fixed end to the spine.\nFigure 3:\nMechanistic model of the proposed gripper when gripping terrain surface.\nHereafter, we discuss a frictional model between a spine and a terrain surface.\nAsbeck\net al.\nhave studied the friction model between a sharp-tip object and rough terrain surface with microscopic asperities\n[\n18\n]\n. Based on this, the asperity can be assumed as a triangular projection, as illustrated on the right side of Fig.\n3\n. Given an external force\nf\nf\nin the\nZ\nZ\n-axis to per pin, the condition for no-slip is expressed as follows.\nf\n<\nμ\ni\n′\n​\nP\ni\n​\n(\nμ\ni\n′\n=\n1\n+\nμ\n​\ntan\n⁡\nβ\ni\ntan\n⁡\nβ\ni\n−\nμ\n)\n\\displaystyle f<\\mu^{\\prime}_{i}P_{i}\\;\\;\\;(\\mu^{\\prime}_{i}=\\frac{1+\\mu\\tan\\beta_{i}}{\\tan\\beta_{i}-\\mu})\n(2)\nWhere\nμ\ni\n′\n\\mu^{\\prime}_{i}\nis the local friction coefficient, and\nμ\n\\mu\nis the global friction coefficient between the spine and the terrain surface.\nμ\ni\n′\n\\mu^{\\prime}_{i}\ndepends on the angle\nβ\ni\n\\beta_{i}\nof the asperity and diverges to infinity as\nβ\ni\n\\beta_{i}\napproaches 0. In nature, however, if a large external force is applied, the asperity is broken by the spine and slipped.\nAssuming that the gripper is applied an external force in the\nZ\nZ\n-axis and it is equally applied to each pin in contact with the terrain surface, the condition that the gripper cannot come off is given by\nF\n<\n2\n​\n∑\ni\n=\n1\nn\nμ\ni\n′\n​\nP\ni\n\\displaystyle F<2\\sum_{i=1}^{n}\\mu^{\\prime}_{i}P_{i}\n(3)\nwhere\nn\nn\nis the number of pins in contact with the terrain surface. In practice, the holding force varies because external forces applied to each pin are not always equal, and they can also break the spines and terrain surface.\nII-C\nRecognition of Terrain Shapes\nFigure 4:\nProcedure of shape recognition by the gripper. The lower illustration shows a close-up of the sensor section and the relationship between the height of a pin\nh\ni\nh_{i}\nand the sensor resistance value\nr\ni\nr_{i}\n.\nWe introduce the second function of the gripper, that is shape recognition capability by tactile. In natural environments, climbing robots should observe the terrain for path planning and graspable point detection. Although vision sensors such as depth cameras are often applied for the robot’s vision, the sensing accuracy depends on the given optical conditions. For example, a passive stereo camera cannot sense in the dark. Active stereo and Time-of-Flight (ToF) cameras are also less accurate when the terrain or the camera is exposed to direct sunlight\n[\n19\n]\n. In addition, while depth cameras and LiDARs have a minimum length for the measurable depth range, it is difficult for a climbing robot to maintain a proper distance between the sensor and the terrain surface because the climbing robot is required to minimize the base height to keep the stability against the tipping over, so the distance to the terrain surface tends to be too close for the sensor.\nTactile sensing can be a solution to address these issues. Several methods have been proposed to classify objects by built-in sensors in a typical robotic gripper.\nTanaka\net al.\nproposed a method to classify objects by active touch using a three-finger gripper with tactile sensors on each finger\n[\n20\n]\n. However, when we use a rigid gripper, we can only obtain information at a few points where the object is contacted by the fingers. A method to acquire more information by increasing contact with a soft gripper has been proposed\n[\n21\n]\n, but the mounted tactile sensors are only two, and high-density shape information has not been obtained.\nIn contrast, we designed a gripper with a sensor on every pin of the pin-array structure and almost ten times as many sensors as the aforementioned methods to acquire dense shape information that enables terrain recognition. A schematic of the proposed system is shown in Fig.\n4\n. In the developed gripper prototype, we employed a pressure sensor to measure the pin displacement because of the miniatualized size. By the developed gripper, when a pin moves vertically, the resistance value of the built-in pressure sensor varies by the attached spring. In the proposed system, we obtain the height of the terrain by a linear approximation between the resistance and the height of a pin. When the gripper is pressed against a terrain surface, if the sensor resistance of a pin is\nr\ni\nr_{i}\n, the measured height,\nh\ni\nh_{i}\n, is given by\nh\ni\n=\nr\ni\n−\nR\nmax\nR\nmin\n−\nR\nmax\n+\nL\n+\nH\noffset\n\\displaystyle h_{i}=\\frac{r_{i}-R_{\\rm{max}}}{R_{\\rm{min}}-R_{\\rm{max}}}+L+H_{\\rm{offset}}\n(4)\nwhere\nR\nmax\nR_{\\rm{max}}\nand\nR\nmin\nR_{\\rm{min}}\nare the maximum and minimum resistance in the range of the linear approximation.\nL\nL\nis the distance a pin moves from\nR\nmin\nR_{\\rm{min}}\nto\nR\nmax\nR_{\\rm{max}}\nof the sensor’s resistance: displacement measurement range.\nH\noffset\nH_{\\rm{offset}}\nis the distance from a pin at its most extended state to the measurable range.\nIII\nGRIPPER PROTOTYPE\nWe developed a prototype of the gripper shown at the top of Fig.\n5\n. The width of the prototype is 150 mm, the height is 165 mm (when the pins are extended), the depth is 70 mm, and the whole mass is 522 g. It consists of three blocks, and each of them is composed of seven pins and two holders.\nThe distances between pins are\nX\npitch\n=\n14\n​\nmm\nX_{\\rm{pitch}}=14~\\rm{mm}\nalong the\nX\nX\n-axis and\nY\npitch\n=\n17.4\n​\nmm\nY_{\\rm{pitch}}=17.4~\\rm{mm}\nalong the\nY\nY\n-axis. The holders and pins are made of ABS plastic, the elastic components are made of polycarbonate, and the spines are brass nails.\nFigure 5:\nOverview of the gripper prototype (top), gripping and lifting convex/concave terrains composed of climbing holds (bottom).\nFigure 6:\nClose-up of the pin section (left, several pins and a movable holder are omitted for visibility). Link mechanism to actuate movable holders (right).\nThe close-up of the pin section is shown on the left side of Fig.\n6\n. At the bottom of the pins, there are guides to prevent the vertically divided pins from moving each other along the\nZ\nZ\n-axis. On the top, there are pressure sensors and springs for shape recognition. The locking mechanisms on fixed holders and pins restrain the\nZ\nZ\n-axis movement of all pins at the (c) Locking phase. The holders are actuated by a servo motor and a link mechanism.\nThe right side of Fig.\n6\nshows the motion of the link mechanism that translates the motor rotation into the linear motion of the holders.\nIt allows the gripper to grasp/release by simply turning the motor at the same angle, regardless of the terrain shapes.\nWe tested the prototype on an emulated terrain made of climbing holds as shown at the bottom of Fig.\n5\n. We confirmed that it could hold a 500 g object with both convex and concave shapes. In addition, we evaluated the pressure sensors. We examined the relationship between pin heights and sensor resistances for every 21 pins. From the results, we determined the linearized range as in Fig.\n4\n, where\nL\n=\n20\n​\nmm\nL=20~\\rm{mm}\nand\nH\noffset\n=\n16\n​\nmm\nH_{\\rm{offset}}=16~\\rm{mm}\n.\nR\nmax\nR_{\\rm{max}}\nand\nR\nmin\nR_{\\rm{min}}\nare determined individually for each pin since they vary depending on the individual sensor.\nFigure 7:\nExperimental setup to evaluate the gripping performance in different shapes of the gripped target (top), emulated convex and concave terrain shapes used in the experiment (bottom).\nIV\nEVALUATION\nIV-A\nGripping Performance for Various Shapes\nWe first evaluated the gripping performance of convex and concave terrain shapes using the prototype. In addition, the same experiment was conducted using a conventional gripper and the results were compared.\nAn overview of the experiments is shown at the top of Fig.\n7\n, and the emulated terrains are shown at the bottom. The gripper fixed to the experimental device gripped an emulated terrain and applied an external pulling force in the negative direction of the\nZ\nZ\n-axis. The pulling force was measured with a force gauge until the emulated terrain was released. The holding force was defined as the maximum pulling force plus the gravity applied to the emulated terrains. If the gripper failed to grasp and the emulated terrain fell, the holding force was defined as 0 N. The emulated terrains were seven different types with inclination angles\nϕ\n\\phi\n, each covered with #40 sandpaper. Measurements were taken 10 times on each emulated terrain. The conventional gripper used for comparison has eight fingers with spines attached in a radial pattern, the same finger arrangement used in HubRobo\n[\n6\n]\n.\nFigure 8:\nHolding force measured by the force gauge for each inclination angle of emulated terrain shapes. Error bars are the standard deviation (STD) of holding force from ten times results for each\nϕ\n\\phi\n.\nAs a result of the experiment, the relationship between the emulated terrain’s inclination angle\nϕ\n\\phi\nand the average value of holding force\nF\nF\nis shown in Fig.\n8\n. Error bars are the standard deviation (STD) of holding forces. When the inclination angle\nϕ\n\\phi\nis negative, the terrain shape is concave, and when it is positive, the shape is convex. The proposed gripper obtained a steady holding force of 5~10 N for more shapes than conventional grippers.\nThe holding force decreased as the inclination became more gentle in both cases convex and concave. It shows that the angle of microscopic asperity\nβ\ni\n\\beta_{i}\nincreases as the slope becomes more gentle, and the local friction coefficient\nμ\ni\n′\n\\mu^{\\prime}_{i}\nbecomes smaller, as shown in the equation (\n2\n).\nAt\nϕ\n=\n90\n​\ndeg\n\\phi=90~\\rm{deg}\nand\nϕ\n=\n−\n90\n​\ndeg\n\\phi=-90~\\rm{deg}\n, the holding force was smaller, and the variability was larger than at\nϕ\n=\n60\n​\ndeg\n\\phi=60~\\rm{deg}\nand\nϕ\n=\n−\n60\n​\ndeg\n\\phi=-60~\\rm{deg}\n. It indicates that the surface area of the emulated terrain was smaller, and the number of pins\nn\nn\nwhose spines touched the emulated terrain was reduced, as shown in equation (\n3\n). Since\nn\nn\nwas determined randomly, the smaller surface area had a greater effect on the variation in holding force.\nIV-B\nShape Recognition\nShape recognition by the proposed gripper was evaluated using the prototype. We examined the accuracy of the measured shapes by comparing them with ground truth.\nAn overview of the experiment shows in Fig.\n9\n. The emulated terrains were two types: convex and concave with heights of 20 mm and flat in the depth direction. The gripper was pressed against the terrain surface by the device until the pins were sufficiently adapted. After that, we measured the heights of each pin by sensors in the gripper. The heights of pins are determined from the resistance values of the pressure sensors, as shown in equation (\n4\n).\nWe measured 10 times on each emulated terrain.\nFigure 9:\nExperimental setup to evaluate shape recognition and emulated grounds.\nFigure 10:\nMeasured height of the emulated terrain by the gripper for each convex and concave terrain shape. Error bars are the standard deviation (STD) of height in the 10 times experiment.\nFig.\n10\nshows the average measured heights for each emulated terrain. The gray lines show the ground truth. Error bars are the standard deviation of measured heights. We could obtain shape information indicating the convexity and concavity characteristics of the terrains.\nStandard deviations of the measured values at each emulated terrain are\nσ\n¯\nconvex\n=\n2.71\n​\nmm\n\\bar{\\sigma}_{\\rm{convex}}=2.71~\\rm{mm}\nand\nσ\n¯\nconcave\n=\n2.02\n​\nmm\n\\bar{\\sigma}_{\\rm{concave}}=2.02~\\rm{mm}\nfor the average of all pins. However, the standard deviation varies significantly among individual sensors, as shown in the graph. The maximum value of the standard deviation is\nσ\nmax\n=\n6.69\n​\nmm\n\\sigma_{\\rm{max}}=6.69~\\rm{mm}\n, and the minimum is\nσ\nmin\n=\n0.16\n​\nmm\n\\sigma_{\\rm{min}}=0.16~\\rm{mm}\n. In order to achieve accurate shape recognition, it is required to reduce the variation.\nThese results show that the proposed system provides high-density information on shape and size by simply pressing the gripper against the terrain surface. The system is expected to generate a physical interaction with the unknown environment by simultaneously gripping and recognizing the terrain, thereby improving the robot’s autonomous locomotion.\nIV-C\n3D Mapping\nIt is necessary for a mobile robot in an unknown environment to map its surroundings for action planning of the mobile robot. We experimented with 3D mapping of uneven terrain by combining shape recognition and gripper location information. The accuracy of the mapping was evaluated by comparison with ground truth.\nThe experimental setup consists of the gripper and the machine that actuates the gripper, as shown in Fig.\n11\n. The machine is a two degree-of-freedom translational drive mechanism that can move the gripper to any position in the\nx\nx\n–\nz\nz\nplane. The mapping is performed using the machine and the gripper by repeating the following actions.\nFigure 11:\nExperimental setup to evaluate 3D mapping by the gripper and the emulated terrain.\nFigure 12:\n3D map generated by the gripper. The upper figure shows all the point clouds acquired by the gripper. The lower shows averages of the\nz\nz\nvalues of the separated point cloud by square columns on the\nx\nx\n–\ny\ny\nplane. The points far off the ground truth in the upside graph (marked by arrows) were removed by the averaging.\n1.\nMove the gripper by\nΔ\n​\nx\n\\Delta x\nalong the\nX\nX\n-axis.\n2.\nMove the gripper in the negative direction of the\nZ\nZ\n-axis and press against the emulated terrain surface until the pins are sufficiently adapted.\n3.\nGet the value of sensors in the gripper and the gripper’s current position.\n4.\nMove the gripper in the positive direction of the\nZ\nZ\n-axis until all pins leave the terrain surface.\nWe set\nΔ\n​\nx\n=\n10\n​\nmm\n\\Delta x=10~\\rm{mm}\nand repeated the above operation 12 times, then generated a point cloud from all the sensor values and current gripper positions.\nGiven the gripper position\n(\nx\ng\n,\nz\ng\n)\n(x_{g},z_{g})\n, each coordinate of the point cloud in the World coordinate system is expressed as follows.\nx\ni\n=\nx\ng\n+\nj\n​\nX\npitch\n,\ny\ni\n=\nk\n​\nY\npitch\n,\nz\ni\n=\nz\ng\n+\nh\ni\n\\displaystyle x_{i}=x_{g}+jX_{\\rm{pitch}},\\;\\;y_{i}=kY_{\\rm{pitch}},\\;\\;z_{i}=z_{g}+h_{i}\n(5)\nwhere\nj\nj\nand\nk\nk\nare numbers representing the position of a pin (\nj\n=\n1\n,\n2\n,\n…\n,\n7\nj=1,2,...,7\n,\nk\n=\n1\n,\n2\n,\n3\nk=1,2,3\n).\nX\npitch\nX_{\\rm{pitch}}\nand\nY\npitch\nY_{\\rm{pitch}}\nare distance between pins in each direction.\nh\ni\nh_{i}\nis the measured height of each pin by built-in sensors, as shown in equation (\n4\n).\nThe width of the emulated terrain is 200 mm, the height is 45 mm, and the depth is 40 mm as shown in Fig.\n11\n.\nIt includes convex, concave, and a slope at depth, with a height displacement of 20 mm.\nThe point cloud obtained by the experiment is shown in Fig.\n12\n. The upper figure shows all the point clouds obtained from the measurements. The lower shows averages of the\nz\nz\nvalues of the separated point cloud by square columns of\nx\n=\n10\n​\nmm\nx=10~\\rm{mm}\nand\ny\n=\n15\n​\nmm\ny=15~\\rm{mm}\n. The gray plane is the ground truth. The average height error from the ground truth at each point in the lower figure was\ne\n¯\n=\n7.67\n​\nmm\n\\bar{e}=\\rm{7.67~mm}\n.\nThe proposed system could reconstruct the map of the convex and concave shapes in the emulated terrain as a point cloud. The slope along the\nY\nY\n-axis was successfully mapped as well. Furthermore, the points far off the ground truth in the upside graph (marked by arrows) were removed by averaging with the neighboring points. It indicates that by measuring the same location repeatedly with different pins, the individual differences between sensors were an issue in Section IV-B, are offset, and accurate information is obtained.\nV\nCONCLUSION\nIn this paper, we presented a pin-array gripper capable of gripping various shaped terrain surfaces and measuring the shape at the same time. We prototyped the gripper and experimentally evaluated its grasping and sensing functions. The proposed gripper is featured in the following points: 1) versatile graspability: the proposed gripper can grip more various shapes, including concaves, than the conventional gripper without any preobservation or grasping planning; 2) terrain measuring capability: we experimentally demonstrated the feasibility of terrain shape recognition (convex or concave) by the proposed gripper. In addition, we applied the function to a 3D terrain mapping application and confirmed its effectiveness. In conclusion, the proposed gripper has a sufficient capability of versatile grasping and accurate terrain sensing/mapping simultaneously, thus the proposed system is effective for mobile robots in unstructured environments to move autonomously and reliably.\nIn future work, the authors plan to develop a robot with the proposed gripper installed on its limbs and conduct field test campaigns on a cliff to confirm its effectiveness in more practical situations.\nImprovements to the sensing system of the gripper are also following this work to obtain more dense shape and force information by combining different sensors such as force/torque sensors and vision sensors.\nReferences\n[1]\nR. A. Brooks,\n“New Approaches to Robotics”,\nScience\n, vol. 253, issue 5025, pp. 1227–1232, 1991.\n[2]\nR. Pfeifer,\net al.\n,\n“Morphological Computation – Connecting Brain, Body, and Environment”,\nJpn. Sci. Monthly\n, vol. 58, no. 2, pp. 48–54, 2005.\n[3]\nT. Miki,\net al.\n,\n“Learning Robust Perceptive Locomotion for Quadrupedal Robots in the Wild”,\nSci. Robot.\n, vol. 7, no. 62, 2022.\n[4]\nK. Yoshida,\net al.\n,\n“A Novel Strategy for Asteroid Exploration with a Surface Robot”,\nProc. 34th COSPAR Scientific Assembly\n, 2002.\n[5]\nY. Tanaka,\net al.\n,\n“SCALER: A Tough Versatile Quadruped Free-Climber Robot”,\nProc. IEEE/RSJ Int. Conf. Intel. Rob. Syst.\n, 2022.\n[6]\nK. Uno,\net al.\n,\n“Hubrobo: A Lightweight Multi-Limbed Climbing Robot for Exploration in Challenging Terrain”,\nProc. IEEE-RAS 20th Int. Conf. Humanoid Rob.\n, pp. 209–215, 2021.\n[7]\nY. Shirai,\net al.\n,\n“Simultaneous Contact-Rich Grasping and Locomotion via Distributed Optimization Enabling Free-Climbing for Multi-Limbed Robots”,\nProc. IEEE/RSJ Int. Conf. Intel. Rob. Syst.\n, 2022.\n[8]\nK. Nagaoka,\net al.\n,\n“Passive Spine Gripper for Free-Climbing Robot in Extreme Terrain”,\nIEEE Robot. Automat. Lett.\n, vol. 3, no. 3, pp. 1765–1770, 2018.\n[9]\nK. Uno\net al.\n,\n“Non-Periodic Gait Planning Based on Salient Region Detection for a Planetary Cave Exploration Robot”,\nProc. Int. Symp. Artif. Intell., Robot., Automat. Space\n, no. 5027, 2020.\n[10]\nS. Wang,\net al.\n,\n“A Palm for a Rock Climbing Robot Based on Dense Arrays of Micro-Spines”,\nProc. IEEE/RSJ Int. Conf. Intel. Rob. Syst.\n, pp. 52–59, 2016.\n[11]\nW. R. T. Roderick,\net al.\n,\n“Bird-Inspired Dynamic\nGrasping and Perching in Arboreal Environments”,\nSci. Robot.\n, vol. 6, no. 61, 2021.\n[12]\nA. Parness,\net al.\n,\n“LEMUR 3: A Limbed Climbing Robot for Extreme Terrain Mobility in Space”,\nProc. IEEE Int. Conf. Robot. Automat.\n, pp. 5467–5473, 2017.\n[13]\nE. Broun,\net al.\n,\n“Universal Robotic Gripper Based on the Jamming of Granular Material”,\nProc. National Academy of Sciences\n, vol. 107, no. 44, pp. 18809–18814, 2010.\n[14]\nP. B. Scott,\n“The ‘Omnigripper’: A Form of Robot Universal Gripper”,\nRobotica\n, vol. 3, issue 3, 1985.\n[15]\nH. Fu,\net al.\n,\n“A Novel Cluster-Tube Self-Adaptive Robot Hand”,\nRobot. biomim.\n, vol. 4, no. 1, art. no. 25, 2017.\n[16]\nA. Mo,\net al.\n,\n“A Novel Universal Gripper Based on Meshed Pin Array”,\nInt. J. Advanced Robotic Syst.\n, vol. 16, no. 2, 2019.\n[17]\nS. Noh,\net al.\n,\n“Pinbot: A Walking Robot with Locking Pin Arrays for Passive Adaptability to Rough Terrains”,\nProc. IEEE Int. Conf. Robot. Automat.\n, pp. 1438–1444, 2020.\n[18]\nA. Asbeck,\net al.\n,\n“Scaling Hard Vertical Surfaces with Compliant Microspine Arrays”,\nInt. J. Robot. Res.\n, vol. 25, no. 12, pp. 1165–1179, 2006.\n[19]\nK. Uno,\net al.\n,\n“Qualification of a Time-of-Flight Camera as a Hazard Detection and Avoidance Sensor for a Moon Exploration Microrover”,\nTrans. JSASS, Aerospace Tech. Jpn.\n, vol. 16, no. 7, pp. 619–627, 2018.\n[20]\nD. Tanaka,\net al.\n,\n“Object Manifold Learning with Action Features for Active Tactile Object Recognition”,\nProc. IEEE/RSJ Int. Conf. Intel. Rob. Syst.\n, pp. 608–614, 2014.\n[21]\nJ. M. Gandarias,\net al.\n,\n“Enhancing Perception with Tactile Object Recognition in Adaptive Grippers for Human–Robot Interaction”,\nSensors\n, vol. 18, no. 3, art. no. E692, 2019.",
    "preview_text": "This paper presents a gripper capable of grasping and recognizing terrain shapes for mobile robots in extreme environments. Multi-limbed climbing robots with grippers are effective on rough terrains, such as cliffs and cave walls. However, such robots may fall over by misgrasping the surface or getting stuck owing to the loss of graspable points in unknown natural environments. To overcome these issues, we need a gripper capable of adaptive grasping to irregular terrains, not only for grasping but also for measuring the shape of the terrain surface accurately. We developed a gripper that can grasp both convex and concave terrains and simultaneously measure the terrain shape by introducing a pin-array structure. We demonstrated the mechanism of the gripper and evaluated its grasping and terrain recognition performance using a prototype. Moreover, the proposed pin-array design works well for 3D terrain mapping as well as adaptive grasping for irregular terrains.\n\nA Pin-Array Structure for Gripping and Shape Recognition\nof Convex and Concave Terrain Profile\nTakuya Kato\n1\n, Kentaro Uno\n1\nand Kazuya Yoshida\n1\n1\nThe authors are with the Department of Aerospace Engineering, Graduate School of Engineering, Tohoku University, Sendai 9808579, Japan.\nkato.takuya.s8@dc.tohoku.ac.jp,\n{unoken, yoshida.astro}@tohoku.ac.jp\nAbstract\nThis paper presents a gripper capable of grasping and recognizing terrain shapes for mobile robots in extreme environments. On rough terrains such as cliffs and cave walls, multi-limbed climbing robots with grippers are effective. However, such robots may fall over due to\nmisgrasping the surface or get stuck due to the loss of graspable points in unknown natural environments. To overcome such issues, we need a gripper capability of adaptive grasping to irregular terrain, and not only for grasping but also for measuring the shape of the terrain\nsurface accurately. We have developed a gripper that can grasp both convex and concave terrains and measure the ",
    "is_relevant": false,
    "relevance_score": 1.0,
    "extracted_keywords": [
        "gripper",
        "pin-array",
        "terrain recognition",
        "adaptive grasping",
        "mobile robots",
        "climbing robots"
    ],
    "one_line_summary": "这篇论文提出了一种用于移动机器人的夹持器，采用针阵列结构来抓握和识别凸凹地形轮廓，但未涉及强化学习、VLA、扩散模型、Flow Matching、运动控制、VLM或全身控制等关键词。",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-13T02:16:10Z",
    "created_at": "2026-01-20T17:49:40.679461",
    "updated_at": "2026-01-20T17:49:40.679470",
    "recommend": 0
}