{
  "id": "2601.09163v1",
  "title": "CEI: A Unified Interface for Cross-Embodiment Visuomotor Policy Learning in 3D Space",
  "authors": [
    "Tong Wu",
    "Shoujie Li",
    "Junhao Gong",
    "Changqing Guo",
    "Xingting Li",
    "Shilong Mu",
    "Wenbo Ding"
  ],
  "abstract": "Robotic foundation models trained on large-scale manipulation datasets have shown promise in learning generalist policies, but they often overfit to specific viewpoints, robot arms, and especially parallel-jaw grippers due to dataset biases. To address this limitation, we propose Cross-Embodiment Interface (\\CEI), a framework for cross-embodiment learning that enables the transfer of demonstrations across different robot arm and end-effector morphologies. \\CEI introduces the concept of \\textit{functional similarity}, which is quantified using Directional Chamfer Distance. Then it aligns robot trajectories through gradient-based optimization, followed by synthesizing observations and actions for unseen robot arms and end-effectors. In experiments, \\CEI transfers data and policies from a Franka Panda robot to \\textbf{16} different embodiments across \\textbf{3} tasks in simulation, and supports bidirectional transfer between a UR5+AG95 gripper robot and a UR5+Xhand robot across \\textbf{6} real-world tasks, achieving an average transfer ratio of 82.4\\%. Finally, we demonstrate that \\CEI can also be extended with spatial generalization and multimodal motion generation capabilities using our proposed techniques. Project website: https://cross-embodiment-interface.github.io/",
  "url": "https://arxiv.org/abs/2601.09163v1",
  "html_url": "https://arxiv.org/html/2601.09163v1",
  "html_content": "CEI\n: A Unified Interface for Cross-Embodiment Visuomotor Policy Learning in 3D Space\nTong Wu\n1\n, Shoujie Li\n12\n, Junhao Gong\n1\n, Changqing Guo\n1\n, Xingting Li\n1\n,\nShilong Mu\n3\n, and Wenbo Ding\n1\nManuscript received: September 26, 2025; Revised: December 6, 2025; Accepted: January 11, 2026.This paper was recommended for publication by Editor Aleksandra Faust upon evaluation of the Associate Editor and Reviewers’ comments.\nThis work was supported by National Key R&D Program of China grant (2024YFB3816000), Guangdong Innovative and Entrepreneurial Research Team Program (2021ZT09L197), Shenzhen Science and Technology Program (JCYJ20220530143013030), Tsinghua Shenzhen International Graduate School-Shenzhen Pengrui Young Faculty Program of Shenzhen Pengrui Foundation (No. SZPR2023005) and Meituan.\nTong Wu and Shoujie Li contributed equally to this\nwork.\n(Corresponding author: Wenbo Ding, ding.wenbo@sz.tsinghua.edu.cn)\n1\nTong Wu, Shoujie Li, Junhao Gong, Changqing Guo, Xingting Li, Wenbo Ding are with Shenzhen International Graduate School, Tsinghua University, Shenzhen 518055, China. (email: {wu-t23, lsj20, gongjh24, gcq24, lixt25}@mails.tsinghua.edu.cn, ding.wenbo@sz.tsinghua.edu.cn))\n2\nShoujie Li is also with the School of Mechanical and Aerospace Engineering, Nanyang Technological University, Singapore 639956, Singapore. (email: shoujie.li@ntu.edu.sg)\n3\nShilong Mu is with Xspark Ai, Shenzhen 518052, China. (email: mu.shilong@xspark-ai.com)Digital Object Identifier (DOI): see top of this page.\nAbstract\nRobotic foundation models trained on large-scale manipulation datasets have shown promise in learning generalist policies, but they often overfit to specific viewpoints, robot arms, and especially parallel-jaw grippers due to dataset biases. To address this limitation, we propose Cross-Embodiment Interface (\nCEI\n), a framework for cross-embodiment learning that enables the transfer of demonstrations across different robot arm and end-effector morphologies.\nCEI\nintroduces the concept of\nfunctional similarity\n, which is quantified using Directional Chamfer Distance. Then it aligns robot trajectories through gradient-based optimization, followed by synthesizing observations and actions for unseen robot arms and end-effectors. In experiments,\nCEI\ntransfers data and policies from a Franka Panda robot to\n16\ndifferent embodiments across\n3\ntasks in simulation, and supports bidirectional transfer between a UR5+AG95 gripper robot and a UR5+Xhand robot across\n6\nreal-world tasks, achieving an average transfer ratio of 82.4%. Finally, we demonstrate that\nCEI\ncan also be extended with spatial generalization and multimodal motion generation capabilities using our proposed techniques. Project website:\nhttps://cross-embodiment-interface.github.io/\n.\nI\nIntroduction\nEmerging robotic foundation models are built upon scaling laws\n[\n11\n]\nand fueled by the growing availability of large-scale real-world manipulation datasets\n[\n7\n,\n26\n]\n. However, these datasets often suffer from significant distributional imbalances, leading models to overfit to specific camera viewpoints and robot embodiments\n[\n4\n]\n. For instance, OXE\n[\n13\n]\naggregates data from 60 datasets spanning multiple robotic platforms, yet remains heavily skewed toward Franka and xArm robots, with nearly all end-effectors limited to parallel grippers. Such biases limit the models’ ability to generalize\n[\n9\n]\n, especially when faced with embodiment variations.\nTo mitigate the embodiment biases, approaches such as Mirage\n[\n3\n]\nand RoVi-Aug\n[\n4\n]\nemploy techniques like cross-painting and generative models to synthesize visual observations, creating the illusion that the source robot is performing the task under test-time conditions. While these methods enable zero-shot deployment by bridging domain and embodiment gaps, their applicability is largely restricted to scenarios involving parallel-jaw grippers and Operational Space Control (OSC). These preconditions present significant challenges for transfer to more complex embodiments, such as multi-fingered dexterous hands. In fact, the limitation is further compounded by the scarcity of dexterous hand data\n[\n18\n]\n, which continues to hinder the development of generalizable policies across diverse robot embodiments.\nFigure 1:\nCross-embodiment interface.\nCEI\nenables cross-embodiment transfer between different robots by synthesizing demonstrations from a source embodiment to a target embodiment. We transfer data and policies from a Franka Panda robot to 16 target embodiments across 3 tasks in simulation, and demonstrate bidirectional transfer between a UR5+AG95 gripper and a UR5+Xhand setup across 6 real-world tasks. We also showcase\nCEI\n’s compatibility with spatial generalization and multimodal motion generation.\nIntriguingly, the underlying similarity in manipulation strategies between parallel-jaw grippers and dexterous hands suggests the feasibility of such cross-embodiment learning. For instance, when humans grasp a bottle, they often adopt a gripper-like pose that naturally promotes force closure. This motivates the question of whether such shared manipulation affordances can be systematically exploited to enable effective transfer across distinct end-effector morphologies.\nTo enable policy learning across heterogeneous robot embodiments, we propose Cross-Embodiment Interface (\nCEI\n), a unified framework for cross-embodiment data synthesis.\nCEI\nleverages a novel notion of\nfunctional similarity\n, which captures shared interaction behaviors across different end-effectors, to align robot motions from a source embodiment to a target embodiment. This is accomplished by quantifying this similarity using the Directional Chamfer Distance\n[\n16\n]\nbetween embodiments’ functional representations, aligning trajectories via gradient-based optimization, and synthesizing corresponding observations and actions for the target robot. Through extensive experiments in both simulation and real world, we show that\nCEI\neffectively transfers demonstrations and policies from a source robot equipped with a parallel-jaw gripper to a target robot with a five-fingered dexterous hand and vice versa, with an overall transfer ratio of 82.4%. Furthermore, we demonstrate that\nCEI\nis compatible with spatial generalization and support multimodal data generation using our extended techniques.\nOur contributions are summarized as follows:\n•\nWe propose a novel concept of\nfunctional similarity\nbased on Directional Chamfer Distance, coupled with gradient-based trajectory alignment, to transfer task-relevant manipulation behaviors across embodiments.\n•\nWe propose a general pipeline that leverages embodiment information to augment both observations and actions, enabling the synthesis of point cloud–based demonstrations across heterogeneous robots.\n•\nExperiments on 16 embodiments over 3 simulation tasks and bidirectional transfers over 6 real-world tasks demonstrate\nCEI\n’s effectiveness on cross-embodiment learning. Furthermore, we showcase that\nCEI\ncan be extended with spatial generalization and multimodal motion generation for diverse data synthesis.\nII\nRelated Work\nII-A\nData Generation for Robotic Manipulation\nWhile recent imitation learning methods have exhibited impressive performance\n[\n6\n,\n24\n]\n, the high cost of collecting expert demonstrations poses significant challenges to scalability and real-world deployment. To mitigate this, online data generation approaches adapt existing demonstrations to novel object configurations and produce plausible interaction trajectories via rollouts in high-fidelity physics simulators\n[\n12\n]\n. Although these methods preserve physical realism, they tend to be computationally intensive, and challenging to apply directly in real-world settings.\nIn contrast, offline data generation synthesizes new demonstrations from existing datasets through trajectory transformations\n[\n20\n]\nor generative model-based visual augmentations\n[\n5\n]\n.\nCEI\nfocuses on cross-embodiment transfer through offline data generation, but addresses the challenge of extreme differences between end-effectors, enabling the learning of dexterous hand policies from parallel gripper data.\nII-B\nCross-embodiment Learning\nPrior work has explored bridging the embodiment gap through various strategies, including space alignment\n[\n25\n,\n22\n,\n2\n]\n, cross-painting\n[\n3\n,\n4\n]\n, dynamics modeling\n[\n10\n]\n, and reward model learning\n[\n23\n]\n. Other approaches incorporate embodiment information directly into the policy and train across a set of embodiments with varying kinematics and dynamics, demonstrating generalization to unseen morphologies within the training distribution\n[\n8\n,\n15\n,\n19\n]\n.\nRecently, many efforts have focused on collecting cross-embodiment datasets\n[\n7\n,\n13\n,\n17\n]\n, which have been shown to generalize effectively across embodiments\n[\n21\n,\n14\n]\n. In contrast to these efforts, our work addresses extreme cross-embodiment data generation, specifically demonstration transfer between a parallel gripper and a dexterous hand, without requiring embodiment-specific training data.\nIII\nProblem Formulation\nA visuomotor policy\nπ\n:\n𝒪\n→\n𝒜\n\\pi:\\mathcal{O}\\rightarrow\\mathcal{A}\nmaps visual observations\no\n∈\n𝒪\no\\in\\mathcal{O}\nto actions\na\n∈\n𝒜\na\\in\\mathcal{A}\n. In imitation learning, such policies are typically trained from a dataset of demonstrations\n𝒟\n\\mathcal{D}\ncollected on a particular embodiment\nE\nE\n.\nWe represent each demonstration\nD\nE\n,\ns\n0\n⊆\n𝒟\nD_{E,s_{0}}\\subseteq\\mathcal{D}\nas a trajectory of observation-action pairs, conditioned on an initial task state\ns\n0\ns_{0}\nand robot embodiment\nE\nE\n:\nD\nE\n,\ns\n0\n=\n(\n(\no\n0\n,\na\n0\n)\n,\n(\no\n1\n,\na\n1\n)\n,\n…\n,\n(\no\nL\n−\n1\n,\na\nL\n−\n1\n)\n∣\ns\n0\n,\nE\n)\n.\nD_{E,s_{0}}=\\left((o_{0},a_{0}),(o_{1},a_{1}),\\dots,(o_{L-1},a_{L-1})\\mid s_{0},E\\right).\nEach observation\no\nt\n=\n(\no\nt\npcd\n,\no\nt\narm\n,\no\nt\nee\n)\no_{t}=(o_{t}^{\\text{pcd}},o_{t}^{\\text{arm}},o_{t}^{\\text{ee}})\nconsists of a point cloud and the proprioceptive states of the robot arm and end-effector, while each action\na\nt\n=\n(\na\nt\narm\n,\na\nt\nee\n)\na_{t}=(a_{t}^{\\text{arm}},a_{t}^{\\text{ee}})\nspecifies joint position targets for robot arm and end-effector.\nOur objective is to generate a corresponding demonstration\nD\n^\nE\n′\n,\ns\n0\n\\hat{D}_{E^{\\prime},s_{0}}\nfor a new target embodiment\nE\n′\nE^{\\prime}\npotentially differing in morphology and kinematics, starting from the same initial task state\ns\n0\ns_{0}\n:\nD\n^\nE\n′\n,\ns\n0\n=\n(\n(\no\n^\n0\n,\na\n^\n0\n)\n,\n(\no\n^\n1\n,\na\n^\n1\n)\n,\n…\n,\n(\no\n^\nL\n−\n1\n,\na\n^\nL\n−\n1\n)\n∣\ns\n0\n,\nE\n′\n)\n.\n\\hat{D}_{E^{\\prime},s_{0}}=\\left((\\hat{o}_{0},\\hat{a}_{0}),(\\hat{o}_{1},\\hat{a}_{1}),\\dots,(\\hat{o}_{L-1},\\hat{a}_{L-1})\\mid s_{0},E^{\\prime}\\right).\nUnlike prior work that focuses solely on the initial state or short trajectory segments, we aim to produce full demonstration trajectories that are executable on the target embodiment.\nEach embodiment\nE\nE\nincludes structural specifications such as joint limits, robot meshes and kinematic chains. We assume access to standardized robot description files (e.g., URDF and XML), which provide this information and allow embodiment-specific adaptation of actions and observations.\nIV\nMethod\nTo generate demonstrations for a new embodiment,\nCEI\nfirst defines the functional representations of both the source and target embodiments and employs the Directional Chamfer Distance to quantify the\nfunctional similarity\nbetween the two embodiments (Section\nIV-A\n). Leveraging the source demonstrations, functional representations and the metric,\nCEI\naligns the robot trajectories from the source embodiment to the target embodiment (Section\nIV-B\n). Finally,\nCEI\nsynthesizes corresponding observations and actions based on the aligned trajectories, obtaining the demonstrations for the target embodiment (Section\nIV-C\n). An overview of the full pipeline is illustrated in Fig.\n2\n.\nFigure 2:\nOverview of the pipeline. Given a source dataset, a source embodiment, and a target embodiment, we first define functional representations as sets of points with associated directions on both embodiments. We then compute functional similarity using the negative Directional Chamfer Distance between these representations. Trajectory alignment is performed by sequentially optimizing the functional similarity for each trajectory slice. Finally, we synthesize target actions with next joint positions and generate target observations by augmenting source point clouds with points sampled from the target embodiment. The viridis colormap is used to illustrate the temporal progression of the trajectory of functional representations.\nIV-A\nFunctional Similarity between Embodiments\nWhile two embodiments may differ significantly in morphology and kinematics, they can nonetheless exhibit similar object interaction behaviors. For example, in a pick-up task, a dexterous hand may grasp an object from opposing sides using the thumb and other four fingers—a strategy that is functionally analogous to the symmetric grasp of a parallel gripper. In this section, we propose a method to formally quantify this\nfunctional similarity\nbetween embodiments.\nIV-A\n1\nFunctional Representation\nWe represent an embodiment’s interaction feature through a set of point-direction pairs\nX\n=\n{\n(\np\ni\n,\nn\ni\n)\n}\ni\n=\n0\n,\n1\n,\n…\n,\nN\nX=\\{(p_{i},n_{i})\\}_{i=0,1,...,N}\n, referred to as the functional representation. As shown in Fig.\n2\n, the points\n{\np\ni\n}\n\\{p_{i}\\}\nlie on the embodiment’s surface and reflect potential contact areas with objects. The associated directions\n{\nn\ni\n}\n\\{n_{i}\\}\nare automatically computed as the surface normal in the vicinity of\n{\np\ni\n}\n\\{p_{i}\\}\n. All point-direction pairs are transformed to the world frame via forward kinematics, ensuring alignment happens in a common frame across embodiments. While this concept is inspired by\naffordance\n[\n1\n]\nwhich captures potential interaction sites on the object, we instead focus on the embodiment, emphasizing how the end-effector interacts with the environment.\nIV-A\n2\nDirectional Chamfer Distance\nTo quantify the similarity between two functional representations, we adopt the\nDirectional Chamfer Distance\n(DCD), which jointly considers spatial proximity and directional alignment between point sets. Specifically, given functional representations\nX\n=\n{\n(\np\ni\n,\nn\ni\n)\n}\ni\n=\n1\nN\nX=\\{(p_{i},n_{i})\\}_{i=1}^{N}\nand\nX\n′\n=\n{\n(\np\nj\n′\n,\nn\nj\n′\n)\n}\nj\n=\n1\nN\n′\nX^{\\prime}=\\{(p^{\\prime}_{j},n^{\\prime}_{j})\\}_{j=1}^{N^{\\prime}}\nfor the source and target embodiments respectively, DCD is defined as:\nDCD\n​\n(\nX\n,\nX\n′\n)\n\\displaystyle\\mathrm{DCD}(X,X^{\\prime})\n=\n1\nN\n​\n∑\ni\n=\n1\nN\nmin\nj\n⁡\n(\n‖\np\ni\n−\np\nj\n′\n‖\n2\n−\nλ\n⋅\n⟨\nn\ni\n,\nn\nj\n′\n⟩\n)\n\\displaystyle=\\frac{1}{N}\\sum_{i=1}^{N}\\min_{j}\\left(\\|p_{i}\\!-\\!p^{\\prime}_{j}\\|_{2}\\!-\\!\\lambda\\!\\cdot\\!\\langle n_{i},n^{\\prime}_{j}\\rangle\\right)\n(1)\n+\n1\nN\n′\n​\n∑\nj\n=\n1\nN\n′\nmin\ni\n⁡\n(\n‖\np\nj\n′\n−\np\ni\n‖\n2\n−\nλ\n⋅\n⟨\nn\nj\n′\n,\nn\ni\n⟩\n)\n,\n\\displaystyle+\\frac{1}{N^{\\prime}}\\sum_{j=1}^{N^{\\prime}}\\min_{i}\\left(\\|p^{\\prime}_{j}\\!-\\!p_{i}\\|_{2}\\!-\\!\\lambda\\!\\cdot\\!\\langle n^{\\prime}_{j},n_{i}\\rangle\\right),\nwhere\nλ\n\\lambda\nis a weighting factor balancing spatial and directional terms. This formulation ensures that each point-direction pair in one set is matched to its most similar counterpart in the other and calculates the distance of two sets. We define the negative DCD as the measure of\nfunctional similarity\n, which increases as the functional representations of two embodiments become more consistent.\nIV-B\nTrajectory Alignment\nTo bridge the embodiment gap, we leverage the defined\nfunctional similarity\nto align the joint (proprioceptive) trajectories between two robots. Given a source embodiment and an associated demonstration, we first compute the trajectory of its functional representation\n{\nX\nt\n}\nt\n=\n0\nL\n−\n1\n\\{X_{t}\\}_{t=0}^{L-1}\nusing a differentiable forward kinematics module\nFK\n, where\nX\nt\n=\nFK\nE\n​\n(\no\nt\narm\n,\no\nt\nee\n)\nX_{t}=\\text{FK}_{E}(o_{t}^{\\text{arm}},o_{t}^{\\text{ee}})\n.\nFor each frame\nt\nt\n, we initialize the target embodiment’s joint configuration\nq\nt\n′\nq^{\\prime}_{t}\nas a set of learnable variables and calculate the corresponding functional representation\nX\nt\n′\n=\nFK\nE\n′\n​\n(\nq\nt\n′\n)\nX^{\\prime}_{t}=\\text{FK}_{E^{\\prime}}(q^{\\prime}_{t})\n.\nWe then optimize functional similarity between\nX\nt\nX_{t}\nand\nX\nt\n′\nX^{\\prime}_{t}\nusing gradient descent:\nmin\nq\nt\n′\n⁡\nℒ\nalign\n​\n(\nq\nt\n′\n)\n=\nw\n1\n​\nDCD\n​\n(\nX\nt\n,\nX\nt\n′\n)\n+\nw\n2\n​\nℒ\n​\n(\nq\nt\n′\n)\n,\n\\min_{q^{\\prime}_{t}}\\mathcal{L}_{\\text{align}}(q^{\\prime}_{t})=w_{1}\\mathrm{DCD}(X_{t},X^{\\prime}_{t})+w_{2}\\mathcal{L}(q^{\\prime}_{t}),\n(2)\nwhere\nℒ\n​\n(\nq\nt\n′\n)\n\\mathcal{L}(q^{\\prime}_{t})\npenalizes the out-of-range joint configuration, and\nw\n1\nw_{1}\n,\nw\n2\nw_{2}\nare weighting factors.\nRather than optimizing each frame independently, we treat the process as a sequential optimization problem. Specifically, the joint configuration at frame\nt\n+\n1\nt+1\nis initialized using the optimized result from frame\nt\nt\n:\nq\nt\n+\n1\n′\n⁣\n(\n0\n)\n←\nq\n^\nt\n,\nq^{\\prime(0)}_{t+1}\\leftarrow\\hat{q}_{t},\nwhere\nq\nt\n+\n1\n′\n⁣\n(\n0\n)\nq^{\\prime(0)}_{t+1}\nrepresents the initial joint configuration at\nt\n+\n1\nt+1\nand\nq\n^\nt\n\\hat{q}_{t}\ndenotes the optimized joint configuration at\nt\nt\n. This strategy not only accelerates convergence due to the small variation between adjacent frames, but also ensures temporal consistency in the generated trajectory.\nIV-C\nObservation and Action Generation\nIV-C\n1\nAction generation\nWe define the action at each timestep as the target embodiment’s joint configuration at the next frame:\na\nt\n=\nq\n^\nt\n+\n1\n.\na_{t}=\\hat{q}_{t+1}.\nSince the embodiment may not achieve the target position in time, we adopt a closed-loop control strategy during execution, where the embodiment continuously applies\na\nt\na_{t}\nuntil its current joint configuration reaches the target position.\nIV-C\n2\nObservation generation\nThe proprioceptive observation of the target embodiment is directly derived from the aligned trajectory:\n(\no\n^\nt\narm\n,\no\n^\nt\nee\n)\n=\nq\n^\nt\n.\n(\\hat{o}_{t}^{\\text{arm}},\\hat{o}_{t}^{\\text{ee}})=\\hat{q}_{t}.\nTo synthesize the point cloud, we first remove points that lie outside the defined workspace, and mask any point that falls within a distance threshold\nτ\n\\tau\n(e.g., 5 mm) of the source robot. This proximity is calculated using the minimum Euclidean distance to a uniformly sampled point cloud derived from the robot’s mesh. Next, we synthesize the point cloud for the target embodiment by first accessing target robot description file and then sampling points across the robot’s mesh. Both the cropping and augmentation steps are conditioned on the current proprioceptive state\nq\n^\nt\n\\hat{q}_{t}\n. Finally we apply Farthest Point Sampling (FPS) to downsample the point cloud to a fixed number (1024).\nDuring inference, the same process is applied to ensure consistency between the synthesized observations and those encountered at test time.\nV\nExperimental Setup\nFigure 3:\nTasks and embodiments for simulation evaluation. We investigate 3 tasks and 16 embodiments, which are combinations of 4 robot arms (UR5e, IIWA, Kinova3 and Franka Panda) and 4 end-effectors (FourierRighthand, InspireRightHand, FourierLefthand and RobotiqThreeFinger gripper).\nV-A\nImplementation Details\nTo construct the robot description, we utilize the\nXML\nfiles of the robot arms and end-effectors. The points of functional representation are sampled from the finger pad meshes, and their associated directional vectors are generated using\nTorchSDF\n. For efficient trajectory alignment, we employ\npytorch_kinematics\nas a batch forward kinematics engine, enabling highly parallelized computations.\nOptimization is performed with a maximum of 300 steps at each timestep. Early stopping is triggered if the alignment loss\nℒ\nalign\n\\mathcal{L}_{\\text{align}}\ndoes not improve for 10 consecutive steps. We empirically determine that setting the weighting factor\nλ\n=\n0.5\n\\lambda=0.5\n, and weights\nw\n1\n=\n1\nw_{1}=1\n,\nw\n2\n=\n1\nw_{2}=1\nyields robust performance across all tasks.\nV-B\nPolicy Training\nWe utilize 3D Diffusion Policy\n[\n24\n]\nto evaluate the synthesized data. The input consists of the current joint positions of both the robot arm and end-effector, along with a preprocessed point cloud of size [1024, 3]. The policy outputs target joint positions. We set the observation horizon to\nT\no\n=\n2\nT_{o}=2\n, action prediction horizon to\nT\np\n=\n16\nT_{p}=16\n, and action execution horizon to\nT\na\n=\n8\nT_{a}=8\n, following the settings in\n[\n24\n]\n. The model is trained for 3000 epochs using the AdamW optimizer with a learning rate of\n1\n×\n10\n−\n4\n1\\times 10^{-4}\nand a 500-step warmup for training stabilization. All experiments are conducted on a single RTX 4090 GPU.\nV-C\nEvaluation Setup\nV-C\n1\nSimulation\nWe evaluate cross-embodiment transfer and visuomotor policy learning in simulation using\n3\nmanipulation tasks and\n16\nrobot embodiments (combinations of\n4\narms and\n4\nend-effectors) from robosuite\n[\n27\n]\n(as shown in Fig.\n3\n). Demonstrations collected on a Franka Panda via teleoperation are transferred to target embodiments using\nCEI\n. We evaluate transferred trajectories via simulation replay and train DP3 policies on the synthesized data, measuring performance over 20 trials with three seeds.\nFigure 4:\nLeft: Setup and associated objects in real-world experiments. Right: Real-world tasks. We evaluate transfer from the AG95 gripper to the Xhand on PushCube, OpenDrawer, and PlaceBird, and from the Xhand to the AG95 gripper on PickCup, PackageBread, and InsertFlower.\nTABLE I:\nFull Evaluation across Tasks and Embodiment Combinations in Simulation.\nTasks\nOpenDrawer\nPickCube\nStackCube\nGrippers / Robot Arms\nUR5e\nIIWA\nKinova3\nPanda\nUR5e\nIIWA\nKinova3\nPanda\nUR5e\nIIWA\nKinova3\nPanda\nFourierRightHand\n100\n100\n100\n100\n100\n100\n100\n100\n81\n81\n72\n72\n69\n69\n79\n79\n53\n53\n38\n38\n37\n37\n34\n34\nInspireRightHand\n91\n91\n87\n87\n87\n87\n84\n84\n50\n50\n45\n45\n33\n33\n43\n43\n24\n24\n16\n16\n12\n12\n15\n15\nFourierLeftHand\n100\n100\n96\n96\n98\n98\n100\n100\n88\n88\n83\n83\n81\n81\n79\n79\n57\n57\n47\n47\n50\n50\n47\n47\nRobotiqThreeFinger\n78\n78\n91\n91\n93\n93\n93\n93\n19\n19\n31\n31\n41\n41\n52\n52\n0\n0\n5\n5\n9\n9\nV-C\n2\nReal world\nIn real world deployment, demonstrations are collected via keyboard teleoperation on a UR5 arm, with RGB-D data captured by a RealSense L515 to generate scene point clouds, as shown in Fig.\n4\n(left). DP3 policies are trained on\nCEI\n-generated data and evaluated over 10 trials per task. We evaluate transfer between the AG95 gripper and Xhand on\n6\nreal-world tasks (Fig.\n4\nright):\n•\nPushCube.\nA cube is placed on the table. The robot must approach and align its end-effector to securely enclose the cube, then push it 20 cm to the right.\n•\nOpenDrawer.\nA drawer is positioned on the left side of the table. The robot moves toward the handle, inserts its fingertip, and pulls it to the right by about 10 cm.\n•\nPlaceBird.\nA toy bird is positioned on the left side of the table, while a box is fixed on the right. The robot approaches, grasps the bird stably, moves it over the box, lowers it, and places the bird inside.\n•\nPickCup.\nA cup is placed near the center of the table. The robot approaches, grasps the cup, and lifts it about 5 cm from the surface.\n•\nPackageBread.\nA toaster with baked bread is placed on the right side of the table, with a bag fixed on the left. The robot approaches the toaster, picks up the bread, moves it above the bag, and deposits the bread inside.\n•\nInsertFlower.\nA bouquet of flowers is placed on the right side of the table, and a vase is fixed on the left. The robot approaches, grasps the bouquet, rotates and moves it above the vase, then inserts and releases it.\nFor the first three tasks, we collect 25 AG95 demonstrations and transfer to Xhand; for the latter three, we collect data with Xhand and transfer to AG95.\nVI\nResults\nVI-A\nSimulation Results\nVI-A\n1\nGripper-to-hands transfer\nTo evaluate whether CEI effectively bridges the extreme embodiment gap from parallel-jaw grippers to dexterous multi-fingered hands, we validate the synthesized data by replaying the robot trajectory online, initialized with the same state when collecting the data.\nTable\nI\npresents the comprehensive evaluation of 16 different embodiments. The results indicate that despite variations in kinematics and morphology,\nCEI\nis capable of bridging the cross-embodiment gap by leveraging\nfunctional similarity\n.\nWe further observe that transfer difficulty correlates with contact richness. While OpenDrawer involves simple interactions, PickCube requires stable grasp acquisition, and StackCube entails sequential contact maintenance. These contact-rich scenarios amplify the susceptibility of our geometry-based synthesis to physical disturbances (e.g., slippage), explaining the observed performance degradation.\nAnalyzing performance across end-effectors, we find that the FourierRightHand and FourierLeftHand consistently achieve the highest success rates across all three tasks. In contrast, the InspireRightHand experiences an average performance drop of approximately 40%.\nAlthough the RobotiqThreeFinger exhibits minimal loss in OpenDrawer, it struggles with StackCube as kinematic constraints force a transition from stable ‘finger-pad’ grasping to a low-contact ‘fingertip’ strategy, thereby reducing manipulation reliability.\nVI-A\n2\nAblation study on cross-embodiment techniques\nTable\nII\npresents an ablation study to investigate the key components that enable\nCEI\nto achieve cross-embodiment transfer. We compare\nCEI\nagainst two baselines: (1) Binary Manual Specification (BMS) generates end-effector motions by linearly interpolating between manually specified open and close poses, while constraining the end-effector to match the gripper aperture of the source embodiment, and (2)\nCEI\nwithout Direction removes directional information and uses only positional features for functional representation. We use a subset of embodiments: Emb. 1 = UR5e + FourierRightHand, Emb. 2 = IIWA + InspireRightHand, Emb. 3 = Kinova3 + FourierLeftHand, and Emb. 4 = Panda + RobotiqThreeFinger.\nThe results show that\nCEI\nwithout Direction achieves an average success rate of only 32%, only half of\nCEI\n. Although it is still capable of completing the OpenDrawer task, it struggles with object grasping tasks, highlighting the critical role of directional information for grasp motions.\nWe also observed that BMS failed in PickCube and StackCube because linear interpolation between manually defined poses often yields failed grasps. Additionally, kinematic discrepancies (e.g., end-effector frame offsets) caused frequent failures in OpenDrawer, rendering BMS inferior to\nCEI\neven when the degree of opening were explicitly constrained to be the same.\nTABLE II:\nAblation Study on Cross-embodiment Techniques.\nTask\nMethod\nEmb. 1\nEmb. 2\nEmb. 3\nEmb. 4\nAvg.\nOpenDrawer\nBMS\n80\n80\n92\n92\n87\n87\n64\n64\n81\n81\nCEI\nw/o Dir.\n84\n84\n𝟏𝟎𝟎\n\\boldsymbol{100}\n91\n91\n𝟏𝟎𝟎\n\\boldsymbol{100}\n94\n94\nCEI\n(Ours)\n𝟏𝟎𝟎\n\\boldsymbol{100}\n87\n87\n𝟗𝟖\n\\boldsymbol{98}\n93\n93\n𝟗𝟓\n\\boldsymbol{95}\nPickCube\nBMS\n0\n0\n0\n0\n0\nCEI\nw/o Dir.\n7\n7\n2\n2\n0\n0\n2\n2\nCEI\n(Ours)\n𝟖𝟏\n\\boldsymbol{81}\n𝟒𝟓\n\\boldsymbol{45}\n𝟖𝟏\n\\boldsymbol{81}\n𝟓𝟐\n\\boldsymbol{52}\n𝟔𝟓\n\\boldsymbol{65}\nStackCube\nBMS\n0\n0\n0\n0\n0\nCEI\nw/o Dir.\n0\n0\n0\n0\n0\nCEI\n(Ours)\n𝟓𝟑\n\\boldsymbol{53}\n𝟏𝟔\n\\boldsymbol{16}\n𝟓𝟎\n\\boldsymbol{50}\n𝟗\n\\boldsymbol{9}\n𝟑𝟐\n\\boldsymbol{32}\nVI-A\n3\nSensitivity of functional representation\nTo evaluate the impact of different functional representation selections on transfer performance, we compare three variants: (1) Standard, which spans the entire finger pad to provide full coverage and is used across main experiments; (2) Reduced, which is limited to a subset of points near the center of the finger pad; and (3) Randomly Dropped (Rand. Drop.), where a subset of points is randomly removed from the full representation. We transfer 20 demonstrations with above three selections in the PickCube task using FourierRightHand and evaluate the success rate. As shown in Table\nIII\n, although the three selections differ, their success rates remain comparable, suggesting that\nCEI\nis robust to such variations and exhibits low sensitivity to the choice of functional representation.\nTABLE III:\nSensitivity Analysis of Functional Representations.\nFunctional\nRepresentation\nStandard\nReduced\nRand. Drop.\nSuccess Rate\n17\n17\n/\n20\n20\n18\n18\n/\n20\n20\n16\n16\n/\n20\n20\nFigure 5:\nQualitative evaluation. Left: Transfer from AG95 to Xhand in PushCube, OpenDrawer, and PlaceBird. Right: Transfer from Xhand to AG95 in PickCup, PackageBread, and InsertFlower. Manipulations of source policies are shown on the top rows, transferred ones on the bottom rows.\nVI-A\n4\nPolicy evaluation\nTable\nIV\npresents the policy evaluation results using synthesized cross-embodiment data. We observe that\nCEI\nachieves an average success rate of 62%, suggesting that the synthesized data effectively captures critical behaviors such as reaching the target position, grasping, and releasing, even without additional refinement or selection. We further compare\nCEI\nagainst two baselines: (1) No Augmentation, where the policy is trained solely on observations from source demonstrations, and (2)\nCEI\nwithout Inference Augmentation, where the policy uses raw observations during inference without additional augmentation. Policies trained without any augmentation fail to complete the tasks, demonstrating the necessity of targeted data augmentation for cross-embodiment generalization. Additionally, removing Inference Augmentation results in a 22% drop in success rate.\nThis performance degradation arises due to the partial and noisy observations during inference.\nTABLE IV:\nPolicy Evaluation on Synthesized Data Generated by\nCEI\n.\nTask\nMethod\nEmb. 1\nEmb. 2\nEmb. 3\nEmb. 4\nAvg.\nOpenDrawer\nNo Aug.\n0\n0\n0\n0\n0\nCEI\nw/o Inf. Aug.\n𝟏𝟎𝟎\n\\boldsymbol{100}\n79\n79\n32\n32\n64\n64\n69\n69\nCEI\n(Ours)\n𝟏𝟎𝟎\n\\boldsymbol{100}\n𝟗𝟎\n\\boldsymbol{90}\n𝟏𝟎𝟎\n\\boldsymbol{100}\n𝟗𝟎\n\\boldsymbol{90}\n𝟗𝟓\n\\boldsymbol{95}\nPickCube\nNo Aug.\n0\n0\n0\n0\n0\nCEI\nw/o Inf. Aug.\n42\n42\n26\n26\n38\n38\n10\n10\n29\n29\nCEI\n(Ours)\n𝟕𝟗\n\\boldsymbol{79}\n𝟔𝟖\n\\boldsymbol{68}\n𝟔𝟖\n\\boldsymbol{68}\n𝟐𝟑\n\\boldsymbol{23}\n𝟔𝟎\n\\boldsymbol{60}\nStackCube\nNo Aug.\n0\n0\n0\n0\n0\nCEI\nw/o Inf. Aug.\n36\n36\n10\n10\n44\n44\n0\n23\n23\nCEI\n(Ours)\n𝟓𝟓\n\\boldsymbol{55}\n𝟏𝟔\n\\boldsymbol{16}\n𝟓𝟐\n\\boldsymbol{52}\n0\n𝟑𝟏\n\\boldsymbol{31}\nSource (ref.)\n100 / 100 / 97\n99\nVI-B\nReal-world Results\nVI-B\n1\nBidirectional transfer\nTable\nV\ndemonstrates the bidirectional transfer capabilities of\nCEI\non real-world tasks. We compare policies trained on synthesized data and deployed on the target embodiment against those trained on source data and deployed on the source embodiment. Results show that for simple tasks such as PushCube,\nCEI\nenables transfer from a parallel-jaw gripper to a dexterous hand without performance loss. Failures in tasks like OpenDrawer and PlaceBird are primarily due to challenges in dexterous contacts, such as fingers slipping off drawer handles. In transfers from a dexterous hand to a parallel gripper,\nCEI\nachieves similar performance.\nHowever, InsertFlower remains exceptionally challenging since the thin geometry of the flower stem makes it prone to slippage, leading to low success rates for both source and target embodiments.\nOverall,\nCEI\nachieves an average success rate of 70% across six tasks, with a transfer ratio (success rate of\nCEI\ndivided by that of the source embodiment) of 82.4%. Qualitative evaluation across 6 tasks is shown in Fig.\n5\n.\nTABLE V:\nReal-world Evaluation.\nAG95\n→\n\\rightarrow\nXhand\nMethod\nPushCube\nOpenDrawer\nPlaceBird\nAverage\nCEI\n(Ours)\n10\n/\n10\n10/10\n8\n/\n10\n8/10\n7\n/\n10\n7/10\n8.3\n/\n10\n8.3/10\nSource\n10\n/\n10\n10/10\n10\n/\n10\n10/10\n10\n/\n10\n10/10\n10\n/\n10\n10/10\nXhand\n→\n\\rightarrow\nAG95\nMethod\nPickCup\nPackageBread\nInsertFlower\nAverage\nCEI\n(Ours)\n6\n/\n10\n6/10\n9\n/\n10\n9/10\n2\n/\n10\n2/10\n5.7\n/\n10\n5.7/10\nSource\n8\n/\n10\n8/10\n9\n/\n10\n9/10\n4\n/\n10\n4/10\n7\n/\n10\n7/10\nFigure 6:\nSpatial generalization. Left: Experimental setup and task configuration, where each anchor is spaced 20 cm apart. Around each anchor, we sample a\n10\n×\n10\n10\\times 10\ngrid within the range\n[\n−\n8\n​\ncm\n,\n8\n​\ncm\n]\n[-8\\,\\text{cm},8\\,\\text{cm}]\nfor data generation. Middle: Our approach enables the Xhand to press the button across most of the table surface. Right: Evaluation results on the 10 anchors. Each anchor is evaluated over 5 trials, with the results distinguished by different colors.\nVI-B\n2\nTime cost of transfer\nTo study how efficient the data generation process is, we evaluate the efficiency of\nCEI\n’s data generation by measuring the time required to synthesize 100, 200, 300 and 400 demonstrations. Given the substantial cost of collecting large-scale real-world demonstrations, we construct larger datasets by replicating a set of 25 collected trajectories through duplication at ratios of 4\n×\n\\times\n, 8\n×\n\\times\n, 12\n×\n\\times\n, and 16\n×\n\\times\n, respectively. We compare\nCEI\nwith MimicGen\n[\n12\n]\nand DemoGen\n[\n20\n]\non datasets with an average episode length of 105 steps. For MimicGen, we estimate time by multiplying the replay duration of each source trajectory by the number of generated demonstrations, and adding 20 seconds per trajectory for manual object resets, following\n[\n20\n]\n. Table\nVI\npresents the time required to generate those numbers of demonstrations. Results show that\nCEI\nrequires significantly less time than MimicGen, which highly depends on online execution. DemoGen generates hundreds of demonstrations in one second, while\nCEI\nrequires several minutes since it utilizes gradient-based optimization.\nTABLE VI:\nTime Cost for Generating Real-world Demonstrations.\n100 Demos\n200 Demos\n300 Demos\n400 Demos\nMimicGen\n6.4\n6.4\nh\n12.8\n12.8\nh\n19.2\n19.2\nh\n25.6\n25.6\nh\nDemoGen\n0.29\n0.29\ns\n0.54\n0.54\ns\n0.84\n0.84\ns\n1.14\n1.14\ns\nCEI\n(Ours)\n2.5\n2.5\nmin\n2.9\n2.9\nmin\n3.3\n3.3\nmin\n3.6\n3.6\nmin\nVII\nBroader Applications\nVII-A\nSpatial Generalization\nVII-A\n1\nSpatial augmentation\nCEI\ninherently facilitates spatial generalization, enabling the generation of diverse demonstrations across the entire workspace from only a single collected trajectory. Given a spatial transform\n𝒯\ni\n\\mathcal{T}_{i}\nwhich encapsulates the possible translational or rotational offset of the objects, we first apply it to the functional representation trajectory:\nX\n~\nt\n=\nX\nt\n+\nℒ\n​\n(\nt\n)\n​\n(\n𝒯\ni\n​\n(\nX\nt\n)\n−\nX\nt\n)\n,\nt\n=\n0\n,\n1\n,\n…\n,\nL\n−\n1\n,\n\\tilde{X}_{t}=X_{t}+\\mathcal{L}(t)(\\mathcal{T}_{i}(X_{t})-X_{t}),\\quad t=0,1,\\ldots,L-1,\n(3)\nwhere\nℒ\n​\n(\nt\n)\n=\nmin\n⁡\n(\nt\n0.8\n​\nL\n,\n1\n)\n\\mathcal{L}(t)=\\min(\\frac{t}{0.8L},1)\nis the clipped linear growth, ensuring that the generated demonstrations share an initial state while diverging to different terminal states by interpolation. The target embodiment is subsequently aligned to the augmented trajectory\n{\nX\n~\nt\n}\nt\n=\n0\nL\n−\n1\n\\{\\tilde{X}_{t}\\}_{t=0}^{L-1}\nthrough the standard\nCEI\noptimization procedure.\nThe augmented point cloud is then obtained by applying\n𝒯\ni\n\\mathcal{T}_{i}\nto the object point cloud and synthesizing the robot point cloud according to the augmented trajectory.\nVII-A\n2\nPress the button anywhere on the table\nWe assess the spatial generalization of\nCEI\nin the PressButton task. Starting from a single demonstration collected with AG95, we generate 1,000 demonstrations across 10 anchors, where each anchor samples a\n10\n×\n10\n10\\times 10\ngrid within the range\n[\n−\n8\n​\ncm\n,\n8\n​\ncm\n]\n[-8\\,\\text{cm},8\\,\\text{cm}]\n(Fig.\n6\n, left). We then train DP3 and evaluate it on each anchor position for 5 trials. As illustrated in Fig.\n6\n(middle and right), our approach extends the policy to press the button over a wide area of the table, rather than being limited to the original position. Moreover, we observe that performance on the left side is better than on the right, likely because the camera is positioned to the right of center and oriented toward the left.\nVII-B\nMultimodal Motion Generation\nFigure 7:\nMultimodality of\nCEI\n.\nCEI\ngenerates two different manipulation motions in OpenDrawer task from the same demonstration.\nIn previous experiments, we observed that varying the initial joint configuration produces different aligned trajectories. For example, when transferring a grasp motion from a gripper to a dexterous hand, the resulting pose of the dexterous hand remains valid even if rotated by\n180\n∘\n180^{\\circ}\naround the heading direction. To exploit such multimodality, we introduce an initialization strategy designed for enhancing data diversity.\nVII-B\n1\nElite-based initialization strategy (EIS)\nInstead of relying on random joint configurations, we uniformly sample candidate configurations from the joint space and rank them according to their\nfunctional similarity\nwith the functional representation of the source embodiment’s initial configuration. The top 10% of these candidates are then selected, and their mean configuration is used as the initialization. Subsequently, we proceed with the original process of\nCEI\nto obtain the aligned trajectory and synthesize corresponding demonstrations.\nVII-B\n2\nBimodal motion in OpenDrawer\nWe evaluate the extension in OpenDrawer task. As shown in Fig.\n7\n,\nCEI\ngenerates 2 different patterns that successfully open the drawer. Since we only manipulate the initialization and\nCEI\nproceeds the trajectory sequentially, the aligned trajectories remain temporally consistent while allowing for diverse motion patterns. We further train DP3 on 25 demonstrations with either an arbitrary motion pattern or a 1:1 mixture of patterns. As reported in Table\nVII\n, the multimodality has no adverse impact on task success.\nTABLE VII:\nSuccess Rates of Different Training Recipes.\nPattern 1\nPattern 2\nMixture of Pattern 1&2\nSuccess Rate\n8\n/\n10\n8/10\n7\n/\n10\n7/10\n7\n/\n10\n7/10\nVIII\nConclusion and Discussion\nIn this letter, we introduce\nCEI\n, a cross-embodiment framework that leverages\nfunctional similarity\nand automated data synthesis to transfer policies across diverse robots in both simulation and the real world. Beyond standard manipulation,\nCEI\nsupports spatial generalization and multimodal motion generation, providing a versatile foundation for scalable robot learning. While our current scope is point cloud-based cross-embodiment learning, preliminary results suggest our work also holds potential for RGB-based observations, as shown on our project website\nhttps://cross-embodiment-interface.github.io/\n. Although\nCEI\ncan synthesize hundreds of demonstrations in parallel within minutes, applying it to large-scale datasets remains an open direction that could further advance generalist policy learning. In addition, the current reliance on visual-kinematic inputs limits the detection of unstable contacts, such as the slippage seen in the InsertFlower task. Integrating tactile sensing would allow the policy to adapt to these physical disturbances in real-time, representing a key area for future improvement.\nReferences\n[1]\nS. Bahl, R. Mendonca, L. Chen, U. Jain, and D. Pathak\n(2023)\nAffordances from human videos as a versatile representation for robotics\n.\nIn\nProc. IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR)\n,\nCited by:\n§\nIV-A\n1\n.\n[2]\nE. Bauer, E. Nava, and R. K. Katzschmann\n(2025)\nLatent action diffusion for cross-embodiment manipulation\n.\nArXiv\n.\nCited by:\n§\nII-B\n.\n[3]\nL. Y. Chen, K. Dharmarajan, K. Hari, C. Xu, Q. Vuong, and K. Goldberg\n(2024)\nMIRAGE: cross-embodiment zero-shot policy transfer with cross-painting\n.\nIn\nProc. Robotics: Science and Systems (RSS)\n,\nCited by:\n§I\n,\n§\nII-B\n.\n[4]\nL. Y. Chen, C. Xu, K. Dharmarajan, R. Cheng, K. Keutzer, M. Tomizuka, Q. Vuong, and K. Goldberg\n(2025)\nRoVi-Aug: robot and viewpoint augmentation for cross-embodiment robot learning\n.\nIn\nProc. Conference on Robot Learning (CoRL)\n,\nCited by:\n§I\n,\n§I\n,\n§\nII-B\n.\n[5]\nQ. Chen, S. C. Kiami, A. Gupta, and V. Kumar\n(2023)\nGenAug: retargeting behaviors to unseen situations via generative augmentation\n.\nIn\nProc. Robotics: Science and Systems (RSS)\n,\nCited by:\n§\nII-A\n.\n[6]\nC. Chi, S. Feng, Y. Du, Z. Xu, E. Cousineau, B. C. Burchfiel, and S. Song\n(2023)\nDiffusion Policy: visuomotor policy learning via action diffusion\n.\nIn\nProc. Robotics: Science and Systems (RSS)\n,\nCited by:\n§\nII-A\n.\n[7]\nF. Ebert, Y. Yang, K. Schmeckpeper, B. Bucher, G. Georgakis, K. Daniilidis, C. Finn, and S. Levine\n(2022)\nBridge Data: boosting generalization of robotic skills with cross-domain datasets\n.\nIn\nProc. Robotics: Science and Systems (RSS)\n,\nCited by:\n§I\n,\n§\nII-B\n.\n[8]\nH. Furuta, Y. Iwasawa, Y. Matsuo, and S. S. Gu\n(2023)\nA system for morphology-task generalization via unified representation and behavior distillation\n.\nIn\nProc. International Conference on Learning Representations (ICLR)\n,\nCited by:\n§\nII-B\n.\n[9]\nJ. Gao, A. Xie, T. Xiao, C. Finn, and D. Sadigh\n(2024)\nEfficient data collection for robotic manipulation via compositional generalization\n.\nIn\nProc. Robotics: Science and Systems (RSS)\n,\nCited by:\n§I\n.\n[10]\nE. S. Hu, K. Huang, O. Rybkin, and D. Jayaraman\n(2022)\nKnow Thyself: transferable visual control policies through robot-awareness\n.\nIn\nProc. International Conference on Learning Representations (ICLR)\n,\nCited by:\n§\nII-B\n.\n[11]\nF. Lin, Y. Hu, P. Sheng, C. Wen, J. You, and Y. Gao\n(2024)\nData scaling laws in imitation learning for robotic manipulation\n.\nIn\nProc. International Conference on Learning Representations (ICLR)\n,\nCited by:\n§I\n.\n[12]\nA. Mandlekar, S. Nasiriany, B. Wen, I. Akinola, Y. Narang, L. Fan, Y. Zhu, and D. Fox\n(2023)\nMimicGen: a data generation system for scalable robot learning using human demonstrations\n.\nIn\nProc. Conference on Robot Learning (CoRL)\n,\nCited by:\n§\nII-A\n,\n§\nVI-B\n2\n.\n[13]\nA. O’Neill, A. Rehman, A. Maddukuri, A. Gupta, A. Padalkar, A. Lee, A. Pooley, A. Gupta, A. Mandlekar, A. Jain,\net al.\n(2024)\nOpen X-embodiment: robotic learning datasets and RT-X models\n.\nIn\nProc. the IEEE International Conference on Robotics and Automation (ICRA)\n,\nCited by:\n§I\n,\n§\nII-B\n.\n[14]\nOcto Model Team, D. Ghosh, H. Walke, K. Pertsch, K. Black, O. Mees, S. Dasari, J. Hejna, C. Xu, J. Luo, T. Kreiman, Y. L. Tan, L. Y. Chen, P. Sanketi, Q. Vuong, T. Xiao, D. Sadigh, C. Finn, and S. Levine\n(2024)\nOcto: an open-source generalist robot policy\n.\nIn\nProc. Robotics: Science and Systems (RSS)\n,\nCited by:\n§\nII-B\n.\n[15]\nL. Shao, F. Ferreira, M. Jorda, V. Nambiar, J. Luo, E. Solowjow, J. A. Ojea, O. Khatib, and J. Bohg\n(2020)\nUniGrasp: learning a unified model to grasp with multifingered robotic hands\n.\nIEEE Robotics and Automation Letters\n5\n(\n2\n),\npp. 2286–2293\n.\nCited by:\n§\nII-B\n.\n[16]\nH. Shi, H. Xu, Z. Huang, Y. Li, and J. Wu\n(2024)\nRoboCraft: learning to see, simulate, and shape elasto-plastic objects in 3D with graph networks\n.\nThe International Journal of Robotics Research\n43\n(\n4\n),\npp. 533–549\n.\nCited by:\n§I\n.\n[17]\nH. R. Walke, K. Black, T. Z. Zhao, Q. Vuong, C. Zheng, P. Hansen-Estruch, A. W. He, V. Myers, M. J. Kim, M. Du, A. Lee, K. Fang, C. Finn, and S. Levine\n(2023)\nBridgeData V2: a dataset for robot learning at scale\n.\nIn\nProc. Conference on Robot Learning (CoRL)\n,\nCited by:\n§\nII-B\n.\n[18]\nC. Wang, H. Shi, W. Wang, R. Zhang, F. Li, and K. Liu\n(2024)\nDexCap: scalable and portable mocap data collection system for dexterous manipulation\n.\nIn\nProc. Robotics: Science and Systems (RSS)\n,\nCited by:\n§I\n.\n[19]\nZ. Xu, B. Qi, S. Agrawal, and S. Song\n(2021)\nAdaGrasp: learning an adaptive gripper-aware grasping policy\n.\nIn\nProc. IEEE International Conference on Robotics and Automation (ICRA)\n,\nCited by:\n§\nII-B\n.\n[20]\nZ. Xue, S. Deng, Z. Chen, Y. Wang, Z. Yuan, and H. Xu\n(2025)\nDemoGen: synthetic demonstration generation for data-efficient visuomotor policy learning\n.\nIn\nProc. Robotics: Science and Systems (RSS)\n,\nCited by:\n§\nII-A\n,\n§\nVI-B\n2\n.\n[21]\nJ. H. Yang, C. Glossop, A. Bhorkar, D. Shah, Q. Vuong, C. Finn, D. Sadigh, and S. Levine\n(2024)\nPushing the limits of cross-embodiment learning for manipulation and navigation\n.\nIn\nProc. Robotics: Science and Systems (RSS)\n,\nCited by:\n§\nII-B\n.\n[22]\nH. Yuan, B. Zhou, Y. Fu, and Z. Lu\n(2025)\nCross-embodiment dexterous grasping with reinforcement learning\n.\nIn\nProc. International Conference on Learning Representations (ICLR)\n,\nCited by:\n§\nII-B\n.\n[23]\nK. Zakka, A. Zeng, P. Florence, J. Tompson, J. Bohg, and D. Dwibedi\n(2022)\nXIRL: cross-embodiment inverse reinforcement learning\n.\nIn\nProc. Conference on Robot Learning (CoRL)\n,\nCited by:\n§\nII-B\n.\n[24]\nY. Ze, G. Zhang, K. Zhang, C. Hu, M. Wang, and H. Xu\n(2024)\n3D Diffusion Policy: generalizable visuomotor policy learning via simple 3D representations\n.\nIn\nProc. Robotics: Science and Systems (RSS)\n,\nCited by:\n§\nII-A\n,\n§\nV-B\n.\n[25]\nQ. Zhang, T. Xiao, A. A. Efros, L. Pinto, and X. Wang\n(2021)\nLearning cross-domain correspondence for control with dynamics cycle-consistency\n.\nIn\nProc. International Conference on Learning Representations (ICLR)\n,\nCited by:\n§\nII-B\n.\n[26]\nT. Z. Zhao, J. Tompson, D. Driess, P. Florence, S. K. S. Ghasemipour, C. Finn, and A. Wahid\n(2024)\nALOHA Unleashed: a simple recipe for robot dexterity\n.\nIn\nProc. Conference on Robot Learning (CoRL)\n,\nCited by:\n§I\n.\n[27]\nY. Zhu, J. Wong, A. Mandlekar, R. Martín-Martín, A. Joshi, S. Nasiriany, and Y. Zhu\n(2020)\nRobosuite: a modular simulation framework and benchmark for robot learning\n.\narXiv preprint arXiv:2009.12293\n.\nCited by:\n§\nV-C\n1\n.",
  "preview_text": "Robotic foundation models trained on large-scale manipulation datasets have shown promise in learning generalist policies, but they often overfit to specific viewpoints, robot arms, and especially parallel-jaw grippers due to dataset biases. To address this limitation, we propose Cross-Embodiment Interface (\\CEI), a framework for cross-embodiment learning that enables the transfer of demonstrations across different robot arm and end-effector morphologies. \\CEI introduces the concept of \\textit{functional similarity}, which is quantified using Directional Chamfer Distance. Then it aligns robot trajectories through gradient-based optimization, followed by synthesizing observations and actions for unseen robot arms and end-effectors. In experiments, \\CEI transfers data and policies from a Franka Panda robot to \\textbf{16} different embodiments across \\textbf{3} tasks in simulation, and supports bidirectional transfer between a UR5+AG95 gripper robot and a UR5+Xhand robot across \\textbf{6} real-world tasks, achieving an average transfer ratio of 82.4\\%. Finally, we demonstrate that \\CEI can also be extended with spatial generalization and multimodal motion generation capabilities using our proposed techniques. Project website: https://cross-embodiment-interface.github.io/\n\nCEI\n: A Unified Interface for Cross-Embodiment Visuomotor Policy Learning in 3D Space\nTong Wu\n1\n, Shoujie Li\n12\n, Junhao Gong\n1\n, Changqing Guo\n1\n, Xingting Li\n1\n,\nShilong Mu\n3\n, and Wenbo Ding\n1\nManuscript received: September 26, 2025; Revised: December 6, 2025; Accepted: January 11, 2026.This paper was recommended for publication by Editor Aleksandra Faust upon evaluation of the Associate Editor and Reviewers’ comments.\nThis work was supported by National Key R&D Program of China grant (2024YFB3816000), Guangdong Innovative and Entrepreneurial Research Team Program (2021ZT09L197), Shenzhen Science and Technology Program (JCYJ20220530143013030), Tsinghua Shenzhen International Graduate School-Shenzhe",
  "is_relevant": true,
  "relevance_score": 6.0,
  "extracted_keywords": [
    "locomotion",
    "whole body control"
  ],
  "one_line_summary": "CEI是一个跨具身学习的统一接口框架，通过功能相似性量化和轨迹对齐，实现不同机器人形态间的策略迁移，并支持空间泛化和多模态运动生成。",
  "detailed_summary": "## 论文摘要：CEI: 用于三维空间跨具身视觉运动策略学习的统一接口\n\n**1. 研究背景和动机**\n当前基于大规模操作数据集训练的机器人基础模型，虽展现出学习通用策略的潜力，但常因数据分布偏差而过拟合于特定视角、机械臂及（尤其是）平行夹爪。这严重限制了模型在面对不同形态机器人（如从夹爪到灵巧手）时的泛化能力。现有方法（如视觉合成）多局限于平行夹爪，难以应对极端形态差异。因此，亟需一种能够跨越不同机器人形态进行演示数据与策略迁移的统一框架。\n\n**2. 核心方法和技术创新**\n本文提出**跨具身接口（CEI）**，其核心创新在于：\n- **功能相似性**：提出新概念，通过**定向倒角距离（DCD）**量化不同末端执行器在物体交互行为上的相似性，同时考虑空间邻近与方向对齐。\n- **梯度轨迹对齐**：基于功能相似性，通过可微前向运动学和梯度优化，将源机器人的关节轨迹序列式地对齐到目标机器人，确保时序一致性。\n- **统一数据合成**：利用对齐后的轨迹，同步合成目标机器人的点云观测（通过掩蔽与增强）和关节动作，生成完整的跨具身演示数据。\n- **扩展应用**：框架可进一步支持**空间泛化**（从单条轨迹生成整个工作空间的演示）与**多模态运动生成**（通过精英初始化策略产生多样化动作模式）。\n\n**3. 主要实验结果**\n- **仿真实验**：将Franka Panda的演示迁移至**16种**不同机械臂与末端执行器组合（包括灵巧手），在开抽屉、抓立方体、堆叠立方体三个任务上验证了有效性。任务成功率随接触复杂度增加而下降，但关键任务（如抓取）平均成功率仍达**65%**。消融实验证实了方向信息与序列优化的重要性。\n- **真实世界实验**：在UR5机械臂上，实现了AG95平行夹爪与Xhand五指灵巧手之间的**双向策略迁移**，涵盖推立方体、开抽屉、放置鸟玩具等6个任务，平均成功率达**70%**，迁移比（目标成功率/源成功率）为**82.4%**。\n- **效率**：生成数百条演示仅需数分钟，远快于依赖在线物理仿真的方法。\n- **策略学习**：使用合成数据训练的3D Diffusion Policy在仿真任务中平均成功率达**62%**，显著优于无数据增强的基线。\n\n**4. 研究意义和价值**\nCEI为解决机器人学习中的**具身偏差**问题提供了新颖且有效的方案。其价值在于：\n- **推动通用机器人学习**：使得利用丰富的夹爪数据来训练灵巧手策略成为可能，缓解了灵巧手数据稀缺的瓶颈，有助于构建更具泛化能力的机器人基础模型。\n- **提升数据利用效率**：提供了一种高效的离线数据生成与增强管道，能显著降低针对新机器人平台收集演示数据的成本。\n- **方法通用性**：框架不依赖于特定任务或控制器，基于点云和运动学，易于集成到现有视觉运动策略学习流程中，并为空间泛化、多模态生成等更广泛的应用奠定了基础。",
  "qa_pairs": [
    {
      "question": "这篇论文的核心创新点是什么，他想解决什么问题，怎么解决的？",
      "answer": "## 论文核心分析：CEI\n\n### **一、 研究背景与核心问题**\n当前基于大规模数据训练的机器人基础模型存在一个关键瓶颈：**数据偏差导致的“具身过拟合”**。具体表现为：\n- **数据集不平衡**：现有大规模操作数据集（如OXE）严重偏向于特定机器人（如Franka、xArm）和特定末端执行器（**几乎全是平行夹爪**）。\n- **泛化能力受限**：模型难以直接迁移到形态和运动学差异巨大的新机器人上，尤其是**从平行夹爪迁移到多指灵巧手**，因为灵巧手数据极度稀缺。\n\n**核心问题**：如何利用丰富的平行夹爪演示数据，为形态迥异的机器人（如灵巧手）**自动合成可执行的视觉运动策略数据**，从而实现跨具身的策略学习？\n\n### **二、 核心创新点**\nCEI 提出了一个统一的跨具身数据合成框架，其创新性主要体现在以下三个层面：\n\n1.  **概念创新：功能相似性**\n    - 提出了 **“功能相似性”** 这一核心概念。它超越了简单的几何形态匹配，关注不同末端执行器在**执行任务时的交互行为是否相似**（例如，平行夹爪的对称抓握与灵巧手拇指对四指的抓握在功能上是相似的）。\n    - 使用 **方向性倒角距离** 来量化这种相似性，同时考虑空间位置和表面法向方向的对齐。\n\n2.  **方法创新：基于梯度的轨迹对齐与数据合成**\n    - **梯度优化对齐**：将轨迹对齐建模为一个**序列优化问题**。对于源机器人的每一帧，通过梯度下降优化目标机器人的关节配置，以最大化与源机器人当前功能表示的功能相似性，并利用前一帧结果初始化当前帧，保证时序一致性。\n    - **端到端数据生成**：不仅合成动作（目标关节位置），还**同步合成对应的视觉观测**（点云）。通过掩蔽源机器人点云并采样添加目标机器人点云，生成符合目标机器人视角的观测。\n\n3.  **框架通用性扩展**\n    - 展示了CEI框架可轻松扩展至**空间泛化**（从单条轨迹生成覆盖整个工作空间的数据）和**多模态运动生成**（通过精英初始化策略，从同一源演示生成多种有效的目标运动模式）。\n\n### **三、 解决方案：CEI 技术流程**\nCEI 的解决方案是一个清晰的三步流水线：\n\n1.  **功能表示与相似性计算**\n    - 为每个机器人定义**功能表示**：一组位于末端执行器潜在接触区域（如手指垫）的`(点，法向)`对。\n    - 通过**方向性倒角距离**计算源机器人与目标机器人功能表示之间的相似度，作为对齐的优化目标。\n\n2.  **序列轨迹对齐**\n    - 输入源机器人演示轨迹。\n    - 对于每一时间步 `t`，将目标机器人的关节配置 `q_t‘` 设为可学习变量。\n    - 通过最小化损失函数进行优化：`ℒ_align = w1 * DCD(功能表示_Xt, 功能表示_Xt’) + w2 * 关节限位惩罚`。\n    - 采用**序列初始化**：`q_{t+1}‘ 的初始值 = 优化后的 q_t‘`，确保轨迹平滑。\n\n3.  **观测与动作合成**\n    - **动作合成**：目标机器人在时刻 `t` 的动作即对齐后的下一帧关节位置 `a_t = q_{t+1}‘`。\n    - **观测合成**：\n        - **本体感知**：直接使用对齐后的关节位置 `q_t‘`。\n        - **点云**：从源场景点云中**移除**靠近源机器人的点，然后**添加**根据目标机器人当前位姿从其网格模型采样的点，最后进行下采样。\n\n### **四、 实际价值与意义**\n- **解决数据稀缺难题**：为数据稀少的机器人形态（如灵巧手）提供了一种高效的数据生成方法，**利用丰富易得的平行夹爪数据即可训练灵巧手策略**。\n- **提升模型泛化能力**：是构建真正“通用”机器人基础模型的关键一步，使模型能适应多样化的物理实体。\n- **高效实用**：属于离线数据生成方法，合成数百条演示仅需数分钟，远快于基于物理仿真的在线生成方法，具备实际部署的可行性。\n- **双向迁移**：实验验证了在平行夹爪（UR5+AG95）与灵巧手（UR5+Xhand）之间的**双向策略迁移**，在6个真实世界任务上平均迁移成功率高达**82.4%**。\n\n**总结**：CEI 的核心在于通过形式化定义并优化“功能相似性”，在算法层面构建了一个连接不同机器人形态的“接口”，实现了跨具身行为与数据的传递，为规模化、通用化的机器人学习提供了新的数据引擎。",
      "timestamp": "2026-01-20T17:57:46.948034",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "基于他的前作，梳理这个方向的整个发展脉络，每一步相比于之前的工作都改进了什么，着重于几个不同的发展方向。",
      "answer": "## 论文《CEI: A Unified Interface for Cross-Embodiment Visuomotor Policy Learning in 3D Space》发展脉络分析\n\n基于论文内容及其引用的相关文献，可以梳理出**跨具身（Cross-Embodiment）视觉运动策略学习**方向的发展脉络。该领域主要围绕**如何克服机器人形态（臂、末端执行器）差异带来的数据偏差和泛化难题**展开，演进路径清晰，主要沿着以下几个关键方向发展：\n\n### 发展脉络总览\n该领域从早期关注**领域自适应（Domain Adaptation）**和**特定形态策略学习**，逐步演进到**利用大规模数据构建基础模型**，并最终聚焦于解决**极端形态差异（如平行夹爪与灵巧手）下的数据生成与策略迁移**这一核心挑战。CEI 是这一脉络中针对“极端跨具身数据合成”问题的最新解决方案。\n\n以下是按主要发展方向梳理的演进步骤：\n\n---\n\n### 发展方向一：从领域自适应到具身间隙弥合（Bridging the Embodiment Gap）\n\n早期工作主要解决视觉观察层面的领域差异（如视角、光照），后来才意识到机器人本体形态差异是更根本的障碍。\n\n1.  **早期领域自适应方法**\n    *   **代表工作**：基于循环一致性（Dynamics Cycle-Consistency）等方法，学习不同领域（如仿真与真实）之间的对应关系【25】。\n    *   **改进与局限**：这些方法主要关注**视觉观察空间**或**动态模型**的映射【10, 25】，并未显式处理机器人**形态和运动学**的根本差异，因此难以直接应用于从夹爪到灵巧手等形态迥异的迁移。\n\n2.  **显式弥合具身间隙的初步尝试**\n    *   **代表工作**：**MIRAGE**【3】和 **RoVi-Aug**【4】。\n    *   **核心改进**：这些方法引入了“跨绘制（cross-painting）”和生成模型技术，**在像素层面合成目标机器人的视觉观察**，制造出源机器人正在目标形态下执行任务的“幻象”。这实现了从**观察层面**的零样本部署。\n    *   **关键局限（CEI 的出发点）**：\n        *   **形态假设强**：严重依赖**平行夹爪**和**操作空间控制（OSC）**，难以迁移到多指灵巧手等复杂形态【4】。\n        *   **仅处理观察**：未同步生成与合成观察相匹配的、可供目标机器人执行的**关节动作**。策略在“看到”目标机器人后，仍可能输出不适合其运动学的动作。\n\n### 发展方向二：基于大规模跨具身数据集的通用策略学习\n\n另一条路径旨在通过收集海量、多样化的机器人数据，直接训练出对形态变化具有鲁棒性的“通用”策略。\n\n1.  **大规模数据集的构建**\n    *   **代表工作**：**Bridge Data**【7】、**BridgeData V2**【17】、**Open X-embodiment (OXE)**【13】。\n    *   **核心改进**：汇集来自数十个不同机器人平台的真实世界演示数据，证明了**数据规模与多样性**对策略泛化能力的重要性。OXE 等数据集为训练 **RT-X** 等大型机器人基础模型奠定了基础【13, 14】。\n    *   **关键局限（CEI 的动机）**：\n        *   **数据分布偏差**：即使是大规模数据集，也严重偏向于 Franka、xArm 等流行机械臂和**平行夹爪**【13】。灵巧手数据极其稀缺【18】，导致模型仍会过拟合到主流形态。\n        *   **无法处理极端未见形态**：模型泛化能力受限于训练数据中形态的分布。对于训练数据中完全未出现过的、形态差异极大的机器人（如从仅有夹爪的数据集泛化到灵巧手），性能会急剧下降。\n\n### 发展方向三：跨具身策略与表示的统一学习\n\n这部分工作尝试在策略网络架构或学习过程中嵌入形态信息，以支持对一组已知形态的泛化。\n\n1.  **统一策略架构**\n    *   **代表工作**：**UniGrasp**【15】、**AdaGrasp**【19】、以及一些将形态编码与策略共同训练的方法【8】。\n    *   **核心改进**：设计能够接收**形态描述（如URDF）** 作为输入的策略网络，在**一组给定的、多样的形态上**进行训练，旨在泛化到该集合内的未见形态。\n    *   **关键局限**：\n        *   **需要目标形态数据**：通常需要在包含目标形态（或相似形态）的**混合数据集**上进行训练，无法实现从单一源形态到完全未知目标形态的零样本迁移。\n        *   **泛化范围有限**：性能高度依赖于训练所见形态的覆盖范围，对于像从夹爪到灵巧手这样的“分布外”泛化挑战巨大。\n\n### 发展方向四：离线的跨具身数据生成与合成（CEI 所属方向）\n\n这是 CEI 直接推进的方向，旨在不依赖目标形态任何真实数据的情况下，**算法性地合成**可用于训练目标策略的演示数据。\n\n1.  **通用数据生成技术**\n    *   **代表工作**：**MimicGen**【12】（在线）和 **DemoGen**【20】（离线）。\n    *   **核心改进**：\n        *   **MimicGen**：在高保真物理模拟器中重放源轨迹，通过物理仿真生成新配置下的数据，保证物理真实性，但**计算成本高**且难以用于真实世界。\n        *   **DemoGen**：通过轨迹变换离线生成数据，**速度快**，但主要处理**物体配置变化**，未解决**机器人形态变化**的根本问题。\n    *   **关键局限**：它们都**未专门设计用于处理末端执行器形态的极端差异**。\n\n2.  **CEI 的革命性改进**\n    *   **核心创新**：提出了首个专门解决**从平行夹爪到多指灵巧手（及反向）** 这类极端跨具身数据生成问题的框架。\n    *   **具体改进点**：\n        *   **提出“功能相似性”概念**：超越几何外形，从**物体交互行为**的层面定义形态间的相似性。这是实现极端迁移的理论基础。\n        *   **引入方向性倒角距离**：使用 **DCD**【16】量化功能相似性，同时考虑**空间距离和表面法向对齐**，这对抓取等接触丰富的任务至关重要（ ablation 实验证明方向信息是关键）。\n        *   **端到端的轨迹、观察、动作合成**：\n            *   **基于梯度的轨迹对齐**：通过优化 DCD，将源轨迹在**功能层面**对齐到目标形态，生成目标关节轨迹。\n            *   **同步合成点云观察和关节动作**：不仅生成看起来像目标机器人的观察，还生成与之严格匹配、可执行的动作序列，形成完整的演示数据对 `(o, a)`。\n        *   **实现真正的零样本双向迁移**：仅需源机器人数据和目标机器人的描述文件（URDF），即可生成目标数据，并在仿真和真实世界中验证了**夹爪↔灵巧手**的双向策略迁移，平均迁移率达 **82.4%**。\n        *   **拓展性**：框架天然支持**空间泛化**（从单条轨迹生成覆盖工作空间的多样数据）和**多模态运动生成**（通过初始化策略产生不同的有效动作模式）。\n\n### 总结：发展脉络与 CEI 的定位\n\n| 发展阶段 | 核心思想 | 代表性工作/方法 | 相对于前作的改进 | 遗留问题/局限 |\n| :--- | :--- | :--- | :--- | :--- |\n| **1. 领域自适应** | 对齐不同领域的视觉/动态特征。 | 循环一致性【25】、Robot-Awareness【10】 | 开始处理仿真到真实的差异。 | 未处理机器人本体形态差异。 |\n| **2. 视觉层面弥合** | 在图像层面“绘制”目标机器人。 | MIRAGE【3】, RoVi-Aug【4】 | 实现了观察层面的零样本跨具身。 | 假设平行夹爪；未生成匹配的动作；难以处理灵巧手。 |\n| **3. 大数据驱动** | 收集多样数据训练通用策略。 | OXE【13】, RT-X/Octo【14】 | 证明了大规模数据的威力，构建了基础模型。 | 数据存在形态偏差；对极端未见形态泛化差。 |\n| **4. 统一策略学习** | 将形态编码作为策略输入。 | UniGrasp【15】, AdaGrasp【19】 | 可泛化到训练分布内的未见形态。 | 需要目标形态相关数据；无法处理分布外极端形态。 |\n| **5. 离线数据生成** | 算法性合成新数据。 | MimicGen【12】, DemoGen【20】 | 高效扩充数据，解决物体配置泛化。 | 未解决机器人形态变化的根本问题。 |\n| **6. 极端跨具身合成 (CEI)** | **基于功能相似性的轨迹与数据合成**。 | **CEI**",
      "timestamp": "2026-01-20T17:58:54.007760",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "他的前作有哪些？使用表格仔细讲讲他的每篇前作，他和前作的区别是什么，主要改善是什么？着重于具体相比于之前文章的改动",
      "answer": "## CEI论文的前作分析与对比\n\n根据论文内容，CEI的研究建立在多个相关工作的基础上，但其核心创新点在于解决**极端形态差异（如平行夹爪与灵巧手）之间的跨具身数据生成**。论文中明确提及并对比了数篇关键的前作。以下是这些前作的详细分析，并以表格形式总结CEI与它们的核心区别和改进。\n\n### 关键前作分析\n\n| 前作名称 (引用编号) | 核心方法 / 关注点 | 与CEI的主要区别 | CEI的主要改进 / 创新 |\n| :--- | :--- | :--- | :--- |\n| **Mirage [3]** | **跨绘制**：通过图像编辑技术（如将源机器人的图像“绘制”成目标机器人的外观）来合成视觉观测，以实现零样本策略迁移。 | 1. **关注层面**：主要解决**视觉外观**的差异，属于图像域转换。<br>2. **形态限制**：方法**严重依赖平行夹爪**和操作空间控制（OSC），难以迁移到灵巧手等复杂形态。<br>3. **数据生成**：侧重于观测（图像）的合成，对动作的适配能力有限。 | 1. **关注功能而非外观**：提出**功能相似性**概念，从机器人**与物体交互的行为本质**出发进行对齐，不依赖视觉外观匹配。<br>2. **解决极端形态差异**：专门设计用于在**平行夹爪与多指灵巧手**之间进行双向数据与策略迁移。<br>3. **全轨迹生成**：同步合成**观测（点云）和动作（关节轨迹）**，生成完整、可执行的目标机器人演示轨迹。 |\n| **RoVi-Aug [4]** | **机器人与视点增强**：结合生成模型和跨绘制技术，同时增强机器人外观和相机视点，以缩小领域和具身差距。 | 1. **问题范围**：同时处理**具身差异**和**视点差异**。<br>2. **方法基础**：同样基于生成式视觉增强，其**有效性前提是源与目标形态在视觉和运动学上不能相差太大**（文中指出其适用性仍局限于平行夹爪和OSC）。<br>3. **数据基础**：需要一定量的跨具身数据来训练生成模型。 | 1. **专攻形态鸿沟**：CEI**专注于解决由巨大形态差异（特别是末端执行器）带来的根本性挑战**，而不主要处理视点变化。<br>2. **基于几何与优化的无数据生成**：**无需为目标形态收集任何演示数据**。仅利用机器人的URDF/XML描述文件，通过基于梯度的轨迹优化实现迁移，解决了灵巧手数据稀缺的瓶颈。<br>3. **引入量化指标**：创新性地使用**定向倒角距离**来形式化和量化“功能相似性”，为跨具身对齐提供了可优化的明确目标。 |\n| **MimicGen [12]** | **在线数据生成**：在高保真物理模拟器中，通过调整物体配置并执行策略 rollout 来生成新的、物理上真实的演示。 | 1. **生成范式**：**在线生成**，依赖模拟器中的物理执行。<br>2. **计算成本**：每次生成都需要进行物理仿真，**计算密集、耗时**。<br>3. **适用性**：主要适用于仿真环境，直接应用于真实世界成本高（需手动重置物体等）。 | 1. **离线生成范式**：CEI是**完全离线的数据合成方法**。给定源演示，直接通过计算和优化生成目标演示，**不依赖物理仿真**。<br>2. **效率大幅提升**：如表VI所示，生成数百条演示仅需**数分钟**，而MimicGen需要**数小时**，效率高出数个数量级。<br>3. **摆脱物理约束**：不依赖于模拟器是否支持目标机器人或精确的物理参数，只要有机器的运动学描述即可工作，**更通用、更轻量**。 |\n| **DemoGen [20]** | **离线轨迹变换**：通过对现有演示轨迹进行几何变换（如平移、旋转）来生成新数据，主要用于**空间泛化**。 | 1. **核心能力**：专注于**同一机器人**在**不同空间位置**执行相同任务的数据生成。<br>2. **形态处理**：**不具备跨不同机器人形态进行数据迁移的能力**。 | 1. **扩展生成维度**：CEI的核心是**跨形态生成**，而DemoGen是**空间生成**。CEI**将空间泛化作为其一个扩展应用**（见VII-A节），展示了其框架的灵活性。<br>2. **方法本质不同**：DemoGen是简单的几何变换；CEI涉及复杂的基于功能相似性的轨迹优化和观测合成。CEI在需要时也可以集成类似DemoGen的空间变换来增强数据多样性。 |\n\n### 总结：CEI的核心突破\n\n综合来看，CEI相对于其前作的核心区别和改善集中于以下几点：\n\n1.  **问题定义上的深化**：从前作主要解决**视觉域适应**或**有限形态变化**，转向攻克**平行夹爪与灵巧手之间极端形态差异**这一更具挑战性的问题。\n2.  **方法论上的创新**：\n    *   **提出“功能相似性”**：超越了表面对齐（外观、关节空间），抓住了“交互行为”这一本质，为跨具身学习提供了新的理论视角。\n    *   **构建基于优化的离线生成管道**：结合DCD度量、可微分运动学和序列优化，实现了**无需目标数据、无需仿真**的高效、高质量轨迹与观测合成。\n3.  **能力上的拓展**：\n    *   **双向迁移**：实现了夹爪→灵巧手和灵巧手→夹爪的双向有效迁移。\n    *   **基础框架的兼容性**：展示了其核心方法可轻松与**空间泛化**和**多模态运动生成**等技术结合，形成一个更强大的数据合成工具箱。\n\n**简言之，CEI的核心改进在于：它不再试图让机器人“看起来”一样（如Mirage），或只在相似形态间迁移（如RoVi-Aug），而是通过让机器人在任务中“行为功能”等效，从而在算法层面打通了截然不同的机器人形态之间的数据与策略迁移通道。**",
      "timestamp": "2026-01-20T17:59:40.849081",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文提出了哪些关键技术方法，请列表格具体详细说明技术细节，需要包含具体的数学原理推导，以及具体参数。",
      "answer": "好的，作为一名专业的学术论文分析助手，我将对这篇题为《CEI: A Unified Interface for Cross-Embodiment Visuomotor Policy Learning in 3D Space》的论文进行深入分析，并详细阐述其提出的关键技术方法。\n\n## 论文核心技术创新与价值分析\n\n本文的核心贡献在于提出了一个名为 **CEI** 的统一框架，旨在解决机器人基础模型因数据偏见而难以在不同形态的机器人（特别是从平行夹爪到灵巧手）之间进行策略迁移的难题。其核心思想是利用**功能相似性**来对齐不同机器人的运动轨迹，并合成目标机器人的观测和动作数据。\n\n### 关键技术方法详述\n\n以下表格详细说明了CEI框架中的关键技术组件、其数学原理、实现细节及参数。\n\n| 技术模块 | 核心概念与目标 | 数学原理与推导细节 | 具体参数与实现细节 |\n| :--- | :--- | :--- | :--- |\n| **1. 功能表示** | 将机器人的交互能力抽象为一组**点-方向对** `X = {(p_i, n_i)}`，用于量化不同形态机器人之间的**功能相似性**。 | - **点 `p_i`**：采样自机器人末端执行器（如手指指腹）表面的点，代表潜在的物体接触区域。<br>- **方向 `n_i`**：点 `p_i` 处的表面法向量，代表接触时的可能施力方向。<br>- 通过正向运动学将所有点-方向对转换到世界坐标系，确保在不同机器人之间进行对齐时有一个共同的参考系。 | - **采样来源**：从手指指垫网格表面采样。<br>- **法向量计算**：使用 `TorchSDF` 库自动计算采样点附近的表面法线。<br>- **目的**：将复杂的几何形态转化为可用于量化比较的集合。 |\n| **2. 功能相似性度量（方向倒角距离）** | 量化两个功能表示集合 `X` 和 `X'` 之间的相似度，同时考虑**空间距离**和**方向对齐**。 | 采用**方向倒角距离**：<br>```math<br>DCD(X, X') = (1/N) Σ_{i=1}^{N} min_j (‖p_i - p'_j‖₂ - λ·⟨n_i, n'_j⟩) <br>                + (1/N') Σ_{j=1}^{N'} min_i (‖p'_j - p_i‖₂ - λ·⟨n'_j, n_i⟩)<br>```<br>**推导与解释**：<br>1. **第一项**：对于源集合 `X` 中的每个点 `(p_i, n_i)`，在目标集合 `X'` 中寻找最匹配的点 `(p'_j, n'_j)`。匹配代价由两部分组成：<br>   - `‖p_i - p'_j‖₂`：空间欧氏距离，越小越好。<br>   - `-λ·⟨n_i, n'_j⟩`：法向量点积的负值。由于点积 `⟨·,·⟩` 越大表示方向越一致，加上负号后，整体代价越小表示方向越匹配。<br>2. **第二项**：对称地，从目标集合向源集合进行匹配，确保度量的对称性。<br>3. **最终相似度**：论文将 **`-DCD(X, X')`** 定义为功能相似度，即 `DCD` 值越小（负值越大），相似度越高。 | - **平衡参数 `λ`**：用于权衡空间距离和方向一致性的重要性。论文通过实验确定 `λ = 0.5`。<br>- **距离度量**：使用 L2 范数计算空间距离。<br>- **方向度量**：使用向量点积计算方向一致性。 |\n| **3. 基于梯度的轨迹对齐** | 将源机器人的演示轨迹（功能表示序列 `{X_t}`）通过优化，对齐到目标机器人的关节空间，生成目标轨迹 `{q'_t}`。 | **优化问题定义**：<br>对于每一时间步 `t`，初始化目标机器人关节配置 `q'_t` 为可学习变量，通过正向运动学 `FK_{E'}(q'_t)` 得到其功能表示 `X'_t`。最小化对齐损失：<br>```math<br>min_{q'_t} ℒ_align(q'_t) = w₁·DCD(X_t, X'_t) + w₂·ℒ_reg(q'_t)<br>```<br>**损失项分解**：<br>- **`DCD(X_t, X'_t)`**：驱动目标机器人的功能表示与源机器人在当前帧的功能表示相似。<br>- **`ℒ_reg(q'_t)`**：正则化项，惩罚超出关节限位的配置，确保生成的轨迹在物理上可行。<br><br>**序列优化策略**：<br>为避免逐帧独立优化导致轨迹不连续，采用序列初始化：<br>`q'_{t+1}^{(0)} ← q̂_t`<br>即第 `t+1` 帧的优化初始值，使用第 `t` 帧优化后的结果 `q̂_t`。这保证了轨迹的时空平滑性，并加速收敛。 | - **优化器**：使用梯度下降法。<br>- **损失权重**：`w₁ = 1`, `w₂ = 1`。<br>- **正则项**：`ℒ_reg` 具体形式未在正文详述，通常为对超出限位的关节施加的二次惩罚。<br>- **优化步数**：每帧最大优化300步，若损失连续10步无改善则提前停止。<br>- **正向运动学引擎**：使用 `pytorch_kinematics` 实现批量可微计算。 |\n| **4. 观测与动作合成** | 根据对齐后的目标机器人关节轨迹 `{q̂_t}`，生成可用于训练目标机器人策略的完整演示数据 `D̂_{E', s₀}`。 | **动作生成**：<br>`a_t = q̂_{t+1}`<br>将动作定义为下一帧的目标关节位置。执行时采用闭环控制，持续施加该动作直至机器人到达目标位置。<br><br>**观测生成**：<br>1. **本体感知观测**：直接取自对齐后的轨迹，`(ô_t^{arm}, ô_t^{ee}) = q̂_t`。<br>2. **点云观测合成**：<br>   - **裁剪**：移除工作空间外的点，并**掩码**掉距离源机器人网格表面小于阈值 `τ` 的点（防止源机器人遮挡目标视角）。<br>   - **增强**：根据当前关节状态 `q̂_t`，从目标机器人网格表面采样点，添加到点云中。<br>   - **降采样**：使用最远点采样将点云固定到1024个点。 | - **距离阈值 `τ`**：例如 5 mm，用于确定需要掩码的源机器人附近点云区域。<br>- **点云大小**：固定为 `[1024, 3]`。<br>- **推理时一致性**：测试时对真实观测应用相同的掩码和增强流程，确保训练与测试的观测分布一致。 |\n| **5. 扩展应用：空间泛化** | 从单条演示轨迹，通过空间变换生成覆盖整个工作空间的多样化演示数据。 | 给定一个空间变换 `𝒯_i`（如平移），首先对源功能表示轨迹进行**渐进式插值**：<br>```math<br>X̃_t = X_t + ℒ(t)·(𝒯_i(X_t) - X_t), t=0,1,...,L-1<br>```<br>其中 `ℒ(t) = min(t/(0.8L), 1)` 是一个裁剪线性增长函数。<br>**原理**：<br>- 在轨迹初期 (`t` 较小)，`ℒ(t)≈0`，`X̃_t ≈ X_t`，保证所有生成轨迹的**初始状态相同**。<br>- 在轨迹后期 (`t` 接近 `L`)，`ℒ(t)=1`，`X̃_t = 𝒯_i(X_t)`，使得轨迹**最终状态**根据变换 `𝒯_i` 发生变化。<br>- 随后，使用标准的CEI轨迹对齐流程，将目标机器人与这个“空间增强后”的轨迹 `{X̃_t}` 对齐，并合成相应的点云（对物体点云应用 `𝒯_i`）。 | - **插值函数**：使用在80%轨迹长度处饱和的线性函数，确保任务后半段完全执行变换后的动作。 |\n| **6. 扩展应用：多模态运动生成** | 利用功能相似性度量的多解特性，从单条源演示生成多种可行的目标机器人运动模式。 | **精英初始化策略**：<br>1. 从目标机器人的关节空间中均匀采样大量初始配置候选。<br>2. 计算每个候选配置的功能表示与源机器人初始功能表示的 `-",
      "timestamp": "2026-01-20T18:00:45.959228",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "他使用了哪些评价指标与数据集，列表格具体讲讲他的评价指标的细节与数据集的细节",
      "answer": "## 论文评价指标与数据集分析\n\n### 一、 主要评价指标\n\n论文采用的核心评价指标是**任务成功率**，并在不同实验设置下进行了细化和对比。具体指标细节如下表所示：\n\n| 评价指标 | 计算方式与细节 | 实验场景 | 作用与说明 |\n| :--- | :--- | :--- | :--- |\n| **任务成功率** | 成功完成任务的试验次数 / 总试验次数。 | 仿真与真实世界实验的核心指标。 | 直接衡量**跨具身数据合成**和**策略学习**的有效性。在仿真中通过模拟器回放验证轨迹可行性，在真实世界中通过策略部署评估最终性能。 |\n| **跨具身转移率** | (目标具身策略成功率) / (源具身策略成功率) × 100%。 | 真实世界双向转移实验（表 V）。 | 量化**CEI框架的转移效率**，衡量在克服具身差异后，目标机器人能保留源机器人性能的百分比。论文中平均达到 **82.4%**。 |\n| **时间成本** | 生成指定数量演示所需的总时间（秒/分钟/小时）。 | 真实世界数据生成效率对比（表 VI）。 | 评估**CEI的离线数据生成效率**，与在线方法（MimicGen）和快速轨迹变换方法（DemoGen）进行对比。 |\n| **对齐损失** | 公式(2): `ℒ_align = w1 * DCD(X_t, X'_t) + w2 * ℒ(q'_t)`。 | 轨迹对齐优化过程。 | **内部优化指标**，用于梯度下降，确保目标机器人的功能表示与源机器人对齐，同时满足关节限制。DCD（定向倒角距离）是核心相似度度量。 |\n\n**关键指标深度解析：**\n- **定向倒角距离**： 这是**CEI**的技术核心，用于量化“功能相似性”。它不仅计算点云的空间距离（`||p_i - p'_j||_2`），还加入了方向对齐项（`-λ·<n_i, n'_j>`）。这使得匹配过程更关注**接触点的法线方向**，对于抓取等需要特定接触力向的任务至关重要（见消融实验表II）。\n- **成功率的分层评估**： 实验设计巧妙地区分了 **“轨迹可行性”**（仿真中直接回放合成轨迹）和 **“策略性能”**（用合成数据训练策略并评估）。这分别验证了**数据合成质量**和**策略学习效果**。\n\n### 二、 使用的数据集\n\n论文工作主要基于**自行收集的演示数据**，并利用**CEI**对其进行跨具身合成，而非直接使用现有大型数据集。数据细节如下：\n\n| 数据集类型 | 源机器人 | 任务与数量 | 数据内容与格式 | 用途 |\n| :--- | :--- | :--- | :--- | :--- |\n| **仿真源数据** | Franka Panda (带平行夹爪) | 3个任务：OpenDrawer, PickCube, StackCube。通过遥操作收集演示。 | - **观测**： 点云 (`o_t^pcd`)、机械臂关节状态 (`o_t^arm`)、末端执行器状态 (`o_t^ee`)。<br>- **动作**： 机械臂和末端执行器的目标关节位置 (`a_t^arm`, `a_t^ee`)。 | 作为**源演示**，用于向**16种**目标具身（4种机械臂 × 4种末端执行器）进行转移和策略训练。 |\n| **真实世界源数据** | 1. UR5 + AG95 平行夹爪<br>2. UR5 + Xhand 五指灵巧手 | 6个任务，双向转移：<br>- AG95→Xhand: PushCube, OpenDrawer, PlaceBird (各25条演示)<br>- Xhand→AG95: PickCup, PackageBread, InsertFlower (各25条演示) | - **观测**： 由RealSense L515 RGB-D相机生成的场景点云，以及机器人本体感状态。<br>- **动作**： 关节位置目标。通过键盘遥操作收集。 | 用于验证**CEI在真实复杂场景下的双向跨具身转移能力**，从简单夹爪到灵巧手，反之亦然。 |\n| **合成数据（由CEI生成）** | 多种目标机器人（仿真16种，真实世界2种） | 与源任务对应，通过**CEI**框架自动合成。 | 格式与源数据一致，包含为目标机器人合成的点云观测、关节状态观测和关节动作。 | 1. **直接评估**：在仿真中回放，验证合成轨迹的可行性（表I）。<br>2. **策略训练**：作为训练集，用于训练3D Diffusion Policy，评估最终策略性能（表IV, V）。 |\n| **空间泛化合成数据** | AG95 → Xhand | PressButton任务。从**1条**源演示，通过空间变换生成**1000条**演示，分布在10个锚点周围的10x10网格上。 | 应用空间变换 `𝒯_i` 对功能表示轨迹和物体点云进行插值，再利用CEI生成对应目标机器人的全套数据。 | 用于验证**CEI支持从单条演示进行大规模空间数据增强**的能力，显著提升策略的工作空间泛化性能（图6）。 |\n\n**数据集关键点分析：**\n- **解决数据偏差问题**： 当前大型机器人数据集（如OXE）存在严重偏差，过度集中于Franka/xArm和平行夹爪。**CEI**的创新在于，**无需为目标具身（尤其是稀缺的灵巧手）收集任何真实数据**，即可从丰富的夹爪数据中合成出可用演示。\n- **仿真到真实的一致性**： 在仿真和真实世界实验中，数据模态保持统一（以**点云**为核心视觉观测），确保了方法验证的连贯性和结论的可靠性。\n- **任务设计具有梯度难度**： 从简单的推动（PushCube）到需要稳定抓取和放置的复杂任务（PlaceBird, InsertFlower），任务难度递增，全面检验了方法在**不同接触丰富度**场景下的有效性（如表I结果分析所示）。",
      "timestamp": "2026-01-20T18:01:31.016634",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文在哪些数据集上进行了实验？主要的评估指标和性能提升是多少？",
      "answer": "## 论文实验数据集与评估指标分析\n\n### 一、实验数据集\n论文在**仿真**和**真实世界**两种环境下进行了实验，具体数据集构建如下：\n\n#### 1. **仿真实验数据集**\n- **任务**：3个基础操作任务  \n  - `OpenDrawer`（打开抽屉）  \n  - `PickCube`（抓取立方体）  \n  - `StackCube`（堆叠立方体）  \n- **机器人形态**：16种不同的机器人组合  \n  - **机械臂**：UR5e、IIWA、Kinova3、Franka Panda（共4种）  \n  - **末端执行器**：FourierRightHand、InspireRightHand、FourierLeftHand、RobotiqThreeFinger（共4种）  \n- **数据来源**：使用Franka Panda机器人通过遥操作收集演示数据，并通过CEI框架迁移到其他15种机器人形态。\n\n#### 2. **真实世界实验数据集**\n- **任务**：6个操作任务（分为两组）  \n  - **AG95平行夹爪 → Xhand灵巧手**：  \n    - `PushCube`（推动立方体）  \n    - `OpenDrawer`（打开抽屉）  \n    - `PlaceBird`（放置玩具鸟）  \n  - **Xhand灵巧手 → AG95平行夹爪**：  \n    - `PickCup`（抓取杯子）  \n    - `PackageBread`（包装面包）  \n    - `InsertFlower`（插入花束）  \n- **机器人平台**：UR5机械臂 + AG95夹爪 / Xhand灵巧手  \n- **数据收集**：通过键盘遥操作收集25条演示轨迹，使用RGB-D相机（RealSense L515）生成场景点云。\n\n---\n\n### 二、主要评估指标\n1. **成功率（Success Rate）**  \n   - 在仿真和真实世界中，通过**在线回放合成轨迹**或**部署训练好的策略**来评估任务完成情况。\n   - 仿真：每个任务-机器人组合进行20次试验，计算平均成功率。\n   - 真实世界：每个任务进行10次试验，计算成功率。\n\n2. **迁移比率（Transfer Ratio）**  \n   - 定义：`迁移后成功率 / 源机器人成功率`。\n   - 用于量化跨形态迁移的性能保持程度。\n\n3. **时间成本（Time Cost）**  \n   - 测量生成100–400条演示所需的时间，与基线方法（MimicGen、DemoGen）对比。\n\n---\n\n### 三、性能提升与关键结果\n\n#### 1. **仿真实验结果**\n- **整体成功率**：CEI在16种机器人形态上平均成功率达到**62%**（策略评估结果）。\n- **跨形态迁移有效性**：  \n  - 从平行夹爪到灵巧手的迁移中，`OpenDrawer`任务成功率最高（平均95%），`StackCube`较低（平均32%），说明任务接触复杂度影响迁移难度。\n  - **消融实验**：CEI完整方法相比**无方向信息**的版本，成功率提升约一倍（65% vs. 32%）；相比**手动线性插值（BMS）**，在抓取任务上从0%提升至65%。\n\n#### 2. **真实世界实验结果**\n- **双向迁移成功率**：  \n  - AG95 → Xhand：平均成功率 **83%**（25/30）  \n  - Xhand → AG95：平均成功率 **57%**（17/30）  \n  - **整体平均成功率**：**70%**（42/60）\n- **迁移比率**：**82.4%**（即迁移后性能达到源机器人性能的82.4%）。\n- **挑战任务**：`InsertFlower`因物体细小易滑落，成功率最低（AG95: 40%, Xhand: 20%）。\n\n#### 3. **效率对比**\n- **数据生成时间**：  \n  - CEI生成100条演示仅需 **2.5分钟**，远快于在线方法MimicGen（6.4小时），但慢于纯轨迹变换方法DemoGen（0.29秒）。\n\n#### 4. **扩展功能验证**\n- **空间泛化**：在`PressButton`任务中，通过单条演示生成1000条空间分布数据，策略可覆盖桌面大部分区域（80cm×80cm）。\n- **多模态运动生成**：在`OpenDrawer`任务中生成两种不同的开抽屉动作模式，成功率均保持在70%以上。\n\n---\n\n### 四、核心结论\n- **技术创新价值**：CEI通过**功能相似性度量**与**梯度优化对齐**，首次实现了从平行夹爪到多指灵巧手的**极端跨形态演示迁移**，在仿真和真实世界中平均迁移比率超过82%。\n- **实际应用意义**：大幅降低了为新型机器人收集演示数据的成本，并为**机器人基础模型**提供了跨形态泛化的数据合成工具。",
      "timestamp": "2026-01-20T18:02:06.382242",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    },
    {
      "question": "论文的主要局限性有哪些？未来可能的改进方向是什么？",
      "answer": "## 论文主要局限性分析\n\n基于对论文内容的分析，**CEI** 框架虽然取得了显著的跨具身学习效果，但仍存在以下几个关键局限性：\n\n### 1. **对物理接触与动态交互的建模不足**\n- **问题**：方法基于**几何功能相似性**进行轨迹对齐，但未显式建模**接触力学**（如摩擦力、滑动、力闭合）。这在接触丰富的任务（如 `StackCube`、`InsertFlower`）中表现明显，成功率下降。\n- **表现**：在需要稳定抓握或精细操作的任务中，合成的轨迹可能在物理仿真或现实中因滑动、碰撞而失败。\n- **例证**：`InsertFlower` 任务中，花茎细滑，仅靠几何对齐无法保证稳定抓握，导致成功率低。\n\n### 2. **依赖视觉-运动学输入，缺乏多模态感知**\n- **问题**：当前框架仅使用**点云**和**关节状态**作为输入，缺乏**触觉传感**或**力反馈**信息。\n- **影响**：无法实时检测和适应不稳定的接触状态（如滑动），限制了在动态、非结构化环境中的鲁棒性。\n\n### 3. **计算效率与可扩展性挑战**\n- **问题**：虽然比在线生成方法（如 `MimicGen`）快，但**基于梯度的轨迹对齐**仍需数分钟生成数百条示教，难以直接应用于**超大规模数据集**（如百万级）。\n- **细节**：每帧需优化最多300步，尽管已批量并行，但计算开销仍可能成为瓶颈。\n\n### 4. **任务与形态泛化的边界**\n- **问题**：实验验证集中于**抓取类任务**和**特定形态转换**（平行夹爪 ↔ 灵巧手）。对于更极端的形态差异（如多臂机器人、非仿人形态）或非抓取任务（如推、拧）的泛化能力未充分验证。\n- **潜在风险**：功能相似性假设可能在某些任务-形态组合中失效。\n\n### 5. **初始状态依赖与轨迹多样性限制**\n- **问题**：轨迹对齐严重依赖**源示教的初始状态**。虽然论文提出了**精英初始化策略**来增加多样性，但生成的运动模式仍受限于源轨迹的宏观结构。\n- **表现**：多模态生成能力有限，可能无法覆盖所有可行的目标机器人运动策略。\n\n---\n\n## 未来可能的改进方向\n\n### 1. **集成物理感知与触觉反馈**\n- **方向**：在功能相似性优化中引入**接触力模型**或**触觉信号预测**。\n- **方法**：\n  - 使用**物理仿真器**提供接触力监督，或在损失函数中加入力闭合约束。\n  - 融合**触觉传感器数据**（如 GelSight、Digit），实现“视觉-触觉”跨模态对齐。\n- **预期价值**：提升在滑动、柔性物体操作等任务中的成功率和鲁棒性。\n\n### 2. **开发更高效的可扩展算法**\n- **方向**：加速轨迹对齐过程，使其适用于大规模数据合成。\n- **方法**：\n  - 采用**神经网络近似**对齐过程，训练一个“对齐网络”直接预测目标关节轨迹。\n  - 利用**元学习**或**快速自适应**技术，减少对新形态的优化步数。\n- **预期价值**：实现分钟级生成数千条示教，助力基础模型训练。\n\n### 3. **扩展任务与形态泛化范围**\n- **方向**：验证并提升框架在更广泛任务和机器人形态上的有效性。\n- **方法**：\n  - 在更多样化的**任务集**（如装配、工具使用）和**机器人形态集**（如移动机械臂、四足机器人）上进行测试。\n  - 探索**分层功能表示**，以捕捉不同粒度（如整体姿态、指尖细节）的相似性。\n- **预期价值**：真正实现“任何任务，任何机器人”的通用策略迁移。\n\n### 4. **探索RGB观测的兼容性**\n- **方向**：将当前点云框架扩展至主流的**RGB观测**。\n- **方法**：\n  - 利用**神经渲染**技术（如 NeRF、Diffusion）合成目标机器人的RGB图像。\n  - 结合**跨绘画**技术，在像素级对齐不同形态的外观。\n- **预期价值**：与现有基于RGB的大规模数据集和模型（如 RT-X）更好兼容。\n\n### 5. **结合强化学习与离线数据生成**\n- **方向**：将 `CEI` 合成的数据作为**高质量初始数据集**，结合**离线强化学习**或**示范增强RL**进行策略微调。\n- **方法**：\n  - 使用 `CEI` 数据预训练策略，再在目标环境中进行少量**在线交互微调**。\n  - 构建**动力学模型**，对合成轨迹进行物理合理性修正。\n- **预期价值**：弥补纯几何合成的不足，提升最终策略在真实物理世界中的性能。\n\n### 6. **构建开源基准与工具链**\n- **方向**：将 `CEI` 框架模块化、开源化，并建立标准评估基准。\n- **方法**：\n  - 发布**跨具身数据合成管道**的代码库。\n  - 定义一套标准的**跨具身转移任务集、形态集和评估协议**。\n- **预期价值**：降低社区研究门槛，加速跨具身学习领域发展。\n\n---\n\n## 总结\n`CEI` 的核心贡献在于提出了**功能相似性**这一概念，并通过**基于梯度的轨迹对齐**实现了从平行夹爪到灵巧手等极端形态间的策略迁移。其当前局限性主要源于**纯几何视角**和**静态优化范式**。未来的改进将围绕**引入物理感知**、**提升计算效率**、**扩展泛化边界**以及**融合多模态学习**展开，最终目标是构建一个高效、鲁棒、通用的机器人策略迁移与数据合成平台。",
      "timestamp": "2026-01-20T18:02:49.826315",
      "thinking": null,
      "is_reasoning": false,
      "parent_qa_id": null
    }
  ],
  "is_hidden": false,
  "is_starred": false,
  "flag": "",
  "published_date": "2026-01-14T05:07:11Z",
  "created_at": "2026-01-20T17:49:48.108427",
  "updated_at": "2026-01-20T17:49:48.108434"
}