{
    "id": "2601.09856v1",
    "title": "How Human Motion Prediction Quality Shapes Social Robot Navigation Performance in Constrained Spaces",
    "authors": [
        "Andrew Stratton",
        "Phani Teja Singamaneni",
        "Pranav Goyal",
        "Rachid Alami",
        "Christoforos Mavrogiannis"
    ],
    "abstract": "受移动机器人在仓库、医院、制造车间及家庭环境中与人类更紧密融合的愿景驱动，本研究聚焦于动态且空间受限环境下的机器人导航。为确保此类场景中人类的安全、舒适与效率，机器人需具备对人类移动模式的认知能力。由于人类行为的随机性、用户偏好差异及数据稀缺性，机器人对人类运动的预测尤为困难。本研究系统探讨了人类运动预测质量对机器人导航性能、人类工作效率及主观感受的影响。我们设计了一个在受限工作空间中机器人穿梭于两名人类受试者之间的场景，并通过一项跨两大洲两个实验站点、涵盖两种不同机器人平台的用户研究（样本量N=80）进行实证验证。主要发现包括：1）广泛采用的平均位移误差指标不能可靠预测机器人导航性能与人类主观感受；2）在受限环境中，关于人类会主动配合机器人的普遍假设往往失效，用户常不回应机器人的协作意图，导致系统性能下降；3）机器人导航效率的提升往往以牺牲人类效率与舒适度为代价。",
    "url": "https://arxiv.org/abs/2601.09856v1",
    "html_url": "https://arxiv.org/html/2601.09856v1",
    "html_content": "",
    "preview_text": "Motivated by the vision of integrating mobile robots closer to humans in warehouses, hospitals, manufacturing plants, and the home, we focus on robot navigation in dynamic and spatially constrained environments. Ensuring human safety, comfort, and efficiency in such settings requires that robots are endowed with a model of how humans move around them. Human motion prediction around robots is especially challenging due to the stochasticity of human behavior, differences in user preferences, and data scarcity. In this work, we perform a methodical investigation of the effects of human motion prediction quality on robot navigation performance, as well as human productivity and impressions. We design a scenario involving robot navigation among two human subjects in a constrained workspace and instantiate it in a user study ($N=80$) involving two different robot platforms, conducted across two sites from different world regions. Key findings include evidence that: 1) the widely adopted average displacement error is not a reliable predictor of robot navigation performance and human impressions; 2) the common assumption of human cooperation breaks down in constrained environments, with users often not reciprocating robot cooperation, and causing performance degradations; 3) more efficient robot navigation often comes at the expense of human efficiency and comfort.",
    "is_relevant": false,
    "relevance_score": 2.0,
    "extracted_keywords": [
        "human motion prediction",
        "robot navigation",
        "constrained spaces",
        "user study",
        "social robot"
    ],
    "one_line_summary": "这篇论文研究了人类运动预测质量对社交机器人在受限空间中导航性能的影响，通过用户实验发现平均位移误差不可靠、人类合作假设失效以及机器人效率与人类舒适度之间的权衡。",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-14T20:34:34Z",
    "created_at": "2026-01-20T17:49:52.197868",
    "updated_at": "2026-01-20T17:49:52.197877"
}