{
    "id": "2601.06833v1",
    "title": "SPINE Gripper: A Twisted Underactuated Mechanism-based Passive Mode-Transition Gripper",
    "authors": [
        "JaeHyung Jang",
        "JunHyeong Park",
        "Joong-Ku Lee",
        "Jee-Hwan Ryu"
    ],
    "abstract": "本文提出了一种单驱动被动夹持器，通过机械编码的动力传递逻辑，实现了稳定抓取与连续双向手内旋转。与需要多个驱动器、传感器或基于控制切换的传统多功能夹持器不同，该夹持器仅根据输入扭矩的大小在抓取与旋转模式间自主切换。实现此功能的核心是扭曲欠驱动机构，该机构能从单一旋转输入中产生非共面运动（即轴向收缩与旋转），且无论旋转方向如何均能产生相同的收缩量。摩擦发生器通过机械方式定义了控制被动模式切换的扭矩阈值，使得夹持器能在无传感或主动控制的情况下，先建立稳定抓持，再自主过渡到手内旋转。本文推导了描述扭曲欠驱动机构运动学、弹性力生成及扭矩传递的分析模型，并进行了实验验证。通过对抓取成功率、基于摩擦的抓取力调节及双向旋转性能的定量实验，评估了所制备夹持器的性能。系统级演示（包括螺栓操作、物体重定向以及仅凭腕部扭矩驱动的机械臂集成任务）验证了夹持器在双向旋转中均能可靠实现从抓取到旋转的转换。这些结果表明，仅通过机械设计即可实现非共面多功能操作，从而确立了机械编码动力传递逻辑作为一种稳健的替代方案，可取代依赖多驱动器与复杂控制的夹持器架构。",
    "url": "https://arxiv.org/abs/2601.06833v1",
    "html_url": "https://arxiv.org/html/2601.06833v1",
    "html_content": "SPINE Gripper: A Twisted Underactuated Mechanism-based Passive Mode-Transition Gripper\nJaeHyung Jang, JunHyeong Park, Joong-Ku Lee, and Jee-Hwan Ryu\nThis work was supported in part by the Ministry of Trade, Industry and Energy (MOTIE), Republic of Korea, under Grant No. 00416440, and in part by the National Research Foundation of Korea (NRF) funded by the Korea government (MSIT) under Grant No. RS-2025-02213804.\n(JaeHyung Jang and JunHyeong Park contributed equally to this work.) (Corresponding\nauthor: Jee-Hwan Ryu.)\nJaeHyung Jang, Joon-ku Lee, and Jee-Hwan Ryu are with the Department of Civil and Environmental Engineering, Korea Advanced Institute of Science and Technology, Daejeon 34141, South Korea. (e-mail: jhjang.kd@kaist.ac.kr; iamjoong9@kaist.ac.kr; jhryu@kaist.ac.kr).JunHyeong Park is with the Robotics Program, Korea Advanced Institute of Science and Technology, Daejeon 34141, South Korea (e-mail: jamesjun2000@kaist.ac.kr).\nAbstract\nThis paper presents a single-actuator passive gripper that achieves both stable grasping and continuous bidirectional in-hand rotation through mechanically encoded power transmission logic. Unlike conventional multifunctional grippers requiring multiple actuators, sensors, or control-based switching, the proposed gripper transitions between grasping and rotation solely according to applied input torque magnitude. The key enabler of this behavior is a Twisted Underactuated Mechanism (TUM), which generates non-coplanar motions, axial contraction and rotation, from a single rotational input while producing identical contraction regardless of rotation direction. A friction generator mechanically defines torque thresholds that govern passive mode switching, enabling stable grasp establishment before autonomously transitioning to in-hand rotation without sensing or active control. Analytical models describing the kinematics, elastic force generation, and torque transmission of the TUM are derived and experimentally validated. The fabricated gripper evaluated through quantitative experiments on grasp success, friction-based grasp force regulation, and bidirectional rotation performance. System-level demonstrations, including bolt manipulation, object reorientation, and manipulator-integrated tasks driven solely by wrist torque, confirm reliable grasp–rotate transitions in both rotational directions. These results demonstrate that non-coplanar multifunctional manipulation is realized through mechanical design alone, establishing mechanically encoded power transmission logic as a robust alternative to actuator- and control-intensive gripper architectures.\nI\nIntroduction\nRobotic grippers are fundamental elements of robotic manipulation systems, allowing robots to physically interact with objects of varying shapes, sizes, and materials. Consequently, grippers play a critical role across a wide range of applications, including industrial automation, warehouse logistics, service robotics, and agricultural harvesting\n[\n3\n,\n5\n,\n7\n,\n1\n]\n. In many of these applications, grippers are required to perform more than simple opening and closing motions. Practical manipulation tasks often demand stable handling of objects with diverse properties, adjustment of object orientation according to task requirements, and fine, contact-rich manipulation after grasping. Such requirements call for advanced capabilities such as adaptive grasping and in-hand manipulation, while maintaining high reliability in complex and unstructured environments.\nConventional approaches to realizing these multifunctional behaviors typically rely on multiple actuators, distributed sensors, and sophisticated control architectures. While effective, these solutions inevitably increase system volume, weight, and power consumption, and introduce additional mechanical and electrical failure modes, reducing overall robustness and reliability\n[\n10\n,\n18\n,\n8\n]\n. As a result, there is a growing demand for gripper design strategies that can achieve multiple manipulation functions while preserving structural simplicity and minimizing actuation and control complexity.\nFigure 1:\nSingle actuator-based PassIve Non-coplanar degree of freedom modE transition (SPINE) gripper: Passive mode-transition gripper with mechanically encoded power transmission logic for grasp and in-hand rotation in fruit harvesting, exploiting the manipulator wrist’s rotational motion without dedicated actuators or control electronics.\nTo meet this demand for mechanical simplicity and high reliability, several studies have proposed underactuated mechanisms based multi-functional grippers. Ko et al. presented a tendon-driven robot gripper that passively switches crawler surfaces with a single actuator to grasp thin objects\n[\n11\n]\n. Yoon et al. developed underactuated fingers that accommodate various object shapes by combining variable-length links with tendon structures\n[\n19\n]\n. Additionally, Hussein et al. proposed an underactuated gripper that mechanically implements desired equivalent stiffness and contact distribution through compliant joint properties and modular architecture\n[\n9\n]\n. Baril et al. introduced prosthetic grippers that passively select operation modes or regulate force distribution using mechanical levers and selectors\n[\n2\n]\n. Meanwhile, Seino et al. proposed a fully passive gripper (PALGRIP) containing no active actuators, demonstrating that grasping and releasing occur solely through structural constraints and contact surface friction\n[\n17\n]\n. Furthermore, research on adaptive underactuated grippers has been reported, embedding object shape adaptability within the structure itself using variable-length links and elastic elements\n[\n4\n,\n12\n]\n.\nFigure 2:\nFunctional components and mechanically encoded power transmission behavior of the SPINE gripper during door handle manipulation. (a) The SPINE gripper exhibits friction-governed transition between grasping and in-hand rotation, with mode switching determined by torque thresholds. (b) Structural elements include the twisted underactuated mechanism (TUM), gripper, friction generator, and frame. (c) Approaching phase: the gripper moves toward the door handle without generating grasping force. (d) Force buildup phase: contact induces grasping force as input torque increases. (e) Rotating phase: input torque exceeding maximum static friction initiates rotation while maintaining stable grasp; grasping force remains proportional to kinetic friction torque as the system transitions to continuous rotation.\nWhile above-mentioned studies demonstrated that underactuated and passive mechanisms effectively improve adaptability and reduce actuation and control complexity, their use has largely been confined to enhancing grasp conformity, force distribution, or contact stability. In most cases, underactuation is exploited to passively adapt finger motion to object geometry, rather than to enable multiple, functionally distinct manipulation modes within a single mechanism. As a result, extending such approaches to support fundamentally different manipulation functions, particularly the combination of stable grasping and continuous in-hand rotation in practical manipulation tasks\n[\n6\n,\n15\n,\n16\n]\n, remains a significant challenge.\nDespite their importance, achieving both functions with a single actuator is fundamentally difficult because grasping and in-hand rotation involve motion along non-coplanar directions. Nishimura et al. demonstrated that grasping and in-hand rotation can be passively coordinated using a single actuator by exploiting force-magnitude–based mode switching\n[\n13\n]\n. However, their mechanism inherently supports rotation in only one direction due to sign-coupled force transmission, which restricts its applicability in tasks requiring directional reversals.\nTo overcome these limitations, we present a Single-actuator PassIve Non-coplanar degree-of-freedom modE-transition (SPINE) gripper that enables stable grasping and continuous bidirectional in-hand rotation through a mechanically encoded power transmission logic, direction-invariant contraction mechanism (Fig.\n1\n). Unlike conventional active-type multi-functional mechanisms, the proposed gripper achieves this functionality through a mechanically encoded power transmission logic rather than through sensing or active control. At the core of the system is a Twisted Underactuated Mechanism (TUM) that generates two non-coplanar motions, axial contraction and rotation, from a single rotational input, and produces identical contraction regardless of the input rotation direction. This property enables a passive mode-switching mechanism in which the transition between grasping and in-hand rotation is governed solely by the magnitude of the input torque. Through analytical modeling, mechanical characterization, and prototype demonstrations, we show that the proposed gripper achieves reliable multifunctional manipulation with a minimal hardware configuration. Furthermore, when mounted on a robotic manipulator and driven exclusively by wrist torque, the system functions as an actuator-free end effector capable of stable grasping and continuous bidirectional rotation, while maintaining structural simplicity and robustness.\nThe structure of this paper is organized as follows. Section\nII\nintroduces the overall system architecture, operating principles, and passive transition scenarios between grasping mode and in-hand rotation mode. Section\nIII\npresents the theoretical principles of the TUM and the kinematic model of the compliant strip structure. Section\nIV\nprovides experimental validation of the theoretical predictions. Section\nV\ndescribes in detail the design and fabrication process of the SPINE gripper prototype. Section\nVI\nvalidates the quantitative feasibility of the proposed functionalities through experiments including grasp success conditions, friction-grasping force relationships, and rotation performance evaluation. Section\nVII\ndemonstrates various task scenarios utilizing a system integrated with a robotic manipulator, confirming performance and versatility in real-world environments. Section\nVIII\nsummarizes the research findings and suggests future research directions.\nII\nConcept of the SPINE gripper\nThis section presents the core concept of the SPINE gripper, which achieves both grasping and in-hand rotation through mechanically encoded power transmission logic driven by a single actuator. Instead of employing additional actuators, sensors, or control algorithms, the gripper alters its power transmission pathway according to applied input torque (Fig.\n2\n(a)), with predefined torque thresholds and mechanical constraints determining whether input motion routes toward grasping or in-hand rotation.\nAs a result, this approach enables multifunctional manipulation through structural design alone. Unlike conventional grippers that employ multiple actuators, sensors, or control algorithms for multifunctional manipulation, the SPINE gripper generates non-coplanar degrees of freedom through passive component interactions. By embedding decision logic directly into the mechanical architecture, this approach achieves stable grasping and continuous in-hand rotation with minimal hardware, demonstrating that structural design alone can support reliable multi-functional operation.\nFigure 3:\nBidirectional behavior, stroke geometry, and deformation characteristics of the twisted underactuated mechanism (TUM).\n(a) A conventional gear differential exhibits no singularity, maintaining a fixed input-output displacement relationship.\n(b) The TUM contains a singularity enabling unidirectional contraction under bidirectional input rotation.\n(c) Strip spacing variation under twisting modeled using two-dimensional geometry.\n(d) Geometric and deformation characteristics relating rotation\nθ\n\\theta\n, contraction\nX\nX\n, and force projection along the\ns\ns\naxis, with bending-dominated deformation governing elastic force\nF\ns\nF_{s}\n.\nII-A\nFunctional Components of the SPINE Gripper\nPassive mode switching in the SPINE gripper arises from mechanically encoded power transmission logic rather than active control. This mechanism comprises four primary components: a twisted underactuated mechanism (TUM), gripper, friction generator, and frame (Fig.\n2\n(b)). These components form an interdependent mechanical network where torque is transmitted, redirected, or released based on structural interactions, implementing the system’s switching logic.\nThe TUM is the core element responsible for generating non-coplanar motion. Based on a screw-like mechanism, it converts rotational input into linear contraction. By removing the rotational constraint on the contracting element, it simultaneously enables contraction and rotation, forming a 2-DOF underactuated mechanism. This dual motion capability allows the same input torque to drive either grasping or in-hand rotation depending on downstream constraints. Detailed analysis is provided in Section\nIII-A\n.\nThe gripper employs a modified slider-crank mechanism that transforms TUM contraction into finger closing motion. Its rigid-body structure transmits force efficiently while allowing free rotation once the system transitions to rotation mode.\nThe friction generator defines the torque threshold for mode switching by frictionally coupling the gripper to the frame. Below the static friction limit, torque drives TUM contraction and grasping. When torque exceeds this limit, friction slips, disengaging the coupling and redirecting torque to rotate the gripper. Mode switching is therefore governed passively by torque magnitude alone.\nThe frame anchors the system and enforces mode-specific mechanical constraints. During grasping, it prevents gripper rotation while allowing TUM contraction. During in-hand rotation, it constrains all motions except gripper rotation, ensuring stable bidirectional rotation without active control.\nII-B\nOperational phases of the SPINE Gripper\nBecause the SPINE gripper relies entirely on mechanically encoded power transmission logic, its behavior is explained through operational phases that describe the redistribution of input torque through the structure. These phases clarify the passive switching logic and the roles of elastic deformation, frictional thresholds, and mechanical constraints.\nThe SPINE gripper operates through three sequential phases: approaching, force buildup, and rotating. Each phase corresponds to a distinct mechanical state defined by interactions among the TUM, gripper, and friction generator (Fig.\n2\n).\nIn the approaching phase (Fig.\n2\n(c)), input torque causes the TUM to contract through elastic twisting, actuating the slider-crank mechanism and closing the gripper toward the object. During this motion, elastic deformation gradually increases the input torque, enabling a smooth approach without abrupt force application.\nThe force buildup phase begins upon fingertip contact (Fig.\n2\n(d)). Increased frictional resistance causes input torque to rise rapidly, generating a stable grasp. Torque continues increasing until reaching the static friction threshold set by the friction generator, passively limiting grasping force without sensors or feedback control.\nIn the rotating phase (Fig.\n2\n(e)), applied torque exceeds the friction threshold, transitioning the coupling between the gripper and frame from static to kinetic friction. Torque is then redirected to rotate the gripper while maintaining the established grasp force, with kinetic friction characteristics ensuring consistent rotation despite external torque fluctuations.\nThese phases demonstrate that the SPINE gripper achieves reliable transitions between grasping and in-hand rotation through purely mechanical interactions, validating mechanically encoded power transmission logic as a robust alternative to control-dependent multifunctional grippers.\nIII\nDesign of the Twisted Underactuated Mechanism\nGenerating two-degree-of-freedom (DOF) non-coplanar motions from a single rotational input poses a fundamental challenge in underactuated mechanism design. Conventional power transmission elements such as differential gears and ball screws can theoretically achieve such configurations, but their structural characteristics, optimized for continuous power transmission, inherently produce odd-function input-output relationships that limit passive mode-switching to unidirectional operation. To overcome this constraint, we introduce the twisted underactuated mechanism (TUM), which simultaneously generates axial and rotational outputs from a single rotary input. Although demonstrated here through the SPINE gripper, the TUM serves as a mechanism-level enabler that allows the proposed gripper to achieve non-coplanar motion under a single passive transmission pathway. This section presents the theoretical foundation of the TUM, deriving analytical models for its kinematic and force transmission properties and providing design guidelines for broader implementation in underactuated mechanisms.\nIII-A\nBidirectional capability of Twisted Underactuated Mechanism\nBidirectional in-hand rotation is fundamental for manipulation tasks such as tightening, loosening, and object reorientation. Conventional passive grippers based on differential mechanisms exhibit symmetric input–output rotation (Fig.\n3\n(a)): clockwise input produces clockwise output, and vice versa. This odd-function behavior transmits rotation only through aligned motion, resulting in effectively unidirectional manipulation once grasping occurs.\nThe TUM overcomes this limitation through a twisted compliant architecture. The mechanism consists of a bottom plate fixed to the input shaft, a top plate supported by a linear bushing allowing rotation and translation, and compliant strips connecting the two plates. Rotation of the bottom plate twists the strips, inducing linear contraction of the top plate. Crucially, this contraction occurs identically under both clockwise and counterclockwise rotation. As shown in Fig.\n3\n(b), the resulting input–output displacement is an even function with singularities, indicating directionally symmetric contraction.\nThis behavior enables identical grasping under opposite torque directions while permitting free bidirectional in-hand rotation after grasping. Unlike gear-based passive mechanisms fundamentally constrained to directional coupling, the TUM decouples contraction from rotation direction, substantially expanding the manipulation repertoire of passive grippers and establishes twisted compliant structures as a powerful alternative to conventional power transmission based underactuated mechanisms.\nIII-B\nStroke design of the Twisted Underactuated Mechanism\nThe compliant strips provide the kinematic linkage that enables contraction through twisting deformation. Their geometric design therefore directly determines the operational stroke of the TUM, and these stroke constraints directly determine the achievable grasping range of the SPINE gripper.\nFor structural balance, the strips are arranged symmetrically and uniformly around the mounting plate. During twisting, the distance between adjacent strips decreases and eventually leads to interference, which defines the maximum operational range. As shown in Fig.\n3\n(c), the angular inclination\nα\n\\alpha\nof each strip relative to the plate is given by\nα\n=\narcsin\n⁡\nw\n2\n+\nw\n3\n+\nd\ns\nL\n\\displaystyle\\alpha=\\arcsin{\\frac{w_{2}+w_{3}+d_{s}}{L}}\n(1)\nwhere\nw\n2\nw_{2}\nand\nw\n3\nw_{3}\ndenote the thicknesses of the top and bottom plates, respectively,\nd\ns\nd_{s}\nis the inter-plate distance, and\nL\nL\nis the strip length.\nWith\nN\nN\nstrips placed on a plate of radius\nR\nR\n, the distance between adjacent strip joints is\nd\nw\n=\n2\n​\nπ\n​\nR\nN\n​\nsin\n⁡\nα\n=\n2\n​\nπ\n​\nR\n​\n(\nw\n2\n+\nw\n3\n+\nd\ns\n)\nN\n​\nL\n.\n\\displaystyle d_{w}=\\frac{2\\pi R}{N}\\sin{\\alpha}=\\frac{2\\pi R(w_{2}+w_{3}+d_{s})}{NL}.\n(2)\nThis relation indicates that increasing the number of strips reduces the allowable stroke. In practice, adjacent strips contact each other through curved surfaces rather than parallel centerlines, which introduces instability in torque transmission. To avoid this, the TUM is designed such that strip interference does not occur even when the top and bottom plates fully contact (\nd\ns\n=\n0\nd_{s}=0\n). The resulting design constraint is\n2\n​\nπ\n​\nR\n​\n(\nw\n2\n+\nw\n3\n+\nd\ns\n)\nN\n​\nL\n=\n2\n​\nπ\n​\nR\n​\n(\nw\n2\n+\nw\n3\n)\nN\n​\nL\n≥\nw\n1\n\\displaystyle\\frac{2\\pi R(w_{2}+w_{3}+d_{s})}{NL}=\\frac{2\\pi R(w_{2}+w_{3})}{NL}\\geq w_{1}\n(3)\nwhere\nw\n1\nw_{1}\nis the strip width. By rearranging the remaining terms, we derive the design condition for the TUM radius as a function of the compliant strip specifications defined as follows:\nR\n≥\nw\n1\n​\nN\n​\nL\n2\n​\nπ\n​\n(\nw\n2\n+\nw\n3\n)\n.\n\\displaystyle R\\geq\\frac{w_{1}NL}{2\\pi(w_{2}+w_{3})}.\n(4)\nIII-C\nElastic Stiffness design of the Twisted Underactuated Mechanism\nFigure 4:\nSchematic representation for kinematic modeling of the TUM.\nThe compliant strips are fabricated from elastic materials with high slenderness to generate restorative forces under twisting. These elastic forces determine both the contraction force of the TUM and the minimum friction threshold required for stable grasping before mode transition in the SPINE gripper.\nAs shown in Fig.\n3\n(d), twisting deformation induces both bending and warping; however, bending dominates the elastic response. Accordingly, the elastic energy is modeled solely based on bending. The axial elastic force of the TUM,\nF\ns\nF_{s}\n, is obtained by projecting the strip’s bending-induced elastic force\nP\nP\nonto the axial direction:\nF\ns\n=\nP\n​\ncos\n⁡\nβ\n\\displaystyle F_{s}=P\\cos{\\beta}\n(5)\nwhere\nβ\n\\beta\nis the angle between the strip and the axial direction.\nThe bending behavior of a compliant strip is governed by\nE\n​\nI\n​\nd\n2\n​\ny\nd\n​\ns\n2\n+\nP\n​\ny\n​\n(\ns\n)\n=\n0\n\\displaystyle EI\\frac{d^{2}y}{ds^{2}}+Py(s)=0\n(6)\nwhere\nE\nE\nis Young’s modulus,\nI\nI\nis the second moment of area, and\ny\n​\n(\ns\n)\ny(s)\nis the transverse deflection. Solving this equation yields\ny\n​\n(\ns\n)\n=\nA\n​\nsin\n⁡\n(\nP\nE\n​\nI\n⋅\ns\n)\n=\nA\n​\nsin\n⁡\n(\nπ\nL\n−\nΔ\n​\nS\n⋅\ns\n)\n,\n\\displaystyle y(s)=A\\sin({\\sqrt{\\frac{P}{EI}}\\cdot s})=A\\sin({\\frac{\\pi}{L-\\Delta S}\\cdot s}),\n(7)\nwhere\nA\nA\nis the maximum height of the strip. Through this, the height of the link is expressed in the form of a trigonometric function, and it is represented at Fig.\n3\n(d) and (\n7\n) that the distance between the endpoints of the strip corresponds to half a period. This relationship is expressed in the following equation and summarized for\nP\nP\n:\nP\nE\n​\nI\n=\nπ\nL\n−\nΔ\n​\nS\n\\displaystyle\\sqrt{\\frac{P}{EI}}=\\frac{\\pi}{L-\\Delta S}\n(8)\nP\n=\n(\nπ\nL\n−\nΔ\n​\nS\n)\n2\n⋅\nE\n​\nI\n.\n\\displaystyle P=(\\frac{\\pi}{L-\\Delta S})^{2}\\cdot EI.\n(9)\nFrom the triangle geometry in Fig.\n3\n(d), the relationship between contraction, rotation, and orientation angle is given by\n(\nL\n−\nΔ\n​\nS\n)\n2\n\\displaystyle(L-\\Delta S)^{2}\n=\nL\n2\n−\n(\nR\n​\nθ\n)\n2\n+\n4\n​\nR\n2\n​\nsin\n2\n⁡\n(\nθ\n2\n)\n\\displaystyle=L^{2}-(R\\theta)^{2}+4R^{2}\\sin^{2}\\left(\\frac{\\theta}{2}\\right)\n(10)\nβ\n\\displaystyle\\beta\n=\narctan\n⁡\n2\n​\nR\n​\nsin\n⁡\n(\n0.5\n​\nθ\n)\nL\n−\nX\n.\n\\displaystyle=\\arctan{\\frac{2R\\sin(0.5\\theta)}{L-X}}.\n(11)\nCombining these relations yields the axial elastic force of a single strip as a function of\nθ\n\\theta\n:\nF\ns\n=\nE\n​\nI\n​\nπ\n2\nL\n2\n−\n(\nR\n​\nθ\n)\n2\n+\n4\n​\nR\n2\n​\nsin\n2\n⁡\n(\nθ\n2\n)\n⋅\nR\n2\n​\nsin\n⁡\n(\nθ\n)\n2\n​\nR\n2\n−\n2\n​\nR\n2\n​\ncos\n⁡\n(\nθ\n)\n+\nL\n2\n−\n(\nR\n​\nθ\n)\n2\n.\n\\displaystyle\\begin{split}F_{s}=\\frac{EI\\pi^{2}}{L^{2}-(R\\theta)^{2}+4R^{2}\\sin^{2}\\left(\\frac{\\theta}{2}\\right)}\\\\\n\\cdot\\frac{R^{2}\\sin(\\theta)}{\\sqrt{2R^{2}}-2R^{2}\\cos(\\theta)+L^{2}-(R\\theta)^{2}}.\\end{split}\n(12)\nThis expression quantitatively captures the dependence of elastic force on material properties, geometry, and rotation.\nFigure 5:\nExperimental setup to evaluate kinematics, elastic force and Jacobian-based motion anlaysis of the TUM.\nIII-D\nKinematic Modeling of the Twisted Underactuated Mechanism\nFor kinematic analysis, the TUM is idealized by modeling the plates as zero-thickness disks and the compliant strips as zero-thickness curves. Under this assumption, the mechanism becomes kinematically equivalent to a twisted string actuator (TSA)\n[\n14\n]\n, as illustrated in Fig.\n4\n.\nThe axial contraction\nX\nX\nas a function of rotation angle\nθ\n\\theta\nis given by\nX\n=\nL\n−\nL\n2\n−\n(\nR\n​\nθ\n)\n2\n.\n\\displaystyle X=L-\\sqrt{L^{2}-(R\\theta)^{2}}.\n(13)\nDifferentiation yields the velocity relationship\nX\n˙\n=\nR\n2\n​\nθ\nL\n2\n−\n(\nR\n​\nθ\n)\n2\n​\nθ\n˙\n\\displaystyle\\dot{X}=\\frac{R^{2}\\theta}{\\sqrt{L^{2}-(R\\theta)^{2}}}\\dot{\\theta}\n(14)\nand the Jacobian of the TUM,\nJ\nT\n​\nU\n​\nM\n=\nX\n˙\nθ\n˙\n=\nR\n2\n​\nθ\nL\n2\n−\n(\nR\n​\nθ\n)\n2\n.\n\\displaystyle J_{TUM}=\\frac{\\dot{X}}{\\dot{\\theta}}=\\frac{R^{2}\\theta}{\\sqrt{L^{2}-(R\\theta)^{2}}}.\n(15)\nFinally, the contraction force\nF\nc\nF_{c}\n, elastic force\nF\ns\nF_{s}\n, and motor input torque\nτ\ni\n​\nn\n\\tau_{in}\nare related through virtual work and force equilibrium as\nF\nc\n=\nJ\nT\n​\nU\n​\nM\n−\n1\n​\nτ\ni\n​\nn\n−\nF\ns\n.\n\\displaystyle F_{c}=J_{TUM}^{-1}\\tau_{in}-F_{s}.\n(16)\nThis kinematic and elastic formulation provides a unified framework for predicting motion transmission, force generation, and torque requirements of the TUM within the SPINE gripper system.\nFigure 6:\nExperimental validation of the analytical model of the Twisted Underactuated Mechanism (TUM). (a) Motor rotation–contraction kinematics under different loads, showing close agreement with analytical predictions and reducing deviation at higher loads. (b) Restorative torque of compliant strips aligns with the model after compensating for frictional losses. (c) Experimental Jacobian values compared with theory, with higher loads improving correspondence by suppressing geometric instability.\nIV\nExperimental Evaluation of the Twisted Underactuated Mechanism\nThe analytical models of the Twisted Underactuated Mechanism (TUM) predict its rotation–contraction kinematics, strip elasticity, and Jacobian-based transmission behavior. We experimentally validate that the two-dimensional formulations from Section\nIII-C\ncapture the physical mechanism under realistic torque inputs and external loads, thereby establishing the empirical basis for subsequent SPINE gripper characterization.\nFig.\n5\nshows the test setup. A Dynamixel motor (XM590-W290-R, Robotis) drove the TUM; a torque sensor (TRS605, FUTEK) mounted on the output shaft measured input torque and rotation angle, and was coupled directly to the TUM bottom plate. The top plate was constrained to linear motion using a linear guide and connected to a linear encoder (PZ34-A-150, GEFRAN) to measure contraction. A constant downward load was applied via a suspended weight and string. All trials were conducted at 60 rpm with four repetitions per condition.\nIV-A\nEvaluation of the Twisted Underactuated Mechanism Kinematics\nWe first verify the TUM kinematics to confirm that the fabricated mechanism follows the predicted mapping from motor rotation angle to axial contraction, which directly governs the grasp-closing motion in the SPINE gripper. Rotation and contraction were measured under four loads (0 g, 100 g, 200 g, and 500 g). In Fig.\n6\n(a), the analytical displacement curve is shown by the black dashed line and experimental data by colored markers.\nAcross conditions, deviation from theory increases with rotation angle, but decreases monotonically with increasing load. Under 500 g, contraction closely matches the analytical curve over the full range. The larger errors at low loads are attributed to slight warping of compliant strips, which is suppressed under higher tensile loading that improves geometric stability. Thus, under operationally relevant loads, the TUM reproduces the intended kinematics, supporting the validity of the analytical model for predicting SPINE gripper motion.\nIV-B\nEvaluation of the Compliant Strip Elastic Force\nGiven that the mode transition and force regulation of the SPINE gripper depend on strip elasticity, we next validate the analytical prediction of restorative torque. Restorative torque was measured as a function of motor rotation under no external load, providing a direct comparison to the model-derived torque profile.\nThe compliant strips were fabricated using an FDM 3-D printer (F170, Stratasys Ltd.) with ABS (Young’s modulus 1200 MPa; second moment of area 1.71 mm\n3\n). In Fig.\n6\n(b), measured torque (gray points) follows the theoretical trend (black dashed line) but exhibits an approximately constant offset of 25 N\n⋅\n\\cdot\nmm, attributable to friction at mechanism and test interfaces. After compensating for this loss, the corrected torque (purple) aligns closely with the analytical prediction, reaching approximately 175 N\n⋅\n\\cdot\nmm at 105\n∘\n. This agreement confirms that the fabricated strips provide the intended elastic response assumed in the SPINE gripper design.\nIV-C\nEvaluation of the Twisted Underactuated Mechanism Jacobian\nFinally, we validate the Jacobian model, which characterizes the transmission relationship between input torque\nτ\ni\n​\nn\n\\tau_{in}\nand output force and thus determines achievable grasping force and manipulation performance. We measured motor rotation angle and input torque under constant loads of 100 g, 200 g, and 500 g, and computed experimental Jacobian values for comparison with theory (Fig.\n6\n(c)).\nUsing the force-equilibrium form of (\n16\n),\nF\ns\nF_{s}\ncan be expressed via the elastic torque\nτ\ns\n\\tau_{s}\nand the inverse Jacobian. Rearranging yields\nJ\nT\n​\nU\n​\nM\n=\nτ\ni\n​\nn\n−\nτ\ns\nF\ns\n\\displaystyle J_{TUM}=\\frac{\\tau_{in}-\\tau_{s}}{F_{s}}\n(17)\nwhere\nτ\ni\n​\nn\n\\tau_{in}\nand\nτ\ns\n\\tau_{s}\nare obtained from measured torque and the calibrated elastic response, and\nF\ns\nF_{s}\nis set by the applied load. The experimental Jacobian follows the analytical curve (black dashed line), with discrepancy increasing at larger rotation angles but decreasing with higher load, consistent with the kinematic results. The improved correspondence at higher loads is again explained by suppression of strip warping and reduced geometric instability. Overall, these results confirm that the analytical Jacobian accurately captures the TUM transmission characteristics under realistic loading, supporting its use for predicting SPINE gripper behavior.\nV\nDesign of the SPINE Gripper\nV-A\nKinematic Modeling of the SPINE Gripper\nFigure 7:\nKinematic schematic and fabricated prototype of the SPINE gripper. (a) Schematic for kinematic modeling. (b) Fabricated prototype.\nBuilding upon the validated TUM model, this subsection derives the kinematic and force transmission relationships that map the contraction of the Twisted Underactuated Mechanism (TUM) to finger rotation and grasping torque in the SPINE gripper. These relationships directly determine the achievable grasp force under a given input torque.\nThe gripper employs a slider–crank mechanism driven by the linear contraction of the TUM, as illustrated in Fig.\n7\n(a). In the kinematic model, the TUM is represented as a slider with contraction length\nX\nX\n. The coordinate system is defined with respect to the origin\nO\nO\n, where\nθ\n1\n\\theta_{1}\ndenotes the angle between the\nz\nz\n-axis and the gripper link, and\nθ\n2\n\\theta_{2}\ndenotes the angle between the\nz\nz\n-axis and the finger link. Geometric parameters\na\na\n,\nb\nb\n, and\nc\nc\ndefine the horizontal and vertical offsets of the linkage, and\nL\nL\nis the initial TUM length.\nApplying the kinematic loop equation yields\nR\n1\n​\n(\ncos\n⁡\nθ\n1\n+\ni\n​\nsin\n⁡\nθ\n1\n)\n+\nR\n2\n​\n(\ncos\n⁡\nθ\n2\n+\ni\n​\nsin\n⁡\nθ\n2\n)\n−\na\n​\ni\n−\nb\n−\nL\n+\nX\n+\nc\n​\ni\n=\n0\n\\displaystyle\\begin{split}R_{1}(\\cos\\theta_{1}+i\\sin\\theta_{1})+R_{2}(\\cos\\theta_{2}+i\\sin\\theta_{2})\\\\\n-ai-b-L+X+ci=0\\end{split}\n(18)\nwhich can be separated into real and imaginary components:\nR\n1\n​\ncos\n⁡\nθ\n1\n+\nR\n2\n​\ncos\n⁡\nθ\n2\n−\nb\n−\nL\n+\nX\n\\displaystyle R_{1}\\cos\\theta_{1}+R_{2}\\cos\\theta_{2}-b-L+X\n=\n0\n\\displaystyle=0\n(19)\nR\n1\n​\nsin\n⁡\nθ\n1\n+\nR\n2\n​\nsin\n⁡\nθ\n2\n−\na\n+\nc\n\\displaystyle R_{1}\\sin\\theta_{1}+R_{2}\\sin\\theta_{2}-a+c\n=\n0\n.\n\\displaystyle=0.\n(20)\nSolving (\n19\n)–(\n20\n) yields\nθ\n1\n​\n(\nX\n)\n\\theta_{1}(X)\nand\nθ\n2\n​\n(\nX\n)\n\\theta_{2}(X)\n, establishing the mapping between TUM contraction and finger rotation.\nThe finger Jacobian\nJ\ng\nJ_{g}\n, relating contraction velocity to finger angular velocity, is defined as\nJ\ng\n=\nd\n​\nθ\n2\n​\n(\nX\n)\nd\n​\nX\n=\nθ\n˙\n2\n​\n(\nX\n)\n=\nθ\n˙\n2\n​\n(\nθ\n)\n.\n\\displaystyle J_{g}=\\frac{d\\theta_{2}(X)}{dX}=\\dot{\\theta}_{2}(X)=\\dot{\\theta}_{2}(\\theta).\n(21)\nCombining this Jacobian with the TUM force balance from (\n16\n), the torque applied at the finger link is expressed as\nτ\ng\n=\nJ\ng\n⋅\nF\nc\n=\nJ\ng\n⋅\n(\nJ\nT\n​\nU\n​\nM\n−\n1\n​\nτ\ni\n​\nn\n​\np\n​\nu\n​\nt\n−\nF\ns\n)\n\\displaystyle\\tau_{g}=J_{g}\\cdot F_{c}=J_{g}\\cdot\\left(J_{TUM}^{-1}\\tau_{input}-F_{s}\\right)\n(22)\nwhich directly links motor input torque to grasping torque at the fingertip. This formulation provides a quantitative basis for predicting grasp force and for tuning the gripper geometry and friction threshold.\nV-B\nPrototype Fabrication of the SPINE Gripper\nFigure 8:\nExperimental validation of grasp success and friction-based grasping force regulation in the SPINE gripper. (a) Experimental setup for grasp success evaluation. (b) Time–torque profiles under high and low friction, showing approaching, force buildup, and rotation phases. (c) Tracked fingertip trajectories indicating successful grasp (high friction) and incomplete grasp (low friction). (d) Experimental setup for grasping force regulation via friction generator compression. (e) Input torque profiles for three friction conditions set by spacer thickness. (f) Corresponding pushing force profiles demonstrating mechanically tunable and stable grasping force.\nTABLE I:\nSpecifications of SPINE gripper\nTwisted underactuated mechanism (TUM)\nR (Radius)\n20 mm\nL (Strip length)\n40 mm\nMaximum contraction length\n40 mm\nMaximum rotation angle\n105\n∘\n105^{\\circ}\nMaterial\nAcrylonitrile Butadiene Styrene (ABS)\nGripper\na\n30 mm\nb\n10 mm\nc\n25 mm\nR\n1\nR_{1}\n(Gripper link)\n40 mm\nR\n2\nR_{2}\n(Finger link)\n25 mm\nMotion range of finger link\n0\n∘\n0^{\\circ}\nto\n120\n∘\n120^{\\circ}\nMaterial\nAcrylonitrile Butadiene Styrene (ABS)\nFriction generator (O-ring)\nOuter diameter\n35 mm\ninner diameter\n24.7 mm\nThickness\n10.8 mm\nmaterial\nNitrile rubber (NBR)\nBased on the derived kinematic and force models, a functional prototype of the SPINE gripper was fabricated to validate the design. The gripper consists of four main components: the TUM, the gripper linkage, a fixed frame, and a friction generator. The system was designed to grasp objects of varying shapes with characteristic dimensions up to 10 cm.\nTo satisfy the non-interference condition in (\n3\n) while ensuring sufficient contraction, the TUM was designed with a strip length of 40 mm and a plate radius of 20 mm. The resulting kinematics allow a finger rotation range of approximately\n0\n∘\n0^{\\circ}\n∼\n\\sim\n120\n∘\n120^{\\circ}\n, suitable for diverse object sizes. The gripper link lengths were set to\nR\n1\n=\n40\nR_{1}=40\nmm and\nR\n2\n=\n16.25\nR_{2}=16.25\nmm, and the linkage offsets were chosen as\na\n=\n30\na=30\nmm,\nb\n=\n10\nb=10\nmm, and\nc\n=\n25\nc=25\nmm to accommodate mechanical constraints. All design parameters are summarized in Table I.\nAll structural components were manufactured using an FDM-type 3-D printer (F170, Stratasys Ltd.) with ABS material. The friction generator, which determines the maximum grasping force, was implemented using a nitrile rubber (NBR) O-ring with an outer diameter of 35 mm, an inner diameter of 24.7 mm, and a thickness of 10.8 mm. The O-ring is inserted between the gripper and frame, creating a frictional interface whose compression distance directly sets the grasping force limit. This simple mechanical element enables tunable and repeatable force regulation without sensors or active control, as validated experimentally in Fig.\n7\n(b).\nVI\nExperimental Evaluation of the SPINE Gripper prototype\nVI-A\nGrasp Success Condition and Results\nThis experiment evaluates whether the SPINE gripper can reliably achieve a full grasp prior to in-hand rotation, focusing on the interaction between the elastic force generated by the TUM and the frictional resistance provided by the friction generator. Successful grasping requires that the maximum static friction exceed the restorative elastic torque of the TUM; otherwise, slip occurs before sufficient contraction is transmitted to the gripper.\nFig.\n8\n(a) illustrates the experimental setup. A Dynamixel motor (XM590-W290-R, Robotis) applied input torque, which was measured in real time using a torque sensor (TRS605, FUTEK). Grasp success was defined as the gripper reaching a fully closed configuration. Fingertip displacement was tracked using a color marker and a top-view camera operating at 60 FPS, with trajectories extracted via OpenCV-based marker tracking.\nThe TUM required approximately 115 N\n⋅\n\\cdot\nmm of input torque to overcome its internal elastic force in the absence of external load. Two friction conditions were tested: a high-friction condition, in which the maximum static friction exceeded the elastic threshold, and a low-friction condition, in which it did not.\nMeasured torque profiles are shown in Fig.\n8\n(b). Under the high-friction condition (red), the input torque exhibited three distinct phases: (i) an approaching phase with gradual torque increase and contraction onset, (ii) a force-buildup phase following fingertip contact, reaching a static friction peak of approximately 440 N\n⋅\n\\cdot\nmm, and (iii) a rotating phase after slip, with torque stabilizing near the kinetic friction level of approximately 340 N\n⋅\n\\cdot\nmm. In contrast, under the low-friction condition (blue), the static friction limit (approximately 100 N\n⋅\n\\cdot\nmm) was lower than the elastic threshold. As a result, the gripper transitioned directly to rotation during the approaching phase, stabilizing near 90 N\n⋅\n\\cdot\nmm without achieving full closure.\nFingertip trajectories in Fig.\n8\n(c) further confirm this behavior. Under high friction, the fingertip moved from an initial position of 320 mm to approximately 50 mm along the X-axis, indicating full closure before rotation, with minimal lateral displacement due to the small rotation radius. Under low friction, rotation initiated prematurely at approximately 300 mm, resulting in a larger rotation radius and significantly increased X–Y displacement. These results demonstrate that a sufficient friction threshold is essential for achieving stable grasping prior to rotation.\nFigure 9:\nDemonstration of the SPINE gripper’s bidirectional capability. The gripper performs grasping and in-hand rotation in both CCW and CW directions through mechanically encoded power transmission logic, without sensors or additional actuators. Alternately loosening and tightening a bolt demonstrates stable grasp–release transitions and continuous rotation, confirming bidirectional manipulation enabled solely by structural design.\nVI-B\nFriction and Grasping Force Evaluation\nBuilding on the grasp success analysis, this subsection evaluates how friction generator compression regulates grasping force and its stability during rotation. Spacer thicknesses of 0.45 mm, 0.6 mm, and 0.7 mm were used to systematically vary the friction level.\nThe experimental setup is shown in Fig.\n8\n(d). Input torque and rotation angle were measured using a torque sensor (TRS605, FUTEK). A force/torque sensor (ATI Mini45) was mounted coaxially with the gripper via an extended shaft and a single-DOF sub-link. During grasping, a plate attached to the sub-link translated along the shaft and pushed against the sensor. Due to the slider–crank kinematics, the measured pushing force has a one-to-one relationship with the fingertip grasping force.\nTime histories of input torque and grasping force are shown in Fig.\n8\n(e) and (f), with raw data filtered using a moving average window of 10 samples. Under the high-friction condition (0.45 mm spacer), the maximum static and kinetic friction torques were approximately 700 N\n⋅\n\\cdot\nmm and 560 N\n⋅\n\\cdot\nmm, respectively, corresponding to pushing forces of 5.3 N (static) and 4.6 N (rotation). With a 0.6 mm spacer, static and kinetic friction torques decreased to approximately 568 N\n⋅\n\\cdot\nmm and 462 N\n⋅\n\\cdot\nmm, yielding pushing forces of 4.0 N and 3.5 N. Under the low-friction condition (0.7 mm spacer), the friction torques dropped to approximately 210 N\n⋅\n\\cdot\nmm (static) and 170 N\n⋅\n\\cdot\nmm (kinetic), with corresponding pushing forces of 1.17 N and 1.05 N.\nThese results demonstrate that the SPINE gripper’s maximum grasping force can be mechanically tuned through friction generator compression, without sensors or active force control. Across all conditions, once the friction threshold was reached, both torque and grasping force remained stable during continuous in-hand rotation. This confirms that the gripper maintains reliable and predictable grasping performance while passively transitioning between grasping and rotation.\nVII\nDemonstration\nFigure 10:\nSystem-level evaluation of the SPINE gripper integrated with a robotic manipulator, driven solely by wrist torque. (a) Comparison between a conventional gripper with electrical wiring constraints (twisting, interference, rotation limits) and the SPINE gripper operating without motors, sensors, or wiring. (b) Pick-and-place demonstrations with rigid and deformable objects using only wrist torque. (c) Pose adjustment through wrist rotation to acquire grasp when initial object orientation is unfavorable. (d) Object reorientation via in-hand rotation for alignment during insertion into a narrow opening. (e) Kitchen demonstration: turning a stove knob and (f) rotating a skewer over a grill, confirming real-world manipulation without motors or sensing hardware.\nVII-A\nBidirectional capability of the SPINE Gripper\nBidirectional in-hand rotation is essential for manipulation tasks that require both stable grasping and controlled object rotation. While many underactuated grippers conform to object geometry, few can achieve continuous rotation in both directions without additional actuators or control complexity. Demonstrating this capability is therefore critical to validating the core premise of the SPINE gripper: that grasping and rotation are passively coordinated through mechanically encoded logic.\nTo evaluate this function, a bolt loosening–tightening task was performed, which explicitly exposes the transition between grasping and rotation (Fig.\n9\n). Starting from an open state, a counterclockwise (CCW) input causes the gripper to grasp the nut; once the transmitted torque exceeds the static friction threshold, the mechanism passively transitions to rotation and loosens the bolt (red dashed box). Reversing the input direction releases the nut and resets the mechanism. Continued clockwise (CW) rotation then induces a second grasp followed by tightening of the bolt (blue dashed box).\nAll transitions between grasping, release, and rotation occurred solely through the mechanical thresholds embedded in the structure, without sensing, closed-loop control, or additional actuation. The ability to repeatedly perform loosening and tightening with a single actuator confirms that the bidirectional behavior arises from the mechanism itself rather than from external control strategies. This result demonstrates a level of functionality that is difficult to achieve with conventional underactuated grippers and validates the effectiveness of mechanically encoded power transmission logic.\nVII-B\nImplementation the SPINE Gripper on a Robotic Manipulator\nWhile isolated mechanism tests confirm functional principles, practical deployment requires evaluation at the system level. In particular, integration with a robotic manipulator must address installation complexity, interaction with joint motion, and wiring-related constraints. This subsection therefore evaluates the SPINE gripper when mounted on a conventional manipulator and driven exclusively by wrist torque.\nAs shown in Fig.\n10\n(a), conventional grippers typically rely on motors and sensors integrated within the gripper, which require electrical wiring to be routed through multiple manipulator joints. Such wiring is prone to fatigue, interference, and twisting during wrist rotation, which limits continuous rotation and increases maintenance demands. In contrast, the SPINE gripper contains no motors, sensors, or wiring at the end effector (Fig.\n10\n(a)). When integrated with a manipulator, the SPINE gripper utilizes the wrist’s rotational motion as the input for grasping (Fig.\n1\n). Once the grasping force reaches a certain threshold, the system transitions to enable the manipulator wrist’s original functionality (in-hand rotation). This design enables both grasping and wrist rotation without requiring any sensors or motors in the gripper, thereby eliminating common failure modes associated with cables and electronic components. This structural simplicity enables a degree of rotational freedom not readily achievable in motor-driven grippers.\nThe first system-level demonstration evaluated basic pick-and-place operations (Fig.\n10\n(b)). A rigid tape roll and a deformable plush doll were selected to represent different contact conditions. In both cases, the 6-DOF serial manipulator (xArm 6, UFactory) applied wrist torque to grasp, confirming that the SPINE gripper can adapt to varying object properties while maintaining sufficient stability for manipulation.\nThe second demonstration examined pose adjustment during manipulation, which is essential when object orientation is unfavorable. As shown in Fig.\n10\n(c), the manipulator rotated its wrist to reposition the gripper before grasping a milk carton placed at an awkward angle. In a related task (Fig.\n10\n(d)), the gripper rotated a grasped object during placement to align it with a narrow opening. These scenarios demonstrate that wrist-driven in-hand rotation enables orientation adjustment without additional actuators.\nTo assess performance in realistic tasks, kitchen demonstrations were conducted. In Fig.\n10\n(e), the gripper grasped and rotated a stove knob to ignite a burner, requiring secure grasping followed by continuous rotation. In addition, the gripper grasped a skewer and rotated it over a grill while maintaining stable contact (Fig.\n10\n(f)). Both tasks were performed using only wrist torque, illustrating that the passive mechanism can execute coordinated grasp-and-rotate actions typical of daily manipulation.\nFinally, a smart farm demonstration evaluated fruit harvesting (Fig.\n1\n). The manipulator positioned the gripper around a fruit, grasped it using wrist torque, and then rotated it to twist the fruit from the stem. The gripper maintained stable contact throughout the motion, allowing the fruit to detach naturally. This sequence, consisting of approach, grasp, rotate, and detach, was completed without sensors, motors, or power units at the tool tip.\nAcross all demonstrations, the SPINE gripper consistently performed tasks that typically require electrically actuated end effectors, despite having no active components at the tool tip. The gripper maintained stable grasping, enabled continuous in-hand rotation, and operated reliably across diverse environments. These results confirm that mechanically encoded power transmission logic alone support a wide range of manipulation tasks while eliminating common failure modes related to wiring, sensing, and actuation, highlighting the SPINE gripper’s suitability for robust real-world deployment.\nVIII\nConclusion\nThis study explored how mechanically encoded power transmission logic can be leveraged to achieve multifunctional manipulation without increasing actuation or control complexity. By embedding decision logic directly into the mechanical structure, the proposed SPINE gripper demonstrates that stable grasping and continuous bidirectional in-hand rotation are unified within a single passive actuation pathway, despite being inherently non-coplanar and traditionally conflicting manipulation functions.\nA central outcome of this work is the realization that direction-invariant force generation, achieved through the twisted underactuated mechanism, fundamentally changes the design space of passive grippers. Rather than treating mode switching as a control or sensing problem, this approach reframes it as a mechanical transmission problem, where functional transitions emerge naturally from the interaction between torque, compliance, and friction. This perspective distinguishes the proposed gripper from prior single-actuator designs that remain constrained by unidirectional operation or require explicit reset mechanisms.\nBeyond the specific gripper implementation, the results suggest a broader implication for robotic mechanism design: complex manipulation behaviors need not be orchestrated exclusively through software or additional hardware, but can instead be encoded into the physical structure itself. Such an approach offers inherent robustness, simplicity, and scalability, particularly in contact-rich or resource-constrained environments where sensing and control are costly or unreliable.\nIn this sense, the SPINE gripper serves not only as a functional end-effector, but also as an example of how mechanical design can actively participate in decision-making, opening new avenues for passive and underactuated robotic systems that prioritize reliability and functional elegance over complexity.\nReferences\n[1]\nM. Barakazi\n(2022)\nThe use of robotics in the kitchens of the future: the example of’moley robotics’\n.\nJournal of Tourism & Gastronomy Studies\n10\n(\n2\n),\npp. 895–905\n.\nCited by:\n§I\n.\n[2]\nM. Baril, T. Laliberté, C. Gosselin, and F. Routhier\n(2013)\nOn the design of a mechanically programmable underactuated anthropomorphic prosthetic gripper\n.\nJournal of Mechanical Design\n135\n(\n12\n).\nCited by:\n§I\n.\n[3]\nD. Belanche, L. V. Casaló, C. Flavián, and J. Schepers\n(2020)\nService robot implementation: a theoretical framework and research agenda\n.\nThe Service Industries Journal\n40\n(\n3-4\n),\npp. 203–225\n.\nCited by:\n§I\n.\n[4]\nI. I. Borisov, E. E. Khornutov, D. V. Ivolga, N. A. Molchanov, I. A. Maksimov, and S. A. Kolyubin\n(2022)\nReconfigurable underactuated adaptive gripper designed by morphological computation\n.\nIn\n2022 International Conference on Robotics and Automation (ICRA)\n,\npp. 1130–1136\n.\nCited by:\n§I\n.\n[5]\nP. E. Dupont, B. J. Nelson, M. Goldfarb, B. Hannaford, A. Menciassi, M. K. O’Malley, N. Simaan, P. Valdastri, and G. Yang\n(2021)\nA decade retrospective of medical robotics research from 2010 to 2020\n.\nScience robotics\n6\n(\n60\n),\npp. eabi8017\n.\nCited by:\n§I\n.\n[6]\nJ. F. Elfferich, D. Dodou, and C. Della Santina\n(2022)\nSoft robotic grippers for crop handling or harvesting: a review\n.\nIeee Access\n10\n,\npp. 75428–75443\n.\nCited by:\n§I\n.\n[7]\nJ. F. Elfferich, E. Shahabi, C. Della Santina, and D. Dodou\n(2024)\nBerryTwist: a twisting-tube soft robotic gripper for blackberry harvesting\n.\nIEEE Robotics and Automation Letters\n.\nCited by:\n§I\n.\n[8]\nC. Hegde, J. Su, J. M. R. Tan, K. He, X. Chen, and S. Magdassi\n(2023)\nSensing in soft robotics\n.\nACS nano\n17\n(\n16\n),\npp. 15277–15307\n.\nCited by:\n§I\n.\n[9]\nI. Hussain, F. Renda, Z. Iqbal, M. Malvezzi, G. Salvietti, L. Seneviratne, D. Gan, and D. Prattichizzo\n(2018)\nModeling and prototyping of an underactuated gripper exploiting joint compliance and modularity\n.\nIEEE Robotics and automation letters\n3\n(\n4\n),\npp. 2854–2861\n.\nCited by:\n§I\n.\n[10]\nH. Kim, H. Na, S. Noh, S. Chang, J. Kim, T. Kong, G. Shin, C. Lee, S. Lee, Y. Park,\net al.\n(2024)\nInherently integrated microfiber-based flexible proprioceptive sensor for feedback-controlled soft actuators\n.\nnpj Flexible Electronics\n8\n(\n1\n),\npp. 15\n.\nCited by:\n§I\n.\n[11]\nT. Ko\n(2020)\nA tendon-driven robot gripper with passively switchable underactuated surface and its physics simulation based parameter optimization\n.\nIEEE Robotics and Automation Letters\n5\n(\n4\n),\npp. 5002–5009\n.\nCited by:\n§I\n.\n[12]\nG. A. Kragten, M. Baril, C. Gosselin, and J. L. Herder\n(2011)\nStable precision grasps by underactuated grippers\n.\nIEEE Transactions on Robotics\n27\n(\n6\n),\npp. 1056–1066\n.\nCited by:\n§I\n.\n[13]\nT. Nishimura, Y. Suzuki, T. Tsuji, and T. Watanabe\n(2022)\n1-degree-of-freedom robotic gripper with infinite self-twist function\n.\nIEEE Robotics and Automation Letters\n7\n(\n3\n),\npp. 8447–8454\n.\nCited by:\n§I\n.\n[14]\nD. Popov, I. Gaponov, and J. Ryu\n(2012)\nA study on twisted string actuation systems: mathematical model and its experimental evaluation\n.\nIn\n2012 IEEE/RSJ International Conference on Intelligent Robots and Systems\n,\npp. 1245–1250\n.\nCited by:\n§\nIII-D\n.\n[15]\nD. Prattichizzo and J. C. Trinkle\n(2016)\nGrasping\n.\nIn\nSpringer handbook of robotics\n,\npp. 955–988\n.\nCited by:\n§I\n.\n[16]\nE. B. Rapacki, C. Niezrecki, and H. A. Yanco\n(2009)\nAn underactuated gripper to unlatch door knobs and handles\n.\nIn\n2009 IEEE International Conference on Technologies for Practical Robot Applications\n,\npp. 135–140\n.\nCited by:\n§I\n.\n[17]\nA. Seino, F. Tokuda, A. Kobayashi, and K. Kosuge\n(2025)\nPassive actuator-less gripper for pick-and-place of a piece of fabric\n.\nIEEE/ASME Transactions on Mechatronics\n.\nCited by:\n§I\n.\n[18]\nJ. C. Tejada, A. Toro-Ossaba, A. López-Gonzalez, E. G. Hernandez-Martinez, and D. Sanin-Villa\n(2025)\nA review of multi-robot systems and soft robotics: challenges and opportunities\n.\nSensors (Basel, Switzerland)\n25\n(\n5\n),\npp. 1353\n.\nCited by:\n§I\n.\n[19]\nS. J. Yoon, M. Choi, B. Jeong, and Y. Park\n(2022)\nElongatable gripper fingers with integrated stretchable tactile sensors for underactuated grasping and dexterous manipulation\n.\nIEEE Transactions on Robotics\n38\n(\n4\n),\npp. 2179–2193\n.\nCited by:\n§I\n.\nJaeHyung Jang\nreceived the B.S. degree from Mechanical Engineering in Yeungnam University, Gyeongsangbuk-do, South Korea in 2016,\nand M.S degree from University of Science and Technology, Daejeon, South Korea in 2018,\nand Ph.D. degrees from the Korea Advanced Institute of Science and Technology, Daejeon, South Korea, in 2025.\nHe is currently a Postdoc with the Department of Civil and Environmental Engineering, Korea Advanced Institute of Science and Technology. His research interests include Underactuated mechanism design, passive systems, actuator design, and Novel hardware mechanism design.\nJunHyeong Park\nJunHyeong Park received the B.S. degrees in Civil, Environmental and Architectural Engineering and Mechanical Engineering from Korea University, Seoul, South Korea, in 2026.\nHe is currently working toward the M.S degree in Robotics with the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, South Korea. His current research interests include actuator design and novel hardware mechanism design.\nJoong-Ku Lee\n(Student Member, IEEE) received the B.S. degree in Mechanical Engineering from Sungkyunkwan University, Suwon, South Korea, in 2020, and the M.S. degree in robotics from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, South Korea, in 2022.\nHe is currently working toward the Ph.D. degree in Civil and Environmental Engineering at KAIST. His research interests include telerobotics, haptics, and artificial intelligence.\nJee-Hwan Ryu\n(Senior Member, IEEE) received the B.S. degree from Inha University, Incheon, South Korea, in 1995, and the M.S.\nand Ph.D. degrees from the Korea Advanced Institute of Science and Technology, Daejeon, South Korea, in 1997 and 2002, respectively, all in mechanical engineering.\nHe is currently a Professor with the Department of Civil and Environmental Engineering, Korea Advanced Institute of Science and Technology. His research interests include haptics, telerobotics, teleoperation, exoskeletons, and autonomous vehicles.",
    "preview_text": "This paper presents a single-actuator passive gripper that achieves both stable grasping and continuous bidirectional in-hand rotation through mechanically encoded power transmission logic. Unlike conventional multifunctional grippers that require multiple actuators, sensors, or control-based switching, the proposed gripper transitions between grasping and rotation solely according to the magnitude of the applied input torque. The key enabler of this behavior is a Twisted Underactuated Mechanism (TUM), which generates non-coplanar motions, namely axial contraction and rotation, from a single rotational input while producing identical contraction regardless of rotation direction. A friction generator mechanically defines torque thresholds that govern passive mode switching, enabling stable grasp establishment before autonomously transitioning to in-hand rotation without sensing or active control. Analytical models describing the kinematics, elastic force generation, and torque transmission of the TUM are derived and experimentally validated. The fabricated gripper is evaluated through quantitative experiments on grasp success, friction-based grasp force regulation, and bidirectional rotation performance. System-level demonstrations, including bolt manipulation, object reorientation, and manipulator-integrated tasks driven solely by wrist torque, confirm reliable grasp to rotate transitions in both rotational directions. These results demonstrate that non-coplanar multifunctional manipulation can be realized through mechanical design alone, establishing mechanically encoded power transmission logic as a robust alternative to actuator and control intensive gripper architectures.\n\nSPINE Gripper: A Twisted Underactuated Mechanism-based Passive Mode-Transition Gripper\nJaeHyung Jang, JunHyeong Park, Joong-Ku Lee, and Jee-Hwan Ryu\nThis work was supported in part by the Ministry of Trade, Industry and Energy (MOTIE), Republic of Korea, under Grant No. 00416440, and in part b",
    "is_relevant": false,
    "relevance_score": 1.0,
    "extracted_keywords": [
        "underactuated mechanism",
        "passive gripper",
        "mechanical design",
        "grasping",
        "in-hand rotation"
    ],
    "one_line_summary": "这篇论文介绍了一种基于扭曲欠驱动机构的被动模式切换夹爪，通过机械设计实现稳定抓取和双向旋转，无需传感器或主动控制。",
    "detailed_summary": "",
    "qa_pairs": [],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-11T09:55:18Z",
    "created_at": "2026-01-21T12:09:04.888162",
    "updated_at": "2026-01-21T12:09:04.888170",
    "recommend": 0
}