{
    "id": "2601.10365v1",
    "title": "FastStair: Learning to Run Up Stairs with Humanoid Robots",
    "authors": [
        "Yan Liu",
        "Tao Yu",
        "Haolin Song",
        "Hongbo Zhu",
        "Nianzong Hu",
        "Yuzhi Hao",
        "Xiuyong Yao",
        "Xizhe Zang",
        "Hua Chen",
        "Jie Zhao"
    ],
    "abstract": "在楼梯上奔跑对人类而言轻而易举，但对人形机器人来说却极具挑战，因为它同时要求高度的灵活性和严格的稳定性。无模型强化学习能够生成动态运动，但隐式的稳定性奖励和对任务特定奖励设计的严重依赖往往导致不安全行为，尤其是在楼梯上；相反，基于模型的落脚点规划器编码了接触可行性和稳定性结构，但强制执行其硬约束常导致保守运动，限制了速度。我们提出了FastStair，一个规划器引导的多阶段学习框架，它融合了这两种互补的优势，实现了快速稳定的上楼梯运动。FastStair将一个并行的基于模型的落脚点规划器集成到强化学习训练循环中，以引导探索朝向动态可行的接触，并预训练一个注重安全的基础策略。为了减轻规划器导致的保守性以及低速和高速动作分布之间的差异，基础策略被微调为速度专家，然后通过低秩自适应技术进行整合，以实现跨整个指令速度范围内的平稳操作。我们将得到的控制器部署在Oli人形机器人上，实现了在指令速度高达1.65米/秒时的稳定上楼梯，并在12秒内穿越了一个33级的螺旋楼梯，展示了在长楼梯上稳健的高速性能。值得注意的是，所提出的方法在\"小蛮腰\"机器人登塔比赛中作为冠军解决方案得到了验证。",
    "url": "https://arxiv.org/abs/2601.10365v1",
    "html_url": "https://arxiv.org/html/2601.10365v1",
    "html_content": "FastStair: Learning to Run Up Stairs with Humanoid Robots\nYan Liu\n1,2\n,\nTao Yu\n2\n,\nHaolin Song\n4\n,\nHongbo Zhu\n2,5\n,\nNianzong Hu\n2\n,\nYuzhi Hao\n2,6\n,\nXiuyong Yao\n2\n,\nXizhe Zang\n1\n​\n†\n{}^{1\\text{\\textdagger}}\n,\nHua Chen\n2\n,\n3\n​\n†\n{}^{2,3\\text{\\textdagger}}\n,\nJie Zhao\n1\n* Work done at LimX Dynamics. Project lead: Tao Yu\n†\nCorresponding author\n1\nSchool of Mechanics Engineering, Harbin Institute of Technology (HIT), Harbin Heilongjiang 150001, China. Email:\nliuyan98@stu.hit.edu.cn, zangxizhe@hit.edu.cn, jzhao@hit.edu.cn\n2\nLimX Dynamics, Shenzhen, China.\n3\nZhejiang University-University of Illinois Urbana-Champaign Institute (ZJUI), Haining, China. Email:\nhuachen@intl.zju.edu.cn\n4\nDepartment of Electronic Engineering and Information Science\n(EEIS), University of Science and Technology of China, Hefei 230027,\nChina. Email:\nhlsong@mail.ustc.edu.cn\n5\nHong Kong University of Science and Technology, Hong Kong SAR, China. Email: Email:\nhzhubi@connect.ust.hk\n6\nDepartment of Mechanical Engineering, National University of Singapore, Singapore 117575. Email:\nyuzhihao@u.nus.edu\nAbstract\nRunning up stairs is effortless for humans but remains extremely challenging for humanoid robots due to the simultaneous requirements of high agility and strict stability. Model-free reinforcement learning (RL) can generate dynamic locomotion, yet implicit stability rewards and heavy reliance on task-specific reward shaping tend to result in unsafe behaviors, especially on stairs; conversely, model-based foothold planners encode contact feasibility and stability structure, but enforcing their hard constraints often induces conservative motion that limits speed. We present FastStair, a planner-guided, multi-stage learning framework that reconciles these complementary strengths to achieve fast and stable stair ascent. FastStair integrates a parallel model-based foothold planner into the RL training loop to bias exploration toward dynamically feasible contacts and to pretrain a safety-focused base policy.\nTo mitigate planner-induced conservatism and the discrepancy between low- and high-speed action distributions, the base policy was fine-tuned into speed-specialized experts and then integrated via Low-Rank Adaptation (LoRA) to enable smooth operation across the full commanded-speed range.\nWe deploy the resulting controller on the Oli humanoid robot, achieving stable stair ascent at commanded speeds up to 1.65 m/s and traversing a 33-step spiral staircase (17 cm rise per step) in 12 s, demonstrating robust high-speed performance on long staircases. Notably, the proposed approach served as the champion solution in the Canton Tower Robot Run Up Competition. Project Page:\nhttps://npcliu.github.io/FastStair\n.\nI\nINTRODUCTION\nHumanoid robots have attracted significant interest because of their superior terrain adaptability, yet they remain far from matching human agile and stable locomotion. Staircases, a ubiquitous feature of human environments, present a particular challenge. While humans navigate them intuitively, robots face an inherent trade-off between agility and stability that remains unresolved. This trade-off has plagued state-of-the-art locomotion control methods, hindering the deployment of humanoid robots in real-world stair-climbing tasks.\nReinforcement Learning (RL) has emerged as a powerful paradigm for generating dynamic humanoid locomotion\n[\n12\n,\n13\n,\n17\n]\n. Although RL can achieve impressive speeds on flat terrain\n[\n12\n]\n, its application to challenging terrains like staircases often exposes a fragility. This vulnerability stems from the reliance on implicit stability rewards, where dynamic stability is not explicitly guaranteed but is instead encouraged through a ensemble of heuristic reward terms, such as alive, posture, and gravity-projection. On stairs, these implicit objectives frequently conflict with task-level rewards such as high-velocity tracking. This inherent contradiction forces the learning process into a trade-off where the pursuit of agility often leads the robot to sacrifice the very rewards that maintain stability. Consequently, most current stair-climbing control schemes, including both ”blind”\n[\n7\n,\n25\n]\nand perception-augmented\n[\n15\n,\n22\n,\n6\n,\n18\n]\napproaches, tend to prioritize safety by heavily weighting stability terms over speed. This prioritization effectively forfeits the potential for high-speed locomotion and results in the conservative behaviors typical of existing RL-based stair climbers.\nFigure 1:\nFull-scale humanoid robot Oli performing agile stair-climbing locomotion: (a) parallel foothold planning in IsaacLab, (b) climbing a staircase with 20 cm step height, (c) Canton Tower Run-up, and (d) high-speed ascent.\nIn contrast, model-based planner provides explicit stability guarantees by computing feasible footholds under model and environment constraints\n[\n1\n,\n16\n,\n20\n,\n2\n]\n. By enforcing hard constraints on capture regions and footstep placement, the planner ensure a high degree of safety. However, this rigorous adherence to feasibility constraints often induces conservative motion, which narrows the exploration space and limits the robot’s dynamic agility.\nA natural strategy to bridge this gap is to utilize model-based planners to guide RL exploration toward explicitly safe and feasible contacts. However, such guidance often transfers planner’s inherent conservatism to the learned policy, resulting in behaviors that are safe but lack the requisite agility for high-speed tasks. This persistent tension between planner-guided safety and learned agility motivates the development of a framework that can reconcile these complementary strengths.\nIn this work, we propose FastStair, a planner-guided, multi-stage learning framework that reconciles model-based stability with learned agility to achieve high-speed stair-climbing locomotion.\nFirst, regarding the foothold planner, compared with mainstream ALIP-based MPC methods\n[\n1\n,\n2\n]\n, planners based on the Divergent Component of Motion (DCM) admit analytical expressions\n[\n11\n]\nand permit relatively simple constraint formulations. These properties make DCM-based planners readily convertible into discrete-search formulations that are well suited for GPU-parallel computation and therefore appropriate for guiding RL training.\nSecond, to resolve the inefficiency of implicit safety exploration, we integrate a parallel DCM-based foothold planner\n[\n11\n]\ninto the RL loop. By reformulating the optimization as a parallel discrete search, we avoid reliance on parallel real-time optimization solvers and guide exploration toward dynamically feasible safety regions. This ”optimization-as-search” approach provides the real-time guidance necessary to pretrain a safety-focused base policy with negligible computational overhead.\nFinally, to mitigate planner-induced conservatism, we adopt a multi-stage training framework. Owing to the discrepancy in action distributions between low- and high-velocity motion, a single policy struggles to track the full commanded-speed range efficiently. Accordingly, in the second stage, the base policy was fine-tuned into two speed-specialized experts via velocity-related reward reweighting. However, direct switching between these experts causes instability (e.g., chattering). To address this, in the third stage, the parameters of both experts were integrated into a single network with low-rank adaptation (LoRA) layers on their branches. The integrated model was then fine-tuned over the full commanded speed range, yielding a unified policy that transitions smoothly across full speed range and enables stable, high-speed stair climbing.\nOur main contributions can be summarized as follows:\n•\nTo enhance stability on challenging staircases, we introduce a DCM-based foothold planner as an explicit stability reward, which guides the reinforcement learning exploration toward dynamically feasible footholds on challenging stairs.\n•\nTo mitigate the prohibitive training overhead of incorporating real-time optimization into parallel RL, we reformulate the foothold optimization as a parallelized discrete search, accelerating the training speed by approximately 25 times.\n•\nTo mitigate planner-induced conservatism and improve velocity-tracking performance, we propose a multi-stage framework that fine-tunes high-speed and low-speed experts from a safety-focused base policy, achieving high-speed locomotion without sacrificing stability or low-speed tracking accuracy.\n•\nTo address instabilities arising from expert switching, the experts were merged into a single network and fine-tuned using LoRA, which enabled smooth transitions between experts and produced a unified policy that operates robustly across the full commanded-speed range.\nFigure 2:\nOverview of the FastStair framework. During the pre-training stage, a parallel DCM-based foothold optimizer generates dynamically feasible contacts to guide policy learning via a foothold-tracking reward. In the post-training stage, the pre-trained base model is fine-tuned into high- and low-speed expert policies by expanding the commanded velocity range and adjusting reward weights to mitigate planner-induced conservatism; this decomposition is motivated by the distinct action distributions at high versus low speeds. However, direct switching between experts can cause control discontinuities, so in the LoRA fine-tuning stage we merge their parameters into a single network and fine-tune it with LoRA. The resulting unified policy ensures robust tracking across the full velocity range for deployment on the physical robot.\nII\nRelated Work\nII-A\nModel-based Locomotion on Challenging Terrains\nClassical model-based methods, such as those based on the DCM\n[\n11\n]\nand Model Predictive Control (MPC), provide a rigorous mathematical foundation for foothold planning\n[\n1\n,\n20\n,\n19\n]\n. By encoding contact feasibility and balance criteria as explicit kinemodynamic constraints, these methods excel at maintaining stability on discrete terrains like stairs or stepping stones. However, ensuring real-time computational feasibility often necessitates simplifying assumptions, such as the linear inverted pendulum model, alongside the use of conservative safety margins. These constraints inevitably restrict the reachable solution space, inducing the conservative locomotion that hinder high-speed agility.\nII-B\nLearning-based Humanoid Locomotion on Stairs\nRecent advancements in deep reinforcement learning (RL) have significantly enhanced the terrain adaptability of humanoid robots. Residual-based methods\n[\n5\n,\n6\n,\n18\n]\ntypically employ a two-stage pipeline where a vision-based network provides corrective residuals to a frozen blind policy. While effective, these decoupled architectures often require complex coordination and may limit the robot’s peak agility due to the restricted search space of the residual. Conversely, end-to-end frameworks\n[\n15\n,\n22\n]\nunify perception and control, but they often struggle with the severe exploration bottlenecks of pure RL, especially when traversing discrete terrains like stairs without explicit motion priors.\nTo further enhance locomotion performance, researchers have explored specialized training strategies. For instance,\n[\n24\n]\nuses a curriculum based on scan points, while\n[\n23\n]\nleverages human motion retargeting to induce natural behaviors. However, these methods often fail to ensure strict dynamical feasibility at high speeds. Our work diverges by using a multi-stage training framework—transitioning from safety-critical pre-training to specialized experts. By integrating these experts into a single network via LoRA\n[\n8\n]\n, we achieve high-speed stair climbing that surpasses the conservative limits of single-policy RL.\nIII\nMethod\nWe propose a multi-stage training framework, FastStair, designed to enable high-speed stair climbing while ensuring robust traversal success rates. An overview is depicted in Fig.\n2\n.\nIn the pre-training stage, we incorporate parallel DCM-based foothold planning to guide the policy via a large foothold-tracking reward.\nWhile this prioritization ensures safety, it inevitably compromises velocity tracking accuracy. To address this, the post-training stage rebalances reward weights to prioritize velocity tracking and trains separate high-speed and low-speed expert policies, initialized from the pre-trained model.\nFinally, in the fine-tuning stage, these experts are integrated into a network and fused via LoRA. This yields a single unified policy capable of reliable traversal across the full commanded velocity range. The details of this three-stage procedure are described below.\nIII-A\nParallel Foothold Planning\nTraversing complex terrain requires selecting safe, flat footholds. However, acquiring this capability is often challenging for pure RL. To bridge this gap, we incorporate a model-based planner to guide foothold selection.\nWhile conventional planning methods\n[\n4\n,\n1\n]\ndemonstrate robust performance, they typically rely on serial CPU-based optimization solvers, rendering them incompatible with massive parallel RL frameworks. Even recent advancements in parallel optimization\n[\n9\n]\noften incur non-trivial computational overhead when scaled.\nTo address this, we formulate a DCM-based foothold optimization problem and reformulate it as a parallel discrete search task. By solving this task via vectorized tensor operations, we leverage the GPU’s massive parallelism, ensuring the planner incurs negligible computational overhead during training.\nIII-A\n1\nDCM for Stair Climbing\nFollowing\n[\n3\n]\n, we model the system dynamics using the Variable-Height Inverted Pendulum (VHIP), governed by:\nx\n¨\n=\nω\n2\n​\nx\n,\n\\ddot{x}=\\omega^{2}x,\nwhere\nx\n∈\nℝ\nx\\in\\mathbb{R}\ndenotes position in the forward direction. To accommodate stair climbing, we define the Center of Mass (CoM) height trajectory\nz\n​\n(\nt\n)\nz(t)\nduring the swing phase (duration\nT\nT\n) as a linear function\nz\n​\n(\nt\n)\n=\nk\n​\nt\n+\nz\n0\nz(t)=kt+z_{0}\n, where\nz\n0\nz_{0}\nrepresents the nominal standing height and\nk\nk\ndenotes the vertical slope. Consequently, the natural frequency is given by\nω\n=\ng\n/\nz\n​\n(\nt\n)\n\\omega=\\sqrt{g/z(t)}\n, where\ng\ng\nis the gravitational acceleration. Fig.\n3\nillustrates this VHIP formulation applied to stair negotiation.\nFigure 3:\nInverted-pendulum stair-climbing process.\nThe DCM is defined as\nξ\n=\nx\n+\n1\nω\n​\nx\n˙\n\\xi=x+\\frac{1}{\\omega}\\dot{x}\n. Differentiating with respect to time yields:\nξ\n˙\n=\n(\n1\n−\nω\n˙\nω\n2\n)\n​\nx\n˙\n+\n1\nω\n​\nx\n¨\n.\n\\dot{\\xi}=\\left(1-\\frac{\\dot{\\omega}}{\\omega^{2}}\\right)\\dot{x}+\\frac{1}{\\omega}\\ddot{x}.\nNoting that\nω\n˙\n=\n−\n1\n2\n​\nω\n​\nk\nz\n\\dot{\\omega}=-\\frac{1}{2}\\omega\\frac{k}{z}\n, then:\nξ\n˙\n\\displaystyle\\dot{\\xi}\n=\n(\n1\n+\nk\n2\n​\ng\n​\nz\n)\n​\nx\n˙\n+\n1\nω\n​\nx\n¨\n\\displaystyle=\\left(1+\\frac{k}{2\\sqrt{gz}}\\right)\\dot{x}+\\frac{1}{\\omega}\\ddot{x}\n(1)\n=\na\n​\nx\n˙\n+\nω\n​\nx\n\\displaystyle=a\\dot{x}+\\omega x\n=\na\n​\nω\n​\nξ\n+\n(\n1\n−\na\n)\n​\nω\n​\nx\n,\n\\displaystyle=a\\omega\\xi+(1-a)\\omega x,\nwhere\na\n=\n1\n+\nk\n2\n​\ng\n​\nz\na=1+\\frac{k}{2\\sqrt{gz}}\n. Considering a maximum stair incline of\n±\n45\n∘\n\\pm 45^{\\circ}\n(implying\nk\n∈\n[\n−\n1\n,\n1\n]\nk\\in[-1,1]\n) and a nominal standing height\nz\n0\n≈\n1\nz_{0}\\approx 1\nm, the coefficient\na\na\nremains within the range\n[\n0.84\n,\n1.16\n]\n[0.84,1.16]\n. Given that\na\na\nis close to unity, we approximate\na\n≈\n1\na\\approx 1\nto simplify the optimization. This yields the dynamics\nξ\n˙\n≈\nω\n​\nξ\n\\dot{\\xi}\\approx\\omega\\xi\nwith a time-varying\nω\n\\omega\n. Consequently, the DCM evolution for stair climbing at time\nt\n∈\n[\n0\n,\nT\n]\nt\\in[0,T]\nis given by:\nξ\n​\n(\nt\n)\n=\nξ\n0\n​\ne\n∫\n0\nt\nω\n​\n(\nτ\n)\n​\n𝑑\nτ\n.\n\\xi(t)=\\xi_{0}e^{\\int_{0}^{t}\\omega(\\tau)d\\tau}.\nIII-A\n2\nDCM-based Foothold Optimization\nLeveraging the structural similarity between our derived dynamics and the standard planar DCM model, we adapt the optimization formulation from\n[\n11\n]\n:\nmin\nu\nT\n,\nb\n\\displaystyle\\min_{u_{T},b}\\quad\nα\n1\n​\n‖\nu\nT\n−\n[\nL\nnom\nW\nnom\n]\n‖\n2\n+\nα\n2\n​\n‖\nb\n−\nb\nnom\n‖\n2\n+\nα\n3\n​\nS\n​\n(\nu\nT\n)\n\\displaystyle\\alpha_{1}\\left\\|u_{T}-\\begin{bmatrix}L_{\\text{nom}}\\\\\nW_{\\text{nom}}\\end{bmatrix}\\right\\|^{2}+\\alpha_{2}\\|b-b_{\\text{nom}}\\|^{2}+\\alpha_{3}S(u_{T})\n(2)\ns.t.\nu\nT\n+\nb\n=\nξ\nt\n​\ne\nσ\n​\n(\nT\n)\n−\nσ\n​\n(\nt\n)\n,\n\\displaystyle u_{T}+b=\\xi_{t}e^{\\sigma(T)-\\sigma(t)},\n(3)\nu\nT\n∈\n𝒫\n,\n\\displaystyle u_{T}\\in\\mathcal{P},\n(4)\nThe integrated natural frequency is explicitly given by:\nσ\n​\n(\nt\n)\n=\n∫\n0\nt\nω\n​\n(\nτ\n)\n​\n𝑑\nτ\n=\n2\n​\ng\n​\n(\nk\n​\nt\n+\nz\n0\n−\nz\n0\n)\nk\n.\n\\sigma(t)=\\int_{0}^{t}\\omega(\\tau)d\\tau=\\frac{2\\sqrt{g}\\left(\\sqrt{kt+z_{0}}-\\sqrt{z_{0}}\\right)}{k}.\nThe decision variable\nu\nT\n∈\nℝ\n2\nu_{T}\\in\\mathbb{R}^{2}\nrepresents the planar projection of the candidate foothold, while\nb\nb\ndenotes the DCM offset\n[\n11\n]\n. The nominal step targets are defined as\nL\nnom\n=\nv\nx\nd\n​\nT\nL_{\\text{nom}}=v_{x}^{d}T\nand\nW\nnom\n=\nv\ny\nd\n​\nT\n+\n(\n−\n1\n)\ni\n​\nl\nW_{\\text{nom}}=v_{y}^{d}T+(-1)^{i}l\n, where\n(\nv\nx\nd\n,\nv\ny\nd\n)\n(v_{x}^{d},v_{y}^{d})\nis the desired commanded velocity,\ni\ni\nis the leg index (left/right), and\nl\nl\ndenotes the nominal lateral inter-foot distance. Accordingly, the nominal DCM offset is formulated as\nb\nnom\n=\n[\nL\ne\nσ\n​\n(\nT\n)\n−\n1\n,\n(\n−\n1\n)\ni\n​\nl\np\n1\n+\ne\nσ\n​\n(\nT\n)\n−\nW\n1\n−\ne\nσ\n​\n(\nT\n)\n]\nb_{\\text{nom}}=[\\frac{L}{e^{\\sigma(T)}-1},(-1)^{i}\\frac{l_{p}}{1+e^{\\sigma(T)}}-\\frac{W}{1-e^{\\sigma(T)}}]\n. The feasible foothold set\n𝒫\n\\mathcal{P}\nis derived from a local elevation map (spanning\n1.8\n​\nm\n×\n1.2\n​\nm\n1.8\\,\\text{m}\\times 1.2\\,\\text{m}\n) centered on the robot, as visualized by the blue points in Fig.\n4\n. The term\nS\n​\n(\nu\nT\n)\nS(u_{T})\nquantifies the terrain steepness cost (indicated by light-blue points in Fig.\n4\n).\nFigure 4:\nTerrain-perception information. Blue markers show terrain scandots, green the averaged gradient map, light blue the local averaged gradient map, and red the optimal footholds.\nIII-A\n3\nSteepness Score Calculation\nThe steepness score\nS\n​\n(\nu\nT\n)\nS(u_{T})\nevaluates local terrain gradients to identify feasible contact patches. Upon acquiring the elevation map, we compute the spatial gradient using a Sobel operator, implemented efficiently as a GPU-parallelized convolution. To account for the robot’s planar foot morphology, we apply a subsequent local neighborhood aggregation step (also via convolution) over a kernel matching the foot dimensions. In the resulting cost map, higher values correspond to steeper terrain, indicating reduced suitability for foothold placement.\nIII-A\n4\nOptimization-to-Search Reformulation\nDirectly solving large-scale optimization problems in real-time typically incurs prohibitive computational overhead, creating a bottleneck for parallel RL. To overcome this, we reformulate the optimization into a parallel discrete search.\nWe observe that the feasible foothold set\n𝒫\n\\mathcal{P}\n(blue points in Fig.\n4\n) is naturally discretized by the elevation map resolution and can be encoded as a tensor on the GPU. Leveraging the equality constraint in Eq. (\n3\n), we analytically map each candidate foothold\nu\nT\n∈\n𝒫\nu_{T}\\in\\mathcal{P}\nto its corresponding DCM offset\nb\nb\n. Consequently, the cost function in Eq. (\n2\n) can be evaluated in parallel across the entire batch of candidate footholds using efficient vectorized tensor operations. The optimal foothold is then identified via a simple\nargmin\nreduction.\nTo further accelerate the query, we constrain the search window to a\n0.6\n​\nm\n×\n0.6\n​\nm\n0.6\\,\\text{m}\\times 0.6\\,\\text{m}\nregion of interest centered on the nominal target\n[\nL\nnom\n,\nW\nnom\n]\n⊤\n[L_{\\text{nom}},W_{\\text{nom}}]^{\\top}\n, as indicated by the light-blue region in Fig.\n4\n.\nWhile this formulation relies on simplified dynamics (approximating\na\n≈\n1\na\\approx 1\n), it provides a computationally lightweight yet effective heuristic sufficient to guide the RL policy. Moreover, this\noptimization-to-search\nparadigm offers a generalizable strategy for tightly coupling model-based planners with massive parallel RL environments without sacrificing training speed.\nIII-B\nThree-Stage Reinforcement Learning Framework\nIII-B\n1\nObservation Space\nThe policy’s state space is partitioned into proprioceptive observations (available during both training and deployment) and privileged observations (restricted to the training phase).\nThe proprioceptive observations primarily comprise the user command vector\n𝒄\nt\n=\n[\nv\nx\nd\n,\nv\ny\nd\n,\nw\nyaw\nd\n]\n⊤\n\\boldsymbol{c}_{t}=[v_{x}^{d},v_{y}^{d},w_{\\mathrm{yaw}}^{d}]^{\\top}\n, base angular velocity, projected gravity vector, joint positions, joint velocities, and the previous action history. To encode timing, we include gait clock signals\n{\nsin\n⁡\n(\n2\n​\nπ\n​\nf\n​\nt\n)\n,\ncos\n⁡\n(\n2\n​\nπ\n​\nf\n​\nt\n)\n}\n\\{\\sin(2\\pi ft),\\cos(2\\pi ft)\\}\n, where\nf\nf\ndenotes the stepping frequency. Crucially, the robot also perceives the terrain via elevation map centered on the robot.\nThe privileged observations augment this set with ground-truth states and explicit model-based guidance. These include the base linear velocity, base height, external contact forces, joint accelerations, and joint torques. Importantly, to guide the learning process, we incorporate the optimal foothold computed by the parallel planner described in Sec.\nIII-A\n.\nIII-B\n2\nReward Function and Network Architecture\nSince our primary contribution lies in the multi-stage framework, we adopt the actor-critic network architecture and the baseline reward formulation from\n[\n21\n]\n. However, to drive stage-specific behaviors, we adjust specific reward scalars across the three training stages, as detailed in Table\nI\n.\nCrucially, to enforce the guidance provided by the parallel planner, we introduce a specific foothold-tracking reward not present in\n[\n21\n]\n:\nr\nfoot\n=\nexp\n⁡\n(\n−\n10\n​\n‖\n𝐩\nf\n−\n𝐩\nf\nd\n‖\n)\n,\nr_{\\text{foot}}=\\exp\\!\\left(-10\\|\\mathbf{p}_{f}-\\mathbf{p}_{f}^{d}\\|\\right),\nwhere\n𝐩\nf\n∈\nℝ\n3\n\\mathbf{p}_{f}\\in\\mathbb{R}^{3}\ndenotes the current swing-foot position and\n𝐩\nf\nd\n∈\nℝ\n3\n\\mathbf{p}_{f}^{d}\\in\\mathbb{R}^{3}\nrepresents the desired instantaneous position for the next time step. The desired trajectory\n𝐩\nf\nd\n\\mathbf{p}_{f}^{d}\nis generated via interpolation (e.g., Bézier curves) defined by three keyframes: the lift-off position, the swing apex, and the target landing position\n[\nu\nT\n⊤\n,\nh\nz\n]\n⊤\n[u_{T}^{\\top},h_{z}]^{\\top}\n. Here,\nu\nT\nu_{T}\nis the optimal planar foothold derived in Sec.\nIII-A\n, and\nh\nz\nh_{z}\nis the corresponding terrain height retrieved directly from the elevation map. To prevent tripping, the swing apex is configured to ensure sufficient clearance above the maximum height difference between the lift-off and landing points.\nIII-B\n3\nPre-training Stage\nIn the Pre-training Stage, we prioritize traversal stability over precise velocity tracking. Accordingly, we assign a dominant weight to the foothold-tracking reward defined above. This constraint compels the policy to target safe contact regions—specifically the centers of stair treads—rather than risky edge placements, thereby maximizing the probability of successful traversal. Through this process, the policy effectively encodes the geometric intuition of the model-based planner. However, the emphasis on foothold accuracy leads to increased speed-tracking error.\nIII-B\n4\nPost-training Stage\nTo recover velocity-tracking precision and increase climbing speed, the reward weights were adjusted by increasing the weight of the speed-tracking term and reducing the foothold-tracking weight.\nWe partition the command space into two distinct regimes: a high-velocity band (\n[\n0.8\n,\n1.6\n]\n​\nm/s\n[0.8,1.6]\\,\\text{m/s}\n) and a low-velocity band (\n[\n−\n0.3\n,\n0.8\n]\n​\nm/s\n[-0.3,0.8]\\,\\text{m/s}\n). Initialized from the pre-trained policy, two separate expert model are trained to master each specific regime. This divide-and-conquer strategy is essential; empirical results indicate that training a single policy directly over the full union of ranges (\n[\n−\n0.3\n,\n1.6\n]\n​\nm/s\n[-0.3,1.6]\\,\\text{m/s}\n) leads to mode collapse towards moderate velocities, significantly degrading tracking accuracy at the operational extremes (i.e., very slow or very fast motion).\nIII-B\n5\nLoRA Fine-tuning Stage\nBecause joint-action distributions differ between high- and low-speed locomotion, directly switching between discrete expert policies induces control discontinuities and physical instability during deployment. To resolve this, we integrate the parameters of both the high-speed and low-speed experts into a unified network (see Fig.\n2\n). We then fine-tune the model using LoRA to smooth the transition boundaries and ensure robust performance across the full command spectrum.\nWithin the unified network, we employ a rule-based switcher driven by the user command: the high-speed expert is activated to generate joint actions when the commanded forward velocity\nv\nx\nd\n>\n0.8\n​\nm/s\nv_{x}^{d}>0.8\\,\\text{m/s}\n, while the low-speed expert governs the regime below this threshold.\nTABLE I:\nThe reward weights for the three stages\nReward Term\nStage 1 Weights\nStage 2 Weights\nStage 3 Weights\nLin. velocity track\n1.0\n1.35\n1.1\nBase height\n(w.r.t. feet)\n0.4\n0.3\n0.4\nAction smoothness\n−\n2.5\n-2.5\ne-03\n−\n2\n-2\ne-03\n−\n2\n-2\ne-03\nJoint accel. L2\n−\n5\n-5\ne-07\n−\n4\n-4\ne-07\n−\n4\n-4\ne-07\nJoint torque L2\n−\n4\n-4\ne-07\n−\n3\n-3\ne-07\n−\n3\n-3\ne-07\nTorque rate\n−\n1.5\n-1.5\ne-07\n−\n2\n-2\ne-08\n−\n2\n-2\ne-08\nJoint power\n−\n2.5\n-2.5\ne-07\n−\n2\n-2\ne-07\n−\n2\n-2\ne-07\nLin. accel. L2\n−\n2\n-2\ne-03\n−\n1.5\n-1.5\ne-03\n−\n1.5\n-1.5\ne-03\nProj. gravity L2\n−\n0.15\n-0.15\n−\n0.1\n-0.1\n−\n0.1\n-0.1\nFeet stumble\n−\n1.5\n-1.5\n−\n1.5\n-1.5\n−\n2\n-2\nFoothold\n0.6\n0.6\n0.5\n0.5\n0.4\n0.4\nIII-C\nElevation Maps Reconstruction\nThe locomotion policy relies on egocentric local elevation maps (visualized as blue markers in Fig.\n4\n) for terrain awareness. During simulation training, we extract ground-truth height samples directly from the IsaacLab interface.\nFor physical deployment, we implement the perception pipeline proposed in\n[\n21\n]\nusing an Intel RealSense D435i depth camera. This module processes raw depth frames in real-time to reconstruct a local terrain grid covering a\n1.8\n​\nm\n×\n1.2\n​\nm\n1.8\\,\\text{m}\\times 1.2\\,\\text{m}\narea centered on the robot, with a spatial resolution of\n5\n​\ncm\n5\\,\\text{cm}\n. The resulting terrain scandots serves as the primary exteroceptive input for the onboard policy.\nIV\nEXPERIMENTS\nIV-A\nRobot Platform\nWe conduct all experiments using the full-scale humanoid robot LimX Oli\n[\n14\n]\n(Fig.\n5\n). The robot weighs 55 kg and stands 1.65 m tall, featuring 31 actuated degrees of freedom (DoF): 6 per leg, 7 per arm, 3 in the waist, and 2 in the head. In this study, all 31 joints are actively controlled. For onboard computing, the system integrates an NVIDIA Jetson Orin NX and a Rockchip RK3588-based single-board computer to handle real-time perception and policy inference.\nFigure 5:\nRobot Platform Limx Oli.\nIV-B\nTraning and Deployment\nFollowing\n[\n21\n]\n, we utilize IsaacLab to construct a diverse training curriculum featuring flat ground, rough terrain, and pyramid-shaped stairs (both ascent and descent). To facilitate agile maneuvers, we constrain the gait frequency to\n[\n1.0\n,\n1.5\n]\n[1.0,1.5]\nHz. We simulate 4096 environments in parallel, randomizing the robot’s base pose upon each reset and resampling command velocities every 10 seconds. While the forward velocity range varies across the three training stages (as detailed in Sec.\nIII-B\n4\n), the lateral velocity and yaw rate are fixed at\nv\ny\nd\n∈\n[\n−\n0.3\n,\n0.3\n]\nv_{y}^{d}\\in[-0.3,0.3]\nm/s and\nw\nyaw\nd\n∈\n[\n−\n1.0\n,\n1.0\n]\nw_{\\text{yaw}}^{d}\\in[-1.0,1.0]\nrad/s, respectively.\nTo bridge the sim-to-real gap, we apply domain randomization. Randomized parameters include the mass and inertia of links (base, waist, legs), contact friction, restitution coefficients, and joint PD gains. Additionally, we inject random external force and impulse perturbations. For the final LoRA fine-tuning stage we configure the LoRA hyperparameters as\nα\n=\n16\n\\alpha=16\nand\nγ\n=\n8\n\\gamma=8\n.\nFor real-world deployment, we employ a distributed computing architecture. The Intel RealSense D435i captures depth frames, which are processed by the perception pipeline on the NVIDIA Jetson Orin NX to generate local elevation maps. These maps are transmitted to the Rockchip RK3588-based computer, which executes the final unified policy. This decoupling of perception and control workloads ensures efficient onboard processing and maintains the strict control loop timing required for stable agile locomotion.\nIV-C\nFoothold Tracking and Computational Efficiency\nIV-C\n1\nFoothold Tracking\nIn our framework, planned footholds serve as supervisory signals within the reward function, guiding the policy toward safe contact regions. Fig.\n6\nillustrates the optimal footholds (red point in the figure) generated via Eq.\n2\nduring ascent; notably, the planner concentrates targets near the centers of the stair treads. By minimizing the tracking error against these targets, the robot implicitly learns to identify and exploit safe, planar contact surfaces.\nTo evaluate this guidance, both the pre-trained and the final unified policies were deployed in IsaacLab and data were collected at commanded forward velocities of\n{\n0.4\n,\n0.6\n,\n0.8\n,\n1.0\n}\n​\nm/s\n\\{0.4,\\,0.6,\\,0.8,\\,1.0\\}\\,\\text{m/s}\n. Performance was quantified by the mean planar Euclidean distance between executed and planned footholds. As illustrated in Fig.\n6\n, simulation screenshots show that the swing foot generally lands near the desired foothold; nevertheless, the foothold-tracking error of the final unified policy is larger than that of the pre-trained policy. By contrast, the velocity-tracking analysis in Fig.\n9\nindicates that the final unified policy attains lower velocity error. This pattern is explained by the training design: during pre-training a larger weight is placed on foothold accuracy to prioritize safety, and only after a safe baseline has been learned is post-training used to explore more agile behaviors. The results therefore reflect the intended trade-off between safety and agility embodied by the proposed multi-stage framework.\nIV-C\n2\nComputational Efficiency\nThe complete planning pipeline—including elevation map processing and the parallel discrete search—incurs a latency of approximately 4 ms per step for a batch of 4096 environments on an NVIDIA RTX 4090. This represents an approximate\n25\n×\n25\\times\nspeedup compared to recent parallel MPC implementations using CusADi\n[\n10\n]\nunder similar hardware conditions, highlighting the scalability of our approach for large-scale RL.\nFigure 6:\nFoothold screenshots and Foothold-tracking error. For each commanded speed, the error was computed by averaging the absolute foothold-position errors recorded over a time window.\nIV-D\nFull-Range Velocity-Tracking Experiments\nTo assess policy robustness beyond the training simulator, we conduct validation in MuJoCo on a staircase with a step height of\n15\n​\ncm\n15\\,\\text{cm}\n. Fig.\n7\npresents both a simulation snapshot and a time-series plot of the forward velocity response during a stair descent maneuver.\nExperimental results demonstrate that the unified policy effectively tracks velocity commands across the entire operational range. Notably, the robot maintains stability and tracking accuracy from a stationary stance (\n0\n​\nm/s\n0\\,\\text{m/s}\n) up to the maximum commanded velocity of\n1.6\n​\nm/s\n1.6\\,\\text{m/s}\n, validating the effectiveness of the multi-stage training framework.\nFigure 7:\nMuJoCo simulation snapshot and velocity-tracking performance during stair descent. The plot shows commanded and measured forward velocities over time.\nIV-E\nTraining Framework Evaluation\nWe evaluated the following methods in terms of terrain traversal success ratio and velocity-tracking mean absolute error (MAE):\n•\nBaseline\n[\n21\n]\n:\nA standard end-to-end RL policy trained without model-based foothold guidance, which has twice the parameters of a velocity expert policy.\n•\nPre-trained (Ablation):\nAn intermediate variant (Stage 1 only) incorporates DCM-based foothold guidance and uses twice the parameters of a velocity expert, but lacks the velocity-specific split and LoRA integration.\n•\nAMP\n[\n23\n]\n:\nA policy trained using Adversarial Motion Priors (AMP), where exploration is guided by retargeted human reference motions rather than terrain-aware geometric planning.\n•\nFastStair (ours):\nThe complete proposed framework (see Fig.\n2\n).\nIV-E\n1\nTerrain Traversal Success Ratio\nThe traversal success ratio was evaluated on a staircase with 25 cm step height at commanded forward speeds of 0.5, 1.0, 1.5, and 2.0 m/s. In IsaacSim we initialized 500 robots around the center of a pyramidal staircase with randomized headings and commanded them to traverse in all directions. The success ratio is defined as the fraction of environments in which the robot reached the far edge of the terrain within an episode without falling. Results are presented in Fig.\n8\n.\nAs illustrated, FastStair achieves the highest success rate across all tested velocities. The Pre-trained policy also significantly outperforms the baselines, a result we attribute to the parallel foothold planning incorporated during pre-training. This explicitly imparts geometric guidance, enabling the robot to identify optimal contact regions on the stair treads.\nIn contrast, while the AMP method performs well at lower velocities (\n≤\n1.0\n​\nm/s\n\\leq 1.0\\,\\text{m/s}\n), its performance degrades sharply at higher speeds, eventually underperforming even the unguided Baseline. In simulation, we observed that the AMP policy exhibited a tendency to stall at the base of the stairs when commanded above\n1.0\n​\nm/s\n1.0\\,\\text{m/s}\n. We hypothesize this stems from two factors: the lack of high-speed climbing examples in the reference dataset (distributional shift) and a conservative reward structure that penalizes the deviations required for aggressive maneuvers.\nAlthough all policies were trained with a maximum commanded velocity of\n1.6\n​\nm/s\n1.6\\,\\text{m/s}\n, we extended the evaluation to\n2.0\n​\nm/s\n2.0\\,\\text{m/s}\nto assess robustness. Notably, FastStair maintains a success rate exceeding\n70\n%\n70\\%\neven in this out-of-distribution regime, demonstrating superior generalization of the learned agile locomotion skills.\nFigure 8:\nSuccess-rate comparison for traversing a staircase with 25 cm step height at various commanded speeds.\nIV-E\n2\nVelocity-Tracking Evaluation\nWe evaluate the velocity-tracking fidelity of the four methods on a staircase with a\n25\n​\ncm\n25\\,\\text{cm}\nstep height. forward velocity commands are sampled uniformly from\n[\n−\n0.3\n,\n1.6\n]\n​\nm/s\n[-0.3,1.6]\\,\\text{m/s}\nat\n3\n​\ns\n3\\,\\text{s}\nintervals. For each trial, we compute the Mean Absolute Error (MAE) between the commanded and actual velocities. The resulting error distributions are presented in Fig.\n9\n.\nAs illustrated, FastStair achieves the lowest MAE (approximately\n0.5\n​\nm/s\n0.5\\,\\text{m/s}\n), validating the effectiveness of the full training pipeline. Notably, the Pre-trained policy exhibits a slightly higher MAE than the Baseline. This result is consistent with our design intent: the heavy weighting of the foothold-tracking reward during pre-training biases the policy toward precise, safe foot placement (as evidenced in Fig.\n6\n) at the expense of velocity-tracking performance. This safety-versus-agility trade-off explicitly justifies the necessity of the subsequent post-training stage to recover velocity-tracking precision while retaining the learned foothold priors.\nConversely, the AMP method yields the largest MAE. As noted in Sec.\nIV-E\n1\n, the AMP policy frequently exhibits stagnation behavior at the stair base under high-velocity commands, leading to significant tracking deviations. Finally, we note that the maximum error values across all methods are inflated by velocity measurements recorded immediately prior to falls; therefore, maximum error is not a reliable indicator of tracking quality.\nFigure 9:\nMean absolute error (MAE) of velocity tracking for four methods on a staircase with 25 cm step height.\nFigure 10:\nOutdoor experiments of perception-enabled agile stair climbing, including high-speed ascent and descent and turning maneuvers on stairs.\nIV-F\nReal-World Deployment\nWe deploy the final policy on the full-scale humanoid robot “LimX Oli,” executing directly on the onboard RK3588-based computer at a control frequency of\n100\n​\nHz\n100\\,\\text{Hz}\n, without any additional task-level fine-tuning. We conduct a series of outdoor experiments to validate performance (see Fig.\n1\nand Fig.\n10\n). Detailed video recordings are provided in the supplementary material\n1\n1\n1\nhttps://youtu.be/SoLBK7VEGDo\n.\nWe perform comprehensive stair-climbing tests covering the full velocity range (0 to 1.5 m/s) on an outdoor staircase with a 15 cm step height (Fig.\n10\n). The robot successfully executes both ascent and descent across the full commanded velocity range, achieving ascent velocities up to 1.5 m/s. To accommodate such high-speed motion, the robot exhibits an emergent step-skipping behavior, clearing two steps in a single stride to maximize forward progress. Notably, the robot successfully negotiated 33 stairs (17 cm/step) at the Canton Tower within 12 seconds, reaching a peak velocity of 1.65 m/s during the final steps of the ascent.\nFurther validation includes the continuous negotiation of steeper staircases (\n20\n​\ncm\n20\\,\\text{cm}\nstep height, Fig.\n1\n) and dynamic turning maneuvers between flight segments. All tasks were completed successfully, demonstrating that FastStair enables stable, perception-aware agile locomotion in challenging real-world environments.\nV\nConclusion\nIn this paper, we presented FastStair, a multi-stage learning framework that reconciles model-based stability with learned agility for high-speed stair climbing. By reformulating DCM-based foothold optimization into a GPU-parallel discrete search, we provided real-time guidance within the RL loop with negligible computational overhead. To mitigate planner-induced conservatism and improve velocity-tracking performance, the base policy was fine-tuned into separate low- and high-speed experts to accommodate differing action distributions. To eliminate instabilities associated with hard switching, the experts were merged into a single network and consolidated via LoRA fine-tuning, yielding a unified policy that operates robustly across the full commanded-speed range. Experimental results on the Oli robot demonstrate robust performance, achieving agile stair ascent at speeds up to 1.65 m/s. The successful navigation of a 33-step spiral staircase in 12 seconds underscores the efficiency and high-speed capabilities of FastStair in challenging real-world environments.\nFor future work, we aim to extend the parallel planning paradigm to a broader spectrum of challenging terrains. Furthermore, we plan to investigate generalized methodologies for tightly coupling model-based geometric priors with large-scale RL, ultimately enabling reliable deployment in complex, unstructured field environments.\nReferences\n[1]\nB. Acosta and M. Posa\n(2023)\nBipedal walking on constrained footholds with mpc footstep control\n.\nIn\n2023 IEEE-RAS 22nd International Conference on Humanoid Robots (Humanoids)\n,\npp. 1–8\n.\nCited by:\n§I\n,\n§I\n,\n§\nII-A\n,\n§\nIII-A\n.\n[2]\nB. Acosta and M. Posa\n(2025)\nPerceptive mixed-integer footstep control for underactuated bipedal walking on rough terrain\n.\narXiv preprint arXiv:2501.19391\n.\nCited by:\n§I\n,\n§I\n.\n[3]\nS. Caron, A. Escande, L. Lanari, and B. Mallein\n(2019)\nCapturability-based pattern generation for walking with variable height\n.\nIEEE Transactions on Robotics\n36\n(\n2\n),\npp. 517–536\n.\nCited by:\n§\nIII-A\n1\n.\n[4]\nO. Dosunmu-Ogunbi, A. Shrivastava, G. Gibson, and J. W. Grizzle\n(2023)\nStair climbing using the angular momentum linear inverted pendulum model and model predictive control\n.\nIn\n2023 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)\n,\npp. 8558–8565\n.\nCited by:\n§\nIII-A\n.\n[5]\nH. Duan, B. Pandit, M. S. Gadde, B. Van Marum, J. Dao, C. Kim, and A. Fern\n(2024)\nLearning vision-based bipedal locomotion for challenging terrain\n.\nIn\n2024 IEEE International Conference on Robotics and Automation (ICRA)\n,\npp. 56–62\n.\nCited by:\n§\nII-B\n.\n[6]\nM. S. Gadde, P. Dugar, A. Malik, and A. Fern\n(2025)\nNo more blind spots: learning vision-based omnidirectional bipedal locomotion for challenging terrain\n.\nIn\n2025 IEEE-RAS 24th International Conference on Humanoid Robots (Humanoids)\n,\npp. 601–608\n.\nCited by:\n§I\n,\n§\nII-B\n.\n[7]\nX. Gu, Y. Wang, and J. Chen\n(2024)\nHumanoid-gym: reinforcement learning for humanoid robot with zero-shot sim2real transfer\n.\narXiv preprint arXiv:2404.05695\n.\nCited by:\n§I\n.\n[8]\nE. J. Hu, Y. Shen, P. Wallis, Z. Allen-Zhu, Y. Li, S. Wang, L. Wang, W. Chen,\net al.\n(2022)\nLora: low-rank adaptation of large language models.\n.\nICLR\n1\n(\n2\n),\npp. 3\n.\nCited by:\n§\nII-B\n.\n[9]\nS. H. Jeon, S. Hong, H. J. Lee, C. Khazoom, and S. Kim\n(2024)\nCusadi: a gpu parallelization framework for symbolic expressions and optimal control\n.\nIEEE Robotics and Automation Letters\n.\nCited by:\n§\nIII-A\n.\n[10]\nJ. Kamohara, F. Wu, C. Wamorkar, S. Hutchinson, and Y. Zhao\n(2025)\nRL-augmented adaptive model predictive control for bipedal locomotion over challenging terrain\n.\narXiv preprint arXiv:2509.18466\n.\nCited by:\n§\nIV-C\n2\n.\n[11]\nM. Khadiv, A. Herzog, S. A. A. Moosavian, and L. Righetti\n(2020)\nWalking control based on step timing adaptation\n.\nIEEE Transactions on Robotics\n36\n(\n3\n),\npp. 629–643\n.\nCited by:\n§I\n,\n§I\n,\n§\nII-A\n,\n§\nIII-A\n2\n,\n§\nIII-A\n2\n.\n[12]\nZ. Li, X. B. Peng, P. Abbeel, S. Levine, G. Berseth, and K. Sreenath\n(2025)\nReinforcement learning for versatile, dynamic, and robust bipedal locomotion control\n.\nThe International Journal of Robotics Research\n44\n(\n5\n),\npp. 840–888\n.\nCited by:\n§I\n.\n[13]\nQ. Liao, T. E. Truong, X. Huang, G. Tevet, K. Sreenath, and C. K. Liu\n(2025)\nBeyondmimic: from motion tracking to versatile humanoid control via guided diffusion\n.\narXiv preprint arXiv:2508.08241\n.\nCited by:\n§I\n.\n[14]\n(\n2025\n)\nLimx Oli\n.\nNote:\nhttps://www.limxdynamics.com/en/oli\nAccessed: July 30, 2025\nCited by:\n§\nIV-A\n.\n[15]\nJ. Long, J. Ren, M. Shi, Z. Wang, T. Huang, P. Luo, and J. Pang\n(2025)\nLearning humanoid locomotion with perceptive internal model\n.\nIn\n2025 IEEE International Conference on Robotics and Automation (ICRA)\n,\npp. 9997–10003\n.\nCited by:\n§I\n,\n§\nII-B\n.\n[16]\nL. Penco, B. Park, S. Fasano, N. Poddar, S. McCrory, N. Kitchel, T. Bialek, D. Anderson, D. Calvert, and R. Griffin\n(2025)\nAnticipatory and adaptive footstep streaming for teleoperated bipedal robots\n.\nIn\n2025 IEEE-RAS 24th International Conference on Humanoid Robots (Humanoids)\n,\npp. 1–8\n.\nCited by:\n§I\n.\n[17]\nT. Peng, L. Bao, and C. Zhou\n(2025)\nGait-conditioned reinforcement learning with multi-phase curriculum for humanoid locomotion\n.\narXiv preprint arXiv:2505.20619\n.\nCited by:\n§I\n.\n[18]\nJ. Ren, T. Huang, H. Wang, Z. Wang, Q. Ben, J. Long, Y. Yang, J. Pang, and P. Luo\n(2025)\nVb-com: learning vision-blind composite humanoid locomotion against deficient perception\n.\narXiv preprint arXiv:2502.14814\n.\nCited by:\n§I\n,\n§\nII-B\n.\n[19]\nA. Shamsah, Z. Gu, J. Warnke, S. Hutchinson, and Y. Zhao\n(2023)\nIntegrated task and motion planning for safe legged navigation in partially observable environments\n.\nIEEE Transactions on Robotics\n39\n(\n6\n),\npp. 4913–4934\n.\nCited by:\n§\nII-A\n.\n[20]\nY. Shi, S. Li, Y. Wu, J. Liu, X. Leng, X. Zang, and S. Piao\n(2025)\nBipedal robust walking on uneven footholds: piecewise slope lipm with discrete model predictive control\n.\narXiv preprint arXiv:2504.02255\n.\nCited by:\n§I\n,\n§\nII-A\n.\n[21]\nH. Song, H. Zhu, T. Yu, Y. Liu, M. Yuan, W. Zhou, H. Chen, and H. Li\n(2025)\nGait-adaptive perceptive humanoid locomotion with real-time under-base terrain reconstruction\n.\narXiv preprint arXiv:2512.07464\n.\nExternal Links:\nLink\nCited by:\n§\nIII-B\n2\n,\n§\nIII-B\n2\n,\n§\nIII-C\n,\n1st item\n,\n§\nIV-B\n.\n[22]\nW. Sun, B. Cao, L. Chen, Y. Su, Y. Liu, Z. Xie, and H. Liu\n(2025)\nLearning perceptive humanoid locomotion over challenging terrain\n.\narXiv preprint arXiv:2503.00692\n.\nCited by:\n§I\n,\n§\nII-B\n.\n[23]\nD. Wang, X. Wang, X. Liu, J. Shi, Y. Zhao, C. Bai, and X. Li\n(2025)\nMoRE: mixture of residual experts for humanoid lifelike gaits learning on complex terrains\n.\narXiv preprint arXiv:2506.08840\n.\nCited by:\n§\nII-B\n,\n3rd item\n.\n[24]\nH. Wang, Z. Wang, J. Ren, Q. Ben, T. Huang, W. Zhang, and J. Pang\n(2025)\nBeamdojo: learning agile humanoid locomotion on sparse footholds\n.\narXiv preprint arXiv:2502.10363\n.\nCited by:\n§\nII-B\n.\n[25]\nZ. Wang, W. Wei, R. Yu, J. Wu, and Q. Zhu\n(2024)\nToward understanding key estimation in learning robust humanoid locomotion\n.\nIn\n2024 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)\n,\npp. 11232–11239\n.\nCited by:\n§I\n.",
    "preview_text": "Running up stairs is effortless for humans but remains extremely challenging for humanoid robots due to the simultaneous requirements of high agility and strict stability. Model-free reinforcement learning (RL) can generate dynamic locomotion, yet implicit stability rewards and heavy reliance on task-specific reward shaping tend to result in unsafe behaviors, especially on stairs; conversely, model-based foothold planners encode contact feasibility and stability structure, but enforcing their hard constraints often induces conservative motion that limits speed. We present FastStair, a planner-guided, multi-stage learning framework that reconciles these complementary strengths to achieve fast and stable stair ascent. FastStair integrates a parallel model-based foothold planner into the RL training loop to bias exploration toward dynamically feasible contacts and to pretrain a safety-focused base policy. To mitigate planner-induced conservatism and the discrepancy between low- and high-speed action distributions, the base policy was fine-tuned into speed-specialized experts and then integrated via Low-Rank Adaptation (LoRA) to enable smooth operation across the full commanded-speed range. We deploy the resulting controller on the Oli humanoid robot, achieving stable stair ascent at commanded speeds up to 1.65 m/s and traversing a 33-step spiral staircase (17 cm rise per step) in 12 s, demonstrating robust high-speed performance on long staircases. Notably, the proposed approach served as the champion solution in the Canton Tower Robot Run Up Competition.\n\nFastStair: Learning to Run Up Stairs with Humanoid Robots\nYan Liu\n1,2\n,\nTao Yu\n2\n,\nHaolin Song\n4\n,\nHongbo Zhu\n2,5\n,\nNianzong Hu\n2\n,\nYuzhi Hao\n2,6\n,\nXiuyong Yao\n2\n,\nXizhe Zang\n1\n​\n†\n{}^{1\\text{\\textdagger}}\n,\nHua Chen\n2\n,\n3\n​\n†\n{}^{2,3\\text{\\textdagger}}\n,\nJie Zhao\n1\n* Work done at LimX Dynamics. Project lead: Tao Yu\n†\nCorresponding author\n1\nSchool of Mechanics Engineering, Harbin Institute of Technology (HIT), Harbin",
    "is_relevant": true,
    "relevance_score": 8.0,
    "extracted_keywords": [
        "Reinforcement Learning",
        "locomotion",
        "whole body control"
    ],
    "one_line_summary": "FastStair是一个结合模型规划与强化学习的框架，用于实现人形机器人快速稳定上楼梯，通过多阶段学习和LoRA集成优化运动控制。",
    "detailed_summary": "## FastStair：双足机器人楼梯奔跑学习框架详细摘要\n\n### 1. 研究背景和动机\n双足机器人在楼梯等非结构化地形上的**高速、稳定运动**是一个长期挑战。现有方法存在明显局限：基于模型的规划器（如DCM、MPC）虽能保证稳定性，但往往导致**保守、低速**的运动；而基于无模型强化学习（RL）的方法虽能生成动态步态，但依赖隐式稳定性奖励，在楼梯等复杂地形上容易产生**不安全行为**，且难以实现高速。因此，亟需一种能**融合模型安全性**与**学习敏捷性**优势的新框架。\n\n### 2. 核心方法和技术创新\n本文提出 **FastStair**，一个**规划器引导的多阶段学习框架**，其核心创新点包括：\n- **基于DCM的并行落脚点规划器**：将落脚点优化问题重构为**GPU并行的离散搜索**，计算开销极低（每步约4ms），能在RL训练循环中实时提供动态可行的落脚点引导，作为显式安全奖励。\n- **三阶段训练策略**：\n    1.  **预训练阶段**：利用规划器引导，训练一个**安全优先**的基础策略，学习在楼梯踏面中心落脚。\n    2.  **后训练阶段**：针对低速（[-0.3, 0.8] m/s）和高速（[0.8, 1.6] m/s）动作分布差异大的问题，将基础策略微调成**两个速度专家策略**，以提升速度跟踪精度。\n    3.  **LoRA微调阶段**：将两个专家策略的参数**整合到单一网络**中，并利用**低秩适应（LoRA）** 技术进行微调，消除直接切换导致的不稳定，最终得到一个能在全速度范围内平滑、鲁棒运行的**统一策略**。\n\n### 3. 主要实验结果\n在仿真与实物机器人（LimX Oli）上进行了全面验证：\n- **成功率与速度跟踪**：在25厘米高台阶的楼梯上，FastStair的**遍历成功率最高**，且**速度跟踪平均绝对误差最低**（约0.5 m/s），显著优于基线方法和AMP方法。\n- **实物部署性能**：机器人成功在户外楼梯（15-20厘米台阶）上实现了**全速度范围（0-1.5 m/s）的稳定上下楼**，并展现出**跨步（一步跨两阶）** 的敏捷行为。在“小蛮腰”登高赛中，以**1.65 m/s的峰值速度**在12秒内成功攀爬33级螺旋楼梯（17厘米/阶），赢得冠军。\n- **计算效率**：并行规划器相比传统并行MPC实现，带来约**25倍的训练加速**。\n\n### 4. 研究意义和价值\nFastStair成功**调和了模型规划的安全性与强化学习的敏捷性**之间的固有矛盾，为双足机器人在复杂地形上的**高速动态运动**提供了切实可行的解决方案。其提出的**“优化即搜索”并行规划范式**和**基于LoRA的多专家策略融合方法**，不仅实现了当前最快的双足机器人楼梯攀爬速度，也为**将模型先验紧密耦合到大规模仿真学习**提供了通用性思路，推动了双足机器人走向更复杂、实用的真实世界部署。",
    "qa_pairs": [
        {
            "question": "这篇论文的核心创新点是什么，他想解决什么问题，怎么解决的？",
            "answer": "## 论文核心分析：FastStair\n\n### **一、 拟解决的核心问题**\n论文旨在解决**人形机器人在楼梯上实现高速、稳定攀爬**这一长期存在的挑战。具体而言，它试图调和传统方法中存在的两个关键矛盾：\n1.  **敏捷性与稳定性的权衡**：\n    - **纯强化学习（RL）方法**：能生成动态运动，但依赖隐式的稳定性奖励，在楼梯等复杂地形上容易产生不安全行为，难以保证高速下的稳定。\n    - **基于模型的规划器方法**：通过硬约束（如落脚点可行性、捕获区域）提供明确的稳定性保证，但往往导致**保守的运动模式**，限制了机器人的速度和动态敏捷性。\n\n2.  **训练效率与实时性的矛盾**：将复杂的模型优化器直接集成到大规模并行RL训练循环中，会产生**难以承受的计算开销**。\n\n### **二、 核心创新点**\n论文提出了一个名为 **FastStair** 的**规划器引导、多阶段学习框架**，其创新性主要体现在以下四个层面：\n\n1.  **基于DCM的并行落脚点规划器作为显式稳定性引导**\n    - **技术创新**：采用**发散运动分量（DCM）模型**进行落脚点规划。相比主流方法（如ALIP-MPC），DCM模型允许解析表达和更简单的约束公式。\n    - **关键改进**：将传统的连续优化问题**重构为并行离散搜索问题**。通过向量化张量操作在GPU上执行，实现了**约25倍的训练加速**，使其能够以可忽略的计算开销实时集成到RL训练循环中。\n    - **作用**：在预训练阶段，通过一个高权重的“落脚点跟踪奖励”，引导RL策略探索**动态可行的安全落脚区域**（如楼梯踏面中心），从而编码了模型规划器的几何先验知识，奠定了安全基础。\n\n2.  **多阶段训练框架以克服规划器保守性**\n    - **问题识别**：单一策略难以在全速度范围（低速到高速）内高效跟踪指令，因为不同速度下的动作分布差异巨大。\n    - **解决方案**：\n        - **阶段一（预训练）**：使用规划器引导，训练一个**安全优先的基础策略**。\n        - **阶段二（后训练）**：通过调整奖励权重（降低落脚点跟踪权重，提高速度跟踪权重），将基础策略**微调成两个速度专家**：**低速专家**（-0.3 至 0.8 m/s）和**高速专家**（0.8 至 1.6 m/s）。这种“分而治之”的策略避免了单一策略在全范围训练时的模式崩溃。\n        - **阶段三（LoRA微调）**：为解决两个专家策略直接切换时产生的控制不连续和不稳定问题，创新性地将两个专家的参数**合并到一个统一网络中**，并利用**低秩自适应（LoRA）技术**进行微调。\n\n3.  **利用LoRA实现专家融合与平滑过渡**\n    - **技术创新**：将自然语言处理领域的**LoRA技术**引入机器人控制。在统一网络中，根据速度指令激活对应专家的LoRA分支进行推理。\n    - **作用**：LoRA微调平滑了高低速专家之间的过渡边界，最终产生一个**单一的、统一的策略**，能够在**全指令速度范围内实现鲁棒、平滑的控制**，消除了切换抖动。\n\n4.  **完整的系统集成与真实世界验证**\n    - **技术整合**：将上述学习框架与**实时感知（基于深度相机的局部高程地图重建）**、**仿真到现实迁移技术（域随机化）** 相结合。\n    - **实际价值**：在“Oli”全尺寸人形机器人上成功部署，无需额外调优。实现了：\n        - 高达 **1.65 m/s** 的楼梯攀爬速度。\n        - 在12秒内稳健攀爬**33级螺旋楼梯**（每级高17厘米）。\n        - 在“广州塔机器人登高比赛”中夺冠，证明了其**在复杂、长距离真实场景中的高性能和鲁棒性**。\n\n### **三、 解决方案总结**\n**FastStair通过“规划器引导安全 + 多阶段学习敏捷 + LoRA融合统一”的三步走策略，系统性地解决了人形机器人高速上楼梯的难题。**\n\n1.  **用模型规划器解决“探索不安全”问题**：将DCM规划器重构为GPU并行搜索，高效地为RL提供明确的动态可行性指导，确保策略学习安全的落脚行为。\n2.  **用多阶段专家策略解决“规划太保守”问题**：先学安全，再针对速度分化学习，打破单一策略的性能瓶颈，解锁高速敏捷性。\n3.  **用LoRA融合解决“专家切换不稳定”问题**：将多个专家智能体“软化”为一个可自适应调整的统一网络，保证全速域控制的平滑与稳定。\n\n这项工作的核心价值在于，它**不是简单地结合模型与学习，而是设计了一个精巧的框架，让两者优势互补**：模型规划器提供了RL初期探索所需的关键安全引导，而RL又通过学习和微调，突破了模型规划器固有的保守性极限，最终实现了超越任何单一方法的性能。",
            "timestamp": "2026-01-20T17:57:49.007446",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "基于他的前作，梳理这个方向的整个发展脉络，每一步相比于之前的工作都改进了什么，着重于几个不同的发展方向。",
            "answer": "## 基于前作的FastStair发展脉络分析\n\n本文提出的FastStair框架并非孤立存在，而是建立在近年来人形机器人楼梯行走研究的一系列关键工作之上。其发展脉络清晰地沿着几个互补的方向演进：**从纯模型方法到纯学习方法的探索，再到两者结合的尝试，最终聚焦于解决结合后产生的“保守性”与“敏捷性”矛盾**。以下是基于论文内容及相关引文的梳理：\n\n### 发展脉络与核心改进\n\n整个方向的发展可以概括为三个阶段，每个阶段都试图解决前一个阶段的核心瓶颈。\n\n#### 第一阶段：模型主导，安全但保守\n*   **代表工作**：基于DCM（发散运动分量）[11] 或ALIP（角动量线性倒立摆）[1, 2, 20] 的模型预测控制（MPC）步态规划器。\n*   **核心思想**：将接触可行性、平衡准则等编码为明确的运动学/动力学约束，通过求解优化问题来规划落脚点。\n*   **优点**：提供**明确的稳定性保证**，在离散地形（如楼梯）上安全性高。\n*   **局限性（即待改进点）**：\n    1.  **保守性**：为确保实时计算可行，常采用简化模型（如线性倒立摆）和保守的安全边界，这**限制了可达解空间**，导致动作保守，无法实现高速敏捷运动。\n    2.  **计算与集成瓶颈**：传统的序列化CPU优化求解器无法与大规模并行RL训练框架兼容，限制了其在学习框架中的应用。\n\n#### 第二阶段：学习主导，敏捷但脆弱\n*   **代表工作**：基于深度强化学习（RL）的端到端[15, 22] 或残差学习[5, 6, 18] 方法。\n*   **核心思想**：利用RL直接从传感器输入学习控制策略，最大化包含任务奖励（如速度跟踪）和隐式稳定性奖励（如存活、姿态）的回报函数。\n*   **优点**：在平坦地形上能展现出**惊人的动态性和敏捷性**[12]。\n*   **局限性（即待改进点）**：\n    1.  **隐式安全的不确定性**：稳定性依赖于启发式奖励项的“鼓励”而非“保证”。在楼梯等复杂地形上，**任务奖励（高速）与稳定性奖励常发生冲突**，导致策略为追求速度而牺牲安全，行为脆弱。\n    2.  **探索瓶颈**：在离散地形上，纯RL面临严重的探索困难，难以自发学会寻找安全落脚点。\n    3.  **性能天花板**：许多工作[7, 15, 22] 为保安全而过度加权稳定性项，**主动放弃了高速运动的潜力**。\n\n#### 第三阶段：模型与学习结合，寻求平衡\n这是当前的主流方向，FastStair是其中的杰出代表。该阶段致力于融合前两阶段的优点，但不同研究侧重点不同：\n\n1.  **方向一：用模型指导学习，提升安全性**\n    *   **核心改进**：引入模型规划器为RL提供**明确的、基于几何的引导**，将探索偏向动态可行的安全区域。\n    *   **FastStair的贡献**：\n        *   **算法选择**：采用**基于DCM的规划器**，因其有解析解，便于约束表述，更容易转化为离散搜索问题。\n        *   **计算范式革新**：将规划器的优化问题**重构为GPU并行的离散搜索**，通过向量化张量操作实现。相比传统的并行优化求解器[9, 10]，**训练速度提升约25倍**，解决了模型方法集成到并行RL中的计算开销瓶颈。\n        *   **引导方式**：将规划出的最优落脚点作为特权信息引入观察空间，并设计专门的**落脚点跟踪奖励**，在预训练阶段强制策略学习安全接触模式。\n\n2.  **方向二：多阶段训练与专家策略，克服保守性并提升性能**\n    *   **问题意识**：单纯的模型引导会将规划器的**保守性传递给学习策略**，导致策略安全但不够敏捷，速度跟踪性能差。\n    *   **FastStair的贡献**：\n        *   **分而治之**：观察到高速与低速运动下的动作分布存在显著差异。提出**多阶段框架**：先预训练一个**安全优先的基策略**；然后将其微调成**高速专家**和**低速专家**，分别优化不同速度区间的性能。\n        *   **性能验证**：实验表明，直接训练单一策略覆盖全速度范围会导致模式崩溃，性能下降。而专家策略能显著提升在各自区间的速度跟踪精度和成功率。\n\n3.  **方向三：策略集成与平滑，实现鲁棒部署**\n    *   **问题意识**：在部署中直接根据速度命令切换两个专家策略会导致**控制不连续和抖动**，引发物理不稳定。\n    *   **FastStair的贡献**：\n        *   **创新性集成方法**：引入**低秩自适应（LoRA）** 技术。将两个专家网络的参数合并到一个统一网络中，并在其分支上添加LoRA层进行微调。\n        *   **效果**：这产生了一个**单一、统一的策略**，能够**在全指令速度范围内平滑过渡**，消除了切换不稳定，同时保留了专家各自的性能优势。\n\n4.  **方向四：与基于先验的方法对比，凸显几何引导的优势**\n    *   **对比对象**：如AMP（对抗性运动先验）[23] 等方法，使用**人体运动重定向**作为参考来引导RL，以生成更自然的步态。\n    *   **FastStair的差异化优势**：\n        *   **原理不同**：FastStair依赖的是**基于物理模型的几何可行性先验**，而非人体运动数据先验。\n        *   **性能表现**：实验表明，在高速（>1.0 m/s）楼梯爬升任务中，AMP方法性能急剧下降，甚至不如无引导的基线。原因是人体数据集中缺乏高速爬楼样本（分布偏移），且其奖励结构对偏离参考动作的惩罚限制了激进机动。而FastStair的**模型引导与速度专家设计使其在高速和超分布（2.0 m/s）场景下仍保持高成功率**。\n\n### 总结\nFastStair的发展脉络清晰地展示了人形机器人复杂地形 locomotion 研究的演进逻辑：从**模型与学习各自为政**，到**简单结合**，再到**深度、高效、精巧的融合**。其核心改进在于：\n1.  **计算层面**：通过“优化即搜索”范式，实现了模型引导与大规模并行RL的**高效紧耦合**。\n2.  **算法层面**：通过**多阶段训练与LoRA集成**，系统性地解决了“引导导致保守”和“专家切换不稳”这两个结合范式中的关键难题。\n3.  **性能层面**：在真实机器人上实现了**高达1.65 m/s的稳定楼梯奔跑**，并在国际竞赛中验证了其优越性，标志着该方向从理论方法到高性能工程实现的重大进步。\n\n未来的发展方向，正如文中所指，是将这种**并行规划范式推广到更广泛的挑战性地形**，并探索**耦合模型先验与大规模RL的通用方法论**，以实现在复杂非结构化环境中的可靠部署。",
            "timestamp": "2026-01-20T17:58:43.978867",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他的前作有哪些？使用表格仔细讲讲他的每篇前作，他和前作的区别是什么，主要改善是什么？着重于具体相比于之前文章的改动",
            "answer": "## FastStair 论文的前作分析\n\n根据论文内容，FastStair 框架建立在作者团队先前的研究工作之上，特别是引用了 `[21]` 作为其网络架构和部分方法的基础。以下是对其核心前作的详细分析。\n\n### 前作核心论文：`[21]` Gait-adaptive Perceptive Humanoid Locomotion with Real-time Under-base Terrain Reconstruction\n\n| 特征维度 | 前作 `[21]` 的内容与特点 | FastStair 的改进与区别 | 主要改善点 |\n| :--- | :--- | :--- | :--- |\n| **核心目标** | 实现**适应性地形的感知运动**，重点在于利用实时重建的地形图进行稳健的行走，适用于粗糙、不平坦的地面。 | 专门针对**高速上下楼梯**这一极具挑战性的任务进行优化，追求在严格稳定性下的高敏捷性。 | **任务聚焦**：从通用的地形适应转向解决楼梯场景中速度与稳定性的固有矛盾。 |\n| **方法框架** | **端到端强化学习 (RL)**。采用 Actor-Critic 架构，奖励函数设计用于鼓励速度跟踪、平衡、动作平滑等。依赖**隐式的稳定性奖励**（如姿态、重力投影）。 | **规划器引导的多阶段学习框架**。在RL循环中集成了**基于DCM的并行落脚点规划器**，为学习提供**显式的稳定性指导**。 | **架构革新**：引入了**模型规划器**作为学习过程的先验和引导，将显式的动态可行性约束与数据驱动的策略学习相结合。 |\n| **稳定性保障** | 完全依赖RL策略通过奖励函数学习到的隐式平衡能力。在极端地形（如高台阶）上，隐式奖励可能与速度目标冲突，导致策略脆弱或不安全。 | 通过**并行落脚点规划器**提供显式指导。规划器基于简化动力学模型（VHIP/DCM）计算动态可行的落脚区域，并通过一个专门的**落脚点跟踪奖励** (`r_foot`) 强烈引导策略朝向安全区域探索。 | **安全性提升**：将模型预测的“硬”约束转化为RL的“软”引导，显著提高了在离散、高风险地形（楼梯边缘）上的探索效率和最终策略的鲁棒性。 |\n| **训练策略** | 单阶段训练。在包含多种地形的课程中训练一个统一的策略。 | **三阶段训练流程**：<br>1. **预训练**：用高权重的落脚点跟踪奖励训练一个**安全优先的基础策略**。<br>2. **后训练**：将基础策略微调为**高速**和**低速**两个专家策略，以解决单一策略在全速度范围跟踪上的分布差异问题。<br>3. **LoRA微调**：将两个专家集成到一个网络中，使用LoRA进行微调，得到**平滑过渡的统一策略**，消除直接切换带来的控制不连续性。 | **性能优化**：<br>1. **解耦学习目标**：先学安全，再学速度，避免了目标冲突。<br>2. **专家分工**：针对不同速度区间的动力学特性进行专门优化。<br>3. **策略融合**：利用LoRA实现专家知识的无缝整合，获得全速域平滑、高性能的最终策略。 |\n| **计算与规划** | 感知部分实时重建机器人下方的地形高程图。**没有集成模型预测控制器(MPC)**，规划完全由学习策略隐式完成。 | **创新性地将规划器并行化并嵌入RL训练循环**。将DCM落脚点优化问题**重构为并行离散搜索**，利用GPU张量操作实现，计算开销极低（每步~4ms），相比传统并行MPC实现提速约**25倍**。 | **训练效率**：解决了在并行RL环境中集成实时优化的计算瓶颈问题，使得“规划引导RL”的模式在大规模训练中变得可行。 |\n| **实验验证** | 在仿真和实物机器人上展示了在粗糙地面、斜坡、低台阶等复杂地形上的稳健行走和速度跟踪能力。 | **专注于楼梯性能**：在仿真和实物上系统验证了高速（高达1.65 m/s）上下楼梯的能力，成功挑战了33级螺旋楼梯。在**广州塔机器人登楼比赛**中夺冠。定量实验表明，其**地形穿越成功率和速度跟踪误差均显著优于前作及AMP等基线方法**。 | **任务性能突破**：实现了人形机器人高速、稳定爬楼梯这一标志性进展，证明了所提框架在解决特定高难度任务上的优越性。 |\n\n### 总结：FastStair 相对于前作的核心改动与提升\n\n1.  **问题定义升级**：从前作的“复杂地形稳健行走”聚焦到更具挑战性的“**高速楼梯运动**”，直面敏捷性与稳定性的核心矛盾。\n2.  **方法论融合**：从“纯学习”转向“**规划引导学习**”。关键创新是引入了**基于DCM的并行落脚点规划器**作为显式安全先验，并通过**优化转搜索**技术使其与大规模并行RL训练兼容。\n3.  **训练流程精细化**：设计了**三阶段训练框架**（安全预训练 -> 速度专家化 -> LoRA统一），系统化地解决了单一策略在兼顾安全与高速时的局限性，以及专家切换的稳定性问题。\n4.  **性能显著提升**：在楼梯任务上，无论是成功率、速度上限还是速度跟踪精度，都实现了对前作及主流方法的超越，并通过实物部署验证了其实际应用价值。\n\n**本质区别**：前作 `[21]` 代表了利用感知实现稳健地形适应的先进纯RL方法；而 **FastStair 是专为突破极限性能任务（高速爬楼）设计的、融合模型与学习优势的下一代框架**，其改进是系统性和根本性的。",
            "timestamp": "2026-01-20T17:59:27.409056",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文提出了哪些关键技术方法，请列表格具体详细说明技术细节，需要包含具体的数学原理推导，以及具体参数。",
            "answer": "## FastStair 关键技术方法分析\n\n该论文提出了一种名为 **FastStair** 的规划引导、多阶段学习框架，旨在解决人形机器人高速上楼梯时面临的**敏捷性与稳定性**的核心矛盾。其关键技术方法通过整合模型规划与强化学习，并采用分阶段训练与模型融合策略来实现。\n\n以下是关键技术方法的详细说明表格：\n\n| 技术方法 | 核心目标 | 技术细节与数学原理 | 具体参数/实现 |\n| :--- | :--- | :--- | :--- |\n| **1. 基于DCM的并行落脚点规划器** | 为RL训练提供**显式的动态可行性与稳定性引导**，将优化问题转化为高效的GPU并行搜索。 | **a. 动力学模型：** 采用**变高度倒立摆（VHIP）** 模型以适应楼梯地形。动力学方程为：<br> `\\ddot{x} = \\omega^2 x`， 其中 `x` 为质心(CoM)水平位置， `\\omega = \\sqrt{g / z(t)}` 为时变自然频率， `z(t) = kt + z_0` 为线性变化的CoM高度。<br>**b. DCM定义与近似：** 发散运动分量定义为 `\\xi = x + \\dot{x}/\\omega`。对其求导并代入动力学方程，得到精确演化：<br> `\\dot{\\xi} = a\\omega\\xi + (1-a)\\omega x`， 其中 `a = 1 + k/(2\\sqrt{gz})`。<br> 由于楼梯坡度通常 `k ∈ [-1, 1]`， `a ≈ 1`，因此可简化为近似线性时变系统：<br> `\\dot{\\xi} ≈ \\omega\\xi`， 其解为 `\\xi(t) = \\xi_0 e^{\\int_0^t \\omega(\\tau)d\\tau} = \\xi_0 e^{\\sigma(t)}`。<br>**c. 优化问题转化为搜索：** 基于简化DCM动力学，落脚点规划被表述为一个带约束的优化问题（式2-4），目标是找到最优落脚点 `u_T` 和DCM偏移 `b`，最小化与标称目标的距离及地形陡度代价 `S(u_T)`。**关键创新**在于利用等式约束 `u_T + b = \\xi_t e^{\\sigma(T)-\\sigma(t)}`，为离散候选点集 `P` 中的每个点解析计算对应的 `b`，从而将整个优化评估转化为在GPU上对候选点成本函数的**并行向量化计算**，最后通过 `argmin` 选取最优点。 | - **地形感知范围：** `1.8m × 1.2m` 的局部高程图，分辨率 `5cm`。<br>- **搜索窗口：** 以标称落脚点 `[L_nom, W_nom]^T` 为中心的 `0.6m × 0.6m` 区域。<br>- **陡度评分 `S(u_T)`：** 使用Sobel算子计算高程图梯度，再通过卷积核（与脚掌尺寸匹配）进行局部聚合，得到地形陡度成本图。<br>- **计算效率：** 在NVIDIA RTX 4090上，对4096个并行环境进行单步规划延迟约 **4ms**，相比传统并行MPC实现加速约 **25倍**。 |\n| **2. 多阶段强化学习框架** | 分阶段解决**安全性引导、速度追踪精度提升、全速域平滑控制**的问题，避免单一策略的局限性。 | **a. 预训练阶段（安全基础策略）：** <br>   - **目标：** 优先保证穿越楼梯的**稳定性**。<br>   - **方法：** 在奖励函数中赋予**落脚点跟踪奖励** `r_foot = exp(-10 * ||p_f - p_f^d||)` 极高的权重（0.6）。其中 `p_f^d` 是基于规划器输出落脚点 `u_T` 和地形高度 `h_z` 通过贝塞尔曲线插值生成的期望摆动脚轨迹。<br>   - **效果：** 策略学会将脚放置在楼梯踏面中心等安全区域，但速度跟踪精度较差。<br><br>**b. 后训练阶段（速度专家策略）：** <br>   - **目标：** 在安全基础上，提升**速度跟踪精度**和**高速运动能力**。<br>   - **方法：** 调整奖励权重（见表I），降低落脚点跟踪权重（0.5→0.4），提高线速度跟踪权重（1.0→1.35）。将指令速度空间划分为**低速区** `[-0.3, 0.8] m/s` 和**高速区** `[0.8, 1.6] m/s`，分别从预训练策略微调出两个**专家策略**。这是因为高速与低速运动对应的关节动作分布差异显著，单一策略易导致模式坍缩。<br><br>**c. LoRA微调阶段（统一策略）：** <br>   - **目标：** 消除两个专家策略直接切换导致的**控制不连续**和**抖动**。<br>   - **方法：** 将两个专家网络的参数合并到一个统一网络中，并在其分支上添加**低秩适应（LoRA）层**。然后使用覆盖全速域 `[-0.3, 1.6] m/s` 的指令对该统一网络进行微调。LoRA允许高效地调整合并后的模型，平滑不同速度区间的过渡。部署时，根据指令速度 `v_x^d` 是否大于 `0.8 m/s` 来激活相应专家分支。 | - **网络架构：** 沿用Actor-Critic架构，观测空间包含本体感知、特权信息（如规划器输出的最优落脚点）和以机器人为中心的局部高程图。<br>- **训练规模：** 在IsaacLab中并行4096个环境，步频 `[1.0, 1.5] Hz`，指令每10秒重采样。<br>- **奖励权重：** 关键权重变化见论文表I（如线速度跟踪、落脚点跟踪、投影重力等权重的阶段性调整）。<br>- **LoRA参数：** 微调时设置 `α=16`, `γ=8`。 |\n| **3. 感知与部署流水线** | 实现从仿真到实物的**零次迁移（Zero-Shot Sim2Real）**，为策略提供实时的地形感知。 | **a. 高程图重建：** <br>   - **仿真中：** 直接从IsaacLab接口获取真实地形高度样本。<br>   - **实物上：** 使用Intel RealSense D435i深度相机。实时处理深度帧，重建以机器人为中心的 `1.8m × 1.2m` 局部地形网格（分辨率5cm），生成“地形散点”作为策略的感知输入。<br><br>**b. 分布式计算部署：** <br>   - **感知模块：** 在NVIDIA Jetson Orin NX上运行，处理深度图像并生成高程图。<br>   - **控制模块：** 在Rockchip RK3588单板计算机上运行，接收高程图并执行统一策略，控制频率为 **100 Hz**。 | - **机器人平台：** LimX Oli人形机器人，身高1.65m，体重55kg，31个驱动自由度。<br>- **控制频率：** 100 Hz。<br>- **感知硬件：** Intel RealSense D435i 深度相机。 |\n\n### **技术创新与实际价值总结**\n\n1.  **规划与学习的深度融合**： 将**模型化DCM规划器**的显式稳定性保证，通过“优化即搜索”的并行化形式，无缝嵌入**模型无关RL**的训练循环中作为引导信号。这解决了纯RL在复杂地形上探索效率低、安全性差的问题。\n2.  **解决“引导即保守”的悖论**： 通过**多阶段训练**策略，先利用规划器学得“安全基础”，再通过**奖励重加权**和**速度区间划分**培养“高速专家”，最后用**LoRA技术**将专家平滑融合。这打破了传统规划引导RL导致的敏捷性上限，实现了安全与速度的兼得。\n3.  **极高的系统效率与工程可行性**： 规划器GPU并行化带来25倍加速，使在线引导训练成为可能；多专家LoRA融合方案计算量小，适合在**嵌入式平台（RK3588）** 上实时运行，最终在实物机器人上实现了高达 **1.65 m/s** 的稳定上楼梯速度，并在广州塔爬楼比赛中获胜，证明了其强大的实际应用价值。",
            "timestamp": "2026-01-20T18:00:30.152359",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他使用了哪些评价指标与数据集，列表格具体讲讲他的评价指标的细节与数据集的细节",
            "answer": "## 论文《FastStair: Learning to Run Up Stairs with Humanoid Robots》的评价指标与数据集分析\n\n本文通过**仿真实验**和**真实世界部署**来评估所提出的FastStair框架。其评价指标主要围绕**任务成功率**、**运动控制精度**和**计算效率**三个方面。数据集则主要是在仿真环境中构建的**多样化训练课程**和用于评估的**特定测试场景**。\n\n### 一、 主要评价指标\n\n| 指标类别 | 具体指标 | 计算方式 / 定义 | 评估目的与细节 |\n| :--- | :--- | :--- | :--- |\n| **任务成功率** | 地形穿越成功率 (Terrain Traversal Success Ratio) | `成功环境数 / 总环境数`。在仿真中，初始化大量机器人，命令其穿越地形。成功定义为：在 episode 内到达地形远端且未摔倒。 | **核心性能指标**。用于衡量策略在**高难度楼梯**（25cm阶高）上，在不同指令速度（0.5, 1.0, 1.5, 2.0 m/s）下的**整体鲁棒性**。该指标直接反映了方法在安全性与敏捷性之间的平衡能力。 |\n| **运动控制精度** | 1. 速度跟踪平均绝对误差 (Velocity-Tracking MAE) | `MAE = mean( | 实际前向速度 - 指令前向速度 | )`。在固定楼梯上，指令速度周期性变化，计算整个过程的跟踪误差。 | 评估策略**精确执行速度命令**的能力。较低的MAE表明策略能更好地响应用户指令，是实现**高速、可控**爬楼梯的关键。论文特别对比了不同方法在此指标上的差异。 |\n| | 2. 落脚点跟踪误差 (Foothold-Tracking Error) | 计算**执行落脚点**与**规划器生成的期望落脚点**之间的**平均平面欧氏距离**。 | 用于量化**模型规划器对RL策略的引导效果**。在预训练阶段，此误差较小，表明策略学会了跟随安全落脚点；在最终策略中，此误差可能增大，以换取更高的速度跟踪精度，体现了设计中的权衡。 |\n| **计算效率** | 1. 规划器计算延迟 (Planner Latency) | 测量完整规划管线（包括高程图处理和并行离散搜索）处理**一个批次（4096个环境）** 所需的时间（约4ms）。 | 证明所提出的 **“优化转搜索”** 改革的有效性。该指标表明，将基于DCM的优化问题重构为GPU并行的离散搜索，能实现**近实时**的规划指导，且对大规模并行RL训练**开销可忽略**。 |\n| | 2. 训练加速比 (Training Speedup) | 与使用传统并行MPC求解器（如CusADi）的方法进行对比，获得约 **25倍的加速**。 | 强调方法在**工程实践上的优势**，使得将复杂的模型规划器集成到RL训练循环中变得可行，解决了传统方法计算开销过大的瓶颈。 |\n| **真实世界性能** | 1. 达成速度 (Achieved Speed) | 在真实机器人上成功执行爬楼梯任务时的**实测最高速度**（如1.65 m/s）。 | **最终验证指标**。证明仿真训练的策略能直接迁移到真实复杂环境（如广州塔螺旋楼梯），并实现**人类级别的敏捷速度**，具有极高的实际应用价值。 |\n| | 2. 任务完成时间 (Task Completion Time) | 完成特定楼梯挑战的**总耗时**（如33级楼梯用时12秒）。 | 直观展示方法在**长距离、连续楼梯**环境下的**高效性和耐力**，综合反映了速度、稳定性和鲁棒性。 |\n\n### 二、 使用的数据集/训练环境\n\n本文没有使用静态的离线数据集，而是依赖于在仿真器中动态生成的**训练课程**和**评估场景**。\n\n| 环境类型 | 具体构成 | 目的与细节 |\n| :--- | :--- | :--- |\n| **训练课程 (Training Curriculum)** | 在 **IsaacLab** 仿真器中构建，包含：<br>1. **平坦地面**<br>2. **崎岖地形**<br>3. **金字塔形楼梯**（包含上行和下行） | **用于策略的多阶段训练**。<br>- **多样性**：确保策略能泛化到不同地形，而不仅仅是楼梯。<br>- **课程学习**：从简单地形开始，逐步增加难度，促进稳定学习。<br>- **域随机化**：对机器人质量、惯性、摩擦、关节增益、外部扰动等进行随机化，以**缩小仿真与现实差距**。 |\n| **评估测试集 (Evaluation Testbeds)** | 1. **仿真测试楼梯**：<br>   - **25cm阶高楼梯**：用于系统性的成功率与速度跟踪误差评估。<br>   - **15cm阶高楼梯**：在MuJoCo中用于验证全速度范围的跟踪性能。<br>2. **真实世界测试场**：<br>   - **15cm阶高户外楼梯**：进行全速度范围（0-1.5 m/s）的爬升/下降测试。<br>   - **20cm阶高楼梯**：测试更陡峭地形的性能。<br>   - **广州塔螺旋楼梯**：33级，17cm阶高，作为终极挑战。 | **用于定量与定性评估**。<br>- **仿真测试**：提供可控、可重复的定量比较基准，用于**消融实验**和与基线方法（如纯RL基线、AMP方法）的公平对比。<br>- **真实世界测试**：最终验证策略的**实际部署能力**、**感知系统**（RealSense D435i深度相机）的可靠性以及整套系统的**工程完备性**。证明方法解决了sim-to-real转移问题。 |\n\n### 总结\nFastStair 的评价体系非常全面，**兼顾了学术研究的严谨性与工程应用的实用性**：\n- **指标上**，不仅有关键的**成功率**和**控制精度**指标，还创新性地引入了**规划器计算效率**指标，凸显了其方法在实现“规划引导RL”时的核心技术贡献。\n- **数据/环境上**，通过精心设计的**仿真课程**和**多维度测试集**，确保了策略的泛化能力和评估结果的可靠性，最终通过**极具挑战性的真实世界演示**证明了其卓越的实际价值。",
            "timestamp": "2026-01-20T18:01:17.251390",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文在哪些数据集上进行了实验？主要的评估指标和性能提升是多少？",
            "answer": "## 论文实验数据集、评估指标与性能提升分析\n\n### 一、 实验数据集与平台\n论文主要在**仿真环境**和**真实机器人平台**上进行实验，未使用传统意义上的“数据集”，而是构建了多样化的训练与测试场景。\n\n#### 1. 仿真训练环境 (IsaacLab)\n- **训练地形**：构建了包含**平地、崎岖地形、金字塔形楼梯（上下行）** 的课程化训练场景。\n- **关键参数**：\n    - 并行4096个环境。\n    - 步态频率约束在 `[1.0, 1.5]` Hz。\n    - 指令速度范围根据训练阶段调整（详见下文）。\n    - 应用了广泛的**域随机化**（质量、惯性、摩擦、恢复系数、关节PD增益、外部扰动等）以缩小仿真与现实差距。\n\n#### 2. 仿真评估环境\n- **IsaacLab / IsaacSim**：用于**成功率**和**足部落点跟踪**评估。\n    - **测试楼梯**：25 cm台阶高度的金字塔形楼梯。\n- **MuJoCo**：用于**全范围速度跟踪**验证。\n    - **测试楼梯**：15 cm台阶高度的楼梯。\n\n#### 3. 真实世界部署平台\n- **机器人**：全尺寸人形机器人 **LimX Oli** (高1.65m，重55kg，31个自由度)。\n- **测试楼梯**：\n    - 15 cm台阶高度的户外楼梯（用于全速度范围爬升/下降测试）。\n    - 20 cm台阶高度的楼梯（用于连续爬升测试）。\n    - **广州塔螺旋楼梯**：33级，每级高17 cm（用于长距离、高速性能展示）。\n- **感知系统**：使用Intel RealSense D435i深度相机实时重建以机器人为中心的**局部高程图**（1.8m × 1.2m，分辨率5cm）。\n\n### 二、 主要评估指标\n论文采用了以下核心指标来量化性能：\n\n1.  **地形穿越成功率**：在指定速度指令下，机器人成功到达地形远端且未跌倒的环境比例。这是衡量**稳定性与鲁棒性**的核心指标。\n2.  **速度跟踪平均绝对误差**：指令速度与实际速度之间的MAE。用于评估**控制精度与敏捷性**。\n3.  **足部落点跟踪误差**：规划的理想落点与策略实际执行落点之间的平均平面欧氏距离。用于验证**模型引导的有效性**。\n4.  **计算效率**：规划模块的延迟，用于评估框架的**实时性与可扩展性**。\n5.  **实际表现**：在真实机器人上达到的**最高爬升速度**和**穿越长楼梯所需时间**。\n\n### 三、 性能提升与实验结果\nFastStair框架相比基线方法在多个维度上取得了显著提升。\n\n#### 1. 成功率与稳定性（核心优势）\n- **对比方法**：\n    - **Baseline**：无模型引导的端到端RL策略。\n    - **Pre-trained (Ablation)**：仅使用DCM引导预训练的策略（阶段1）。\n    - **AMP**：使用对抗运动先验（人类运动重定向）引导的策略。\n    - **FastStair (Ours)**：完整的三阶段框架。\n- **结果**（在25cm台阶、不同指令速度下）：\n    - **FastStair在所有测试速度下均取得最高成功率**。\n    - 即使在**超出训练范围**的 `2.0 m/s` 指令下，成功率仍超过 **70%**，展现了出色的泛化能力。\n    - **Pre-trained**策略也显著优于Baseline，证明了模型引导对安全性的提升。\n    - **AMP**在低速(`≤1.0 m/s`)表现尚可，但在高速下性能急剧下降，甚至不如Baseline，表明其在高速敏捷运动上存在局限性。\n\n#### 2. 速度跟踪精度\n- **结果**：FastStair实现了**最低的速度跟踪MAE（约0.5 m/s）**。\n- **分析**：\n    - **Pre-trained**策略的MAE略高于Baseline，这符合设计预期：预训练阶段为保障安全（强调足部跟踪）牺牲了部分速度跟踪精度。\n    - 后续的专家微调和LoRA融合阶段成功**恢复了速度跟踪精度**，同时保持了安全性，验证了多阶段框架的必要性。\n    - **AMP**的MAE最大，因其在高速指令下易出现停滞行为。\n\n#### 3. 计算效率\n- **并行足部规划器**将优化问题重构为并行离散搜索，利用GPU张量操作。\n- **性能**：在NVIDIA RTX 4090上，处理4096个环境的批量规划，延迟仅约 **4 ms/步**。\n- **提升**：相比使用CusADi的并行MPC实现，获得了约 **25倍的加速**，使得在RL训练循环中集成实时规划指导成为可能，且开销可忽略不计。\n\n#### 4. 真实世界部署性能（实际价值体现）\n- **高速爬升**：在15cm台阶上实现稳定爬升，速度高达 **1.5 m/s**；在广州塔楼梯上峰值速度达 **1.65 m/s**。\n- **长距离穿越**：在 **12秒内** 成功穿越 **33级** 螺旋楼梯，展示了在长楼梯场景下的**高效性与耐久性**。\n- **复杂机动**：成功完成了楼梯上的**动态转向**和**20cm高台阶的连续爬升**。\n- **部署效率**：策略在板载计算机(RK3588)上以 **100 Hz** 频率实时运行，无需针对真实世界进行额外的任务级微调，证明了优秀的**Sim2Real迁移能力**。\n\n### 总结\nFastStair通过创新的**多阶段学习框架**和**GPU并行的模型引导**，在**仿真**和**真实世界**的楼梯地形上，全面超越了现有方法。其核心性能提升体现在：\n- **稳定性**：穿越成功率最高。\n- **敏捷性**：速度跟踪最精准，实现高速运动（>1.5 m/s）。\n- **效率**：规划计算加速25倍，现实任务完成时间短（33级/12秒）。\n- **实用性**：在复杂、长距离的真实楼梯场景中表现稳健，获得了**广州塔机器人爬楼比赛的冠军**，凸显了其突出的实际应用价值。",
            "timestamp": "2026-01-20T18:02:02.451837",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文的主要局限性有哪些？未来可能的改进方向是什么？",
            "answer": "## 论文《FastStair》的主要局限性及未来改进方向分析\n\n### 一、主要局限性\n\n1.  **模型简化带来的近似误差**：\n    - 在基于**发散运动分量（DCM）**的立足点规划器中，为了将优化问题转化为高效的并行离散搜索，对动力学模型进行了关键简化（假设系数 `a ≈ 1`）。这虽然大幅提升了计算效率，但本质上是一种**启发式近似**，可能在高动态、大坡度或非标准楼梯场景下引入规划误差，影响理论上的最优性或鲁棒性边界。\n\n2.  **感知系统的依赖与潜在瓶颈**：\n    - 整个框架严重依赖**实时局部高程图**的精确重建。论文中使用的Intel RealSense D435i深度相机在强光、反光、透明或纹理缺失的楼梯表面可能失效，且感知延迟（尽管文中提到约4ms）在极端高速（如接近1.65 m/s）下可能成为系统稳定性的潜在瓶颈。感知误差会直接传导至规划器和策略。\n\n3.  **专家策略切换的逻辑依赖**：\n    - 最终的统一策略虽然通过LoRA实现了平滑过渡，但其底层仍依赖于一个**基于规则的速度切换器**（以0.8 m/s为阈值）。这种硬编码的切换逻辑可能无法最优地处理所有过渡状态，尤其是在非平稳运动或快速变速度指令下，可能仍存在细微的不连续性风险。\n\n4.  **训练场景与泛化能力限制**：\n    - 训练主要在仿真环境中进行，尽管使用了域随机化，但课程设置集中于**金字塔形楼梯和特定参数范围**。对于更极端或更不规则的楼梯（如螺旋楼梯、台阶高度/深度变化极大、带有平台或破损的楼梯），策略的泛化能力未经充分验证。论文中在螺旋楼梯的成功演示更多是结果验证，而非系统性泛化能力证明。\n\n5.  **计算架构的复杂性**：\n    - 框架包含**多阶段训练**（预训练、专家训练、LoRA微调）和**异构计算平台**（GPU用于训练/规划，Jetson Orin用于感知，RK3588用于控制）。这种复杂性增加了系统集成、调试和维护的难度，可能不利于快速部署到其他机器人平台。\n\n### 二、未来可能的改进方向\n\n1.  **规划器模型的增强与泛化**：\n    - **开发更精确的并行优化器**：探索在保持GPU并行效率的前提下，减少动力学近似误差的方法，例如采用迭代修正或学习型校正项。\n    - **扩展至更复杂地形**：将“优化即搜索”范式推广到**斜坡、碎石地、非结构化环境**等，研究如何将地形特征（如摩擦系数、可变形性）纳入并行代价计算中。\n\n2.  **感知与控制的紧耦合与鲁棒性提升**：\n    - **多传感器融合**：结合**视觉惯性里程计（VIO）、激光雷达或事件相机**，以补偿纯视觉深度感知的缺陷，提高在挑战性光照和纹理条件下的鲁棒性。\n    - **感知不确定性建模**：在策略的观察空间中显式引入**感知置信度或不确定性估计**，使策略能够根据感知质量自适应调整其行为（如进入更谨慎的模式）。\n\n3.  **策略架构与学习范式的进化**：\n    - **端到端的自适应切换**：用**可学习的门控网络或混合专家（MoE）** 替代基于规则的速度切换器，实现更平滑、更基于上下文的速度模式过渡。\n    - **元学习或终身学习**：使策略具备在少量真实世界交互后**在线适应**新楼梯几何特征的能力，减少对仿真精确建模的依赖。\n\n4.  **系统集成与效率优化**：\n    - **轻量化与统一部署**：研究将感知、规划、控制模块进一步压缩和优化，实现在**单一边缘计算平台**上的高效运行，降低系统复杂性和功耗。\n    - **仿真到真实迁移的强化**：开发更先进的**域自适应技术**和**系统辨识方法**，以进一步缩小仿真与真实机器人动力学之间的差距。\n\n5.  **性能边界探索与理论分析**：\n    - **安全性与敏捷性的理论权衡**：对框架进行更形式化的分析，量化引入模型引导所带来的**稳定性保障边界**，以及为追求速度所承担的**风险水平**。\n    - **极限性能测试**：在更严苛的条件下（如湿滑楼梯、负重、外力扰动）系统性地测试策略的失效模式，为下一代改进提供明确方向。\n\n**总结**：FastStair的核心局限性源于其为了在**效率、安全性与敏捷性**之间取得平衡而做出的工程折衷（模型简化、规则切换）以及对特定感知管道的依赖。未来的改进将沿着 **“更精确的模型”、“更鲁棒的感知”、“更智能的策略”和“更高效的系统”** 四个主要方向推进，旨在实现人形机器人在更复杂、未知的真实环境中真正类人的高速、稳健运动能力。",
            "timestamp": "2026-01-20T18:02:39.704826",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        }
    ],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-15T13:14:59Z",
    "created_at": "2026-01-20T17:49:55.254225",
    "updated_at": "2026-01-20T17:49:55.254246",
    "recommend": 0
}