{
    "id": "2601.23087v1",
    "title": "Temporally Coherent Imitation Learning via Latent Action Flow Matching for Robotic Manipulation",
    "authors": [
        "Wu Songwei",
        "Jiang Zhiduo",
        "Xie Guanghu",
        "Liu Yang",
        "Liu Hong"
    ],
    "abstract": "学习长时程机器人操作需要同时实现高表现力的行为建模、实时推理与稳定执行，这对现有生成式策略仍具挑战。基于扩散的方法虽具备强大建模能力，但通常伴随高推理延迟；而流匹配技术虽能实现快速单步生成，直接在原始动作空间应用时往往导致执行不稳定。\n\n我们提出LG-Flow策略，这是一种在连续潜在动作空间进行流匹配的轨迹级模仿学习框架。该方法通过将动作序列编码为时间正则化的潜在轨迹，并学习显式的潜在空间流，实现了全局运动结构与底层控制噪声的解耦，从而获得平滑可靠的长时程执行效果。\n\nLG-Flow策略进一步融合了几何感知点云条件机制与执行时多模态调制功能，其中视觉线索作为现实场景中的代表性模态进行评估。仿真与实体机器人平台实验表明，相较于在原始动作空间运行的流匹配基线方法，LG-Flow策略实现了接近单步的推理速度，显著提升了轨迹平滑度与任务成功率，同时仍比基于扩散的策略更为高效。",
    "url": "https://arxiv.org/abs/2601.23087v1",
    "html_url": "https://arxiv.org/html/2601.23087v1",
    "html_content": "Temporally Coherent Imitation Learning via Latent Action Flow Matching for Robotic Manipulation\nWu Songwei, Jiang Zhiduo , Xie Guanghu, Liu Yang\n†\n, Liu Hong\n†\nCorresponding author: Liu Yang(liuyanghit@hit.edu.cn).*This work was supported by the Natural Science Foundation of Hei longjiang Province for Excellent Young Scholars (Grant No. YQ2024E018)\nand the Youth Talent Support Program of the China (Grant No. 2022-JCJQQT-061).\nAll authors are with with the State Key Laboratory of Robotics and Systems,\nHarbin Institute of Technology, Harbin 150001, Heilongjiang, China\nAbstract\nLearning long-horizon robotic manipulation requires jointly achieving expressive behavior modeling,\nreal-time inference, and stable execution, which remains challenging for existing generative policies.\nDiffusion-based approaches offer strong modeling capacity but incur high inference latency,\nwhile flow matching enables fast one-step generation yet often suffers from unstable execution when operating directly in the raw action space.\nWe propose\nLG-Flow Policy\n, a trajectory-level imitation learning framework that performs flow matching in a continuous latent action space.\nBy encoding action sequences into temporally regularized latent trajectories and learning an explicit latent-space flow,\nLG-Flow Policy decouples global motion structure from low-level control noise, enabling smooth and reliable long-horizon execution.\nThe framework further integrates geometry-aware point cloud conditioning and execution-time multimodal modulation, with visual cues as a representative modality evaluated in real-world settings for robust deployment.\nExperiments in simulation and on real robots show that LG-Flow Policy achieves near single-step inference,\nimproves trajectory smoothness by up to\n93.7%\nand task success by up to\n25%\nover raw action-space flow baselines,\nwhile remaining significantly faster than diffusion-based policies.\nI\nIntroduction\nDiffusion-based policies (DP)\n[\n6\n]\nhave demonstrated strong performance in robotic visuomotor imitation learning,\nparticularly for complex manipulation tasks in both simulation and real-world environments.\nBy modeling multimodal action distributions conditioned on rich sensory observations such as images\n[\n6\n,\n17\n]\nor point clouds\n[\n32\n,\n25\n,\n26\n]\n, these methods enable expressive behavior modeling and generalization across diverse task variations.\nMore recently, flow matching\n[\n16\n,\n5\n,\n10\n]\nhas emerged as an alternative generative paradigm for robotic control\n[\n34\n,\n7\n,\n2\n]\n.\nBy formulating action generation as the solution of an ordinary differential equation (ODE),\nflow matching enables near one-step inference and substantially improves inference efficiency compared to diffusion-based approaches,\nmaking it a promising framework for real-time imitation learning.\nDespite these advances, deploying generative policies on physical robots remains challenging.\nDiffusion policies rely on iterative denoising, which introduces nontrivial inference latency and limits real-time applicability.\nFlow matching methods, while efficient, generate trajectories directly in the raw action space, where modeling noise\nand numerical errors tend to accumulate over long horizons, resulting in jittery trajectories and degraded execution stability.\nAs a result, existing approaches struggle to simultaneously achieve expressive behavior modeling, fast inference, and stable execution.\nSeveral recent works have explored different strategies to alleviate these issues.\nDP3\n[\n32\n]\nand iDP3\n[\n31\n]\nimprove perception efficiency through lightweight point cloud encoders,\nRDP\n[\n28\n]\nintroduces a hierarchical Fast–Slow control structure for long-horizon behaviors,\nand Flow Policy\n[\n34\n]\nincorporates consistency constraints to enhance execution performance.\nHowever, our experimental results indicate that the fundamental trade-off between inference efficiency and execution stability\nhas not yet been fully resolved.\nTo address this challenge, we propose\nLG-Flow Policy\n, a trajectory-level action generation framework that performs flow matching\nin a continuous latent action space.\nBy mapping action sequences into temporally regularized latent trajectory representations and learning an explicit latent-space flow,\nLG-Flow Policy preserves the inference efficiency of flow-based methods while substantially improving execution smoothness and stability.\nOperating on motion-level latent representations decouples global trajectory structure from low-level control noise,\nmitigating error amplification during trajectory generation and enabling more reliable long-horizon behaviors.\nLG-Flow Policy further integrates geometry-aware point cloud conditioning and execution-time visual modulation from a wrist-mounted camera,\nproviding rich environmental awareness without perturbing latent trajectory dynamics.\nExtensive simulation and real-world experiments demonstrate that the proposed approach consistently achieves smooth trajectories,\nhigh task success rates, and fast response times, outperforming both diffusion-based and raw action-space flow-based baselines.\nOur main contributions are summarized as follows:\n•\nWe introduce a trajectory-level latent flow matching framework that reconciles fast inference with smooth and stable robotic manipulation.\n•\nWe show that performing flow matching in a continuous latent action space significantly reduces trajectory jitter\nand improves execution reliability.\n•\nWe demonstrate through comprehensive simulation and real-world experiments that the proposed method achieves robust performance across diverse tasks,\nincluding improved tolerance to heterogeneous and suboptimal demonstrations.\nFigure 1:\nOverall architecture of the proposed LG-Flow Policy. The system first encodes point cloud observations into geometry-aware scene features, then performs latent-space flow matching to generate temporally coherent latent action trajectories, which are finally decoded into executable control commands under visual conditioning.\nII\nRelated Work\nII-A\nDiffusion and Flow-Based Policies for Robotics\nDiffusion-based policies\n[\n14\n,\n6\n,\n32\n,\n31\n,\n26\n,\n17\n]\nmodel visuomotor control as conditional trajectory generation and achieve strong performance in complex manipulation tasks.\nHowever, their reliance on iterative denoising leads to high inference latency and sensitivity to execution noise, limiting real-time deployment.\nAcceleration strategies such as DDIM\n[\n21\n]\nor hierarchical designs like RDP\n[\n28\n]\nalleviate but do not eliminate the need for multi-step inference, leaving the recursive nature of diffusion a fundamental bottleneck.\nFlow-based generative models\n[\n16\n,\n5\n]\nprovide a more direct alternative by learning vector fields that define probability paths via ODEs.\nFlow Matching enables fast inference by directly regressing velocity fields, and recent consistency-based variants\n[\n34\n,\n7\n,\n2\n]\nfurther reduce sampling steps.\nDespite their efficiency, flow-based policies often exhibit trajectory oscillations when applied directly in raw action spaces, especially under high-dimensional actions and complex visual inputs.\nOur work builds on consistency flow matching while addressing this limitation through trajectory-level latent modeling and geometry-aware conditioning.\nII-B\nVisual Imitation Learning with 3D Representations\nEarly visual imitation learning methods rely primarily on 2D image observations\n[\n6\n,\n9\n]\n, processed by convolutional networks\n[\n13\n]\nor vision transformers\n[\n8\n]\n.\nRecent 3D-based approaches\n[\n32\n,\n31\n,\n25\n,\n12\n]\nincorporate depth or point clouds and improve geometric reasoning, but commonly face two challenges.\nFirst, prediction-and-planning formulations\n[\n27\n,\n33\n]\nestimate 3D keyframes or target poses, introducing additional optimization at test time and scaling poorly to high-dimensional control.\nSecond, efficient point cloud encoding remains difficult: PointNet-style architectures\n[\n19\n]\ncan be computationally expensive\n[\n25\n]\n, while simplified encoders\n[\n32\n,\n31\n]\ntrade geometric sensitivity for speed.\nIn contrast, our work follows a policy-centric design that directly outputs continuous actions, integrating structured 3D geometric representations while maintaining real-time-capable inference.\nII-C\nTrajectory-Level Modeling and Dexterous Manipulation\nDexterous manipulation has traditionally been addressed using reinforcement learning or task-specific pipelines\n[\n23\n,\n33\n]\n, often requiring extensive training or carefully engineered structures.\nRecent imitation learning methods model action sequences or chunks\n[\n6\n,\n34\n]\n, but may still suffer from temporal inconsistency under long-horizon, high-dimensional control.\nTrajectory-level modeling improves long-horizon coherence and robustness to noisy or suboptimal demonstrations, with latent action representation playing a central role.\nDiscrete latents via VQ-VAE\n[\n24\n]\nare widely adopted\n[\n1\n,\n3\n,\n4\n]\nto enforce information bottlenecks, but may limit expressiveness.\nRecent studies show that appropriately structured continuous latent representations can achieve strong performance without sacrificing stability\n[\n11\n,\n15\n]\n.\nFor example, CoMo\n[\n29\n]\nmitigates shortcut learning through temporal difference modeling, and LAOM\n[\n18\n]\ndemonstrates the benefits of higher-capacity continuous bottlenecks.\nThese results motivate trajectory-level continuous latent action modeling as an effective mechanism for generating smooth and temporally coherent dexterous behaviors, which we adopt in this work.\nIII\nMETHODS\nIII-A\nCoherent Latent Action Representation\nLong-horizon robotic manipulation requires action trajectories that are both expressive and execution-stable.\nApplying flow-based generative models directly in the raw action space often amplifies high-frequency noise during trajectory integration,\nleading to jittery and unreliable behaviors.\nTo address this issue at its source, we introduce a\ntrajectory-level continuous latent action representation\nthat explicitly regularizes the geometry of the generation space before flow matching is applied.\nThe overall architecture is illustrated in Fig.\n2\n.\nTrajectory-Level Latent Modeling\nInstead of modeling individual control commands, we encode short-horizon action segments into latent variables that represent motion-level abstractions.\nGiven an action trajectory\n𝐀\nt\n:\nt\n+\nH\n−\n1\n∈\nℝ\nH\n×\nd\na\n\\mathbf{A}_{t:t+H-1}\\in\\mathbb{R}^{H\\times d_{a}}\n, we divide it into\nK\nK\nconsecutive chunks\n{\n𝐀\n(\n1\n)\n,\n…\n,\n𝐀\n(\nK\n)\n}\n\\{\\mathbf{A}^{(1)},\\ldots,\\mathbf{A}^{(K)}\\}\n, each spanning\nc\nc\ntime steps.\nEach chunk is mapped to a compact feature embedding and processed by a recurrent encoder with gated memory.\nSpecifically, we employ a GRU-based encoder to aggregate action chunks over time,\n𝐡\nk\n=\nGRU\n​\n(\n𝐱\nk\n,\n𝐡\nk\n−\n1\n)\n,\n\\mathbf{h}_{k}=\\mathrm{GRU}(\\mathbf{x}_{k},\\mathbf{h}_{k-1}),\n(1)\nwhere\n𝐱\nk\n\\mathbf{x}_{k}\ndenotes the feature embedding of the\nk\nk\n-th action chunk, obtained via a lightweight temporal convolution.\nThe recurrent structure plays a critical role in shaping the latent space.\nBy conditioning each latent code on the entire history of preceding action segments, the GRU introduces a strong temporal inductive bias\nthat suppresses high-frequency variations and enforces trajectory-level coherence.\nAs a result, the latent space forms a smooth trajectory manifold rather than a collection of independent step-level representations,\nwhich is particularly beneficial for stabilizing downstream ODE-based flow matching.\nEmpirically, we observe that replacing the recurrent encoder with non-recurrent, per-chunk independent encoders\nleads to noticeably increased trajectory jitter.\nFigure 2:\nConditional variational autoencoder for latent action modeling.\nA GRU encoder enforces temporal coherence in the latent space, while an MLP decoder with FiLM-conditioned wrist-camera features enables visually adaptive action execution.\nVariational Regularization\nTo further regularize the latent action space, we adopt a variational formulation.\nThe KL divergence between the posterior and a standard normal prior encourages compactness and continuity of the latent distribution,\nimproving robustness to noisy or suboptimal demonstrations.\nImportantly, this regularization operates at the trajectory level rather than the control-step level,\nmaking it well suited for long-horizon manipulation.\nVisual-Conditioned Action Decoding\nThe proposed decoding mechanism is designed to flexibly incorporate execution-time sensory information without interfering with latent trajectory generation.\nIn principle, when available, diverse modalities (e.g., vision, touch, and language) can be incorporated into the decoder through FiLM, enabling flexible multimodal conditioning while preserving coherent latent trajectory dynamics.\nSince the decoder operates at low computational cost, incorporating additional conditioning signals at this stage allows the policy to leverage richer information without sacrificing real-time responsiveness.\nIn this work, we instantiate this design using wrist-mounted camera observations in real-world experiments.\nSpecifically, images captured at execution time are processed by a lightweight visual encoder, and the resulting features are used to modulate the decoder through FiLM layers.\nGiven a latent action code\n𝐳\n​\nk\n\\mathbf{z}k\n, the decoder reconstructs the corresponding action chunk as\n𝐀\n^\n(\nk\n)\n=\nf\n​\nθ\n​\n(\n𝐳\nk\n∣\n𝐯\nt\n)\n,\n\\hat{\\mathbf{A}}^{(k)}=f\\theta(\\mathbf{z}_{k}\\mid\\mathbf{v}_{t}),\n(2)\nwhere\n𝐯\nt\n\\mathbf{v}_{t}\ndenotes the encoded visual feature.\nBy confining perceptual conditioning to the decoding stage, the system cleanly separates latent trajectory planning from execution-time adaptation,\nallowing low-level action realization to react to scene variations while maintaining the smoothness and temporal coherence of the latent plan.\nTraining Objective\nThe latent action representation is trained using a standard variational objective with a reconstruction term and a KL regularizer,\naugmented by a lightweight smoothness constraint between consecutive latent codes.\nWhile the smoothness term serves as an auxiliary regularizer,\nthe primary source of temporal coherence arises from the recurrent encoding structure itself.\nOverall, the proposed representation defines a low-dimensional, continuous, and temporally regularized latent action space.\nBy reshaping the generation manifold prior to flow matching, it lays the foundation for stable and efficient\nlong-horizon trajectory generation, which we describe next.\nIII-B\nLatent-Space Action Generation via Flow Matching\nGiven a sequence of latent action codes\n{\n𝐳\n1\n,\n…\n,\n𝐳\nK\n}\n\\{\\mathbf{z}_{1},\\ldots,\\mathbf{z}_{K}\\}\nobtained from the trajectory-level encoder,\nwe generate long-horizon manipulation behaviors by modeling their evolution in continuous time using flow matching.\nUnlike diffusion-based policies that rely on iterative denoising, flow matching enables efficient one-step generation.\nHowever, when applied directly in the raw action space, flow-based models are highly sensitive to local inconsistencies and noise.\nWe therefore perform flow matching exclusively in the regularized latent action space, which is explicitly designed to be smooth and temporally coherent\n(Sec.\nIII-A\n).\nLatent-Space Flow Dynamics\nLet\n𝐳\n\\mathbf{z}\ndenote a latent action code sampled from the target latent distribution and\n𝐳\n~\n\\tilde{\\mathbf{z}}\na corresponding sample from a simple base distribution.\nWe learn a time-dependent vector field\n𝝂\nθ\n​\n(\nt\n,\n𝐳\n)\n\\boldsymbol{\\nu}_{\\theta}(t,\\mathbf{z})\nthat defines a continuous probability path from the source to the target distribution,\ngoverned by the ordinary differential equation\nd\n​\nξ\n𝐳\n​\n(\nt\n)\nd\n​\nt\n=\n𝝂\nθ\n​\n(\nt\n,\nξ\n𝐳\n​\n(\nt\n)\n)\n,\nξ\n𝐳\n​\n(\n0\n)\n=\n𝐳\n~\n.\n\\frac{d\\xi_{\\mathbf{z}}(t)}{dt}=\\boldsymbol{\\nu}_{\\theta}(t,\\xi_{\\mathbf{z}}(t)),\\quad\\xi_{\\mathbf{z}}(0)=\\tilde{\\mathbf{z}}.\n(3)\nOperating on motion-level latent representations rather than raw control signals substantially improves numerical stability,\nas the smooth geometry of the latent space suppresses the amplification of high-frequency variations during trajectory generation.\nConsistency Flow Matching in Latent Space\nTo efficiently learn the latent vector field across noise levels, we adopt consistency flow matching (CFM) and define the flow function\nf\nθ\n​\n(\nt\n,\n𝐳\n)\n=\n𝐳\n+\n(\n1\n−\nt\n)\n​\n𝝂\nθ\n​\n(\nt\n,\n𝐳\n)\n,\nf_{\\theta}(t,\\mathbf{z})=\\mathbf{z}+(1-t)\\,\\boldsymbol{\\nu}_{\\theta}(t,\\mathbf{z}),\n(4)\nwhere\nt\n∈\n[\n0\n,\n1\n]\nt\\in[0,1]\ninterpolates between the source and target latent distributions.\nHere,\n𝝂\nθ\n​\n(\nt\n,\n𝐳\n)\n\\boldsymbol{\\nu}_{\\theta}(t,\\mathbf{z})\nrepresents a learned velocity field in the latent action space, and the factor\n(\n1\n−\nt\n)\n(1-t)\nattenuates update magnitudes as the trajectory approaches the target distribution, improving stability near convergence.\nWe further apply a time-dependent input normalization\nc\nin\n​\n(\nt\n)\n=\n1\nt\n2\n+\n(\n1\n−\nt\n)\n2\n,\nc_{\\mathrm{in}}(t)=\\frac{1}{\\sqrt{t^{2}+(1-t)^{2}}},\n(5)\nto balance latent state scales across the time horizon.\nOne-Step Latent Trajectory Generation\nAt inference time, latent action codes are sampled from the base distribution and transformed via a single evaluation of the learned flow:\n𝐳\n^\nk\n=\nf\nθ\n​\n(\n1\n,\n𝐳\n~\nk\n)\n.\n\\hat{\\mathbf{z}}_{k}=f_{\\theta}(1,\\tilde{\\mathbf{z}}_{k}).\n(6)\nIn contrast to diffusion-based policies that require iterative denoising through multiple inference steps,\nour approach learns an explicit latent-space flow field during training and therefore performs single-step integration at test time.\nThis enables one-shot generation of the entire latent action trajectory without iterative sampling or numerical integration loops,\nsubstantially reducing inference latency.\nThe resulting latent trajectory preserves temporal coherence by construction and is decoded into executable action segments using the\nvisual-conditioned decoder described in Sec.\nIII-A\n.\nBy decoupling trajectory generation from execution-level adaptation, the policy achieves both fast inference and stable, smooth manipulation behavior.\nIII-C\nGeometry-Aware 3D Scene Conditioning\nStable execution of latent action trajectories requires accurate awareness of scene geometry,\nas geometric errors can propagate across multiple decoded action segments over long horizons.\nWe therefore condition the latent flow policy on a compact, geometry-aware 3D scene representation\nderived from point clouds.\nPoint Cloud Encoding\nScene point clouds are reconstructed from depth images captured by a fixed global camera,\nfollowed by workspace cropping to remove irrelevant background.\nFarthest Point Sampling (FPS) is applied to select a sparse set of center points that uniformly cover the workspace,\nserving as anchors for local neighborhood construction.\nTo capture geometric information at multiple spatial scales, we adopt a dual-branch encoder consisting of\na local encoder\nf\nl\nf_{l}\nand a center encoder\nf\nc\nf_{c}\n, whose overall architecture is illustrated in Fig.\n3\n.\nThe local encoder aggregates relative point offsets within each neighborhood using a residual convolutional backbone\nwith combined max–mean pooling, focusing on contact-level geometry that is invariant to global translation.\nIn parallel, the center encoder maps the sampled center coordinates to a compact global context vector\nvia a lightweight MLP, capturing coarse scene layout with minimal computational overhead:\n𝐟\nl\n=\nf\nl\n​\n(\npcd\nlocal\n)\n,\n𝐟\nc\n=\nf\nc\n​\n(\npcd\ncenter\n)\n.\n\\mathbf{f}_{l}=f_{l}(\\text{pcd}_{\\text{local}}),\\quad\\mathbf{f}_{c}=f_{c}(\\text{pcd}_{\\text{center}}).\n(7)\nFigure 3:\nGeometry-aware point cloud encoder.\nLocal neighborhoods around farthest-sampled centers capture translation-invariant local geometry via residual convolutions and max–mean pooling, while a lightweight center encoder provides compact global scene context for latent trajectory conditioning.\nHierarchical Geometric Conditioning\nThe extracted geometric features are injected into the latent flow network through a two-stage\nfeature-wise linear modulation (FiLM) mechanism.\nGiven an intermediate activation\n𝐡\n\\mathbf{h}\n, local geometric modulation is applied first,\nfollowed by center-level conditioning:\n𝐡\n′\n\\displaystyle\\mathbf{h}^{\\prime}\n=\n𝜸\nl\n⊙\n𝐡\n+\n𝜷\nl\n,\n[\n𝜸\nl\n,\n𝜷\nl\n]\n=\nMLP\nl\n​\n(\n𝐟\nl\n)\n,\n\\displaystyle=\\boldsymbol{\\gamma}_{l}\\odot\\mathbf{h}+\\boldsymbol{\\beta}_{l},\\quad[\\boldsymbol{\\gamma}_{l},\\boldsymbol{\\beta}_{l}]=\\mathrm{MLP}_{l}(\\mathbf{f}_{l}),\n(8)\n𝐡\n′′\n\\displaystyle\\mathbf{h}^{\\prime\\prime}\n=\n𝜸\nc\n⊙\n𝐡\n′\n+\n𝜷\nc\n,\n[\n𝜸\nc\n,\n𝜷\nc\n]\n=\nMLP\nc\n​\n(\n𝐟\nc\n)\n.\n\\displaystyle=\\boldsymbol{\\gamma}_{c}\\odot\\mathbf{h}^{\\prime}+\\boldsymbol{\\beta}_{c},\\quad[\\boldsymbol{\\gamma}_{c},\\boldsymbol{\\beta}_{c}]=\\mathrm{MLP}_{c}(\\mathbf{f}_{c}).\n(9)\nApplying local modulation prior to center-level conditioning allows the policy to first adapt to\ncontact-level constraints and subsequently adjust according to global scene structure,\nwhich we find to be more effective than the reverse ordering.\nOverall, this geometry-aware conditioning provides the latent action model with robust spatial context,\nenabling stable long-horizon manipulation without compromising inference efficiency.\nIV\nExperiments\nIV-A\nEvaluation Metrics\nWe evaluate all methods using three complementary metrics that jointly characterize task performance, real-time efficiency, and execution quality: task success rate, response time, and trajectory smoothness.\nTask Success Rate.\nTask success rate is defined as the percentage of trials that satisfy task-specific success criteria within the episode horizon.\nSuccess is determined by predefined geometric constraints, including object pose errors below threshold and stable grasps or placements maintained for a minimum duration.\nResponse Time.\nResponse time measures the end-to-end inference latency from receiving sensory observations to outputting control actions, reflecting the real-time computational efficiency and closed-loop responsiveness of each policy.\nTrajectory Smoothness.\nTo quantify long-horizon execution stability, we define a trajectory smoothness metric that captures both time-domain and frequency-domain characteristics of executed joint trajectories.\nSpecifically, smoothness is computed as a weighted combination of discrete-time jerk and high-frequency spectral energy.\nGiven a sequence of joint actions\n{\n𝐚\nt\n}\nt\n=\n1\nT\n\\{\\mathbf{a}_{t}\\}_{t=1}^{T}\nwith control timestep\nΔ\n​\nt\n\\Delta t\n, jerk is approximated using a third-order finite difference:\n𝐣\nt\n=\n𝐚\nt\n+\n1\n−\n3\n​\n𝐚\nt\n+\n3\n​\n𝐚\nt\n−\n1\n−\n𝐚\nt\n−\n2\n(\nΔ\n​\nt\n)\n3\n.\n\\mathbf{j}_{t}=\\frac{\\mathbf{a}_{t+1}-3\\mathbf{a}_{t}+3\\mathbf{a}_{t-1}-\\mathbf{a}_{t-2}}{(\\Delta t)^{3}}.\n(10)\nThe time-domain smoothness term is defined as the mean squared jerk magnitude:\n𝒮\njerk\n=\n1\nT\n−\n2\n​\n∑\nt\n=\n3\nT\n‖\n𝐣\nt\n‖\n2\n2\n.\n\\mathcal{S}_{\\mathrm{jerk}}=\\frac{1}{T-2}\\sum_{t=3}^{T}\\|\\mathbf{j}_{t}\\|_{2}^{2}.\n(11)\nTo further capture high-frequency oscillations not fully reflected by jerk alone, we compute the frequency-domain energy of each joint trajectory using the discrete Fourier transform (DFT).\nLet\n𝐚\n^\nf\n\\hat{\\mathbf{a}}_{f}\ndenote the Fourier coefficients of\n{\n𝐚\nt\n}\n\\{\\mathbf{a}_{t}\\}\n.\nThe high-frequency energy ratio is defined as\n𝒮\nfreq\n=\n∑\nf\n>\nf\nc\n‖\n𝐚\n^\nf\n‖\n2\n2\n∑\nf\n‖\n𝐚\n^\nf\n‖\n2\n2\n,\n\\mathcal{S}_{\\mathrm{freq}}=\\frac{\\sum_{f>f_{c}}\\|\\hat{\\mathbf{a}}_{f}\\|_{2}^{2}}{\\sum_{f}\\|\\hat{\\mathbf{a}}_{f}\\|_{2}^{2}},\n(12)\nwhere\nf\nc\nf_{c}\nis a cutoff frequency separating low- and high-frequency components.\nThe final trajectory smoothness metric is given by\n𝒮\nsmooth\n=\nα\n​\n𝒮\njerk\n+\nβ\n​\n𝒮\nfreq\n,\n\\mathcal{S}_{\\mathrm{smooth}}=\\alpha\\,\\mathcal{S}_{\\mathrm{jerk}}+\\beta\\,\\mathcal{S}_{\\mathrm{freq}},\n(13)\nwhere lower values indicate smoother trajectories with reduced abrupt variations and high-frequency oscillations.\nBased on extensive empirical evaluation and normalization of the two terms, we set\nα\n=\n0.25\n\\alpha=0.25\nand\nβ\n=\n0.75\n\\beta=0.75\nin all experiments.\nTABLE I:\nMain results for simulation experiments.\nSuccess rates (%) are reported as mean\n±\n\\pm\nstandard deviation.\nAvg. Success rate averages results over Adroit and MetaWorld.\nΔ\n\\Delta\nSuccess /\nΔ\n\\Delta\nTime denote relative changes w.r.t. DP3 (Baseline) in average success rate and per-step inference latency.\nMethods\nSuccess rate in Adroit\nSuccess rate in MetaWorld\nAvg. Success rate\n𝚫\n\\boldsymbol{\\Delta}\nSuccess\nAvg. Time\n𝚫\n\\boldsymbol{\\Delta}\nTime\nDiffusion Policy\n26.0\n±\n4.0\n26.0\\pm 4.0\n37.3\n±\n2.3\n37.3\\pm 2.3\n31.7\n±\n6.9\n31.7\\pm 6.9\n−\n34.0\n-34.0\n35.7\n​\nms\n35.7\\text{ ms}\n−\n20.2\n-20.2\nFlow Policy\n56.7\n±\n2.3\n56.7\\pm 2.3\n65.3\n±\n2.3\n65.3\\pm 2.3\n61.0\n±\n5.2\n61.0\\pm 5.2\n−\n4.7\n-4.7\n6.1\n​\nms\n\\mathbf{6.1\\text{ ms}}\n−\n49.8\n\\mathbf{-49.8}\nDP3 (Baseline)\n62.0\n±\n2.0\n62.0\\pm 2.0\n69.3\n±\n3.1\n69.3\\pm 3.1\n65.7\n±\n4.6\n65.7\\pm 4.6\n0.0\n0.0\n55.9\n​\nms\n55.9\\text{ ms}\n0.0\n0.0\niDP3\n62.7\n±\n2.3\n62.7\\pm 2.3\n71.3\n±\n2.3\n71.3\\pm 2.3\n67.0\n±\n5.2\n67.0\\pm 5.2\n+\n1.3\n+1.3\n58.9\n​\nms\n58.9\\text{ ms}\n+\n3.0\n+3.0\nRDP\n70.0\n±\n2.0\n70.0\\pm 2.0\n76.0\n±\n2.0\n76.0\\pm 2.0\n73.0\n±\n3.7\n73.0\\pm 3.7\n+\n7.3\n+7.3\n57.3\n​\nms\n57.3\\text{ ms}\n+\n1.4\n+1.4\nLG-Flow Policy (Ours)\n76.0\n±\n2.0\n\\mathbf{76.0\\pm 2.0}\n80.7\n±\n3.1\n\\mathbf{80.7\\pm 3.1}\n78.3\n±\n3.4\n\\mathbf{78.3\\pm 3.4}\n+\n12.6\n\\mathbf{+12.6}\n7.5\n​\nms\n7.5\\text{ ms}\n−\n48.4\n-48.4\nIV-B\nSimulation Experiments\nIV-B\n1\nSimulation Setup\nSimulation Benchmarks.\nWe evaluate all methods on two widely used manipulation benchmarks, Adroit\n[\n20\n]\nand Meta-World\n[\n30\n]\n, covering 37 tasks in total.\nAdroit focuses on contact-rich dexterous manipulation with a high-dimensional articulated hand, while Meta-World consists of diverse arm-based manipulation tasks with varying difficulty.\nBoth benchmarks are built upon the MuJoCo\n[\n22\n]\nphysics simulator.\nFor both benchmarks, expert demonstrations are collected using well-tuned heuristic policies to ensure consistent data quality.\nFigure 4:\nTrajectory smoothness comparison across simulated manipulation tasks. Lower values indicate smoother execution.\nBaselines.\nWe compare our method against representative diffusion- and flow-based visuomotor policies.\nDP3\n[\n32\n]\nserves as the primary point-cloud-based diffusion baseline, with iDP3\n[\n31\n]\nand Reactive Diffusion Policy (RDP\n[\n28\n]\n) included as advanced variants.\nDue to environment constraints, RDP is evaluated without force or pressure sensing, and employs a standard VAE as a latent-space encoder on top of DP.\nWe further include a 2D RGB-based Diffusion Policy\n[\n6\n]\nand a standard Flow Policy\n[\n34\n]\nto contrast 3D conditioning and latent-space modeling.\nTraining and Implementation Details.\nAll methods condition on the two most recent observations and predict actions for the subsequent four steps.\nFor each task, 30 expert demonstrations are collected, and performance is evaluated over 50 rollouts.\nRGB observations are cropped to\n84\n×\n84\n84\\times 84\n, and point clouds are downsampled using farthest point sampling to 512 points.\nModels are trained for 150 epochs using AdamW with a learning rate of\n1\n×\n10\n−\n4\n1\\times 10^{-4}\n, batch size 96, and EMA with decay rate 0.95.\nState and action inputs are normalized to\n[\n−\n1\n,\n1\n]\n[-1,1]\n, with actions unnormalized before execution.\nAll experiments are conducted on identical hardware with an Intel Core i7-14700KF CPU and an NVIDIA RTX 4090D GPU.\nIn simulation, no additional execution-time sensory signals are provided to the decoder, and action decoding relies solely on the latent action representation.\nFigure 5:\nReal-world experimental setup and observations.\nLeft: Franka Emika Panda robot with a LEAP Hand and the visual sensing setup (global L515 and wrist-mounted D435).\nRight: Example multimodal observations (RGB images, point clouds, wrist views) and task objects used in real-world experiments.\nIV-B\n2\nSimulation Results Analysis\nSimulation results are evaluated from three perspectives: trajectory smoothness, inference latency and task success.\nTrajectory Smoothness.\nFig.\n4\nreports trajectory smoothness across all simulated tasks.\nLG-Flow Policy achieves the lowest average smoothness score of\n0.052\n0.052\n, reducing the metric by\n51.4\n%\n51.4\\%\n,\n69.4\n%\n69.4\\%\n, and\n77.2\n%\n77.2\\%\nrelative to RDP, DP3, and Flow Policy, respectively.\nRDP exhibits lower smoothness than other diffusion-based baselines, indicating that latent action representations partially improve trajectory stability.\nHowever, its trajectories remain less smooth than those of LG-Flow Policy, as RDP does not impose explicit temporal smoothness constraints in the latent space.\nBy contrast, LG-Flow Policy performs flow matching over temporally coherent latent trajectories, consistently suppressing high-frequency oscillations.\nTask Success Rate and Response Time.\nTable\nI\nsummarizes task success rates and inference latency across simulated benchmarks.\nLG-Flow Policy achieves the highest average success rate of\n78.3\n%\n78.3\\%\n, outperforming Flow Policy (\n+\n17.3\n%\n+17.3\\%\n) and DP3 (\n+\n12.6\n%\n+12.6\\%\n), and improving over RDP (\n73.0\n%\n73.0\\%\n) by\n5.3\n%\n5.3\\%\n.\nWhile Flow Policy attains the lowest latency (6.1 ms), LG-Flow Policy incurs only a marginal increase (7.5 ms) and remains in the same real-time regime.\nNotably, LG-Flow Policy is approximately\n7.5\n×\n7.5\\times\nfaster than DP3 (55.9 ms), demonstrating a favorable success–latency trade-off with minimal loss in responsiveness.\nOverall, simulation results show that LG-Flow Policy achieves a favorable trade-off among smooth execution, fast inference, and high task success, which is essential for real-time robotic manipulation.\nIV-C\nReal-World Experiments\nIV-C\n1\nReal-World Experimental Setup\nPlatform and Sensing.\nReal-world experiments are conducted on a Franka Emika Panda arm with an interchangeable end-effector configuration,\nwhere the LEAP Hand can be replaced by a parallel gripper depending on the task (Fig.\n5\n, left).\nA RealSense L515 global camera provides scene-level RGB-D observations, while a wrist-mounted RealSense D435 supplies local visual feedback.\nBoth cameras operate at\n640\n×\n480\n640\\times 480\nresolution and 30 fps.\nDepth images are converted to point clouds using calibrated intrinsics and extrinsics.\nIn contrast to simulation, RGB images from the wrist-mounted camera are additionally used as execution-time conditioning inputs to the decoder,\nallowing low-level action realization to adapt to local visual variations during real-world execution.\nTasks.\nWe evaluate three real-world manipulation tasks:\npick-and-place\n, performed with both the LEAP Hand and a parallel gripper to cover different manipulation modalities;\npeg-in-hole\n, which requires precise insertion; and\nobstacle-avoidance grasping\n, where a target object must be grasped while avoiding surrounding obstacles.\nRepresentative objects and environments are shown in Fig.\n5\n(top right).\nDemonstrations and Baselines.\nExpert demonstrations are collected via human teleoperation, with 30 demonstrations per task.\nWe compare LG-Flow Policy against DP3\n[\n32\n]\n, Reactive Diffusion Policy (RDP)\n[\n28\n]\n, and Flow Policy\n[\n34\n]\n.\nFor RDP, tactile inputs are replaced with wrist camera images to ensure a fair comparison under visual-only settings.\nEvaluation Protocol.\nEach task is evaluated over 3 independent runs with different random seeds, each consisting of 10 trials (30 trials per task).\nSuccess rates are reported as mean\n±\n\\pm\nstandard deviation.\nResponse time measures end-to-end policy inference latency, excluding sensor acquisition and environment stepping.\nAll experiments are conducted on identical hardware with an Intel Core i9-14900KF CPU and an NVIDIA RTX 4080 GPU.\nIV-C\n2\nReal-World Results Analysis\nQuantitative real-world results are summarized in Table\nII\nand Fig.\n6\n, evaluating trajectory smoothness, task success, and response time.\nTABLE II:\nMain results for real-world robot experiments.\nSuccess rates (%) are reported as mean\n±\n\\pm\nstandard deviation over 30 trials.\nAvg. Success denotes the average success rate across all tasks.\nAvg. Response Time measures end-to-end policy inference latency per control step.\nMethods\nPick & Place\nPick & Place (Gripper)\nPeg-in-Hole\nObstacle Avoidance\nAvg. Success\nAvg. Response Time\nDP3\n66.7\n±\n5.8\n66.7\\pm 5.8\n80.0\n±\n5.8\n80.0\\pm 5.8\n35.0\n±\n5.8\n35.0\\pm 5.8\n50.0\n±\n10.0\n50.0\\pm 10.0\n57.9\n57.9\n29.29\n​\nms\n29.29\\text{ ms}\nRDP\n73.3\n±\n5.8\n73.3\\pm 5.8\n93.3\n±\n5.8\n93.3\\pm 5.8\n50.0\n±\n0.0\n50.0\\pm 0.0\n63.3\n±\n5.8\n63.3\\pm 5.8\n70.0\n70.0\n31.82\n​\nms\n31.82\\text{ ms}\nFlow Policy\n60.0\n±\n0.0\n60.0\\pm 0.0\n73.3\n±\n5.8\n73.3\\pm 5.8\n30.0\n±\n10.0\n30.0\\pm 10.0\n46.7\n±\n5.8\n46.7\\pm 5.8\n52.5\n52.5\n6.54\n​\nms\n\\mathbf{6.54\\text{ ms}}\nLG-Flow Policy (Ours)\n83.3\n±\n5.8\n\\mathbf{83.3\\pm 5.8}\n96.7\n±\n5.8\n\\mathbf{96.7\\pm 5.8}\n60.0\n±\n0.0\n\\mathbf{60.0\\pm 0.0}\n70.0\n±\n5.8\n\\mathbf{70.0\\pm 5.8}\n77.5\n\\mathbf{77.5}\n8.59\n​\nms\n8.59\\text{ ms}\nTrajectory Smoothness.\nFigure 6:\nTrajectory smoothness comparison across real-world manipulation tasks. Lower values indicate smoother execution.\nAs shown in Fig.\n6\n, LG-Flow Policy achieves the lowest mean and maximum smoothness scores among all methods, indicating substantially reduced jerk and high-frequency oscillations.\nCompared to Flow Policy, the mean smoothness metric is reduced by over\n93.7\n%\n93.7\\%\n, demonstrating strong robustness under real-world sensing noise and actuation delays.\nConsistent with simulation results, RDP exhibits lower smoothness than other diffusion-based baselines, suggesting that latent action representations improve execution stability in physical settings.\nHowever, its trajectories remain less smooth than those of LG-Flow Policy, as RDP does not impose explicit temporal smoothness constraints in the latent space.\nThis effect is further illustrated in Fig.\n7\n, where Flow Policy produces pronounced high-frequency oscillations, while LG-Flow Policy yields smooth and temporally coherent joint motions under identical initial conditions.\nFigure 7:\nComparison of real-world joint trajectories under identical initial conditions.\nFlow Policy exhibits high-frequency oscillations and abrupt variations, while LG-Flow Policy generates smoother and more temporally coherent trajectories, consistent with the quantitative smoothness metrics.\nTask Success Rate and Response Time.\nTable\nII\nreports task success rates and inference latency in real-world experiments.\nLG-Flow Policy achieves the highest average success rate of\n77.5\n%\n77.5\\%\n, outperforming DP3 (\n57.9\n%\n57.9\\%\n), RDP (\n70.0\n%\n70.0\\%\n), and Flow Policy (\n52.5\n%\n52.5\\%\n).\nWhile Flow Policy attains the lowest latency (6.54 ms), its unstable trajectories often lead to execution failures.\nLG-Flow Policy incurs only a modest increase in response time (8.59 ms) while achieving substantially higher task success.\nOne contributing factor to the improved success of both RDP and LG-Flow Policy is the incorporation of wrist-mounted camera observations during action decoding, providing execution-time visual feedback for precise manipulation.\nLG-Flow Policy remains over\n3\n×\n3\\times\nfaster than DP3 and RDP, indicating that significant real-world performance gains are achieved at minimal computational cost.\nOverall, real-world results confirm that LG-Flow Policy strikes a robust balance between inference efficiency, trajectory smoothness, and task success, supporting its suitability for stable real-world deployment.\nIV-D\nAblation Study\nFigure 8:\nAblation study on trajectory smoothness and task success rate in real world manipulation tasks.\nFig.\n8\nsummarizes ablation results in both simulation and real-world settings, analyzing the contributions of geometry-aware perception (GE-Flow) and latent action modeling (L-Flow).\nAcross both domains, the two components exhibit complementary effects on task success and trajectory smoothness.\nIn simulation, geometry-aware encoding improves average success from\n61\n%\n61\\%\nto\n64.3\n%\n64.3\\%\nbut slightly degrades trajectory smoothness, indicating that enhanced spatial perception alone does not resolve temporal instability.\nIn contrast, latent action modeling substantially reduces the smoothness metric (\n0.228\n→\n0.046\n0.228\\rightarrow 0.046\n) while increasing success to\n72.4\n%\n72.4\\%\n.\nCombining both components further improves success to\n78.3\n%\n78.3\\%\nwhile maintaining low oscillations.\nA similar trend is observed in real-world experiments.\nWhile geometry-aware perception alone yields only marginal success gains (\n52.5\n%\n→\n54.2\n%\n52.5\\%\\rightarrow 54.2\\%\n), it noticeably increases trajectory oscillations, often leading to execution failures under real-world noise and actuation delays.\nLatent action modeling, by contrast, improves both metrics, increasing success to\n71.7\n%\n71.7\\%\nand reducing smoothness by over\n95\n%\n95\\%\n.\nCombining both components achieves the best real-world performance, reaching a success rate of\n77.5\n%\n77.5\\%\nwith minimal oscillations.\nOverall, these results indicate that geometry-aware perception enhances spatial understanding, whereas stable manipulation critically relies on enforcing temporal coherence through latent action modeling, particularly in real-world settings.\nV\nConclusion\nThis work addresses real-time robotic manipulation under long-horizon and high-dimensional control,\nwhere existing generative policies struggle to jointly achieve expressive behavior modeling,\nfast inference, and stable execution, limiting their deployment on physical systems.\nWe propose\nLG-Flow Policy\n, a trajectory-level action generation framework that performs flow matching\nin a continuous latent action space.\nBy mapping action sequences into a temporally regularized latent trajectory manifold and learning an explicit\nlatent-space flow, LG-Flow Policy enables near single-step inference while substantially improving execution\nsmoothness and stability.\nOperating on motion-level latent representations decouples global trajectory structure from low-level control noise,\nmitigating error amplification during generation and leading to more reliable long-horizon behaviors.\nLG-Flow Policy further integrates geometry-aware point cloud conditioning and execution-time decoding modulation,\nallowing additional sensory signals to be incorporated without perturbing latent trajectory dynamics.\nThis design enables richer multimodal execution while preserving fast response, as demonstrated by visual-conditioned\ndecoding with a wrist-mounted camera in real-world experiments.\nExtensive simulation and real-robot results show smooth trajectories, high success rates, and rapid inference,\noutperforming both diffusion-based and raw action-space flow-based baselines.\nDespite its effectiveness, the current system adopts relatively lightweight multimodal fusion and does not\nexplicitly model complex contact dynamics.\nFuture work will explore richer multimodal representations and contact-aware latent dynamics to extend\nLG-Flow Policy toward more challenging contact-rich manipulation.\nReferences\n[1]\nJ. Bjorck, F. Castañeda, N. Cherniadev, X. Da, R. Ding, L. Fan, Y. Fang, D. Fox, F. Hu, S. Huang,\net al.\n(2025)\nGr00t n1: an open foundation model for generalist humanoid robots\n.\narXiv preprint arXiv:2503.14734\n.\nCited by:\n§\nII-C\n.\n[2]\nM. Braun, N. Jaquier, L. Rozo, and T. Asfour\nRiemannian flow matching policy for robot motion learning. in 2024 ieee\n.\nIn\nRSJ International Conference on Intelligent Robots and Systems (IROS)\n,\npp. 5144–5151\n.\nCited by:\n§I\n,\n§\nII-A\n.\n[3]\nJ. Bruce, M. D. Dennis, A. Edwards, J. Parker-Holder, Y. Shi, E. Hughes, M. Lai, A. Mavalankar, R. Steigerwald, C. Apps,\net al.\n(2024)\nGenie: generative interactive environments\n.\nIn\nForty-first International Conference on Machine Learning\n,\nCited by:\n§\nII-C\n.\n[4]\nQ. Bu, J. Cai, L. Chen, X. Cui, Y. Ding, S. Feng, X. He, X. Huang,\net al.\n(2025)\nAgibot world colosseo: a large-scale manipulation platform for scalable and intelligent embodied systems\n.\nIn\n2025 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)\n,\nCited by:\n§\nII-C\n.\n[5]\nR. T. Chen and Y. Lipman\n(2023)\nFlow matching on general geometries\n.\narXiv preprint arXiv:2302.03660\n.\nCited by:\n§I\n,\n§\nII-A\n.\n[6]\nC. Chi, Z. Xu, S. Feng, E. Cousineau, Y. Du, B. Burchfiel, R. Tedrake, and S. Song\n(2025)\nDiffusion policy: visuomotor policy learning via action diffusion\n.\nThe International Journal of Robotics Research\n44\n(\n10-11\n),\npp. 1684–1704\n.\nCited by:\n§I\n,\n§\nII-A\n,\n§\nII-B\n,\n§\nII-C\n,\n§\nIV-B\n1\n.\n[7]\nH. Ding, N. Jaquier, J. Peters, and L. Rozo\n(2025)\nFast and robust visuomotor riemannian flow matching policy\n.\nIEEE Transactions on robotics\n.\nCited by:\n§I\n,\n§\nII-A\n.\n[8]\nA. Dosovitskiy, L. Beyer, A. Kolesnikov, D. Weissenborn, X. Zhai, T. Unterthiner, M. Dehghani, M. Minderer, G. Heigold, S. Gelly, J. Uszkoreit, and N. Houlsby\n(2021)\nAn image is worth 16x16 words: transformers for image recognition at scale\n.\nICLR\n.\nCited by:\n§\nII-B\n.\n[9]\nP. Florence, C. Lynch, A. Zeng, O. A. Ramirez, A. Wahid, L. Downs, A. Wong, J. Lee, I. Mordatch, and J. Tompson\n(2022)\nImplicit behavioral cloning\n.\nIn\nConference on robot learning\n,\npp. 158–168\n.\nCited by:\n§\nII-B\n.\n[10]\nS. Fotiadis, N. D. Brenowitz, T. Geffner, Y. Cohen, M. Pritchard, A. Vahdat, and M. Mardani\nAdaptive flow matching for resolving small-scale physics\n.\nIn\nForty-second International Conference on Machine Learning\n,\nCited by:\n§I\n.\n[11]\nS. Gao, S. Zhou, Y. Du, J. Zhang, and C. Gan\n(2025)\nAdaWorld: learning adaptable world models with latent actions\n.\nIn\nInternational Conference on Machine Learning (ICML)\n,\nCited by:\n§\nII-C\n.\n[12]\nA. Goyal, J. Xu, Y. Guo, V. Blukis, Y. Chao, and D. Fox\n(2023)\nRvt: robotic view transformer for 3d object manipulation\n.\nIn\nConference on Robot Learning\n,\npp. 694–710\n.\nCited by:\n§\nII-B\n.\n[13]\nK. He, X. Zhang, S. Ren, and J. Sun\n(2016)\nDeep residual learning for image recognition\n.\nIn\nProceedings of the IEEE conference on computer vision and pattern recognition\n,\npp. 770–778\n.\nCited by:\n§\nII-B\n.\n[14]\nJ. Ho, A. Jain, and P. Abbeel\n(2020)\nDenoising diffusion probabilistic models\n.\nAdvances in neural information processing systems\n33\n,\npp. 6840–6851\n.\nCited by:\n§\nII-A\n.\n[15]\nA. Liang, P. Czempin, M. Hong, Y. Zhou, E. Biyik, and S. Tu\n(2025)\nClam: continuous latent action models for robot learning from unlabeled demonstrations\n.\narXiv preprint arXiv:2505.04999\n.\nCited by:\n§\nII-C\n.\n[16]\nY. Lipman, R. T. Chen, H. Ben-Hamu, M. Nickel, and M. Le\n(2022)\nFlow matching for generative modeling\n.\narXiv preprint arXiv:2210.02747\n.\nCited by:\n§I\n,\n§\nII-A\n.\n[17]\nZ. Ni, Y. He, L. Qian, J. Mao, F. Fu, W. Sui, H. Su, J. Peng, Z. Wang, and B. He\n(2025)\nVO-dp: semantic-geometric adaptive diffusion policy for vision-only robotic manipulation\n.\narXiv preprint arXiv:2510.15530\n.\nCited by:\n§I\n,\n§\nII-A\n.\n[18]\nA. Nikulin, I. Zisman, D. Tarasov, N. Lyubaykin, A. Polubarov, I. Kiselev, and V. Kurenkov\n(2025)\nLatent action learning requires supervision in the presence of distractors\n.\nIn\nInternational Conference on Machine Learning (ICML)\n,\nCited by:\n§\nII-C\n.\n[19]\nC. R. Qi, H. Su, K. Mo, and L. J. Guibas\n(2017)\nPointnet: deep learning on point sets for 3d classification and segmentation\n.\nIn\nProceedings of the IEEE conference on computer vision and pattern recognition\n,\npp. 652–660\n.\nCited by:\n§\nII-B\n.\n[20]\nA. Rajeswaran, V. Kumar, A. Gupta, G. Vezzani, J. Schulman, E. Todorov, and S. Levine\n(2017)\nLearning complex dexterous manipulation with deep reinforcement learning and demonstrations\n.\narXiv preprint arXiv:1709.10087\n.\nCited by:\n§\nIV-B\n1\n.\n[21]\nJ. Song, C. Meng, and S. Ermon\n(2020)\nDenoising diffusion implicit models\n.\narXiv preprint arXiv:2010.02502\n.\nCited by:\n§\nII-A\n.\n[22]\nE. Todorov, T. Erez, and Y. Tassa\n(2012)\nMujoco: a physics engine for model-based control\n.\nIn\n2012 IEEE/RSJ international conference on intelligent robots and systems\n,\npp. 5026–5033\n.\nCited by:\n§\nIV-B\n1\n.\n[23]\nD. Turpin, T. Zhong, S. Zhang, G. Zhu, E. Heiden, M. Macklin, S. Tsogkas, S. Dickinson, and A. Garg\n(2023)\nFast-grasp’d: dexterous multi-finger grasp generation through differentiable simulation\n.\nIn\nICRA\n,\nCited by:\n§\nII-C\n.\n[24]\nA. Van Den Oord, O. Vinyals,\net al.\n(2017)\nNeural discrete representation learning\n.\nAdvances in neural information processing systems\n30\n.\nCited by:\n§\nII-C\n.\n[25]\nC. Wang, H. Shi, W. Wang, R. Zhang, L. Fei-Fei, and C. K. Liu\n(2024)\nDexCap: scalable and portable mocap data collection system for dexterous manipulation\n.\narXiv preprint arXiv:2403.07788\n.\nCited by:\n§I\n,\n§\nII-B\n,\n§\nII-B\n.\n[26]\nD. Wang, C. Liu, F. Chang, and Y. Xu\n(2025)\nHierarchical diffusion policy: manipulation trajectory generation via contact guidance\n.\nIEEE Transactions on Robotics\n.\nCited by:\n§I\n,\n§\nII-A\n.\n[27]\nR. Wang, J. Zhang, J. Chen, Y. Xu, P. Li, T. Liu, and H. Wang\n(2022)\nDexgraspnet: a large-scale robotic dexterous grasp dataset for general objects based on simulation\n.\narXiv preprint arXiv:2210.02697\n.\nCited by:\n§\nII-B\n.\n[28]\nH. Xue, J. Ren, W. Chen, G. Zhang, Y. Fang, G. Gu, H. Xu, and C. Lu\n(2025)\nReactive diffusion policy: slow-fast visual-tactile policy learning for contact-rich manipulation\n.\nIn\nProceedings of Robotics: Science and Systems (RSS)\n,\nCited by:\n§I\n,\n§\nII-A\n,\n§\nIV-B\n1\n,\n§\nIV-C\n1\n.\n[29]\nJ. Yang, Y. Shi, H. Zhu, M. Liu, K. Ma, Y. Wang, G. Wu, T. He, and L. Wang\n(2025)\nCoMo: learning continuous latent motion from internet videos for scalable robot learning\n.\narXiv preprint arXiv:2505.17006\n.\nCited by:\n§\nII-C\n.\n[30]\nT. Yu, D. Quillen, Z. He, R. Julian, K. Hausman, C. Finn, and S. Levine\n(2020)\nMeta-world: a benchmark and evaluation for multi-task and meta reinforcement learning\n.\nIn\nConference on robot learning\n,\npp. 1094–1100\n.\nCited by:\n§\nIV-B\n1\n.\n[31]\nY. Ze, Z. Chen, W. Wang, T. Chen, X. He, Y. Yuan, X. B. Peng, and J. Wu\n(2025)\nGeneralizable humanoid manipulation with 3d diffusion policies\n.\nIn\n2025 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)\n,\npp. 2873–2880\n.\nCited by:\n§I\n,\n§\nII-A\n,\n§\nII-B\n,\n§\nII-B\n,\n§\nIV-B\n1\n.\n[32]\nY. Ze, G. Zhang, K. Zhang, C. Hu, M. Wang, and H. Xu\n(2024)\n3D diffusion policy: generalizable visuomotor policy learning via simple 3d representations\n.\nIn\nProceedings of Robotics: Science and Systems (RSS)\n,\nCited by:\n§I\n,\n§I\n,\n§\nII-A\n,\n§\nII-B\n,\n§\nII-B\n,\n§\nIV-B\n1\n,\n§\nIV-C\n1\n.\n[33]\nJ. Zhang, H. Liu, D. Li, X. Yu, H. Geng, Y. Ding, J. Chen, and H. Wang\n(2024)\nDexgraspnet 2.0: learning generative dexterous grasping in large-scale synthetic cluttered scenes\n.\nIn\n8th Annual Conference on Robot Learning\n,\nCited by:\n§\nII-B\n,\n§\nII-C\n.\n[34]\nQ. Zhang, Z. Liu, H. Fan, G. Liu, B. Zeng, and S. Liu\n(2025)\nFlowpolicy: enabling fast and robust 3d flow-based policy via consistency flow matching for robot manipulation\n.\nIn\nProceedings of the AAAI Conference on Artificial Intelligence\n,\nVol.\n39\n,\npp. 14754–14762\n.\nCited by:\n§I\n,\n§I\n,\n§\nII-A\n,\n§\nII-C\n,\n§\nIV-B\n1\n,\n§\nIV-C\n1\n.",
    "preview_text": "Learning long-horizon robotic manipulation requires jointly achieving expressive behavior modeling, real-time inference, and stable execution, which remains challenging for existing generative policies. Diffusion-based approaches provide strong modeling capacity but typically incur high inference latency, while flow matching enables fast one-step generation yet often leads to unstable execution when applied directly in the raw action space.\n  We propose LG-Flow Policy, a trajectory-level imitation learning framework that performs flow matching in a continuous latent action space. By encoding action sequences into temporally regularized latent trajectories and learning an explicit latent-space flow, the proposed approach decouples global motion structure from low-level control noise, resulting in smooth and reliable long-horizon execution.\n  LG-Flow Policy further incorporates geometry-aware point cloud conditioning and execution-time multimodal modulation, with visual cues evaluated as a representative modality in real-world settings. Experimental results in simulation and on physical robot platforms demonstrate that LG-Flow Policy achieves near single-step inference, substantially improves trajectory smoothness and task success over flow-based baselines operating in the raw action space, and remains significantly more efficient than diffusion-based policies.\n\nTemporally Coherent Imitation Learning via Latent Action Flow Matching for Robotic Manipulation\nWu Songwei, Jiang Zhiduo , Xie Guanghu, Liu Yang\n†\n, Liu Hong\n†\nCorresponding author: Liu Yang(liuyanghit@hit.edu.cn).*This work was supported by the Natural Science Foundation of Hei longjiang Province for Excellent Young Scholars (Grant No. YQ2024E018)\nand the Youth Talent Support Program of the China (Grant No. 2022-JCJQQT-061).\nAll authors are with with the State Key Laboratory of Robotics and Systems,\nHarbin Institute of Technology, Harbin 150001, Heilongjiang, China\nAbstract\nLearning long-horizon robotic manip",
    "is_relevant": true,
    "relevance_score": 8.0,
    "extracted_keywords": [
        "Flow Matching",
        "Inference Acceleration",
        "fine tune",
        "whole body control",
        "locomotion",
        "Reinforcement Learning",
        "VLA",
        "VLM",
        "Vision-Language-Action Model",
        "VLA for Robotics",
        "Diffusion",
        "Edge Deployment",
        "offline Reinforcement Learning",
        "constrained reinforcement learning",
        "safe reinforcement learning",
        "goal conditioned reinforcement learning",
        "world model"
    ],
    "one_line_summary": "该论文提出了一种基于潜在动作流匹配的模仿学习框架，用于机器人操作，通过潜在空间建模实现快速推理和稳定执行，与流匹配、推理加速和机器人控制相关，但与视觉语言模型和强化学习子领域关联较弱。",
    "detailed_summary": "## 论文摘要：基于潜在动作流匹配的时序一致性模仿学习用于机器人操作\n\n### 1. 研究背景和动机\n在机器人模仿学习中，现有生成式策略难以同时实现**高表达能力、快速推理和稳定执行**。基于扩散的策略建模能力强，但推理延迟高；而流匹配方法虽能实现快速一步生成，但在原始动作空间中直接操作时，往往因噪声累积导致轨迹抖动和执行不稳定。本文旨在解决这一核心矛盾，提出一种能够兼顾**快速推理与平滑稳定执行**的框架。\n\n### 2. 核心方法和技术创新\n本文提出了 **LG-Flow Policy**，其核心创新在于**在连续潜在动作空间中进行流匹配**。主要技术贡献包括：\n- **时序一致的潜在动作表示**：使用基于GRU的编码器将动作序列编码为**轨迹级的连续潜在表示**，通过循环结构和变分正则化，在潜在空间中强制施加时序一致性，解耦全局运动结构与底层控制噪声。\n- **潜在空间流匹配**：在平滑的潜在动作空间（而非原始高维动作空间）中学习显式的流场，通过**一致性流匹配**实现近乎一步的快速推理，同时避免了数值误差在长时程中的放大。\n- **多模态感知与调制**：采用**几何感知的点云编码器**（双分支局部-全局特征提取）进行场景条件输入；并在解码阶段通过**FiLM机制**灵活融入执行时的多模态信息（如腕部相机视觉反馈），实现感知自适应而不干扰潜在轨迹的动态。\n\n### 3. 主要实验结果\n在仿真（Adroit, Meta-World）和真实机器人（Franka Panda + LEAP Hand）上的实验表明：\n- **推理效率**：平均响应时间仅约 **7.5 ms**，比扩散策略（DP3）快约 **7.5倍**，接近原始流匹配策略的速度。\n- **执行平滑性**：轨迹平滑度指标相比原始动作空间流基线提升最高达 **93.7%**，有效抑制了高频抖动。\n- **任务成功率**：在仿真和真实任务中，平均成功率分别达到 **78.3%** 和 **77.5%**，显著优于扩散基线和原始流匹配基线（提升最高达 **25%**）。\n- **消融实验**证实了**潜在动作建模**对提升平滑度和成功率的关键作用，以及**几何感知**与潜在建模的互补价值。\n\n### 4. 研究意义和价值\n本工作为**实时、长时程、高维度的机器人操作**提供了一个高效的解决方案。它成功地将**流匹配的推理速度**与**潜在空间建模的稳定性**相结合，打破了生成式策略在效率与稳定性之间的权衡。所提出的框架易于扩展多模态感知，为在物理系统上部署稳健、自适应的模仿学习策略奠定了重要基础，推动了生成式机器人策略向实际应用迈进。",
    "qa_pairs": [
        {
            "question": "这篇论文的核心创新点是什么，他想解决什么问题，怎么解决的？",
            "answer": "## 论文核心分析\n\n### **一、 研究问题**\n论文旨在解决**机器人模仿学习中生成式策略面临的核心权衡问题**：\n1.  **推理效率与建模能力**：基于扩散的策略建模能力强，但迭代去噪导致推理延迟高，难以实时部署。\n2.  **推理速度与执行稳定性**：基于流匹配的策略可实现单步快速推理，但直接在原始动作空间生成轨迹时，噪声和误差会累积，导致**轨迹抖动、执行不稳定**，尤其在长时程、高维操作任务中。\n\n现有方法（如加速扩散、分层设计、一致性约束）未能从根本上解决这一权衡，限制了生成式策略在物理机器人上的稳定、实时部署。\n\n### **二、 核心创新点**\n论文提出了 **“LG-Flow Policy”** 框架，其核心创新在于**在连续潜在动作空间中执行轨迹级流匹配**，从而将快速推理与平滑稳定的执行统一起来。\n\n具体创新点分解如下：\n\n- **1. 轨迹级连续潜在动作表示**\n    - **思路**：不直接建模单个控制命令，而是将短时程的动作片段编码为表示**运动级抽象**的潜在变量。\n    - **关键设计**：\n        - **GRU编码器**：对动作块进行时序编码，引入强时序归纳偏置，抑制高频变化，强制轨迹级连贯性，形成平滑的潜在轨迹流形。\n        - **变分正则化**：在轨迹级别（而非控制步级别）使用KL散度正则化，鼓励潜在分布的紧凑性和连续性，提升对噪声或次优演示的鲁棒性。\n    - **效果**：从根本上重塑了生成空间，为后续稳定的流匹配奠定了基础。\n\n- **2. 潜在空间流匹配生成**\n    - **思路**：在**上述正则化后的平滑潜在空间**中学习显式的流（向量场），而非在原始高维、嘈杂的动作空间中。\n    - **关键设计**：\n        - 采用**一致性流匹配**，学习定义概率路径的向量场。\n        - 推理时，通过对学习到的流场进行**单步评估**，即可从简单基分布生成连贯的潜在轨迹。\n    - **效果**：实现了**接近单步的快速推理**，同时由于潜在空间的平滑特性，在轨迹生成过程中抑制了误差放大和高频振荡。\n\n- **3. 解耦的感知与执行架构**\n    - **思路**：将**轨迹规划（潜在空间）** 与**执行时适应（解码阶段）** 清晰分离。\n    - **关键设计**：\n        - **几何感知的点云条件化**：通过一个双分支（局部+全局）的轻量级点云编码器，将3D几何信息以FiLM方式注入到**潜在流网络**中，用于轨迹规划。\n        - **执行时多模态调制**：将执行时的感官信息（如论文中验证的腕部相机视觉特征）仅通过FiLM注入到**动作解码器**中，用于低层动作的实时微调。\n    - **效果**：允许策略利用丰富的环境信息（几何+视觉）进行鲁棒规划，同时保持潜在轨迹的动态连贯性不变，实现了**感知丰富性**与**执行稳定性**的兼得。\n\n### **三、 解决方案总结**\n论文通过一个**三层级联的架构**系统性地解决了问题：\n1.  **前端编码**：将原始动作序列通过**时序GRU编码器**映射到平滑、连续的潜在轨迹空间。\n2.  **中端生成**：在**条件化**（几何点云）的潜在空间中，利用**一致性流匹配**进行快速、单步的轨迹生成。\n3.  **后端解码**：将生成的潜在轨迹通过**条件化**（执行时视觉等多模态信息）的解码器，重建为可执行的具体动作序列。\n\n**技术核心**在于：**将“流匹配”的快速生成优势，与“潜在表示”的平滑滤波优势相结合**，并通过**条件化位置的精心设计**（几何信息影响规划，瞬时感知影响执行）来兼顾全局结构与局部适应。\n\n### **四、 实际价值**\n- **性能提升**：在仿真和真实机器人实验中，相比原始动作空间的流匹配基线，轨迹平滑度提升高达 **93.7%**，任务成功率提升高达 **25%**。\n- **效率优势**：推理速度（~7.5 ms）与快速流匹配策略（~6.1 ms）处于同一量级，但比扩散策略（~55.9 ms）快约 **7.5倍**。\n- **部署可行性**：首次在生成式策略中**同时实现了**接近单步的推理速度、高任务成功率和极高的轨迹平滑度，为**高维、长时程的实时机器人操作**提供了切实可行的解决方案。",
            "timestamp": "2026-02-03T15:54:29.987359",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "基于他的前作，梳理这个方向的整个发展脉络，每一步相比于之前的工作都改进了什么，着重于几个不同的发展方向。",
            "answer": "## 基于前作的机器人模仿学习发展脉络梳理\n\n本文提出的 **LG-Flow Policy** 是机器人视觉运动模仿学习领域，特别是基于生成模型的策略学习方向上的最新进展。其发展脉络可以清晰地梳理为几个关键阶段和不同的技术发展方向。\n\n### 发展脉络总览\n\n该领域的发展核心围绕着解决 **“表达能力-推理效率-执行稳定性”** 这一不可能三角展开。早期工作侧重于表达能力，随后分别向提升效率和稳定性两个方向演进，而本文的工作则试图在潜空间中将这两个方向进行融合与统一。\n\n```mermaid\ntimeline\n    title 机器人生成式策略发展脉络\n    section 表达能力优先\n        扩散模型奠基 : 基于DDPM/DDIM<br>强大表达能力<br>高推理延迟\n        3D表征增强 : 引入点云等3D信息<br>提升几何感知与泛化\n    section 效率与稳定性分叉演进\n        流向匹配引入 : 基于ODE的单步推理<br>大幅提升效率<br>原生动作空间不稳定\n        分层与一致性改进 : RDP: 快慢层次结构<br>FlowPolicy: 一致性约束<br>部分缓解问题\n        潜动作建模探索 : RDP/CoMo等使用潜空间<br>提升时序一致性<br>多为离散或非专门设计\n    section 融合与统一\n        LG-Flow Policy : 连续时序正则化潜空间<br>潜空间流匹配<br>几何感知+多模态解码<br>兼顾三者\n```\n\n### 关键发展阶段与技术改进\n\n#### 1. 奠基与表达能力突破：扩散模型主导期\n*   **代表工作**：**Diffusion Policy (DP)** [6], **DP3** [32]\n*   **核心思想**：将机器人动作序列生成建模为条件扩散过程，通过迭代去噪生成多模态动作分布。\n*   **相比于之前的RL/BC方法**：\n    *   **改进**：极大地提升了策略的**表达能力**和**泛化能力**，能够从演示数据中学习复杂的、多模态的动作分布，在处理接触丰富、长视野任务上表现出色。\n    *   **遗留问题**：**推理延迟高**，依赖多步迭代采样，难以满足实时控制要求；对执行时的噪声敏感，长视野任务中误差容易累积。\n\n#### 2. 感知效率与架构优化：3D表征与分层设计\n*   **发展方向一：感知效率提升**\n    *   **代表工作**：**DP3** [32], **iDP3** [31]\n    *   **核心思想**：用轻量化的点云编码器（如简化版PointNet）替代沉重的2D图像编码器，输入3D点云作为观测。\n    *   **相比于纯2D DP**：\n        *   **改进**：提供了**几何感知**能力，对物体姿态、空间关系更鲁棒；网络更轻量，**部分提升了感知编码效率**。\n        *   **遗留问题**：未解决扩散模型固有的**高推理延迟**根本问题；为追求速度可能牺牲了几何编码的细节。\n\n*   **发展方向二：控制架构分层**\n    *   **代表工作**：**Reactive Diffusion Policy (RDP)** [28]\n    *   **核心思想**：设计“快-慢”分层结构。慢回路（扩散模型）生成粗粒度的潜动作计划（如使用VAE），快回路（轻量网络）根据实时传感（如触觉）进行反应式调整。\n    *   **相比于单层DP**：\n        *   **改进**：通过将长视野规划与瞬时反应解耦，**提升了长任务执行的鲁棒性**和对实时干扰的适应性。**首次明确引入了潜动作空间**用于高层规划。\n        *   **遗留问题**：慢回路仍是扩散模型，**推理速度瓶颈仍在**；其潜动作空间（如通过标准VAE获得）并非为时序连贯性专门设计，稳定性提升有限。\n\n#### 3. 推理效率革命：流匹配模型引入\n*   **代表工作**：**Flow Policy** [34], **Consistency Flow Matching** 相关研究 [7,2]\n*   **核心思想**：用流匹配（Flow Matching）替代扩散模型。通过学一个向量场（ODE），实现从简单分布到目标分布的变换，支持**单步或极少步推理**。\n*   **相比于扩散模型**：\n    *   **改进**：实现了**数量级级别的推理加速**（从几十毫秒降至几毫秒），满足了实时控制需求。\n    *   **遗留问题**：直接在**原始高维动作空间**进行流匹配，对数值误差和噪声非常敏感，容易产生**轨迹抖动和执行不稳定**，尤其在长视野任务中。\n\n#### 4. 执行稳定性攻坚：潜动作与时序建模\n*   **发展方向：潜动作表示学习**\n    *   **相关探索**：**CoMo** [29], **LAOM** [18]，以及RDP中使用的VAE。\n    *   **核心思想**：不直接生成原始动作，而是生成低维、抽象的“潜动作”，再解码为具体动作。这可以施加信息瓶颈，过滤噪声。\n    *   **早期方法的局限**：\n        *   **离散潜空间（VQ-VAE）**：可能限制表达能力，无法表征细腻的连续运动。\n        *   **非时序敏感的编码**：独立编码每一帧或动作块，缺乏对轨迹整体平滑性的约束。\n        *   **与生成模型耦合不紧**：潜编码器设计（如标准VAE）未专门针对下游的流匹配生成过程进行优化。\n\n#### 5. 本文工作：LG-Flow Policy —— 效率与稳定的统一\n本文站在前述工作的肩膀上，**核心创新在于将“高效率的流匹配”与“专为稳定性设计的时序连贯潜空间”进行深度耦合**。\n\n*   **相比于 Flow Policy [34]（效率方向）**：\n    *   **改进**：将流匹配从**原始动作空间**移至**连续时序正则化潜空间**。通过GRU编码器对动作块序列进行编码，显式地塑造出一个平滑的潜轨迹流形，从根本上抑制了高频噪声在ODE积分过程中的放大，**在保持近乎单步推理速度的同时，大幅提升了轨迹平滑性（最高93.7%）和任务成功率**。\n\n*   **相比于 RDP [28]（稳定性/分层方向）**：\n    *   **改进**：\n        1.  **生成模型效率**：用**单步流匹配**替代了**迭代扩散模型**，解决了慢回路的根本延迟瓶颈。\n        2.  **潜空间设计**：使用了**连续潜空间**而非离散空间，并引入**强时序归纳偏置（GRU）**，专门为生成平滑轨迹而设计。RDP的潜空间主要服务于分层，而非显式优化平滑性。\n        3.  **多模态融合**：提出了更灵活的**执行时多模态调制**（通过Decoder的FiLM），将感知反馈（如腕部相机）与动作生成解耦，不影响潜轨迹的连贯性。\n\n*   **相比于 DP3/iDP3（感知方向）**：\n    *   **改进**：在继承其**几何感知点云编码**优点的同时，通过潜空间流匹配框架，**同时实现了远超它们的推理速度（7.5ms vs. 55.9ms）和更高的任务成功率**。\n\n### 总结：不同的发展方向与融合\n1.  **表达能力方向**：扩散模型 → 更强大的生成能力。\n2.  **感知效率方向**：2D RGB → 3D点云 → 轻量化3D编码。\n3.  **推理效率方向**：多步扩散 → (一致性模型) → **单步/少步流匹配**。\n4.  **执行稳定性方向**：原始动作生成 → 分层规划 → **潜动作表示** → **时序连贯的潜轨迹建模**。\n\n**LG-Flow Policy 的贡献在于**：它敏锐地抓住了“**在原始空间做流匹配不稳定**”这一关键瓶颈，创造性地将**发展方向3（流匹配）** 与**发展方向4（时序连贯潜空间）** 深度融合。它不是简单的组合，而是通过**轨迹级潜编码**和**潜空间流匹配**这一核心设计，实现了效率与稳定性的协同提升，代表了当前解决“不可能三角”问题的一个前沿且有效的思路。其**几何感知编码**和**执行时多模态解码**的设计，则是对发展方向2和更广泛多模态融合的延续与拓展。",
            "timestamp": "2026-02-03T15:55:37.447000",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他的前作有哪些？使用表格仔细讲讲他的每篇前作，他和前作的区别是什么，主要改善是什么？着重于具体相比于之前文章的改动",
            "answer": "## 论文前作分析\n\n根据论文内容，作者团队（特别是通讯作者 Liu Yang）及其合作者在机器人视觉运动模仿学习领域有一系列相关研究。以下表格梳理了文中明确引用的、可作为其“前作”或紧密相关基线的工作，并重点分析本文（LG-Flow Policy）与它们的核心区别和改进。\n\n| 前作/基线论文 | 核心方法 | 与本文（LG-Flow Policy）的主要区别 | 本文的主要改进/创新点 |\n| :--- | :--- | :--- | :--- |\n| **Diffusion Policy (DP)** <br> Chi et al., 2025 | **基于扩散模型的策略**：将动作生成建模为条件轨迹去噪过程。使用迭代采样，建模能力强，但推理延迟高。 | 1. **生成范式不同**：DP使用**扩散模型**，需要多步迭代去噪；本文使用**流匹配（Flow Matching）**，旨在实现单步生成。<br>2. **动作空间不同**：DP直接在**原始高维动作空间**进行生成；本文在**连续、时间正则化的潜在动作空间**进行流匹配。<br>3. **稳定性关注点不同**：DP主要关注表达能力和泛化性，对长时域执行的**时间相干性**和**平滑性**关注较少。 | 1. **推理速度**：将平均每步推理时间从 **~55.9 ms (DP3)** 降低到 **~7.5 ms**，提升约 **7.5倍**，接近单步推理。<br>2. **执行平滑性**：通过潜在空间建模和流匹配，将轨迹平滑度指标（值越低越平滑）相比DP3基线**提升51.4%**，显著减少抖动。<br>3. **任务成功率**：在模拟实验中，平均成功率相比DP3提升 **12.6%**。 |\n| **3D Diffusion Policy (DP3)** <br> Ze et al., 2024 | **3D扩散策略**：DP的3D扩展版，使用**轻量级点云编码器**进行几何感知的条件生成。是本文的主要扩散基线。 | 1. **感知与生成的耦合**：DP3的扩散过程直接以点云特征为条件。本文将**几何感知（点云编码）** 与**动作生成（潜在流匹配）** 解耦，并通过FiLM进行层次化调制。<br>2. **缺乏显式的时间正则化**：DP3在动作序列层面进行预测，但没有引入**递归编码器**等机制来显式地强制潜在轨迹的时间平滑性。 | 1. **解耦的架构**：提出**轨迹级潜在动作表示**，使用GRU编码器将动作块编码为时间相干的潜在代码，将全局运动结构与底层控制噪声解耦。<br>2. **层次化几何条件**：采用**双分支点云编码器**（局部+中心）和**两阶段FiLM调制**，更精细地融合几何信息，而不干扰潜在轨迹的动态特性。 |\n| **iDP3** <br> Ze et al., 2025 | **改进的3D扩散策略**：DP3的改进版本，进一步优化了3D表示和策略学习。 | 与DP3类似，核心区别仍在于**扩散模型 vs. 流匹配**，以及**原始空间 vs. 潜在空间生成**。iDP3在DP3基础上提升了感知效率，但未解决扩散模型固有的**推理延迟**和流匹配在原始动作空间的**不稳定**问题。 | 本文从根本上改变了生成范式，**用潜在空间流匹配替代了扩散模型**，从而在保持高成功率的同时，获得了**数量级提升的推理速度**和**显著改善的执行平滑性**。 |\n| **Reactive Diffusion Policy (RDP)** <br> Xue et al., 2025 | **分层反应式扩散策略**：采用“快-慢”分层结构，慢路径规划，快路径（基于VAE潜在空间）反应式调整。引入了**潜在动作表示**。 | 1. **潜在空间的性质**：RDP使用**VAE**获得潜在表示，主要用于**层次化控制中的快速反应层**，其潜在空间可能缺乏**显式的时间相干性约束**。<br>2. **生成模型**：RDP的慢路径仍是**扩散模型**，存在推理延迟。其快速路径虽在潜在空间，但目的是局部调整，而非全局轨迹生成。 | 1. **专为平滑性设计的潜在空间**：本文的潜在空间通过**GRU编码器和变分正则化** explicitly designed for temporal coherence，而RDP的VAE潜在空间主要为了压缩和快速解码。<br>2. **统一的流匹配生成**：本文**整个轨迹**都在时间相干的潜在空间中通过**一致性流匹配**一次性生成，实现了**快速**与**平滑**的统一。RDP仍依赖扩散模型进行规划，速度较慢。<br>3. **平滑性结果**：实验表明，即使在RDP已使用潜在表示的情况下，本文的轨迹平滑度仍显著优于RDP（模拟中提升51.4%）。 |\n| **Flow Policy** <br> Zhang et al., 2025 | **基于流匹配的策略**：将一致性流匹配应用于机器人操作，直接在**原始动作空间**进行快速生成。 | **这是最直接的前作对比**。核心区别在于**动作生成空间**：<br>- Flow Policy：**原始动作空间**的流匹配。<br>- LG-Flow Policy：**时间正则化潜在动作空间**的流匹配。 | 1. **解决关键缺陷**：Flow Policy在原始空间流匹配会产生**轨迹抖动和不稳定执行**。本文通过迁移到**平滑的潜在空间**，从根本上解决了这一问题。<br>2. **性能飞跃**：在真实世界实验中，本文相比Flow Policy将**轨迹平滑度提升了93.7%**，同时将**平均任务成功率从52.5%提升至77.5%**，而推理时间仅略有增加（6.54ms -> 8.59ms）。 |\n\n### 总结：本文相对于前作的核心改动与改善\n\n1.  **范式创新：从“扩散/原始空间流匹配”到“潜在空间流匹配”**\n    *   **改动**：提出了 **LG-Flow Policy** 框架，核心创新在于**在连续、时间相干的潜在动作空间执行流匹配**。\n    *   **改善**：**一举三得**：\n        *   **保留了流匹配的快速推理优势**（近单步生成）。\n        *   **克服了原始空间流匹配的轨迹抖动问题**（平滑度极大提升）。\n        *   **避免了扩散模型的多步迭代延迟**（推理速度比扩散快一个数量级）。\n\n2.  **技术核心：构建时间相干的潜在动作空间**\n    *   **改动**：引入**轨迹级连续潜在动作表示**，使用**GRU编码器**对动作块序列进行编码，并施加**变分正则化**。\n    *   **改善**：该潜在空间**显式地强制了时间平滑性和全局运动结构**，将底层控制噪声与高级运动规划解耦，使得在其上进行的流匹配数值更稳定，生成长时域轨迹更可靠。\n\n3.  **架构设计：感知、生成与执行解耦**\n    *   **改动**：采用**层次化几何感知（点云编码）** 条件化潜在流，同时**在执行时通过解码器集成多模态反馈**（如腕部相机）。\n    *   **改善**：\n        *   **几何感知不干扰轨迹生成**：点云特征通过FiLM调制注入，不影响潜在轨迹的动态平滑性。\n        *   **执行时灵活适应**：腕部相机等实时感官信息仅在**低成本解码器**阶段引入，允许对场景变化进行微调，而不改变已生成的高层平滑轨迹。\n\n**结论**：本文并非对单一前作的简单改进，而是针对“**扩散模型慢**”和“**原始流匹配抖**”这两个领域核心痛点，提出了一种**融合二者优点、规避其缺点**的新框架。其核心贡献在于**通过精心设计的潜在空间作为“中介”**，成功地将**流匹配的推理速度**与**扩散级的行为建模质量及执行稳定性**结合起来，并通过系统的实验验证了其在仿真和真实机器人任务上的综合优势。",
            "timestamp": "2026-02-03T15:56:43.258665",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文提出了哪些关键技术方法，请列表格具体详细说明技术细节，需要包含具体的数学原理推导，以及具体参数。",
            "answer": "好的，作为一名专业的学术论文分析助手，我将为您详细分析这篇题为《Temporally Coherent Imitation Learning via Latent Action Flow Matching for Robotic Manipulation》的论文所提出的关键技术方法。\n\n## 论文核心方法分析\n\n本文的核心目标是解决机器人模仿学习中**推理速度**、**行为表达能力**和**执行稳定性**之间的权衡难题。为此，作者提出了 **LG-Flow Policy** 框架，其关键技术可归纳为以下三个相互关联的模块：\n\n| 关键技术模块 | 核心目标 | 技术细节与数学原理 | 具体参数/设计选择 |\n| :--- | :--- | :--- | :--- |\n| **1. 时序连贯的潜在动作表示** | 将原始高维、易噪的动作序列编码到一个**平滑、低维、时序连贯的潜在流形**中，为后续的流匹配提供一个稳定的生成空间。 | **a. 轨迹级分块编码：** <br> 将长度为 `H` 的动作轨迹 $\\mathbf{A}_{t:t+H-1} \\in \\mathbb{R}^{H \\times d_a}$ 划分为 `K` 个连续的块 $\\{\\mathbf{A}^{(1)}, ..., \\mathbf{A}^{(K)}\\}$，每块包含 `c` 个时间步。 <br><br> **b. 基于GRU的时序编码器：** <br> 每个动作块通过一个轻量级时序卷积网络映射为特征嵌入 $\\mathbf{x}_k$，然后输入GRU以聚合历史信息，强制引入时序连贯性： <br> $\\mathbf{h}_k = \\mathrm{GRU}(\\mathbf{x}_k, \\mathbf{h}_{k-1})$ <br> 潜在变量 $\\mathbf{z}_k$ 从 $\\mathbf{h}_k$ 的后验分布中采样。 <br><br> **c. 变分正则化：** <br> 使用变分自编码器（VAE）框架，用KL散度约束后验分布 $q(\\mathbf{z}_k | \\mathbf{A}^{(k)}, \\mathbf{h}_{k-1})$ 接近标准正态先验 $\\mathcal{N}(0, I)$，以鼓励潜在空间的连续性和紧凑性。损失函数包含**重构损失**和**KL正则项**。 <br><br> **d. 视觉条件解码：** <br> 解码器 $f_\\theta$ 将潜在代码 $\\mathbf{z}_k$ 与执行时的视觉特征 $\\mathbf{v}_t$（来自腕部相机）通过 **FiLM（Feature-wise Linear Modulation）** 层结合，重建动作块： <br> $\\hat{\\mathbf{A}}^{(k)} = f_\\theta(\\mathbf{z}_k | \\mathbf{v}_t)$ <br> FiLM操作：$\\mathbf{h}' = \\boldsymbol{\\gamma} \\odot \\mathbf{h} + \\boldsymbol{\\beta}$，其中 $[\\boldsymbol{\\gamma}, \\boldsymbol{\\beta}] = \\mathrm{MLP}(\\mathbf{v}_t)$。 | - **分块大小：** 文中未明确给出 `c` 和 `K` 的具体值，但指出预测未来4步动作 (`H=4`)。 <br> - **编码器：** GRU + 时序卷积。 <br> - **潜在空间维度：** 低于原始动作维度 $d_a$，具体值未给出。 <br> - **解码调制：** 使用FiLM层融合腕部相机视觉特征，实现执行时自适应。 |\n| **2. 潜在空间流匹配动作生成** | 在已正则化的潜在空间中学习一个**确定性流**，实现**单步推理**生成整个潜在动作轨迹，兼具扩散模型的表达能力和流匹配的速度。 | **a. 一致性流匹配（CFM）公式：** <br> 学习一个时间相关的向量场 $\\boldsymbol{\\nu}_\\theta(t, \\mathbf{z})$，定义从简单基分布（如高斯噪声）到目标潜在分布的**概率路径**。轨迹 $\\xi_\\mathbf{z}(t)$ 由ODE描述： <br> $\\frac{d\\xi_\\mathbf{z}(t)}{dt} = \\boldsymbol{\\nu}_\\theta(t, \\xi_\\mathbf{z}(t)), \\quad \\xi_\\mathbf{z}(0) = \\tilde{\\mathbf{z}} \\sim \\mathcal{N}(0, I)$ <br><br> **b. 流函数参数化：** <br> 采用**一致性流匹配**的参数化形式，直接回归从噪声到目标数据的向量场： <br> $f_\\theta(t, \\mathbf{z}) = \\mathbf{z} + (1-t) \\cdot \\boldsymbol{\\nu}_\\theta(t, \\mathbf{z})$ <br> 其中 $t \\in [0,1]$，当 $t=1$ 时，$f_\\theta(1, \\tilde{\\mathbf{z}}) \\approx \\mathbf{z}$（目标潜在代码）。因子 $(1-t)$ 在接近目标时衰减更新幅度，提升稳定性。 <br><br> **c. 输入标准化：** <br> 引入时间依赖的输入缩放，以平衡不同时间步的潜在状态尺度： <br> $c_{in}(t) = \\frac{1}{\\sqrt{t^2 + (1-t)^2}}$ <br><br> **d. 单步生成：** <br> 在推理时，从基分布采样噪声潜在代码 $\\tilde{\\mathbf{z}}_k$，通过**单次前向传播**得到目标潜在轨迹： <br> $\\hat{\\mathbf{z}}_k = f_\\theta(1, \\tilde{\\mathbf{z}}_k)$ <br> 无需迭代去噪或数值积分循环。 | - **流模型：** 一致性流匹配（CFM）。 <br> - **时间参数：** $t \\in [0,1]$。 <br> - **网络输出：** 向量场 $\\boldsymbol{\\nu}_\\theta(t, \\mathbf{z})$。 <br> - **推理步骤：** **1步**。与扩散策略（通常需10-20步）形成鲜明对比。 |\n| **3. 几何感知的3D场景条件** | 为流匹配网络提供**高效且对几何变化鲁棒**的3D场景表示，提升在复杂环境中的操作成功率。 | **a. 点云预处理：** <br> 从全局深度相机获取点云，裁剪工作空间，使用**最远点采样（FPS）** 选取 `N` 个中心点。 <br><br> **b. 双分支编码器：** <br> - **局部编码器 $f_l$：** 以每个FPS中心点为中心构建局部邻域，通过**残差卷积**结合**最大-均值池化**提取局部几何特征 $\\mathbf{f}_l$。该特征对全局平移具有不变性。 <br> - **中心编码器 $f_c$：** 将FPS采样的中心点坐标通过一个轻量级MLP，映射为全局场景上下文特征 $\\mathbf{f}_c$。 <br> $\\mathbf{f}_l = f_l(\\text{pcd}_{\\text{local}}), \\quad \\mathbf{f}_c = f_c(\\text{pcd}_{\\text{center}})$ <br><br> **c. 分层特征调制（FiLM）：** <br> 将几何特征分两层注入流匹配网络： <br> 1. **局部几何调制：** $\\mathbf{h}' = \\boldsymbol{\\gamma}_l \\odot \\mathbf{h} + \\boldsymbol{\\beta}_l, \\quad [\\boldsymbol{\\gamma}_l, \\boldsymbol{\\beta}_l] = \\mathrm{MLP}_l(\\mathbf{f}_l)$ <br> 2. **全局上下文调制：** $\\mathbf{h}'' = \\boldsymbol{\\gamma}_c \\odot \\mathbf{h}' + \\boldsymbol{\\beta}_c, \\quad [\\boldsymbol{\\gamma}_c, \\boldsymbol{\\beta}_c] = \\mathrm{MLP}_c(\\mathbf{f}_c)$ <br> **先局部后全局**的顺序被证明更有效。 | - **点云规模：** 下采样至512个点（FPS）。 <br> - **局部邻域：** 围绕每个FPS中心点构建。 <br> - **编码器结构：** 残差卷积（局部）+ MLP（全局）。 <br> - **条件注入方式：** 分层FiLM。 |\n\n## 技术创新与实际价值总结\n\n1.  **核心创新点**：**“在时序正则化的潜在空间中进行流匹配”**。这并非简单串联VAE和CFM，而是通过**GRU编码器**和**轨迹级变分正则化**，**主动塑造**出一个适合流匹配的平滑潜在流形，从根本上解决了原始动作空间流匹配的抖动问题。\n\n2.  **数学原理的巧妙结合**：\n    *   将**变分推断**（用于学习平滑潜在空间）与**流匹配**（用于高效确定性生成）相结合。\n    *   流匹配部分采用**一致性流匹配（CFM）** 公式，其损失函数旨在使从不同噪声水平出发的流轨迹在相同时间点汇聚到同一点，这自然促进了单步推理的可行性。\n\n3.  **系统级设计价值**：\n",
            "timestamp": "2026-02-03T15:57:53.654749",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "他使用了哪些评价指标与数据集，列表格具体讲讲他的评价指标的细节与数据集的细节",
            "answer": "## 论文评价指标与数据集分析\n\n### 一、 评价指标\n\n论文使用了三个核心指标来全面评估策略的性能，涵盖了任务成功率、实时效率和执行质量。\n\n| 指标类别 | 具体指标 | 计算方式与细节 | 目的与意义 |\n| :--- | :--- | :--- | :--- |\n| **任务性能** | **任务成功率** | - **定义**：在任务时间范围内，满足任务特定成功标准的试验百分比。<br>- **判定标准**：基于预定义的几何约束，例如物体位姿误差低于阈值、稳定抓取或放置保持最小持续时间。 | 衡量策略完成指定任务的根本能力，是最直接的性能指标。 |\n| **实时效率** | **响应时间** | - **定义**：从接收传感器观测到输出控制动作的端到端推理延迟。<br>- **测量**：仅包含策略推理时间，**排除**传感器采集和环境步进时间。 | 评估策略的实时计算效率和闭环响应能力，对物理机器人部署至关重要。 |\n| **执行质量** | **轨迹平滑度** | - **综合指标**：结合时域和频域特性，定义为 `𝒮_smooth = α·𝒮_jerk + β·𝒮_freq`，**值越低表示轨迹越平滑**。<br> - **时域平滑度 (𝒮_jerk)**：计算关节动作序列的离散加加速度（jerk）的均方值，反映动作的突变程度。公式：`𝐣_t = (𝐚_{t+1} - 3𝐚_t + 3𝐚_{t-1} - 𝐚_{t-2}) / (Δt)^3`；`𝒮_jerk = mean(‖𝐣_t‖²)`。<br> - **频域平滑度 (𝒮_freq)**：计算关节轨迹高频能量占总能量的比例，反映不必要的高频振荡。公式：`𝒮_freq = Σ_{f>f_c} ‖𝐚̂_f‖² / Σ_f ‖𝐚̂_f‖²`，其中 `f_c` 为截止频率。<br>- **权重**：根据经验评估和归一化，设置为 `α = 0.25`, `β = 0.75`，更侧重频域平滑度。 | 量化长时程执行的稳定性。平滑的轨迹能减少机械磨损、提高执行可靠性，是本文解决**原始动作空间流匹配导致轨迹抖动**问题的核心验证指标。 |\n\n### 二、 数据集与实验平台\n\n论文在仿真和真实机器人两个平台上进行了全面评估。\n\n| 实验环境 | 数据集/平台名称 | 细节描述 | 任务与数据 |\n| :--- | :--- | :--- | :--- |\n| **仿真实验** | **Adroit** | - **来源**：广泛使用的灵巧操作基准。<br>- **特点**：专注于**接触丰富的灵巧操作**，使用高自由度的拟人化手（Shadow Hand）。<br>- **仿真器**：MuJoCo物理引擎。 | - **任务范围**：包含多种灵巧操作任务。<br>- **专家数据**：使用调优好的启发式策略收集，确保数据质量一致。每个任务收集**30条**演示。 |\n| | **Meta-World** | - **来源**：广泛使用的机器人操作基准。<br>- **特点**：包含**多样化、不同难度**的基于机械臂的操作任务。<br>- **仿真器**：MuJoCo物理引擎。 | - **任务范围**：涵盖多种臂式操作任务。与Adroit合计共**37个**任务。<br>- **专家数据**：收集方式同Adroit，每个任务**30条**演示。 |\n| **真实机器人实验** | **自定义真实平台** | - **机器人**：Franka Emika Panda 机械臂，配备可互换的末端执行器（LEAP Hand 或平行夹爪）。<br>- **感知系统**：<br> 1. **全局相机**：RealSense L515，提供场景级RGB-D观测。<br> 2. **腕部相机**：RealSense D435，提供执行时局部视觉反馈。<br>- **配置**：双相机均以640x480分辨率、30fps运行。深度图通过标定的内外参转换为点云。 | - **任务**：评估了3类操作任务：<br> 1. **抓取-放置**：分别使用LEAP Hand和平行夹爪执行。<br> 2. **插孔**：需要精确插入。<br> 3. **避障抓取**：在避开周围障碍物的同时抓取目标物体。<br>- **专家数据**：通过**人类遥操作**收集，每个任务**30条**演示。 |\n\n### 三、 评估协议细节\n- **仿真评估**：每个任务进行**50次** rollout 来评估性能。\n- **真实世界评估**：每个任务进行**3次**独立运行（不同随机种子），每次包含**10次**试验，共计**30次**试验/任务，报告平均成功率及标准差。\n- **观测与预测**：所有方法均基于**最近两次观测**，预测**后续四步**的动作。\n- **输入处理**：RGB图像裁剪至84x84；点云使用最远点采样下采样至512个点。\n\n### 总结\n本文的评价体系设计精良：\n1.  **指标全面**：同时衡量了**效果**（成功率）、**效率**（响应时间）和**质量**（平滑度），直击机器人部署的核心痛点。\n2.  **平滑度指标创新**：提出的复合平滑度指标（结合jerk和频域能量）比单一指标更能可靠地量化轨迹的稳定性和连贯性，是验证其**潜在动作流匹配**技术优势的关键。\n3.  **数据集具有代表性**：涵盖了从仿真到真实、从灵巧手到简单夹爪、从常规任务到精密任务（插孔）的多种场景，证明了方法的**泛化性和鲁棒性**。\n4.  **对比公平**：在相同的数据集、演示数量、硬件平台和输入配置下与主流基线进行对比，增强了结果的可信度。",
            "timestamp": "2026-02-03T15:58:40.722902",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文在哪些数据集上进行了实验？主要的评估指标和性能提升是多少？",
            "answer": "## 论文实验数据集、评估指标与性能提升分析\n\n### 一、 实验数据集\n论文在**仿真**和**真实机器人**两个平台上进行了全面实验，具体数据集/任务如下：\n\n#### 1. 仿真实验数据集\n- **Adroit**：专注于**高维灵巧手**的接触式操作任务（如物体旋转、抓握等）。\n- **Meta-World**：包含多种**机械臂**操作任务，难度各异。\n- **总计**：覆盖 **37 个**不同的操作任务，基于 MuJoCo 物理模拟器构建。\n- **数据来源**：使用调优的启发式策略收集专家演示（每个任务 30 条轨迹）。\n\n#### 2. 真实机器人实验平台与任务\n- **硬件平台**：Franka Emika Panda 机械臂，配备 **LEAP Hand**（灵巧手）或**平行夹爪**。\n- **感知系统**：\n    - 全局相机：RealSense L515（提供场景 RGB-D 观测）。\n    - 腕部相机：RealSense D435（提供执行时视觉反馈）。\n- **评估任务**（共 4 类）：\n    1. **Pick-and-Place**（使用灵巧手）。\n    2. **Pick-and-Place**（使用平行夹爪）。\n    3. **Peg-in-Hole**（需要精确插入）。\n    4. **Obstacle-Avoidance Grasping**（在障碍物环境中抓取目标物体）。\n- **数据来源**：通过**人类遥操作**收集专家演示（每个任务 30 条轨迹）。\n\n### 二、 主要评估指标\n论文采用三个核心指标，全面评估策略的性能、效率与执行质量：\n\n| 指标 | 定义与计算方式 | 物理意义 |\n| :--- | :--- | :--- |\n| **任务成功率** | 在 episode 内满足任务特定成功条件的试验百分比（如物体位姿误差低于阈值、稳定抓握/放置维持最小时长）。 | 衡量策略完成任务的**有效性**和**可靠性**。 |\n| **响应时间** | 从接收传感器观测到输出控制动作的**端到端推理延迟**（毫秒）。 | 衡量策略的**实时计算效率**和**闭环响应能力**。 |\n| **轨迹平滑度** | 综合时域和频域特征的复合指标，计算公式：<br> `𝒮_smooth = α * 𝒮_jerk + β * 𝒮_freq` <br> - **𝒮_jerk**：关节轨迹加加速度（jerk）的均方值（衡量时域突变）。<br> - **𝒮_freq**：关节轨迹高频能量占比（衡量频域振荡）。<br> - 论文设定 `α=0.25`, `β=0.75`。 | **值越低表示轨迹越平滑**。直接反映长期执行中的**稳定性**和**抖动程度**，对真实机器人部署至关重要。 |\n\n### 三、 主要性能提升（LG-Flow Policy vs. 基线方法）\n\n#### 1. 仿真实验结果（关键数据）\n- **对比基线**：DP3（主要扩散基线）、Flow Policy（原始动作空间流匹配）、RDP（分层扩散策略）等。\n- **性能提升**：\n    - **平均任务成功率**：达到 **78.3%**，相比 DP3 提升 **+12.6%**，相比 Flow Policy 提升 **+17.3%**。\n    - **轨迹平滑度**：平均平滑度得分 **0.052**，相比 RDP 降低 **51.4%**，相比 DP3 降低 **69.4%**，相比 Flow Policy 大幅降低 **77.2%**。\n    - **响应时间**：**7.5 ms**，接近最快的 Flow Policy (6.1 ms)，但比 DP3 (55.9 ms) 快约 **7.5倍**，实现了效率与性能的优异平衡。\n\n#### 2. 真实机器人实验结果（关键数据）\n- **对比基线**：同上，增加了真实世界噪声和延迟挑战。\n- **性能提升**：\n    - **平均任务成功率**：达到 **77.5%**，显著高于 DP3 (57.9%)、RDP (70.0%) 和 Flow Policy (52.5%)。\n    - **轨迹平滑度**：相比 **Flow Policy**，平滑度指标降低了 **93.7%**，证明了其在真实噪声环境下的卓越稳定性。\n    - **响应时间**：**8.59 ms**，虽略高于 Flow Policy (6.54 ms)，但比 DP3 (29.29 ms) 和 RDP (31.82 ms) 快 **3倍以上**，保持了实时性。\n\n#### 3. 核心优势总结\n- **技术创新价值**：通过**在潜在动作空间进行流匹配**，LG-Flow Policy 成功**解耦了全局运动规划与底层控制噪声**。\n- **实际部署价值**：同时实现了 **① 接近单步的快速推理**、**② 大幅提升的轨迹平滑度（>90% 改善）** 和 **③ 显著更高的任务成功率（提升最高达 25%）**，解决了现有生成式策略在“表达能力-推理速度-执行稳定性”之间的根本权衡问题，为**实时、稳定的机器人操作部署**提供了有效方案。",
            "timestamp": "2026-02-03T15:59:22.312446",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        },
        {
            "question": "论文的主要局限性有哪些？未来可能的改进方向是什么？",
            "answer": "## 论文主要局限性分析\n\n基于对论文内容的分析，**LG-Flow Policy** 方法虽然取得了显著成果，但仍存在以下主要局限性：\n\n- **多模态融合相对简单**：论文明确指出，当前系统采用了“相对轻量级的多模态融合”（relatively lightweight multimodal fusion）。这意味着在整合视觉、触觉、语言等多种感知信号时，方法可能不够深入或高效，限制了在更复杂、需要多感官协同的场景下的性能。\n\n- **未显式建模复杂接触动力学**：方法没有显式地对机器人操作中关键的、复杂的接触动力学进行建模。这对于**接触丰富的灵巧操作任务**（如精细装配、非刚性物体操作）至关重要，缺乏此类建模可能影响策略在高度依赖物理交互的任务中的泛化能力和鲁棒性。\n\n- **潜在动作空间的表达能力与规整性权衡**：虽然通过GRU编码器和变分正则化塑造了平滑的潜在轨迹空间，但这本质上是一种**信息瓶颈**。过度规整可能会限制策略对高度动态或突发性任务的适应能力，如何更优地平衡潜在空间的表达能力和时序相干性仍是一个开放问题。\n\n- **实验任务的广度与复杂性**：尽管在模拟和真实世界任务中进行了验证，但任务类型主要集中在抓取、放置、插入等。对于需要**长时程规划、工具使用或非预定义目标的开放式任务**，方法的有效性尚未得到充分检验。\n\n- **对演示数据质量的依赖**：作为模仿学习方法，其性能上限在一定程度上受限于专家演示数据的质量和多样性。论文提到对“异构和次优演示”有改进的容忍度，但并未完全消除对此的依赖。\n\n---\n\n## 未来可能的改进方向\n\n针对上述局限性，论文在结论部分及分析中暗示了以下未来研究方向：\n\n1.  **探索更丰富的多模态表征**：\n    - 开发更强大的架构，深度融合视觉（全局与局部）、触觉、力觉、音频甚至语言指令，实现**跨模态的鲁棒对齐与推理**，以应对更复杂、信息模糊的真实环境。\n\n2.  **集成接触感知的潜在动力学模型**：\n    - 在潜在空间建模或解码过程中，**显式地引入接触状态、力/力矩预测模块**。这可以使策略“理解”交互物理，生成更符合接触约束的动作，从而直接应对“未显式建模复杂接触动力学”这一局限。\n\n3.  **发展更自适应的潜在空间学习机制**：\n    - 研究如何**动态调整潜在空间的规整强度**，或许可以通过任务难度或不确定性进行调制，使其在需要稳定性的任务中保持平滑，在需要灵活性的任务中增加表达能力。\n\n4.  **向分层与长程规划扩展**：\n    - 将当前的轨迹级生成框架扩展为**分层策略**：高层在更抽象的潜在空间进行长程目标或子任务规划，底层（即当前方法）负责平滑执行。这有助于解决更长时程和更复杂逻辑的任务。\n\n5.  **结合强化学习与离线数据**：\n    - 在模仿学习的基础上，引入**离线强化学习或基于模型的优化**，利用收集到的次优数据或通过仿真自我改进，突破专家演示的瓶颈，实现策略的自主提升与适应。\n\n6.  **提升计算与采样效率的极致化**：\n    - 尽管已实现近单步推理，但仍可探索**更高效的网络架构、蒸馏技术或稀疏激活机制**，在边缘计算设备上进一步降低延迟与功耗，促进大规模部署。\n\n**总结而言，LG-Flow Policy的核心价值在于通过“潜在空间流匹配”这一创新设计，优雅地权衡了推理速度、时序平滑性和任务性能。其未来的进化将围绕如何赋予这个平滑的潜在空间以更丰富的物理语义、更强大的多模态理解能力和更层次化的决策能力展开，最终目标是实现能在复杂、动态现实世界中稳定、高效、智能操作的机器人系统。**",
            "timestamp": "2026-02-03T15:59:54.350696",
            "thinking": null,
            "is_reasoning": false,
            "parent_qa_id": null
        }
    ],
    "is_hidden": false,
    "is_starred": false,
    "flag": true,
    "published_date": "2026-01-30T15:36:43Z",
    "created_at": "2026-02-03T15:53:10.653375",
    "updated_at": "2026-02-03T15:53:10.653385"
}